{
    "type": "Optimizer",
    "definition": {
        "text": "Optimizers are the extended class, which include added information to train a specific model. The optimizer class is initialized with given parameters but it is important to remember that no Tensor is needed. The optimizers are used for improving speed and performance for training a specific model.",
        "updated": 1615895635391,
        "translations": [
            {
                "language": "RU",
                "text": "Оптимизаторы - это расширенный класс, который содержит дополнительную информацию для обучения конкретной модели. Класс Optimizer инициализируется с заданными параметрами, но важно помнить, что тензор не нужен. Оптимизаторы используются для повышения скорости и производительности обучения конкретной модели.",
                "updated": 1645249168776
            },
            {
                "language": "TR",
                "text": "Optimize ediciler, belirli bir modeli eğitmek için ek bilgiler içeren genişletilmiş sınıftır. Optimizer sınıfı verilen parametrelerle başlatılır ancak Tensör gerekmediğini unutmamak önemlidir. Optimize ediciler, belirli bir modeli eğitmek için hız ve performansı artırmak amacıyla kullanılır.",
                "updated": 1654397381840
            },
            {
                "language": "DE",
                "text": "Optimierer sind die erweiterte Klasse, die zusätzliche Informationen enthalten, um ein spezifisches Modell zu trainieren. Die Optimiererklasse wird mit gegebenen Parametern initialisiert, aber es ist wichtig, sich daran zu erinnern, dass kein Tensor benötigt wird. Die Optimierer werden verwendet, um die Geschwindigkeit und Leistung beim Training eines bestimmten Modells zu verbessern.",
                "updated": 1705267177963
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645249173679
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397387878,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1705267186404
                }
            ]
        }
    ]
}