{
    "type": "Inter Execution Memory",
    "definition": {
        "text": "It is a data structure that some bots need in order to resume their operations after they get woken up at the next cycle of their Main Loop. ",
        "updated": 1621955211473,
        "translations": [
            {
                "language": "RU",
                "text": "Это структура данных, которая нужна некоторым ботам для возобновления работы после того, как они проснутся в следующем цикле их основного цикла Main Loop.",
                "updated": 1638283859604
            },
            {
                "language": "TR",
                "text": "Bazı botların Ana Döngülerinin ( Main Loop ) bir sonraki döngüsünde uyandıktan sonra işlemlerine devam edebilmeleri için ihtiyaç duydukları bir veri yapısıdır.",
                "updated": 1670331944709
            },
            {
                "language": "DE",
                "text": "Es handelt sich um eine Datenstruktur, die einige Bots benötigen, um ihre Operationen wieder aufzunehmen, nachdem sie im nächsten Zyklus ihrer Hauptschleife ( Main Loop ) aufgeweckt wurden.",
                "updated": 1696955470044
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This data structure is currently saved inside the Status Report of the Bot. Since every bot usually read it's own Status Report at every run, with it, it has access to the Inter Execution Memory data structure that itself saved at the previous run.",
            "updated": 1621955314173,
            "translations": [
                {
                    "language": "RU",
                    "text": "Эта структура данных в настоящее время сохраняется в отчете о состоянии (Status Report) бота. Поскольку каждый бот обычно читает свой собственный Status Report при каждом запуске, он имеет доступ к структуре данных Inter Execution Memory, которая была сохранена при предыдущем запуске.",
                    "updated": 1638284031302
                },
                {
                    "language": "TR",
                    "text": "Bu veri yapısı şu anda Botun Durum Raporunun içine kaydedilmiştir. Her bot genellikle her çalıştırmada kendi Durum Raporunu okuduğundan, bununla birlikte, bir önceki çalıştırmada kaydedilen Yürütmeler Arası Bellek veri yapısına erişebilir.",
                    "updated": 1654391178356,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Diese Datenstruktur wird derzeit im Statusreport (Status Report) des Bots gespeichert. Da jeder Bot normalerweise bei jedem Lauf seinen eigenen Statusbericht liest, hat er damit Zugriff auf die Datenstruktur des Ausführungsspeichers, die er selbst beim vorherigen Lauf gespeichert hat.",
                    "updated": 1696955470217,
                    "style": "Text"
                }
            ]
        }
    ]
}