{
    "type": "Asset Class",
    "definition": {
        "text": "The Asset Class node is an organizational device used to group Asset nodes in arbitrary arrangements. The node may receive Weight Votes. When it does, votes are evenly distributed among offspring nodes.",
        "updated": 1624720632494,
        "translations": [
            {
                "language": "RU",
                "text": "Asset Class - это организационное устройство, используемое для группировки узлов ресурсов в произвольном порядке. Узел может получать голоса по весу Weight Votes. Когда это происходит, голоса равномерно распределяются между дочерними узлами.",
                "updated": 1638620222146
            },
            {
                "language": "TR",
                "text": "Varlık Sınıfı düğümü, Varlık düğümlerini rastgele düzenlemelerde gruplamak için kullanılan bir organizasyon aracıdır. Düğüm Ağırlık Oyları alabilir. Aldığında, oylar yavru düğümler arasında eşit olarak dağıtılır.",
                "updated": 1654394408600
            },
            {
                "language": "DE",
                "text": "Der Asset-Klassenknoten ist ein Organisationsmittel, mit dem Asset -Knoten in beliebiger Anordnung gruppiert werden können. Der Knoten kann Gewichtungsstimmen (Weight Votes) erhalten. Wenn dies der Fall ist, werden die Stimmen gleichmäßig auf die Nachfolgeknoten verteilt.  ",
                "updated": 1708628803961
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624720655011
        },
        {
            "style": "Text",
            "text": "You may direct Weight Votes to an Asset Class node when you intend to drive Weight to the whole class, including all assets within.",
            "updated": 1630434955110,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете направить Weight Votes на узел классов ресурсов Asset Class, если вы намереваетесь передать вес всему классу, включая все изделия внутри.",
                    "updated": 1638620255741
                },
                {
                    "language": "TR",
                    "text": "Ağırlığı, içindeki tüm varlıklar dahil olmak üzere tüm sınıfa yönlendirmek istediğinizde, Ağırlık Oylarını bir Varlık Sınıfı düğümüne yönlendirebilirsiniz.",
                    "updated": 1654394414418,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie können Gewichtungsabstimmungen (Weight Votes) auf einen Anlagenklassenknoten richten, wenn Sie beabsichtigen, die gesamte Klasse einschließlich aller darin enthaltenen Anlagen zu gewichten (Weight).",
                    "updated": 1708291040853
                }
            ]
        },
        {
            "style": "Text",
            "text": "Asset Class nodes may take incoming Weight Votes. When you cast Weight Votes on an Asset Class node, votes cascade evenly to all offspring nodes.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узлы класса ресурсов могут принимать входящие голоса по весу Weight Votes. Когда вы применяете Weight Votes к узлу Asset Class, голоса распределяются равномерно по всем дочерним узлам.",
                    "updated": 1638620301677
                },
                {
                    "language": "TR",
                    "text": "Varlık Sınıfı düğümleri gelen Ağırlık Oylarını alabilir. Bir Varlık Sınıfı düğümüne Ağırlık Oyları verdiğinizde, oylar tüm yavru düğümlere eşit olarak yayılır.",
                    "updated": 1654394420062,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Anlagenklassenknoten können eingehende Gewichtungsstimmen (Weight Votes) annehmen. Wenn Sie Gewichtungsstimmen (Weight Votes) für einen Anlagenklassenknoten abgeben, werden die Stimmen gleichmäßig auf alle Nachfolgeknoten verteilt.",
                    "updated": 1708291073228
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1638611848567
                },
                {
                    "language": "TR",
                    "text": "Konfigürasyon",
                    "updated": 1654394425558,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Konfiguration",
                    "updated": 1708291079627
                }
            ]
        }
    ]
}