{
    "topic": "Docs Languages",
    "pageNumber": "2",
    "type": "Docs In Spanish",
    "definition": {
        "text": "The Docs pages of Superalgos and other projects integrated are originally written in English. The system allows users to search and browse pages in other languages as well, as long as users have previously contributed the corresponding translations.",
        "updated": 1613820592771,
        "translations": [
            {
                "language": "ES",
                "text": "Si bien la documentación esta originalmente escrita en Inglés, el sistema permite a cualquier usuario buscar contenido en su idioma nativo, siempre y cuando otros usuarios hayan contribuido traducciones de los artículos existentes escritos en el idioma por defecto que es el Inglés. \nAdvertencia!!! Los documentos de Superalgos y de otros proyectos integrados están escritos originariamente en Inglés. El sistema permite a los usuarios buscar y navegar en páginas en otros idiomas también, siempre que algunos usuarios hayan contribuido con las correspondientes traducciones.",
                "updated": 1667505095147,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Zusammenfassung: Die Docs-Seiten von Superalgos und anderen integrierten Projekten sind ursprünglich in Englisch verfasst. Das System ermöglicht es den Nutzern, die Seiten auch in anderen Sprachen zu suchen und zu durchsuchen, sofern die Nutzer zuvor die entsprechenden Übersetzungen beigetragen haben.",
                "updated": 1636748741317
            },
            {
                "language": "TR",
                "text": "Superalgos'un ve entegre edilen diğer projelerin Docs sayfaları orijinal olarak İngilizce yazılmıştır. Sistem, kullanıcılar daha önce ilgili çevirilere katkıda bulundukları sürece, kullanıcıların diğer dillerde de arama yapmasına ve sayfalara göz atmasına olanak tanır.",
                "updated": 1654393569525
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "English is considered the default language. When you switch to a different language, the system attempts to show the content in the new language. However, if the translation is not yet available, it shows the English version instead.",
            "updated": 1613820612132,
            "translations": [
                {
                    "language": "ES",
                    "text": "Es importante destacar que por más que uno seleccione un idioma, el contenido se mostrará en inglés en cada sitio donde todavía no ha sido traducido. El sistema permite a cualquier usuario contribuir traducciones con una granularidad a nivel de párrafos. Esto significa que una página puede tener todos, algunos o ningún párrafo traducido. Esto solo depende de cuales hayan sido traducidos previamente por miembros de la comunidad. El inglés se considera el idioma por defecto. Cuando se cambia de idioma, el sistema intentará mostrar el contenido en el nuevo idioma. Sin embargo, si la traducción aún no está disponible, muestra la versión en inglés en su lugar.",
                    "updated": 1667505404838,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Englisch gilt als Standardsprache. Wenn Sie zu einer anderen Sprache wechseln, versucht das System, den Inhalt in der neuen Sprache anzuzeigen. Wenn die Übersetzung jedoch noch nicht verfügbar ist, wird stattdessen die englische Version angezeigt.",
                    "updated": 1636748766355
                },
                {
                    "language": "TR",
                    "text": "İngilizce varsayılan dil olarak kabul edilir. Farklı bir dile geçtiğinizde, sistem içeriği yeni dilde göstermeye çalışır. Ancak, çeviri henüz mevcut değilse, bunun yerine İngilizce sürümü gösterir.",
                    "updated": 1654393575375,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Node types, variable names, the title of pages in the Docs, and a few more elements of Superalgos may not be translated, as they are unique identifiers of the said elements. You will always get those in English.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Node types, variable names, der Titel von Seiten in den Docs und einige weitere Elemente von Superalgos werden nicht übersetzt, da sie eindeutige Bezeichner der genannten Elemente sind. Sie erhalten diese immer auf Englisch.",
                    "updated": 1636748781667
                },
                {
                    "language": "TR",
                    "text": "Düğüm türleri, değişken adları, Dokümanlar'daki sayfaların başlığı ve Superalgos'un birkaç öğesi daha, söz konusu öğelerin benzersiz tanımlayıcıları oldukları için çevrilmeyebilir. Bunları her zaman İngilizce olarak alacaksınız.",
                    "updated": 1654393582374,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Los tipos de Node, los nombres de las variables, el título de las páginas en los Docs, y algunos elementos más de Superalgos no pueden ser traducidos, ya que son identificadores únicos de dichos elementos. Siempre los tendrás en inglés.",
                    "updated": 1667505483658
                }
            ]
        },
        {
            "style": "Success",
            "text": "If you wish to contribute translations, read the How to Contribute Translations page.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn sie zu den Docs beitragen möchten, lesen sie die How to Contribute Translations Seite.",
                    "updated": 1636748836601
                },
                {
                    "language": "TR",
                    "text": "Çevirilere katkıda bulunmak istiyorsanız, Çevirilere Nasıl Katkıda Bulunulur sayfasını okuyun.",
                    "updated": 1654393589169,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Si deseas contribuir con traducciones, lee la página How to Contribute Translations.",
                    "updated": 1675204206536
                }
            ]
        },
        {
            "style": "Success",
            "text": "Users can switch between languages using the links/Flags provided at the footer of every page at the Docs.",
            "updated": 1636748942800,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para cambiar de un idioma a otro los usuarios pueden cambiar de idioma mediante los enlaces/banderas que aparecen en el pie de cada página de Docs",
                    "updated": 1667505658107,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Die Benutzer können über die Links in der Fußzeile jeder Seite in den Docs zwischen den Sprachen wechseln.",
                    "updated": 1636748881372
                },
                {
                    "language": "TR",
                    "text": "Kullanıcılar, Dokümanlar'daki her sayfanın altbilgisinde sağlanan bağlantıları / Bayrakları kullanarak diller arasında geçiş yapabilirler.",
                    "updated": 1654393595487,
                    "style": "Success"
                }
            ]
        },
        {
            "style": "Note",
            "text": "You may only add or delete pages to the Docs when the language is set to English. For the translation you have to select the language you want to translate into. (In this case spanish)",
            "updated": 1636749198522,
            "translations": [
                {
                    "language": "DE",
                    "text": "Sie können nur Seiten zu den Dokumenten hinzufügen oder löschen, wenn die Sprache auf Englisch eingestellt ist. Für die Übersetzung müssen Sie die Sprache auswählen, in die Sie übersetzen möchten.",
                    "updated": 1636749982716
                },
                {
                    "language": "TR",
                    "text": "Dokümanlara yalnızca dil İngilizce olarak ayarlandığında sayfa ekleyebilir veya silebilirsiniz. Çeviri için çevirmek istediğiniz dili seçmeniz gerekir. (Bu durumda ispanyolca)",
                    "updated": 1654393601784,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Sólo se permite añadir o eliminar páginas en los Docs cuando el idioma está configurado en inglés. Para la traducción tienes que seleccionar el idioma al que quieres traducir. (En este caso Español)",
                    "updated": 1667505761755
                }
            ]
        }
    ]
}