{
    "topic": "Docs Languages",
    "pageNumber": "1",
    "type": "Docs In English",
    "definition": {
        "text": "The Docs pages of Superalgos and other projects integrated are originally written in English. The system allows users to search and browse pages in other languages as well, as long as users have previously contributed the corresponding translations.",
        "updated": 1613820592771,
        "translations": [
            {
                "language": "DE",
                "text": "Zusammenfassung: Die Docs-Seiten von Superalgos und anderen integrierten Projekten sind ursprünglich in Englisch verfasst. Das System ermöglicht es den Nutzern, die Seiten auch in anderen Sprachen zu suchen und zu durchsuchen, sofern die Nutzer zuvor die entsprechenden Übersetzungen beigetragen haben. Ins deutsche übersetzt von gitforkgit.",
                "updated": 1634133897069,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Superalgos'un ve entegre edilen diğer projelerin Docs sayfaları orijinal olarak İngilizce yazılmıştır. Sistem, kullanıcılar daha önce ilgili çevirilere katkıda bulundukları sürece, kullanıcıların diğer dillerde de arama yapmasına ve sayfalara göz atmasına olanak tanır.",
                "updated": 1654393533416
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1616761358289
        },
        {
            "style": "Text",
            "text": "English is considered the default language. When you switch to a different language, the system attempts to show the content in the new language. However, if the translation is not yet available, it shows the English version instead.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Englisch gilt als Standardsprache. Wenn Sie zu einer anderen Sprache wechseln, versucht das System, den Inhalt in der neuen Sprache anzuzeigen. Wenn die Übersetzung jedoch noch nicht verfügbar ist, wird stattdessen die englische Version angezeigt.",
                    "updated": 1634069381374,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "İngilizce varsayılan dil olarak kabul edilir. Farklı bir dile geçtiğinizde, sistem içeriği yeni dilde göstermeye çalışır. Ancak, çeviri henüz mevcut değilse, bunun yerine İngilizce sürümü gösterir.",
                    "updated": 1654393538976,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Node types, variable names, the title of pages in the Docs, and a few more elements of Superalgos may not be translated, as they are unique identifiers of the said elements. You will always get those in English.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Node types, variable names, der Titel von Seiten in den Docs und einige weitere Elemente von Superalgos werden nicht übersetzt, da sie eindeutige Bezeichner der genannten Elemente sind. Sie erhalten diese immer auf Englisch.",
                    "updated": 1634069418064,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Düğüm türleri, değişken adları, Dokümanlar'daki sayfaların başlığı ve Superalgos'un birkaç öğesi daha, söz konusu öğelerin benzersiz tanımlayıcıları oldukları için çevrilmeyebilir. Bunları her zaman İngilizce olarak alacaksınız.",
                    "updated": 1654393544916,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Success",
            "text": "To switch languages, click on the flags on the footer of the Docs.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Um die Sprache zu wechseln, klicken Sie auf die Flaggen in der Fußzeile der Dokumente.",
                    "updated": 1634069431390,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "Dil değiştirmek için Dokümanların altbilgisindeki bayraklara tıklayın.",
                    "updated": 1654393551489,
                    "style": "Success"
                }
            ],
            "updated": 1674832048987
        },
        {
            "style": "Note",
            "text": "You may only add or delete pages / paragraphs to the Docs when the language is set to English.",
            "updated": 1634069492600,
            "translations": [
                {
                    "language": "DE",
                    "text": "Sie können nur Seiten/Absätze zu den Docs hinzufügen oder löschen, wenn die Sprache auf Englisch eingestellt ist.",
                    "updated": 1634069541313,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Dokümanlara yalnızca dil İngilizce olarak ayarlandığında sayfa / paragraf ekleyebilir veya silebilirsiniz.",
                    "updated": 1654393557631,
                    "style": "Note"
                }
            ]
        },
        {
            "style": "Block",
            "text": "End"
        },
        {
            "style": "Success",
            "text": "If you wish to contribute translations, read the How to Contribute Translations page.",
            "updated": 1616761556162,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn Sie Übersetzungen beisteuern möchten, lesen Sie die Seite: How to Contribute Translations.",
                    "updated": 1634069577126,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "Çevirilere katkıda bulunmak istiyorsanız, Çevirilere Nasıl Katkıda Bulunulur sayfasını okuyun.",
                    "updated": 1654393563778,
                    "style": "Success"
                }
            ]
        }
    ]
}