{
    "type": "Crypto Exchanges",
    "definition": {
        "text": "The crypto exchanges node groups definitions of the different exchanges the user may interact with.",
        "translations": [
            {
                "language": "ES",
                "text": "Los grupos de nodos  de los exchanges cripto  definen los diferentes exchanges con los que el usuario puede interactuar.",
                "updated": 1636365203486
            },
            {
                "language": "RU",
                "text": "Узел Crypto Exchanges группирует определения различных бирж, с которыми может взаимодействовать пользователь.",
                "updated": 1638648933625
            },
            {
                "language": "TR",
                "text": "Kripto borsaları, kullanıcının etkileşime girebileceği farklı borsaların tanımları düğüm gruplarıdır.",
                "updated": 1652799502893
            },
            {
                "language": "DE",
                "text": "Der Knoten Kryptobörsen gruppiert die Definitionen der verschiedenen Börsen, mit denen der Benutzer interagieren kann.",
                "updated": 1708265568255
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The default workspace features several nodes of this type, each with a purpose:",
            "updated": 1609771412437,
            "translations": [
                {
                    "language": "ES",
                    "text": "El workspace (espacio de trabajo) predeterminado presenta varios tipos de nodos, cada uno con un propósito:",
                    "updated": 1636365369249
                },
                {
                    "language": "RU",
                    "text": "В рабочем пространстве по умолчанию есть несколько узлов этого типа, каждый из которых предназначен для:",
                    "updated": 1638648949414
                },
                {
                    "language": "TR",
                    "text": "Varsayılan çalışma alanı, her birinin bir amacı olan bu türden birkaç düğüm içerir:",
                    "updated": 1652799511254
                },
                {
                    "language": "DE",
                    "text": "Der Standardarbeitsbereich enthält mehrere Knoten dieser Art, die jeweils einen bestimmten Zweck erfüllen:",
                    "updated": 1708265568426,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "List",
            "text": "Tested: features Crypto Exchange nodes of exchanges that have been thoroughly tested.",
            "updated": 1609771181080,
            "translations": [
                {
                    "language": "ES",
                    "text": "Tested ( testeados): Crypto Exchange caracteriza a nodos de exchanges que ya han sido testados minuciosamente.",
                    "updated": 1636365489754
                },
                {
                    "language": "RU",
                    "text": "Tested:  особенности узлов Crypto Exchange, которые были тщательно протестированы.",
                    "updated": 1638649035681
                },
                {
                    "language": "TR",
                    "text": "Test edildi: Kapsamlı bir şekilde test edilmiş Crypto Exchange borsa düğümlerini içerir.",
                    "updated": 1652799539143
                },
                {
                    "language": "DE",
                    "text": "Getestet: bietet Crypto Exchange Nodes von Börsen, die gründlich getestet wurden.",
                    "updated": 1708265568598,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Untested: features a collection of Crypto Exchange nodes of untested exchanges that comply with the set of API requirements of the CCXT library that Superalgos needs to function.",
            "updated": 1609771650992,
            "translations": [
                {
                    "language": "ES",
                    "text": "Untested ( sin testear): presenta una colección de nodos de Crypto Exchange de exchangesno testeados que cumplen con el conjunto de requisitos de la API de la CCXT library que Superalgos necesita para funcionar function.",
                    "updated": 1640977707849
                },
                {
                    "language": "RU",
                    "text": "Untested: содержит набор узлов Crypto Exchange непроверенных бирж, которые соответствуют набору требований API библиотеки CCXT, необходимых Superalgos для работы.",
                    "updated": 1638649058992
                },
                {
                    "language": "TR",
                    "text": "Test Edilmemiş: Superalgos'un çalışması gereken CCXT kitaplığının API gereksinimlerine uyan, test edilmemiş borsalardan oluşan bir Crypto Exchange düğümleri koleksiyonuna sahiptir.",
                    "updated": 1652799559376
                },
                {
                    "language": "DE",
                    "text": "Ungetestet: enthält eine Sammlung von Krypto-Börsenknoten von ungetesteten Börsen, die die API-Anforderungen der CCXT-Bibliothek erfüllen, die Superalgos zum Funktionieren benötigt.",
                    "updated": 1708265568755,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Testing Queue: you may use this node to deploy Crypto Exchange nodes while testing them.",
            "updated": 1609771442675,
            "translations": [
                {
                    "language": "ES",
                    "text": "Testing Queue (fila de testeo): puede usar este nodo para implementar nodos Crypto Exchange mientras los testea.",
                    "updated": 1636365750538
                },
                {
                    "language": "RU",
                    "text": "Testing Queue: вы можете использовать этот узел для развертывания узлов Crypto Exchange во время их тестирования.",
                    "updated": 1638649074711
                },
                {
                    "language": "TR",
                    "text": "Test Sırası: Test ederken Crypto Exchange düğümlerini dağıtmak için bu düğümü kullanabilirsiniz.",
                    "updated": 1652799568889
                },
                {
                    "language": "DE",
                    "text": "Testing Queue: Sie können diesen Knoten verwenden, um Crypto Exchange-Knoten zu testen.",
                    "updated": 1708265568974,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}