{
    "type": "Time Frame Scale",
    "definition": {
        "text": "The time frame scale controls the time frame setting, that is, the period represented by each candle, either of the time machine or of the timeline chart, depending on where the node is located.",
        "translations": [
            {
                "language": "ES",
                "text": "El time frame scale controla la configuración del marco de tiempo, es decir, el período representado por cada vela, ya sea de la máquina del tiempo o del gráfico de la línea de tiempo, dependiendo de dónde se encuentre el nodo.",
                "updated": 1628898828318
            },
            {
                "language": "RU",
                "text": "Шкала временных рамок Time Frame Scale управляет настройкой временных рамок, т.е. периодом, представленным каждой свечой, либо машины времени, либо графика временной шкалы, в зависимости от месторасположения узла.",
                "updated": 1639381334074
            },
            {
                "language": "TR",
                "text": "Zaman çerçevesi ölçeği, zaman çerçevesi ayarını, yani düğümün bulunduğu yere bağlı olarak zaman makinesinin veya zaman çizelgesi grafiğinin her bir mum tarafından temsil edilen periyodu kontrol eder.Kısaca Grafiği hangi zaman diliminde görmek istiyorsak , o zaman dilimine ayarlamamızı sağlar. (Örn. 1dk, 5dk, 1s,  4s vb.) ",
                "updated": 1639214358968
            },
            {
                "language": "EL",
                "text": "Η κλίμακα χρονικού πλαισίου ελέγχει τη ρύθμιση του χρονικού πλαισίου, δηλαδή την περίοδο που αντιπροσωπεύει κάθε κερί, είτε της χρονομηχανής είτε του γραφήματος της γραμμής χρόνου, ανάλογα με το πού βρίσκεται ο κόμβος.",
                "updated": 1640126593839
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "When the time frame scale is set at the level of the time machine, the scale setting affects all charts within the time machine. When set at the level of the timeline chart, the setting overrides the time frame scale at the time machine level.",
            "updated": 1610136694170,
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда шкала временных рамок установлена ​​на уровне машины времени, настройка масштаба влияет на все диаграммы внутри машины времени. Если задано на уровне временной шкалы, параметр имеет приоритет над шкалой временных рамок на уровне машины времени.",
                    "updated": 1639381280059
                },
                {
                    "language": "EL",
                    "text": "Όταν η κλίμακα χρονικού πλαισίου ορίζεται στο επίπεδο της χρονομηχανής, η ρύθμιση κλίμακας επηρεάζει όλα τα γραφήματα εντός της χρονομηχανής. Όταν ορίζεται στο επίπεδο του γραφήματος γραμμής χρόνου, η ρύθμιση υπερισχύει της κλίμακας χρονικού πλαισίου σε επίπεδο χρονομηχανής.",
                    "updated": 1640126629649
                }
            ]
        },
        {
            "style": "Success",
            "text": "This allows comparing charts in different time frames, but still synchronized at the datetime level.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Это позволяет сравнивать графики на разных таймфреймах, но при этом синхронизировать их на уровне даты и времени.",
                    "updated": 1639381305150
                },
                {
                    "language": "EL",
                    "text": "Αυτό επιτρέπει τη σύγκριση γραφημάτων σε διαφορετικά χρονικά πλαίσια, αλλά εξακολουθεί να συγχρονίζεται σε επίπεδο ημερομηνίας.",
                    "updated": 1640126653482
                }
            ]
        },
        {
            "style": "Block",
            "text": "Charts"
        },
        {
            "style": "Title",
            "text": "Time Frame Scale at the Charts",
            "translations": [
                {
                    "language": "RU",
                    "text": "Time Frame Scale на графиках",
                    "updated": 1639381356667
                },
                {
                    "language": "EL",
                    "text": "Time Frame Scale at the Charts (Κλίμακα Χρονικού Πλαισίου στα Γραφήματα)",
                    "updated": 1640126695659
                }
            ]
        },
        {
            "style": "Text",
            "text": "To set a time frame value, place the mouse pointer over the corresponding time machine or timeline chart time frame box and scroll the mouse wheel.",
            "updated": 1609783625339,
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы установить значение временного интервала, наведите указатель мыши на соответствующую машину времени или рамку временного интервала на временной шкале и прокрутите колесико мыши.",
                    "updated": 1639381372632
                },
                {
                    "language": "EL",
                    "text": "Για να ορίσετε μια τιμή χρονικού πλαισίου, τοποθετήστε το δείκτη του ποντικιού πάνω από το αντίστοιχο πλαίσιο χρονικού πλαισίου χρονομηχανής ή γραφήματος χρονοδιαγράμματος και μετακινηθείτε με κύλιση του τροχού του ποντικιού.",
                    "updated": 1640126744027
                }
            ]
        },
        {
            "style": "Text",
            "text": "Alternatively, you may place the mouse pointer and use the up and down arrows ↑ ↓ to toggle through the available time frames.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В качестве альтернативы вы можете навести указатель мыши и использовать стрелки вверх и вниз ↑ ↓ для переключения доступных временных рамок.",
                    "updated": 1639381385989
                },
                {
                    "language": "EL",
                    "text": "Εναλλακτικά, μπορείτε να τοποθετήσετε τον δείκτη του ποντικιού και να χρησιμοποιήσετε τα πάνω και κάτω βέλη ↑ ↓ για εναλλαγή μεταξύ των διαθέσιμων χρονικών πλαισίων.",
                    "updated": 1640126762743
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609783710191
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Time Frame Scale Configuration",
            "updated": 1609783714701,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Time Frame Scale",
                    "updated": 1639381399451
                },
                {
                    "language": "EL",
                    "text": "Time Frame Scale Configuration (Διαμόρφωση Κλίμακας Χρονικού Πλαισίου)",
                    "updated": 1640126801599
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609783740323,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1639381406899
                },
                {
                    "language": "EL",
                    "text": "Properties (Ιδιότητες)",
                    "updated": 1640126812995
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "01-hs\n02-hs\n03-hs\n04-hs\n06-hs\n08-hs\n12-hs\n24-hs",
            "updated": 1609783795852
        },
        {
            "style": "Note",
            "text": "The values entered via the design space and the charts are synchronized and stored in the node.",
            "updated": 1609783812074,
            "translations": [
                {
                    "language": "RU",
                    "text": "Значения, введенные через пространство дизайна и диаграммы, синхронизируются и сохраняются в узле.",
                    "updated": 1639381584682
                },
                {
                    "language": "EL",
                    "text": "Οι τιμές που εισάγονται μέσω του χώρου σχεδίασης και των γραφημάτων συγχρονίζονται και αποθηκεύονται στον κόμβο.",
                    "updated": 1640126835354
                }
            ]
        }
    ]
}