{
    "type": "Market Data Tasks",
    "definition": {
        "text": "A market data tasks node groups data mining tasks operating in a specific market.",
        "translations": [
            {
                "language": "ES",
                "text": "El nodo market data task agrupa tareas de minería de datos que operan en un mercado específico.",
                "updated": 1624379923791
            },
            {
                "language": "RU",
                "text": "Узел Задачи рыночных данных группирует задачи интеллектуального анализа данных, работающие на определенном рынке.",
                "updated": 1636195923570
            },
            {
                "language": "TR",
                "text": "Market Data Tasks, belirli bir işlem çiftinde (BTC/USDT gibi) faaliyet gösteren veri madenciliği görevlerini gruplandırır.",
                "updated": 1639144208436
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The market data tasks node must reference a market defined in the Crypto Ecosystem hierarchy.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El nodo Market Data Tasks debe hacer referencia a un Market definido en la jerarquía del Crypto Ecosystem.",
                    "updated": 1641153955075
                },
                {
                    "language": "TR",
                    "text": "Piyasa veri görevleri düğümü, Kripto Ekosistemi ( Crypto Ecosystem ) hiyerarşisinde tanımlanmış bir piyasaya referans vermelidir.",
                    "updated": 1701087566139
                }
            ]
        },
        {
            "style": "Text",
            "text": "This node may spawn individual data products or may deploy data products in bulk organized by data mine and by bots. See the data products node for the details.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Este nodo puede generar Data Products individuales o puede implementar Data Products en masa organizados por Data Mines y por Bots. Consulte el nodo de Data Products para conocer los detalles.",
                    "updated": 1641154026317
                },
                {
                    "language": "TR",
                    "text": "Bu düğüm tek tek veri ürünleri oluşturabilir veya veri madeni ve botlar tarafından düzenlenen veri ürünlerini toplu olarak dağıtabilir. Ayrıntılar için veri ürünleri düğümüne bakın.",
                    "updated": 1701087570683
                }
            ]
        },
        {
            "style": "Block",
            "text": "Running"
        }
    ]
}