{
    "type": "Hits",
    "definition": {
        "text": "Hits counts the number of positions that closed with a positive profit loss, in the context of the parent node.",
        "translations": [
            {
                "language": "RU",
                "text": "Hits подсчитывает количество позиций, которые закрылись с прибылью в контексте родительского узла.",
                "updated": 1638968198860
            },
            {
                "language": "TR",
                "text": "İsabetler, üst düğüm bağlamında pozitif bir kar kaybıyla kapanan pozisyonların sayısını sayar.",
                "updated": 1654419415489
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "In the context of the quoted asset or the base asset, hits are calculated relative to the asset in question. That is, if the base asset profit loss is positive, then a hit is counted for the base asset.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В контексте котируемого актива или базового актива попадания рассчитываются относительно рассматриваемого актива. То есть, если прибыль базового актива положительный, то попадания Hits засчитываются для базового актива.",
                    "updated": 1638968506347
                },
                {
                    "language": "TR",
                    "text": "Kote edilen varlık veya temel varlık bağlamında, isabetler söz konusu varlığa göre hesaplanır. Yani, temel varlık kar zararı pozitifse, temel varlık için bir isabet sayılır.",
                    "updated": 1654419422456,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "However, when the context of the asset is not specified&mdash;such as under the statistics node&mdash;then hits are calculated in a consolidated manner, converting the respective balances to perform the calculations.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Однако, если контекст актива не указан — например, в узле статистики Statistics — тогда попадания Hits рассчитываются консолидированным образом, преобразуя соответствующие балансы для выполнения вычислений.",
                    "updated": 1638968445210
                },
                {
                    "language": "TR",
                    "text": "Ancak, varlığın bağlamı belirtilmediğinde&mdash;örneğin istatistik düğümü altında&mdash;o zaman isabetler konsolide bir şekilde hesaplanır ve hesaplamaları gerçekleştirmek için ilgili bakiyeler dönüştürülür.",
                    "updated": 1654419429131,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Note",
            "text": "The consolidated calculations are explained thoroughly in the profit loss node.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Объединенные расчеты подробно объясняются в узле Profit Loss.",
                    "updated": 1640347905998
                },
                {
                    "language": "TR",
                    "text": "Konsolide hesaplamalar kar zarar düğümünde ayrıntılı olarak açıklanmıştır.",
                    "updated": 1654419435490,
                    "style": "Note"
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609873831169
        },
        {
            "style": "Title",
            "text": "Hits Configuration",
            "updated": 1609880458158,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Hits",
                    "updated": 1638968520074
                },
                {
                    "language": "TR",
                    "text": "Hit Konfigürasyonu",
                    "updated": 1654419441898,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609873980538,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сыойства",
                    "updated": 1638968533372
                },
                {
                    "language": "TR",
                    "text": "Özellikler",
                    "updated": 1654419447859,
                    "style": "Subtitle"
                }
            ]
        },
        {
            "style": "List",
            "text": "initialValue allows resetting the initial state of the node to an arbitrary value.",
            "updated": 1609875415147,
            "translations": [
                {
                    "language": "RU",
                    "text": "initialValue позволяет сбросить начальное состояние узла на произвольное значение.",
                    "updated": 1638968542833
                },
                {
                    "language": "TR",
                    "text": "initialValue düğümün ilk durumunun rastgele bir değere sıfırlanmasını sağlar.",
                    "updated": 1654419454893,
                    "style": "List"
                }
            ]
        }
    ]
}