{
    "type": "Voting Program",
    "definition": {
        "text": "The Voting Program is the heart and soul of governance, as it enables you to cast various types of votes. You may decide what to incentivize, weighing Pools, Assets, Features, and Positions. You may also evaluate contributions and transfer Voting Power to other users.",
        "updated": 1630329477687
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624729363885
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Featuring Tokens Bonus",
            "updated": 1630329521827
        },
        {
            "style": "Text",
            "text": "The features in the Voting Program allow you to cast three different broad categories of votes:",
            "updated": 1630329757543
        },
        {
            "style": "List",
            "text": "Claim Votes include Asset Claim Vote, Feature Claim Vote, and Position Claim Vote nodes."
        },
        {
            "style": "List",
            "text": "Weight Votes include Pool Weight Vote, Asset Weight Vote, Feature Weight Vote, and Position Weight Vote nodes."
        },
        {
            "style": "List",
            "text": "User Profile Vote"
        },
        {
            "style": "Text",
            "text": "There is a top-level Votes Switch node that allows spawning several other switches, each associated to the different types of votes described above:"
        },
        {
            "style": "List",
            "text": "Claim Votes Switch",
            "updated": 1630329624666
        },
        {
            "style": "List",
            "text": "Weight Votes Switch"
        },
        {
            "style": "List",
            "text": "User Profile Votes Switch"
        },
        {
            "style": "Text",
            "text": "All of the above switches feature three different functions:"
        },
        {
            "style": "List",
            "text": "They work like organizational devices, so that you may create arbitrary arrangements of votes, spawning more switches and votes."
        },
        {
            "style": "List",
            "text": "They may reference Class types of nodes in Project Definition Hierarchies and map entire structures of those hierarchies."
        },
        {
            "style": "List",
            "text": "They also work like switches, allowing the control of the flow of Voting Power, pretty much like the Token Power Switch, but within the Voting Program. If you need a reminder, read about Token Power Flows."
        },
        {
            "style": "Text",
            "text": "The different types of votes are explained in the page each type of switch node.",
            "updated": 1630329669482
        },
        {
            "style": "Success",
            "text": "The Token Rewards and Voting Power Flow page in the Governance Flow topic covers important details of how votes work. Make sure you read the whole topic!",
            "updated": 1630329713208
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "updated": 1624729377169
        }
    ]
}