{
    "type": "Voting Program",
    "definition": {
        "text": "The Voting Program is the heart and soul of governance, as it enables you to cast various types of votes. You may decide what to incentivize, weighing Pools, Assets, Features, and Positions. You may also evaluate and support Contribution Claims and transfer Voting Power to other users.",
        "updated": 1630351287920,
        "translations": [
            {
                "language": "ES",
                "text": "El Voting Program (programa de voto) es el corazón y el alma de la gobernanza ya que te permite emitir varios tipos de votos. Puede decidir que incentivar, agregando peso a Pools, Assets, Features, and Positions. Puede también evaluar y apoyar Contribution Claims y transferir Voting Power a otros usuarios.",
                "updated": 1636283766725
            },
            {
                "language": "RU",
                "text": "Программа голосования - это сердце и душа управления, поскольку она позволяет вам отдавать различные типы голосов. Вы можете решить, что стимулировать, взвесив Pools, Assets, Features и Positions. Вы также можете оценивать и поддерживать заявления о взносах Contribution Claims и передавать право голоса Voting Power другим пользователям.",
                "updated": 1639029722546
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624729363885
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Featuring Tokens Bonus",
            "updated": 1630329521827
        },
        {
            "style": "Note",
            "text": "Your Reputation is added to the Token Power that flows into the Voting Program, effectively increasing your Voting Power. Read more about Reputation!",
            "updated": 1630424362937,
            "translations": [
                {
                    "language": "ES",
                    "text": "Su Reputation (reputación) es agregada al Token Power que fluye hacia el Voting Program ( programa de voto), incrementando efectivamente su Voting Power. Lea más acerca de la Reputation!",
                    "updated": 1636283913006
                },
                {
                    "language": "RU",
                    "text": "Ваша репутация Reputation добавляется к силе токена Token Power, которая вливается в программу голосования Voting Program, эффективно увеличивая вашу силу голоса Voting Power. Узнайте больше о Reputation !",
                    "updated": 1638986609516
                }
            ]
        },
        {
            "style": "Text",
            "text": "The features in the Voting Program allow you to cast three different categories of votes:",
            "translations": [
                {
                    "language": "ES",
                    "text": "Estas funciones del Voting Program le permite emitir tres categorías diferentes de votos:",
                    "updated": 1636283960032
                },
                {
                    "language": "RU",
                    "text": "Функции программы голосования позволяют отдавать голоса трех разных категорий:",
                    "updated": 1638986630462
                }
            ]
        },
        {
            "style": "List",
            "text": "Claim Votes: Use Claim Votes to support the claims of other users so that they may get the rewards they deserve for their contributions. There are three types of claim vote nodes, namely Asset Claim Vote, Feature Claim Vote, and Position Claim Vote nodes.",
            "updated": 1630344722135,
            "translations": [
                {
                    "language": "ES",
                    "text": "Claim Votes: Usar Claim Votes ( votos de solicitud) para apoyar las solicitudes de otros usuarios para que ellos obtengan las recompensas que se merecen por sus contribuciones. Hay tres tipos de nodos de  claim vote, a saber nodos de Asset Claim Vote, Feature Claim Vote, y Position Claim Vote.",
                    "updated": 1636284130567
                },
                {
                    "language": "RU",
                    "text": "Claim Votes: используйте Claim Votes, чтобы поддержать утверждения других пользователей, чтобы они могли получить заслуженное вознаграждение за свой вклад. Существует три типа узлов голосования за претензию, а именно: голосование за ресурс Asset Claim Vote, голосование за функцию Feature Claim Vote и голосование за позицию Position Claim Vote.",
                    "updated": 1638987918385
                }
            ]
        },
        {
            "style": "List",
            "text": "Weight Votes: Use Weight Votes to influence what areas of the project should be incentivized. There are four types of weight votes, namely Pool Weight Vote, Asset Weight Vote, Feature Weight Vote, and Position Weight Vote nodes.",
            "updated": 1630344790466,
            "translations": [
                {
                    "language": "ES",
                    "text": "Weight Votes: Use Weight Votes (votos de peso) para influenciar que áreas del pryecto deberían ser incentivadas Hay cautro tipos de weight votes, a saber nodos de Pool Weight Vote, Asset Weight Vote, Feature Weight Vote, y Position Weight Vote.",
                    "updated": 1636284236503
                },
                {
                    "language": "RU",
                    "text": "Weight Votes: используйте Weight Votes, чтобы повлиять на то, какие области проекта следует стимулировать. Существует четыре типа голосов по весу, а именно: голосование по весу пула Pool Weight Vote, голосование по весу ресурса Asset Weight Vote, голосование по весу функции Feature Weight Vote и голосование по весу позиции Position Weight Vote.",
                    "updated": 1638987907146
                }
            ]
        },
        {
            "style": "List",
            "text": "User Profile Votes: Use a User Profile Vote to transfer Voting Power to other users.",
            "updated": 1630344853204,
            "translations": [
                {
                    "language": "ES",
                    "text": "User Profile Votes: Use un User Profile Vote (voto de perfil de usuario) para transferir Voting Power a otros usuarios.",
                    "updated": 1636284287487
                },
                {
                    "language": "RU",
                    "text": "User Profile Votes: используйте User Profile Vote, чтобы передать право голоса Voting Power другим пользователям.",
                    "updated": 1638988047324
                }
            ]
        },
        {
            "style": "Text",
            "text": "There is a top-level Votes Switch node that allows spawning several other switches, each one associated to the different types of votes described above:",
            "updated": 1630343139964,
            "translations": [
                {
                    "language": "ES",
                    "text": "Hay un nivel superior de nodo de Votes Switch ( interruptor de voto)que permite desplegar muchos otros switches, cada uno asociado a los diferentes tipos de votos descriptos aquí arriba:",
                    "updated": 1636284440520
                },
                {
                    "language": "RU",
                    "text": "Существует узел переключения голосов Votes Switch верхнего уровня, который позволяет создавать несколько других переключателей, каждый из которых связан с различными типами голосов, описанными выше:",
                    "updated": 1638989315266
                }
            ]
        },
        {
            "style": "List",
            "text": "Claim Votes Switch",
            "updated": 1630329624666
        },
        {
            "style": "List",
            "text": "Weight Votes Switch"
        },
        {
            "style": "List",
            "text": "User Profile Votes Switch"
        },
        {
            "style": "Success",
            "text": "These switches control the flow of Voting Power, may be used as organizational devices, may spawn the different types of votes, and may help you map entire data structures easily. Find the details on the page of each switch!",
            "updated": 1630348670996,
            "translations": [
                {
                    "language": "ES",
                    "text": "Estos interruptores controlan el flujo del Voting Power,puede ser usado coomo dispositivos organizacionales, puede generar los diferentes tipos de votos, y puede ayudarlo a mapear estructuras de datos completas fácilmente. Encuentre más detalles en la página de cada switch!",
                    "updated": 1636284604967
                },
                {
                    "language": "RU",
                    "text": "Эти переключатели управляют Voting Power, могут использоваться в качестве организационных устройств, могут порождать различные типы голосов и могут помочь вам легко отобразить целые структуры данных. Подробности читайте на странице каждого переключателя!",
                    "updated": 1638989401423
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "updated": 1624729377169,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1638989332033
                }
            ]
        }
    ]
}