{
    "type": "User Supporter",
    "definition": {
        "text": "A User Supporter node must establish a reference with the User Profile of your supporter. If you have more than one supporter, add more nodes! This is how you establish who your supporters are.",
        "updated": 1630232791200,
        "translations": [
            {
                "language": "RU",
                "text": "Узел User Supporter должен установить ссылку на профиль пользователя вашего помощника. Если у вас более одного помощника, добавьте больше узлов! Так вы выясняете, кто ваши помощники.",
                "updated": 1639128606836
            },
            {
                "language": "TR",
                "text": "Bir Kullanıcı Destekçisi düğümü, destekçinizin Kullanıcı Profili ( User Profile ) ile bir referans oluşturmalıdır. Birden fazla destekçiniz varsa, daha fazla düğüm ekleyin! Destekçilerinizin kim olduğunu bu şekilde belirlersiniz.",
                "updated": 1671558279208
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624727081804
        },
        {
            "style": "Warning",
            "text": "Declaring at least one User Supporter is a requirement to participate in the program. If you fail to declare at least one, you don't qualify for Tokens Bonus incentives.",
            "updated": 1630232813838,
            "translations": [
                {
                    "language": "RU",
                    "text": "Для участия в программе необходимо указать хотя бы одного User Supporter. Если вы не заявите хотя бы один, вы не имеете права на получение бонусов Tokens Bonus.",
                    "updated": 1639128683648
                },
                {
                    "language": "TR",
                    "text": "En az bir Kullanıcı Destekçisi beyan etmek programa katılmak için bir gerekliliktir. En az bir tane beyan etmezseniz, Token Bonus ( Tokens Bonus ) teşviklerine hak kazanamazsınız.",
                    "updated": 1671558377505
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1639128693711
                }
            ]
        }
    ]
}