{
    "type": "Space Settings",
    "definition": {
        "text": "The space settings node features controls over the physics, proportions, and positioning of icons representing node, and their menus."
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Space Settings Configuration",
            "updated": 1609863913978
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1631554214199
        },
        {
            "style": "List",
            "text": "\"physics\" determines whether the environment is static (false) or dynamic (true). When physics is set to true, nodes in the design space are affected by th gravitational pull and repulsion of other nodes.",
            "updated": 1631588883144
        },
        {
            "style": "List",
            "text": "detachUsingMouse defines if you can detach nodes from it's parent or reference parents only using the mouse (when true) or if you can not use the mouse for that and can only do it using the detach buttons on the icon's menu (when false)."
        },
        {
            "style": "Subtitle",
            "text": "Node Properties"
        },
        {
            "style": "List",
            "text": "\"node\" here refers to every node in the design space. This collection of properties adjusts the settings of all nodes in the design space.",
            "updated": 1631588871268
        },
        {
            "style": "List",
            "text": "distancePercentage adjusts the baseline distance between nodes.",
            "updated": 1631588124341
        },
        {
            "style": "List",
            "text": "radiusPercentage is the radius of the circular nodes' menu applied as a percentage of an arbitrary default radius. A higher value will lead to a larger node menu.",
            "updated": 1631588202567
        },
        {
            "style": "List",
            "text": "massPercentage is the reference mass of nodes that affects the attraction and repulsion of the environment's physics when the physics setting is set to true.",
            "updated": 1631588798797
        },
        {
            "style": "List",
            "text": "animationSteps adjusts the amount of steps the animation takes to open a node menu upon hovering over it. A higher value leads to smoother transition.",
            "updated": 1631588728860
        },
        {
            "style": "List",
            "text": "menuItem refers to the items on the right-hand side of a node's menus and has the following three properties.",
            "updated": 1631588761551
        },
        {
            "style": "List",
            "text": "widthPercentage is the reference width of an item applied as a percentage of an arbitrary default width.",
            "updated": 1609863995477
        },
        {
            "style": "List",
            "text": "heightPercentage is the reference height of an item applied as a percentage of an arbitrary default height.",
            "updated": 1609863990453
        },
        {
            "style": "List",
            "text": "radiusPercentage is the reference radius of the circular matrix that governs the distribution of items in the circular menu. Larger numbers cause items to spread apart while smaller numbers makes items lie closer to each other.",
            "updated": 1631554041849
        },
        {
            "style": "Subtitle",
            "text": "Shortcut Properties"
        },
        {
            "style": "Text",
            "text": "Shortcuts are key stroke combinations that helps users execute certain actions very quickly. To execute a Shortcut users need to simultaneously press CTRL + SHIFT + a pre-defined key.",
            "updated": 1625419324367
        },
        {
            "style": "Success",
            "text": "Shortcuts default values can be seen below. You can modify those values by changing the Config Properties listed below.",
            "updated": 1625419754545
        },
        {
            "style": "List",
            "text": "toggleMapMode defines which key will be used as a Shortcut for entering and leaving the Map Mode.",
            "updated": 1625419803171
        },
        {
            "style": "List",
            "text": "toggleDrawRelationshipLines defines which key will be used as a Shortcut for turning on and off the drawing of Reference Lines.",
            "updated": 1625419810253
        },
        {
            "style": "List",
            "text": "toggleDrawParentLines defines which key will be used as a Shortcut for turning on and off the drawing of Parent Lines.",
            "updated": 1625419816654
        },
        {
            "style": "List",
            "text": "saveWorkspace defines which key will be used as a Shortcut for saving the Workspace.",
            "updated": 1625419822252
        },
        {
            "style": "List",
            "text": "adjustAspectRation defines which key will be used as a Shortcut for forcing a Time Machine to adjust it's aspect ratio according to the size of the screen a user currently have.",
            "updated": 1625419830418
        }
    ]
}