{
    "type": "Feature Contribution Claim",
    "definition": {
        "text": "Use this node to reference a Feature node in one of the Features hierarchy to establish a Feature Contribution Claim. This claim means that you declare that you have worked on that Feature, either creating or improving it, and that you expect to be rewarded accordingly!",
        "updated": 1630349366359,
        "translations": [
            {
                "language": "ES",
                "text": "Use este nodo para referenciar un nodo de Feature (Función) en una jerarquía de funciones para establecer una Feature Contribution Claim( Solicitud de Contrución de Función). Esta solicitud significa que declara que ha trabajado en una función, ya sea creándola o mejorándola, y que espera ser recompensado consecuentemente!",
                "updated": 1636281996936
            },
            {
                "language": "RU",
                "text": "Используйте этот узел, чтобы ссылаться на узел Feature в одной из иерархий Features, чтобы установить Feature Contribution Claim. Это означает, что вы заявляете, что работали над этим Feature, создавая или улучшая ее, и ожидаете соответствующего вознаграждения!",
                "updated": 1639134017230
            },
            {
                "language": "TR",
                "text": "Bir Özellik Katkı Talebi oluşturmak için Özellikler (Features) hiyerarşisinden birindeki bir Özellik (Feature) düğümüne başvurmak için bu düğümü kullanın. Bu iddia, o Özellik üzerinde çalıştığınızı, onu yarattığınızı veya geliştirdiğinizi ve buna göre ödüllendirilmeyi beklediğinizi beyan ettiğiniz anlamına gelir!",
                "updated": 1644497527852
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624728714757
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Claims Content",
            "updated": 1630325534128
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1639133721209
                }
            ]
        }
    ]
}