{
    "type": "Calculations Procedure",
    "definition": {
        "text": "The calculations procedure processes information to be fed to calculated properties. Calculated properties are not stored in the data set; instead, they are calculated in real-time as the data is consumed by others.",
        "translations": [
            {
                "language": "RU",
                "text": "Calculations Procedure обрабатывает информацию, которая должна быть передана в вычисляемые свойства. Вычисляемые свойства не сохраняются в наборе данных; вместо этого они вычисляются в режиме реального времени по мере использования данных другими пользователями.",
                "updated": 1638645712103
            },
            {
                "language": "TR",
                "text": "Hesaplama prosedürü, hesaplanan özelliklere beslenecek bilgileri işler. Hesaplanan özellikler veri kümesinde saklanmaz; bunun yerine, veriler başkaları tarafından tüketildiği için gerçek zamanlı olarak hesaplanır.",
                "updated": 1652797102731
            },
            {
                "language": "DE",
                "text": "Das Berechnungsverfahren verarbeitet Informationen, die in berechnete Eigenschaften einfließen sollen. Die berechneten Eigenschaften werden nicht im Datensatz gespeichert, sondern in Echtzeit berechnet, wenn die Daten von anderen genutzt werden.",
                "updated": 1708265554110
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Bots store data in the minimized array format as a strategy to build the lightest possible datasets. For the same reason, a bot may choose not to store easily calculable information.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Боты хранят данные в формате минимизированного массива в качестве стратегии для создания максимально легких наборов данных. По той же причине бот может отказаться от хранения легко вычисляемой информации.",
                    "updated": 1638645744288
                },
                {
                    "language": "TR",
                    "text": "Botlar, mümkün olan en hafif veri kümelerini oluşturmak için bir strateji olarak verileri simge durumuna küçültülmüş dizi biçiminde depolar. Aynı nedenle, bir bot kolayca hesaplanabilen bilgileri saklamamayı seçebilir.",
                    "updated": 1652797118803
                },
                {
                    "language": "DE",
                    "text": "Bots speichern Daten in einem minimierten Array-Format, um möglichst kleine Datensätze zu erstellen. Aus demselben Grund kann ein Bot auch beschließen, keine leicht zu berechnenden Informationen zu speichern.",
                    "updated": 1708265554281,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example, imagine an indicator that stores buy and sell volumes... does it need to store the total volume? Given that it is so easy to calculate, the answer is probably not. It is up to the developer to decide, but it is certainly not required.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Например, представьте индикатор, который хранит объемы покупок и продаж ... нужно ли ему хранить общий объем? Учитывая, что это так легко вычислить, ответ, вероятно, нет. Решение остается за разработчиком, но это, конечно, не обязательно.",
                    "updated": 1638645764246
                },
                {
                    "language": "TR",
                    "text": "Örneğin, alım satım hacimlerini saklayan bir gösterge hayal edin... toplam hacmi saklaması gerekiyor mu? Hesaplaması çok kolay olduğu için, cevap muhtemelen değildir. Karar geliştiriciye kalmıştır, ancak kesinlikle gerekli değildir.",
                    "updated": 1652797129208
                },
                {
                    "language": "DE",
                    "text": "Stellen Sie sich zum Beispiel einen Indikator vor, der das Kauf- und Verkaufsvolumen speichert... muss er das Gesamtvolumen speichern? Angesichts der Tatsache, dass es so einfach zu berechnen ist, lautet die Antwort wahrscheinlich nein. Die Entscheidung liegt beim Entwickler, ist aber sicher nicht erforderlich.",
                    "updated": 1708265554453,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Note",
            "text": "The calculations procedure is used to calculate properties that the developer chooses not to store in the dataset.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Процедура вычислений используется для вычисления свойств, которые разработчик решает не хранить в наборе данных.",
                    "updated": 1638645783469
                },
                {
                    "language": "TR",
                    "text": "Not: Hesaplama prosedürü, geliştiricinin veri kümesinde saklamamayı tercih ettiği özellikleri hesaplamak için kullanılır.",
                    "updated": 1652797141680
                },
                {
                    "language": "DE",
                    "text": "Das Berechnungsverfahren wird verwendet, um Eigenschaften zu berechnen, die der Entwickler nicht im Datensatz speichern möchte.",
                    "updated": 1708265554688,
                    "style": "Note"
                }
            ]
        },
        {
            "style": "Note",
            "text": "To fully understand the role of the calculations procedure, please refer to the data mining workflow page.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы полностью понять роль процедуры вычислений, обратитесь к странице Data Mining - Workflows.",
                    "updated": 1638645915223
                },
                {
                    "language": "TR",
                    "text": "Not: Hesaplama prosedürünün rolünü tam olarak anlamak için lütfen veri madenciliği iş akışı sayfasına bakın.",
                    "updated": 1652797151465
                },
                {
                    "language": "DE",
                    "text": "Um die Rolle des Berechnungsverfahrens vollständig zu verstehen, lesen Sie bitte die Seite zum Data-Mining-Workflow.",
                    "updated": 1708265554828,
                    "style": "Note"
                }
            ]
        }
    ]
}