{
    "type": "Claim Votes Switch",
    "definition": {
        "text": "Verwenden Sie diesen Schalter, um verschiedene Arten von Fallabstimmungen (Claim Votes) zu erzeugen und um auf Fallordnertypen (Claims Folder types) von Knoten innerhalb des Fallprogrammabschnitts (Claims Program section) der Benutzerprofilhierarchie (User Profile hierarchy) zu verweisen, um große Strukturen von Fällen abzubilden.",
        "updated": 1708373675860,
        "translations": [
            {
                "language": "ES",
                "text": "Use este switch abrir tipos diferentes de Claim Votes, y para referenciar tipos de nodos Claims Folder incluídos en el Claims Program en la sección de la jerarquía del User Profilepara mapear grandes estructuras de solicitudess.",
                "updated": 1636039814895
            },
            {
                "language": "RU",
                "text": "Используйте этот переключатель для создания различных типов Claim Votes и для ссылки на типы узлов Claims Folder в разделе Claims Program иерархии профиля пользователя для сопоставления больших структур утверждений.",
                "updated": 1639134336701
            },
            {
                "language": "TR",
                "text": "Bu anahtarı farklı türlerde Talep Oyları oluşturmak ve büyük talep yapılarını eşleştirmek için Kullanıcı Profili hiyerarşisinin Talep Programı bölümündeki Talep Klasörü düğüm türlerine başvurmak için kullanın.",
                "updated": 1654394546552
            },
            {
                "language": "DE",
                "text": "Verwenden Sie diesen Schalter, um verschiedene Arten von Fallabstimmungen (Claim Votes) zu erzeugen und um auf Fallordnertypen (Claims Folder types) von Knoten innerhalb des Fallprogrammabschnitts (Claims Program section) der Benutzerprofilhierarchie (User Profile hierarchy) zu verweisen, um große Strukturen von Fällen abzubilden.  ",
                "updated": 1708628890220
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624729599989
        },
        {
            "style": "Text",
            "text": "Sie können diesen Schalter für drei verschiedene Zwecke verwenden:",
            "updated": 1708373767345,
            "translations": [
                {
                    "language": "ES",
                    "text": "Puede usar este interruptor para tres propósitos diferentes:",
                    "updated": 1636039855908
                },
                {
                    "language": "RU",
                    "text": "Вы можете использовать этот переключатель для трех разных целей:",
                    "updated": 1639134350579
                },
                {
                    "language": "TR",
                    "text": "Bu anahtarı üç farklı amaç için kullanabilirsiniz:",
                    "updated": 1654394552546,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "List",
            "text": "Als Organisationsmittel: Sie können beliebige Anordnungen von Stimmen erstellen, die weitere Schalter und Stimmen hervorbringen.",
            "updated": 1708373793750,
            "translations": [
                {
                    "language": "ES",
                    "text": "Como un dispositivo organizacional: puede crear arbitrariamente arreglos de votos, desplegando más switches y votos.",
                    "updated": 1636040002945
                },
                {
                    "language": "RU",
                    "text": "В качестве организационного устройства: вы можете создавать произвольные схемы голосов, порождая больше переключателей и голосов.",
                    "updated": 1639134379562
                },
                {
                    "language": "TR",
                    "text": "Organizasyonel bir araç olarak: Daha fazla anahtar ve oy üreterek keyfi oy düzenlemeleri oluşturabilirsiniz.",
                    "updated": 1654394561868,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Als Schalter: Sie können den Fluss der Claim Support Power steuern, ähnlich wie mit dem Token Power Switch, aber innerhalb des Abstimmungsprogramms (Voting Program). Wenn Sie eine Erinnerung brauchen, lesen Sie, wie Token Power fließt (Token Power Flows).",
            "updated": 1708373848382,
            "translations": [
                {
                    "language": "ES",
                    "text": "Como un switch: Ypuede controlar el flujo del Claim Support Power, muy parecido al Token Power Switch, pero sin el Voting Program. Si necesita un recordatorio, lea como fluye el Token Power Flows.",
                    "updated": 1636040127007
                },
                {
                    "language": "RU",
                    "text": "В качестве переключателя: вы можете управлять потоком Claim Support Power, почти так же, как с помощью Token Power Switch, но в рамках программы Voting Program. Если вам нужно напоминание, прочитайте пояснения Token Power Flows.",
                    "updated": 1639134540761
                },
                {
                    "language": "TR",
                    "text": "Anahtar olarak: Talep Destek Gücünün akışını, Token Güç Anahtarında olduğu gibi, ancak Oylama Programı dahilinde kontrol edebilirsiniz. Hatırlatmaya ihtiyacınız varsa, Token Gücünün nasıl Aktığını okuyun.",
                    "updated": 1654394567484,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Als Datenstruktur-Mapper: Verwenden Sie den Knoten zur Referenzierung von Claims Folder -Knotentypen, um ganze Strukturen von Claims auf anderen User Profile Hierarchien abzubilden.",
            "updated": 1708373875102,
            "translations": [
                {
                    "language": "ES",
                    "text": "Como mapeador de estructuras de datos: Use el nodo para referir  Claims Foldertipo de nodo para mapear estructuras enteras de solicitudes, en otra jerarquía del User Profile.",
                    "updated": 1636040291714
                },
                {
                    "language": "RU",
                    "text": "В качестве средства сопоставления структуры данных: используйте узел для ссылки на типы узлов Claims Folder, чтобы сопоставить целые структуры утверждений с другими иерархиями профилей пользователей.",
                    "updated": 1639134594315
                },
                {
                    "language": "TR",
                    "text": "Bir veri yapısı eşleyicisi olarak: Diğer Kullanıcı Profili hiyerarşilerindeki taleplerin tüm yapılarını eşlemek için Talep Klasörü türlerine başvurmak üzere düğümü kullanın.",
                    "updated": 1654394573229,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Die ersten beiden Anwendungsfälle sind selbsterklärend. Lassen Sie uns den dritten Fall genauer untersuchen.",
            "updated": 1708373885125,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los primeros dos casos de uso  son autoexplicativo. Exploremos el tercer caso con más detalle.",
                    "updated": 1636040377996
                },
                {
                    "language": "RU",
                    "text": "Первые два варианта использования не требуют пояснений. Рассмотрим третий подробнее.",
                    "updated": 1639134609926
                },
                {
                    "language": "TR",
                    "text": "İlk iki kullanım durumu kendi kendini açıklar niteliktedir. Üçüncüsünü daha ayrıntılı olarak inceleyelim.",
                    "updated": 1654394579802,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Verwenden Sie einen Claim Votes Switch-Knoten, um einen Bezug zu einem Claims Folder-Knoten - Position Claims Folder, Feature Claims Folder oder Asset Claims Folder - innerhalb des Claims Program-Abschnitts des User Profile-Knotens Ihres Kollegen herzustellen. Verwenden Sie dann die Option Fehlende Stimmen installieren im Menü des Claim Votes-Schalter, um den gesamten Claims-Ordner zuzuordnen!",
            "updated": 1708374307972,
            "translations": [
                {
                    "language": "ES",
                    "text": "Use un nodo Claim Votes Switch para establecer la referencia de Claims Folde con un tipo de nodo — Position Claims Folder, Feature Claims Folder, o Asset Claims Folder — incluídos en la sección de Claims Program en el nodo del User Profile de un colega. Entonces use la opción de Install Missing Votes en el menú del Claim Votes Switch para mapear por completo el Claims Folder!",
                    "updated": 1636040586880
                },
                {
                    "language": "RU",
                    "text": "Используйте узел Claim Votes Switch, чтобы установить ссылку на тип узла Claims Folder — Position Claims Folder, Feature Claims Folder или Asset Claims Folder — в разделе Claims Program узла User Profile вашего коллеги. Затем используйте опцию Install Missing Votes в меню Claim Votes Switch, чтобы сопоставить всю папку Claims Folder!",
                    "updated": 1639135007910
                },
                {
                    "language": "TR",
                    "text": "İş arkadaşınızın Kullanıcı Profili düğümünün Talep Programı bölümünde bir Talep Klasörü türü düğümle (Pozisyon Talepleri Klasörü, Özellik Talepleri Klasörü veya Varlık Talepleri Klasörü) referans oluşturmak için bir Talep Oyları Anahtarı düğümü kullanın. Ardından tüm Talep Klasörünü eşlemek için Talep Oyları Anahtarı menüsündeki Eksik Oyları Yükle seçeneğini kullanın!",
                    "updated": 1654394585497,
                    "style": "Callout"
                }
            ]
        },
        {
            "style": "Note",
            "text": "Der Prozess erstellt einen Claim Votes Switch für jeden Claims Folder und passende Claim Votes für jeden Asset Contribution Claim, Feature Contribution Claim oder Position Contribution Claim, die innerhalb jedes Ordners definiert sind.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El proceso crea un Claim Votes Switch para cada Claims Folder, y emparejando Claim Votes fpara cada Asset Contribution Claim, Feature Contribution Claim, o Position Contribution Claim definida en cada carpeta.",
                    "updated": 1636040713515
                },
                {
                    "language": "RU",
                    "text": "Процесс создает переключатель Claim Votes Switch для каждой папки Claims Folder и  соответствующие Claim Votes для каждого Asset Contribution Claim, Feature Contribution Claim или Position Contribution Claim, определенных в каждой папке.",
                    "updated": 1639135246581
                },
                {
                    "language": "TR",
                    "text": "Süreç, her bir Talep Klasörü için bir Talep Oyları Anahtarı ve her bir klasörde tanımlanan her bir Varlık Katkı Talebi, Özellik Katkı Talebi veya Pozisyon Katkı Talebi için eşleşen Talep Oyları oluşturur.",
                    "updated": 1654394592496,
                    "style": "Note"
                }
            ],
            "updated": 1708374494440
        },
        {
            "style": "Success",
            "text": "Wenn sich an den Definitionen etwas ändert, können Sie jederzeit zurückgehen und den Prozess Fehlende Abstimmungen installieren erneut ausführen. Der Prozess wird die Struktur mit den entsprechenden Stimmen und Schaltern neu zuordnen.",
            "updated": 1708374521123,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si algo cambia del lado de las definiciones, puede siempre retroceder yhacer correr nuevamente el proceso de Install Missing Votes . E proceso remapeará la estructura con los votos y los switches adecuados.",
                    "updated": 1636040878722
                },
                {
                    "language": "RU",
                    "text": "Если что-то изменится в определениях, вы всегда можете вернуться к процессу Install Missing Votes еще раз. Процесс изменит отображение структуры с соответствующими голосами и переключателями.",
                    "updated": 1639135447582
                },
                {
                    "language": "TR",
                    "text": "Tanımlar tarafında bir şey değişirse, her zaman geri dönüp Eksik Oyları Yükle işlemini tekrar çalıştırabilirsiniz. İşlem, yapıyı uygun oylarla ve anahtarlarla yeniden eşleştirecektir.",
                    "updated": 1654394598656,
                    "style": "Success"
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Konfiguration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1639135473603
                },
                {
                    "language": "TR",
                    "text": "Konfigürasyon",
                    "updated": 1654394604393,
                    "style": "Title"
                }
            ],
            "updated": 1708374528819
        }
    ]
}