{
    "type": "Target Rate",
    "definition": {
        "text": "The target rate is a reference rate that may affect simulations and that, in combination with the placement of managed stop loss and managed take profit targets, is used to determine whether the targets have been hit.",
        "translations": [
            {
                "language": "ES",
                "text": "El target rate es una tasa de referencia que puede afectar a las simulaciones y que, en combinación con la ubicación de los objetivos de stop loss gestionados y take profit gestionados, se utiliza para determinar si se han alcanzado los objetivos.",
                "updated": 1629580668142
            },
            {
                "language": "RU",
                "text": "Target Rate (целевая ставка)  - это базовая ставка, которая может влиять на моделирование и которая, в сочетании с размещением управляемых стоп-лоссов и управляемых тейк-профитов, используется для определения того, были ли достигнуты цели.",
                "updated": 1639822060269
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Title",
            "text": "Internal Use",
            "updated": 1609595630529,
            "translations": [
                {
                    "language": "RU",
                    "text": "Внутреннее использование",
                    "updated": 1639819367535
                }
            ]
        },
        {
            "style": "Text",
            "text": "The system needs to determine when the managed stop loss and managed take profit targets have been hit. To do this, the system observes how the user places the targets in relation to the target rate.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Системе необходимо определить, когда цели управляемого стоп-лосса и управляемого тейк-профита были достигнуты. Для этого система наблюдает за тем, как пользователь размещает цели по отношению к целевой ставке.",
                    "updated": 1639819428111
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "For example",
            "updated": 1609595707526,
            "translations": [
                {
                    "language": "RU",
                    "text": "Например",
                    "updated": 1639819439813
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the phase 1 managed stop loss target is placed below the target rate and the phase 1 managed take profit target above it, the system assumes that:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если цель управляемого стоп-лосса фазы 1 расположена ниже целевой ставки, а цель управляемого тейк-профита фазы 1 - выше нее, система предполагает, что:",
                    "updated": 1639819464320
                }
            ]
        },
        {
            "style": "List",
            "text": "the stop loss target is hit when the current rate is equal to or smaller than the managed stop loss value;",
            "translations": [
                {
                    "language": "RU",
                    "text": "цель стоп-лосс достигнута, когда текущая ставка равна или меньше управляемого значения стоп-лосс;",
                    "updated": 1639819506441
                }
            ]
        },
        {
            "style": "List",
            "text": "the stop loss target is hit when the current rate is equal to or greater than the managed take profit value;",
            "translations": [
                {
                    "language": "RU",
                    "text": "цель стоп-лосс достигается, когда текущая ставка равна или превышает значение управляемого тейк-профита;",
                    "updated": 1639819525790
                }
            ]
        },
        {
            "style": "Text",
            "text": "This is how the system uses the target rate internally.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Так система использует целевую ставку внутри системы.",
                    "updated": 1639819539106
                }
            ]
        },
        {
            "style": "Title",
            "text": "Fetching the Value from Formulas",
            "updated": 1609595638456,
            "translations": [
                {
                    "language": "RU",
                    "text": "Получение значений из формул",
                    "updated": 1639819564896
                }
            ]
        },
        {
            "style": "Text",
            "text": "Additionally, defining a target rate at the level of the stage may be of use so that you may retrieve the value from formulas while setting the rate of limit orders, using the path of the corresponding node at the trading engine.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Кроме того, определение целевой ставки на уровне этапа может быть полезным для того, чтобы вы могли получить значение из формул при установке ставки лимитных ордеров, используя путь соответствующего узла в торговом движке.",
                    "updated": 1639819622326
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example, tradingEngine.tradingCurrent.position.entryTargetRate.value or tradingEngine.tradingCurrent.position.exitTargetRate.value.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Например, tradingEngine.tradingCurrent.position.entryTargetRate.value или tradingEngine.tradingCurrent.position.exitTargetRate.value.",
                    "updated": 1639819640358
                }
            ]
        },
        {
            "style": "Title",
            "text": "Affecting How Simulations are Plotted",
            "updated": 1609595746127,
            "translations": [
                {
                    "language": "RU",
                    "text": "Влияние симуляций на построение графиков",
                    "updated": 1639819708750
                }
            ]
        },
        {
            "style": "Text",
            "text": "The target rates defined at the open and close stages affect how the Position Base Asset and Position Quoted Asset layers in the Simulation Objects layer manager draw the triangle representing the development of the trade.",
            "updated": 1609595773405,
            "translations": [
                {
                    "language": "RU",
                    "text": "Целевые ставки, определенные на стадиях открытия и закрытия, влияют на то, как слои Position Base Asset и Position Quoted Asset в менеджере слоев Simulation Objects рисуют треугольник, представляющий развитие сделки.",
                    "updated": 1639820992365
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/Charts/target-rate-in-position.png",
            "updated": 1609597291786
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": "The horizontal segment marks the target rate defined at the open stage. If you are using market orders to take the position, then using tradingEngine.tradingCurrent.tradingEpisode.candle.close.value may offer a good representation of the rate of market orders. If you are using limit orders, then you may decide at which rate you wish to take the position, and the horizontal segment of the triangle will match the chosen rate.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Горизонтальный отрезок отмечает целевую ставку, определенную на стадии открытия. Если вы используете рыночные ордера для открытия позиции, то использование tradingEngine.tradingCurrent.tradingEpisode.candle.close.value может дать хорошее представление о ставке рыночных ордеров. Если вы используете лимитные ордера, то вы можете решить, по какому курсу вы хотите занять позицию, и горизонтальный сегмент треугольника будет соответствовать выбранному курсу.",
                    "updated": 1639821072912
                }
            ]
        },
        {
            "style": "Text",
            "text": "The third vertex of the triangle points to a [datetime, rate] coordinate. The datetime is given by the candle on which the manage stage closes, that is, the candle at which the stop loss or take profit targets are hit. The rate portion of the coordinate is given by the target rate defined in the close stage.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Третья вершина треугольника указывает на координату [datetime, rate]. Дата задается свечой, на которой закрывается стадия управления, то есть свечой, на которой достигаются цели стоп-лосс или тейк-профит. Часть координаты rate задается целевой ставкой, определенной на стадии закрытия Close Stage.",
                    "updated": 1639821171001
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may choose to apply a similar reasoning as with the open stage target rate for limit orders, but there is some nuance to consider if you are using market orders.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете применить аналогичные рассуждения, как и в случае с целевой ставкой открытой стадии для лимитных ордеров, но есть некоторые нюансы, которые необходимо учитывать, если вы используете рыночные ордера.",
                    "updated": 1639821202743
                }
            ]
        },
        {
            "style": "Callout",
            "text": "The issue arises when you run a testing session at a time frame higher than the time frame you use for live trading.",
            "updated": 1609596096827,
            "translations": [
                {
                    "language": "RU",
                    "text": "Проблема возникает, когда вы запускаете сеанс тестирования на более высоком таймфрейме, чем тот, который вы используете для реальной торговли.",
                    "updated": 1639821267253
                }
            ]
        },
        {
            "style": "Text",
            "text": "Why is that an issue?",
            "translations": [
                {
                    "language": "RU",
                    "text": "Почему это проблема?",
                    "updated": 1639821293362
                }
            ]
        },
        {
            "style": "Text",
            "text": "Let's say your trading system makes decisions based on the close of the 1-hour candle. And let's say you are using stop loss and take profit targets. In such cases&mdash;when live trading&mdash;you may want to run your strategy in the 1-minute time frame, to detect the tagging of the take profit and stop targets as soon as possible, and act accordingly.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Допустим, ваша торговая система принимает решения на основе закрытия 1-часовой свечи. И, допустим, вы используете цели стоп-лосс и тейк-профит. В таких случаях - при реальной торговле - вы, возможно, захотите запустить свою стратегию на 1-минутном таймфрейме, чтобы как можно быстрее обнаружить тейк-профит и стоп-цели и действовать соответствующим образом.",
                    "updated": 1639821324294
                }
            ]
        },
        {
            "style": "Text",
            "text": "However, when backtesting, it is much faster to run sessions on the 1-hour time frame. This is particularly important when you wish to test significant time ranges.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Однако при бэктестинге гораздо быстрее запускать сессии на 1-часовом временном интервале. Это особенно важно, когда вы хотите протестировать большие временные диапазоны.",
                    "updated": 1639821364316
                }
            ]
        },
        {
            "style": "Text",
            "text": "When backtesting a strategy on the 1-hour time frame, the trading bot evaluates if stop loss and take profit targets have been hit at the close of the 1-hour candle, and may only act upon the evaluation on the next candle. This means that if you are using market orders to exit the position, the market order would be placed (in the simulation!) on the candle after one of the targets was hit.",
            "translations": [
                {
                    "language": "RU",
                    "text": "При бэктестировании стратегии на 1-часовом таймфрейме торговый бот оценивает, были ли достигнуты цели стоп-лосс и тейк-профит при закрытии 1-часовой свечи, и может действовать на основании этой оценки только на следующей свече. Это означает, что если вы используете рыночные ордера для выхода из позиции, то рыночный ордер будет размещен (в симуляции!) на свече после достижения одной из целей.",
                    "updated": 1639821408214
                }
            ]
        },
        {
            "style": "Text",
            "text": "The difference in rate between the moment in time the target is hit and the time the 1-hour candle closes may be significant. As a result, if the close stage target rate is defined as tradingEngine.tradingCurrent.tradingEpisode.candle.close.value, the resulting simulation may show significant slippage, and diverge from what the trade would look like if running on the 1-minute time frame, like you would when trading live.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Разница в курсе между моментом достижения цели и моментом закрытия часовой свечи может быть значительной. В результате, если целевой показатель этапа закрытия определен как tradingEngine.tradingCurrent.tradingEpisode.candle.close.value, результирующая симуляция может показать значительное проскальзывание и расходиться с тем, как выглядела бы сделка при работе на 1-минутном таймфрейме, как при реальной торговле.",
                    "updated": 1639821451109
                }
            ]
        },
        {
            "style": "Text",
            "text": "To solve the above issue, you may use a more elaborate formula for the target rate in the close stage:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы решить эту проблему, вы можете использовать более сложную формулу для целевой ставки на стадии закрытия:",
                    "updated": 1639821505134
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "targetRate()\n\nfunction targetRate() {\n    switch (tradingEngine.tradingCurrent.position.exitType.value) {\n        case 'No Exit': {\n            return tradingEngine.tradingCurrent.tradingEpisode.candle.close.value\n            break\n        }\n        case 'Take Profit': {\n            return tradingEngine.tradingCurrent.position.takeProfit.finalValue.value\n            break\n        }\n        case 'Stop Loss': {\n            return tradingEngine.tradingCurrent.position.stopLoss.finalValue.value\n            break\n        }\n    }\n}",
            "updated": 1609596984516
        },
        {
            "style": "Text",
            "text": "This formula discriminates among three possible outcomes:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Эта формула различает три возможных результата:",
                    "updated": 1639821570588
                }
            ]
        },
        {
            "style": "List",
            "text": "When no target has been hit, the value of the target rate is the close of the current candle.",
            "updated": 1609603780132,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если цель не достигнута, значением целевой ставки является закрытие текущей свечи.",
                    "updated": 1639821590033
                }
            ]
        },
        {
            "style": "List",
            "text": "When the take profit is hit, the value of the target rate is the last value of the take profit.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда тейк-профит достигнут, значением целевой ставки станет последнее значение тейк-профита.",
                    "updated": 1639821713089
                }
            ]
        },
        {
            "style": "List",
            "text": "When the stop loss is hit, the value of the target rate is the last value of the stop loss.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда стоп-лосс достигнут, значением целевой ставки станет последнее значение стоп-лосса.",
                    "updated": 1639821701323
                }
            ]
        },
        {
            "style": "Success",
            "text": "You may use a similar formula on the simulated actual rate node of the simulated exchange events associated with the market order you are using to exit the position. Such use of the simulated actual rate node would impact the accounts kept for the episode and result in more realistic results for your backtesting session.",
            "updated": 1609603803351,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете использовать аналогичную формулу на узле симуляции реального курса смоделированных биржевых событий, связанных с рыночным ордером, который вы используете для выхода из позиции. Такое использование узла симулированного реального курса повлияет на счета, которые ведутся для данного эпизода, и приведет к более реалистичным результатам для вашей сессии бэктестирования.",
                    "updated": 1639821917998
                }
            ]
        },
        {
            "style": "Note",
            "text": "As you see, flexibility is a key design feature in Superalgos.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Как видите, гибкость - ключевая конструктивная особенность Superalgos.",
                    "updated": 1639822015714
                }
            ]
        }
    ]
}