{
    "topic": "Gov Commands Errors",
    "pageNumber": "2",
    "type": "Gov Error - Github Credentials Missing",
    "definition": {
        "text": "To manage pull requests from within the app, you must first provide your Github.com credentials so that the Client can get you authenticated when while accessing Github.com.",
        "updated": 1611129104270,
        "translations": [
            {
                "language": "ES",
                "text": "Para administrar los cpull requests desde dentro de la app, debe proveer sus credenciales de Github.com para que el Clientpuede conseguir que se autentique al acceder a Github.com.",
                "updated": 1637852263275
            },
            {
                "language": "DE",
                "text": "Um Pull Requests aus der App heraus zu verwalten, müssen Sie zunächst Ihre Github.com Anmeldedaten (credentials) angeben, damit der Client Sie beim Zugriff auf Github.com authentifizieren kann.",
                "updated": 1639571197259
            },
            {
                "language": "RU",
                "text": "Чтобы управлять запросами на извлечение из приложения, вы должны сначала предоставить свои учетные данные Github.com, чтобы клиент мог аутентифицировать вас при доступе к Github.com.",
                "updated": 1645627543184
            },
            {
                "language": "TR",
                "text": "Özet: Uygulama içinden çekme isteklerini yönetmek ve İstemcinin ( Client ) Github.com'a erişirken kimliğinizi doğrulayabilmesi için önce Github.com kimlik bilgilerinizi sağlamanız gerekir.",
                "updated": 1646742758149
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Anchor",
            "text": "Anchor Github Credentials Missing",
            "updated": 1609855373585,
            "translations": [ ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. Please solve this issue and try again.",
            "updated": 1620591786589,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Github Anmeldeinformationen (Credentials) fehlen. Bitte lösen Sie dieses Problem und versuchen Sie es erneut.",
                    "updated": 1639571190796
                },
                {
                    "language": "RU",
                    "text": "Учетные данные Github отсутствуют. Пожалуйста, решите эту проблему и повторите попытку.",
                    "updated": 1645627569863
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Lütfen bu sorunu çözün ve tekrar deneyin.",
                    "updated": 1646742772816
                }
            ]
        },
        {
            "style": "Text",
            "text": "To solve this issue follow the following instructions on how to set up your GitHub.com credentials so that the system can automate the tasks needed to submit your contributions to the main repository of the Superalgos project.",
            "updated": 1609945787577,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para resolver este problema, siga las siguientes instrucciones sobre cómo configurar sus credenciales de GitHub.com para que el sistema pueda automatizar las tareas necesarias para enviar sus contribuciones al repositorio principal del proyecto Superalgos.",
                    "updated": 1637852304242
                },
                {
                    "language": "DE",
                    "text": "Um dieses Problem zu lösen, befolgen Sie die folgenden Anweisungen, um Ihre GitHub.com Anmeldedaten einzurichten, damit das System die Aufgaben automatisieren kann, die erforderlich sind, um Ihre Beiträge in das main repository des Superalgos Projekts einzureichen.",
                    "updated": 1639571240790
                },
                {
                    "language": "RU",
                    "text": "Для решения этой проблемы следуйте следующим инструкциям по настройке учетных данных GitHub.com, чтобы система могла автоматизировать задачи, необходимые для отправки вашего вклада в основной репозиторий проекта Superalgos.",
                    "updated": 1645627562155
                },
                {
                    "language": "TR",
                    "text": "Bu sorunu çözmek için, sistemin Superalgos projesinin ana deposuna katkılarınızı göndermek için gereken görevleri otomatikleştirebilmesi için GitHub.com kimlik bilgilerinizi nasıl ayarlayacağınıza ilişkin aşağıdaki talimatları izleyin.",
                    "updated": 1646742793685
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Hierarchy APIs Not Found",
            "translations": [
                {
                    "language": "TR",
                    "text": "Çapa Hiyerarşisi API'leri Bulunamadı",
                    "updated": 1654395122566,
                    "style": "Anchor"
                }
            ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The Hierarchy APIs was not found at your workspace. Please create it following the guide below and try again.",
            "updated": 1620591795457,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github-Anmeldeinformationen fehlen. Die Hierarchy APIs wurden in Ihrem workspace nicht gefunden. Bitte erstellen Sie sie gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1639571270120
                },
                {
                    "language": "RU",
                    "text": "Учетные данные Github отсутствуют. На вашем рабочем пространстве не найден Hierarchy APIs. Пожалуйста, создайте его, следуя приведенному ниже руководству, и повторите попытку.",
                    "updated": 1645627617623
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Hiyerarşi API'leri çalışma alanınızda bulunamadı. Lütfen aşağıdaki kılavuzu izleyerek oluşturun ve tekrar deneyin.",
                    "updated": 1646742811084
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Github API Node Not Found",
            "updated": 1610559802944,
            "translations": [
                {
                    "language": "TR",
                    "text": "Anchor Github API Düğümü Bulunamadı",
                    "updated": 1654395128863,
                    "style": "Anchor"
                }
            ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The Hierarchy APIs does not have a child of type Github API. Please create it following the guide below and try again.",
            "updated": 1620591802895,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github Anmeldeinformationen fehlen.Die Hierarchy APIs haben kein untergeordnetes Element vom Typ Github API.  Bitte erstellen Sie sie gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1639571321684
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Hiyerarşi API'lerinin Github API türünde bir alt öğesi yoktur. Lütfen aşağıdaki kılavuzu izleyerek oluşturun ve tekrar deneyin.",
                    "updated": 1646742943602
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Config Property Username Not Found",
            "updated": 1610559852624,
            "translations": [
                {
                    "language": "TR",
                    "text": "Anchor Config Özelliği Kullanıcı Adı Bulunamadı",
                    "updated": 1654395134800,
                    "style": "Anchor"
                }
            ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The property username is missing or empty. Please create it following the guide below and try again.",
            "updated": 1620591810613,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github Anmeldeinformationen fehlen. Die Hierarchy APIs haben kein untergeordnetes Element vom Typ Github API. Die Eigenschaft username fehlt oder ist leer. Bitte erstellen Sie ihn gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1639571348964
                },
                {
                    "language": "RU",
                    "text": "Учетные данные Github отсутствуют. Имя пользователя отсутствует или пусто. Пожалуйста, создайте его, следуя приведенному ниже руководству, и повторите попытку.",
                    "updated": 1645627627894
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Özellik kullanıcı adı eksik veya boş. Lütfen aşağıdaki kılavuzu izleyerek oluşturun ve tekrar deneyin.",
                    "updated": 1646743025800
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Config Property Token Not Found",
            "updated": 1610559914327,
            "translations": [
                {
                    "language": "TR",
                    "text": "Anchor Config Özellik Belirteci Bulunamadı",
                    "updated": 1654395140753,
                    "style": "Anchor"
                }
            ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The property token is missing or empty. Please create it following the guide below and try again.",
            "updated": 1610559900470,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github Anmeldeinformationen fehlen. Die Hierarchy APIs haben kein untergeordnetes Element vom Typ Github API. Das Property Token fehlt oder ist leer.  Bitte erstellen Sie ihn gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1639571372981
                },
                {
                    "language": "RU",
                    "text": "Учетные данные Github отсутствуют. Свойство token отсутствует или является пустым. Пожалуйста, создайте его, следуя приведенному ниже руководству, и повторите попытку.",
                    "updated": 1645627679219
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Özellik jetonu eksik veya boş. Lütfen aşağıdaki kılavuzu izleyerek oluşturun ve tekrar deneyin.",
                    "updated": 1646743050479
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Applies to",
            "translations": [
                {
                    "language": "DE",
                    "text": "Gilt für:",
                    "updated": 1639571389539
                },
                {
                    "language": "RU",
                    "text": "Применяется к",
                    "updated": 1645627686212
                },
                {
                    "language": "TR",
                    "text": "Şunlar için geçerlidir:",
                    "updated": 1646743063217
                }
            ]
        },
        {
            "style": "List",
            "text": "Gov PRs Command",
            "translations": [
                {
                    "language": "TR",
                    "text": "Vali Halkla İlişkiler Komutanlığı",
                    "updated": 1654395147674,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Topic->App Contribute Command->Block Authentication",
            "updated": 1609945833844,
            "translations": [
                {
                    "language": "TR",
                    "text": "Foundations->Topic->App Contribute Command->Block Authentication",
                    "updated": 1654395153447,
                    "style": "Include"
                }
            ]
        }
    ]
}