{
    "type": "Indicator Bot",
    "definition": {
        "text": "An indicator bot is an algorithm that processes information that other bots have generated, and produces elaborate datasets for others to consume.",
        "translations": [
            {
                "language": "ES",
                "text": "Un indicator bot es un algoritmo que procesa información que otros bots han generado y produce conjuntos de datos elaborados para que otros los consuman.",
                "updated": 1624496036942
            },
            {
                "language": "RU",
                "text": "Бот-индикатор - это алгоритм, который обрабатывает информацию, сгенерированную другими ботами, и создает сложные наборы данных для использования другими.",
                "updated": 1636192708246
            },
            {
                "language": "DE",
                "text": "Ein Indikator-Bot ist ein Algorithmus, der Informationen verarbeitet, die andere Bots generiert haben, und umfangreiche Datensätze erstellt, die von anderen genutzt werden können.",
                "updated": 1636658543393
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The indicator bot node holds all definitions required for an indicator bot to function. Definitions are split between the definition of processes and products. Processes are algorithms that go through an input dataset, perform certain calculations, and produce an output. Products are the outcome of the work produced by these algorithms, in the form of elaborate data sets.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die indicator bot node enthält alle Definitionen, die für die Funktion eines indicator bot erforderlich sind. Die Definitionen sind aufgeteilt in die Definition von Prozessen und Produkten. Prozesse (Processes) sind Algorithmen, die einen Eingabedatensatz durchlaufen, bestimmte Berechnungen durchführen und eine Ausgabe erzeugen. Products sind das Ergebnis der von diesen Algorithmen geleisteten Arbeit in Form von ausgearbeiteten Datensätzen.",
                    "updated": 1636658558739
                }
            ]
        },
        {
            "style": "Text",
            "text": "Most of the behavior expected from an indicator bot is defined by the structure of nodes in the hierarchy and the references among the nodes within these definitions. As such, you do not need to code any of the functions that make up the infrastructure functionality. Dependencies, outputs, data structures, execution sequences, and several other problems are handled by the definitions embodied in the structure of nodes that make up an indicator, and are configured in the visual environment of the design space. Coding is limited to the actual calculation and data building procedures.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Großteil des von einem indicator-Bot erwarteten Verhaltens wird durch die Struktur der nodes in der hierarchy und die references (Verweise) zwischen den nodes innerhalb dieser Definitionen festgelegt. Daher müssen Sie keine der Funktionen, die die infrastructure functionality ausmachen, programmieren. Dependencies, outputs, data structures, execution sequences und verschiedene andere Probleme werden durch die Definitionen in der Struktur der nodes, aus denen ein indicator bot besteht, gehandhabt und werden in der visuellen Umgebung des Design Space konfiguriert. Die Programmierung beschränkt sich auf die eigentlichen Berechnungs/Datenaufbau -Verfahren.",
                    "updated": 1636658578266
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Indicator Bot Configuration",
            "updated": 1609789150912,
            "translations": [
                {
                    "language": "DE",
                    "text": "Indicator Bot Konfiguration:",
                    "updated": 1636658588076
                }
            ]
        },
        {
            "style": "Text",
            "text": "Properties",
            "updated": 1609789156452
        },
        {
            "style": "List",
            "text": "codeName is the name of the bot as used within the code of the system.",
            "translations": [
                {
                    "language": "DE",
                    "text": "codeName ist der Name des Bots, wie er im (Programm)-Code des Systems verwendet wird.",
                    "updated": 1636658601783
                }
            ]
        }
    ]
}