{
    "type": "Docs Space Settings",
    "definition": {
        "text": "This node allows the user to determine how the docs space will be loaded by the current workspace.",
        "updated": 1631587592724,
        "translations": [
            {
                "language": "RU",
                "text": "Этот узел позволяет пользователю определить, как пространство документов будет загружено текущим рабочим пространством.",
                "updated": 1638526506560
            },
            {
                "language": "TR",
                "text": "Bu düğüm, kullanıcının dokümanlar alanının geçerli çalışma alanı tarafından nasıl yükleneceğini belirlemesine olanak tanır.",
                "updated": 1652014103367
            },
            {
                "language": "DE",
                "text": "Mit diesem Knoten kann der Benutzer festlegen, wie der Docs Space vom aktuellen Arbeitsbereich geladen werden soll.",
                "updated": 1674916851109
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1631587516173,
            "translations": [
                {
                    "language": "TR",
                    "text": "Özellikleri",
                    "updated": 1652014111719
                },
                {
                    "language": "DE",
                    "text": "Eigenschaften",
                    "updated": 1674916886307
                }
            ]
        },
        {
            "style": "List",
            "text": "indexContent defines whether the contents of the docs space will be indexed for searching upon loading the workspace. If false docs space will be disabled allowing faster load times for development.",
            "translations": [
                {
                    "language": "TR",
                    "text": "indexContent çalışma alanı yüklendikten sonra arama için dokümanlar alanının içeriğinin dizine eklenip eklenmeyeceğini tanımlar. Yanlış dokümanlar alanı devre dışı bırakılırsa, geliştirme için daha hızlı yükleme süreleri sağlanır.",
                    "updated": 1652014128881
                },
                {
                    "language": "DE",
                    "text": "indexContent legt fest, ob der Inhalt des Docs Space beim Laden des Arbeitsbereichs für die Suche indiziert wird. Bei false wird der Docs Space deaktiviert, was schnellere Ladezeiten für die Entwicklung ermöglicht.",
                    "updated": 1674916933578
                }
            ]
        }
    ]
}