{
    "type": "Position Contribution Claim",
    "definition": {
        "text": "Use this node to reference a Position node in one of the Positions hierarchy to establish a Position Contribution Claim. This claim means that you declare that you have worked on that Position, and that you expect to be rewarded accordingly!",
        "updated": 1630349455755,
        "translations": [
            {
                "language": "ES",
                "text": "Use este nodo para referenciar un nodo de Position ( Posición) de una jerarquía de posición para establecer una Position Contribution Claim ( Solicitud de Contribución de Posición). Esta solicitud significa que declara que ha trabajado en esa posición, y que espera ser recompensado consecuentemente!",
                "updated": 1636282196871
            },
            {
                "language": "RU",
                "text": "Используйте этот узел для ссылки на узел Position в одной из иерархий Positions для создания Position Contribution Claim. Это заявление означает, что вы заявляете, что работали на этим Position и ожидаете соответствующего вознаграждения!",
                "updated": 1639134163757
            },
            {
                "language": "TR",
                "text": "Bir Pozisyon Katkısı Talebi oluşturmak için Pozisyonlar (Positions) hiyerarşisinden birindeki bir Pozisyon (Position) düğümüne başvurmak için bu düğümü kullanın. Bu iddia, o Pozisyonda çalıştığınızı ve buna göre ödüllendirilmeyi beklediğinizi beyan ettiğiniz anlamına gelir!",
                "updated": 1644497602886
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624728656474
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Claims Content",
            "updated": 1630325507398
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1639134175536
                }
            ]
        }
    ]
}