{
    "type": "Depthwise Conv 2D Layer",
    "definition": {
        "text": "Depthwise separable 2D convolution. Depthwise Separable convolutions consists in performing just the first step in a depthwise spatial convolution (which acts on each input channel separately). The depthMultiplier argument controls how many output channels are generated per input channel in the depthwise step.",
        "updated": 1613218906419,
        "translations": [
            {
                "language": "RU",
                "text": "Глубинная сепарабельная двумерная свертка. Она заключается в выполнении только первого шага глубинной пространственной свертки (который действует на каждый входной канал отдельно). Аргумент depthMultiplier управляет тем, сколько выходных каналов генерируется на каждый входной канал на шаге по глубине.",
                "updated": 1645247396604
            },
            {
                "language": "TR",
                "text": "Derinlemesine ayrılabilir 2D konvolüsyon. Derinlemesine Ayrılabilir konvolüsyonlar, derinlemesine uzamsal konvolüsyonda (her bir giriş kanalına ayrı ayrı etki eden) sadece ilk adımın gerçekleştirilmesinden oluşur. depthMultiplier bağımsız değişkeni, derinlik adımında giriş kanalı başına kaç çıkış kanalı oluşturulacağını kontrol eder.",
                "updated": 1654396970522
            },
            {
                "language": "DE",
                "text": "Tiefenweise trennbare 2D-Faltung. Tiefenweise trennbare Faltungen bestehen darin, nur den ersten Schritt einer tiefenweisen räumlichen Faltung durchzuführen (der auf jeden Eingangskanal separat wirkt). Das Argument depthMultiplier steuert, wie viele Ausgangskanäle pro Eingangskanal im tiefenweisen Schritt erzeugt werden.  ",
                "updated": 1708629001418
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645247366886
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654396976912,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1708460262569
                }
            ]
        }
    ]
}