{
    "topic": "Error Causes",
    "pageNumber": "3",
    "type": "Value Not A Number",
    "definition": {
        "text": "At runtime some nodes might acquire a value, and when it is expected that the value is a number, this type of error will pop up. To avoid this to happen Make sure that at nodes that should have only numeric values, that they don't get by any means a non numeric one.",
        "updated": 1611652261727,
        "translations": [
            {
                "language": "RU",
                "text": "Во время выполнения некоторые узлы могут получить значение, и когда ожидается, что значение будет числом, появится ошибка этого типа. Чтобы этого не произошло, убедитесь, что в узлах, которые должны иметь только числовые значения, они ни в коем случае не получают нечисловые значения.",
                "updated": 1638553135261
            },
            {
                "language": "DE",
                "text": "Zur Laufzeit können einige Nodes einen Wert erhalten, und wenn erwartet wird, dass der Wert eine Zahl ist, wird diese Art von Fehler angezeigt. Um dies zu vermeiden, stellen Sie sicher, dass Nodes, die nur numerische Werte haben sollen, auf keinen Fall einen nicht numerischen Wert erhalten.",
                "updated": 1645478334129
            },
            {
                "language": "TR",
                "text": "Çalışma zamanında bazı düğümler bir değer elde edebilir ve değerin bir sayı olması beklendiğinde bu tür bir hata açılır. Bunun olmasını önlemek için, yalnızca sayısal değerlere sahip olması gereken düğümlerde, hiçbir şekilde sayısal olmayan bir değer almadıklarından emin olun.",
                "updated": 1652296493045
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode. Then you can use docs.save to save your changes and app.contribute to send it to the main repository.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования. Затем вы можете использовать docs.save для сохранения изменений и app.contribute для отправки в основной репозиторий.",
                    "updated": 1638553150958
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle. Yeni paragraflar yazmak için ENTER'a basın. Düzenleme modundan çıkmak için ESC. Ardından docs.save değişikliklerinizi kaydetmek ve app.contribute ana depoya göndermek için kullanabilirsiniz.",
                    "updated": 1652296419836
                }
            ]
        }
    ]
}