{
    "type": "Data Product",
    "definition": {
        "text": "A data product represents the collection of datasets generated by the instance of a bot as defined in the corresponding data mine or trading mine.",
        "translations": [
            {
                "language": "ES",
                "text": "Un data product representa la recopilación de conjuntos de datos generados por la instancia de un bot según se define en la mina de datos o mina de trading correspondiente.",
                "updated": 1624284305118,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Data Product представляет собой совокупность наборов данных, сгенерированных экземпляром бота, как определено в соответствующей Data Mine или Trading Mine.",
                "updated": 1638377396280
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Data products exist in the context of trading mines data and data mines data nodes. In the first case, a data product is the collection of datasets generated by an instance of a trading bot as defined in a trading mine, running a trading session. In the latter case, it is the collection of datasets generated by either a sensor bot or an indicator bot instance, as defined in a data mine, and running a data mining task.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Информационные продукты существуют в контексте обмена данными шахт и узлов Data Mine. В первом случае информационный продукт - это набор коллекций данных, созданный экземпляром торгового бота, как определено в торговой шахте, при запуске торговой сессии. В последнем случае, это набор коллекций данных, созданных либо ботом-датчиком, либо экземпляром бота-индикатора, как определено в шахте данных, и запуском задачи интеллектуального анализа данных.",
                    "updated": 1638377105469
                }
            ]
        },
        {
            "style": "Text",
            "text": "A data product node must reference a product definition in the corresponding bot.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел информационного продукта должен ссылаться на определение продукта в соответствующем боте.",
                    "updated": 1638377306672
                }
            ]
        },
        {
            "style": "Important",
            "text": "Data products may only be stored on the same network node on which the task&mdash;data mining or trading&mdash;runs.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Продукты данных могут храниться только на том же сетевом узле, на котором выполняется задача - интеллектуальный анализ данных или торговля.",
                    "updated": 1638377326255
                }
            ]
        }
    ]
}