{
    "type": "Functional Model",
    "definition": {
        "text": "The key difference between a Functional and Sequential Model is that Functional Models allows you to create an arbitrary graph of layers, as long as they don't have cycles.",
        "updated": 1613207678780,
        "translations": [
            {
                "language": "RU",
                "text": "Ключевое различие между функциональной и последовательной моделью заключается в том, что функциональные модели позволяют создавать произвольный граф слоев, если они не имеют циклов.",
                "updated": 1645248059730
            },
            {
                "language": "TR",
                "text": "İşlevsel ve Sıralı Model arasındaki temel fark, İşlevsel Modellerin, döngüleri olmadığı sürece rastgele bir katman grafiği oluşturmanıza izin vermesidir.",
                "updated": 1654397166948
            },
            {
                "language": "DE",
                "text": "Der Hauptunterschied zwischen einem funktionalen und einem sequenziellen Modell (Sequential Model) besteht darin, dass Sie mit funktionalen Modellen einen beliebigen Graphen von Ebenen erstellen können, solange diese keine Zyklen haben.",
                "updated": 1707239728435
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645248065565
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397172859,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1707239739112
                }
            ]
        }
    ]
}