{
    "type": "Sensor Bot",
    "definition": {
        "text": "A sensor bot extracts raw data from external sources where a certain specific extracting algorithm needs to be coded, and stores it in a dataset that other bots may consume.",
        "updated": 1621691864710,
        "translations": [
            {
                "language": "ES",
                "text": "Un sensor bot extrae datos sin procesar de fuentes externas donde es necesario codificar un algoritmo de extracción específico, y los almacena en un conjunto de datos que otros bots pueden consumir.",
                "updated": 1624283917619
            },
            {
                "language": "RU",
                "text": "Sensor Bot извлекает необработанные данные из внешних источников, где необходимо закодировать определенный алгоритм извлечения, и сохраняет их в наборе данных, который могут использовать другие боты.",
                "updated": 1639406692285
            },
            {
                "language": "DE",
                "text": "Ein Sensor-Bot extrahiert Rohdaten aus externen Quellen, für die ein bestimmter Extraktionsalgorithmus kodiert werden muss, und speichert sie in einem Datensatz, der von anderen Bots genutzt werden kann.",
                "updated": 1646078905677
            },
            {
                "language": "TR",
                "text": "Bir sensör botu, belirli bir özel ayıklama algoritmasının kodlanması gereken harici kaynaklardan ham verileri alır ve diğer botların tüketebileceği bir veri kümesinde saklar.",
                "updated": 1652013796630
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "When there is no need for a special algorithm to be coded, Superalgos users run an API Data Fetcher Bot, which uses an API Map to describe the API itself and the bot allows fetching data without the need to code an algorithm at all.",
            "updated": 1621692364436,
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда нет необходимости в кодировании специального алгоритма, пользователи Superalgos запускают бот API Data Fetcher Bot, который использует API Map для описания самого API, а бот позволяет извлекать данные без необходимости кодировать алгоритм вообще.",
                    "updated": 1639406773116
                },
                {
                    "language": "ES",
                    "text": "Cuando no es necesario codificar un algoritmo en especial, los usuarios de Superalgos ejecutan una API Data Fetcher Bot (Bot de Obtención de Datos), que utiliza un API Map para describir la propia API, así el bot permite obtener datos sin necesidad de codificar un algoritmo en absoluto.",
                    "updated": 1641093316274
                },
                {
                    "language": "DE",
                    "text": "Wenn kein spezieller Algorithmus kodiert werden muss, können Superalgos-Benutzer einen API Data Fetcher Bot einsetzen, der eine API-Map verwendet, um die API selbst zu beschreiben, und der Bot ermöglicht das Abrufen von Daten, ohne dass überhaupt ein Algorithmus kodiert werden muss.",
                    "updated": 1646078971787
                },
                {
                    "language": "TR",
                    "text": "Özel bir algoritmanın kodlanmasına gerek olmadığında, Superalgos kullanıcıları API'nin kendisini tanımlamak için bir API Haritası ( API Map ) kullanan bir API Veri Alıcı Botu ( API Data Fetcher Bot ) çalıştırır ve bot, herhangi bir algoritma kodlamasına gerek kalmadan veri alınmasına izin verir.",
                    "updated": 1652013871684
                }
            ]
        },
        {
            "style": "Title",
            "text": "Current Implementation",
            "translations": [
                {
                    "language": "RU",
                    "text": "Текущая реализация",
                    "updated": 1639406782138
                },
                {
                    "language": "ES",
                    "text": "Aplicación Actual",
                    "updated": 1641093329047
                },
                {
                    "language": "DE",
                    "text": "Aktuelle Implementierung",
                    "updated": 1646078988348
                },
                {
                    "language": "TR",
                    "text": "Mevcut Uygulama",
                    "updated": 1652013881764
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are only two processes coded for the Sensor Bot so far:",
            "updated": 1621692240145,
            "translations": [
                {
                    "language": "RU",
                    "text": "Пока для Sensor Bot закодированы только два процесса:",
                    "updated": 1639406795512
                },
                {
                    "language": "ES",
                    "text": "Hasta el momento solo hay dos procesos codificados para el Sensor Bot:",
                    "updated": 1641093340799
                },
                {
                    "language": "DE",
                    "text": "Bisher sind nur zwei Prozesse für den Sensor Bot kodiert:",
                    "updated": 1646079005343
                },
                {
                    "language": "TR",
                    "text": "Şu ana kadar Sensör Botu için kodlanmış sadece iki süreç var:",
                    "updated": 1652013894837
                }
            ]
        },
        {
            "style": "List",
            "text": "Historic-OHLCVs: It can specifically fetch 1 minute candles from exchanges supported by the CCXT open source library.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Исторические данные - OHLCV: он может специально получать 1-минутные свечи с бирж, поддерживаемых библиотекой с открытым исходным кодом CCXT.",
                    "updated": 1639406893465
                },
                {
                    "language": "ES",
                    "text": "Historic-OHLCVs: Específicamente puede obtener velas de 1 minuto de los Exchanges soportados por la librería de código abierto CCXT.",
                    "updated": 1641093346385
                },
                {
                    "language": "DE",
                    "text": "Historic-OHLCVs: Kann ausschliesslich 1-Minuten-Kerzen von Börsen abrufen, die von der Open-Source-Bibliothek CCXT unterstützt werden.",
                    "updated": 1646079119994
                },
                {
                    "language": "TR",
                    "text": "Historic-OHLCVs: CCXT açık kaynak kitaplığı tarafından desteklenen borsalardan özel olarak 1 dakikalık mumlar getirebilir.",
                    "updated": 1652013925366
                }
            ]
        },
        {
            "style": "List",
            "text": "Check Webhooks: It checks for information that arrived at the client comming from webhook calls from external systems.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверка Webhooks: Он проверяет информацию, поступившую к клиенту в результате вызовов webhook из внешних систем.",
                    "updated": 1639406959823
                },
                {
                    "language": "ES",
                    "text": "Check Webhooks: Comprueba la información que recibe el cliente proveniente de llamadas Webhook de sistemas externos.",
                    "updated": 1641093386787
                },
                {
                    "language": "DE",
                    "text": "Check Webhooks: Prüft, ob Informationen von Webhook-Aufrufen aus externen Systemen beim Client angekommen sind.",
                    "updated": 1646079148549
                },
                {
                    "language": "TR",
                    "text": "Web kancalarını kontrol et: Harici sistemlerden gelen web kancası çağrılarından istemciye gelen bilgileri kontrol eder.",
                    "updated": 1652013947388
                }
            ]
        },
        {
            "style": "Text",
            "text": "More processes might be coded in the future as the system grows. ",
            "translations": [
                {
                    "language": "RU",
                    "text": "В будущем по мере роста системы может быть закодировано больше процессов.",
                    "updated": 1639406975132
                },
                {
                    "language": "ES",
                    "text": " Es posible que en el futuro se codifiquen más procesos a medida que el sistema crezca.",
                    "updated": 1641093393820
                },
                {
                    "language": "DE",
                    "text": "Wenn das System wächst, können in Zukunft weitere Prozesse kodiert werden.",
                    "updated": 1646079202618
                },
                {
                    "language": "TR",
                    "text": "Sistem büyüdükçe gelecekte daha fazla süreç kodlanabilir.",
                    "updated": 1652013961294
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Sensor Bot Configuration",
            "updated": 1609790137912,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Sensor Bot",
                    "updated": 1639406989637
                },
                {
                    "language": "ES",
                    "text": "Configuración del Sensor Bot",
                    "updated": 1641093412662
                },
                {
                    "language": "DE",
                    "text": "Sensor Bot Konfiguration",
                    "updated": 1646079210171
                },
                {
                    "language": "TR",
                    "text": "Sensör Botu Yapılandırması",
                    "updated": 1652013970077
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609790143486,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1639406996298
                },
                {
                    "language": "ES",
                    "text": "Propiedades",
                    "updated": 1641093423092
                },
                {
                    "language": "DE",
                    "text": "Eigenschaften",
                    "updated": 1646079217238
                },
                {
                    "language": "TR",
                    "text": "Özellikleri",
                    "updated": 1652013980030
                }
            ]
        },
        {
            "style": "List",
            "text": "codeName is the name of the bot as used within the code of the system. This will also be used as the folder name at the Data-Storage folder structure.",
            "updated": 1621692071539,
            "translations": [
                {
                    "language": "RU",
                    "text": "codeName - это имя бота, используемое в коде системы. Это также будет использоваться как имя папки в структуре папок хранилища данных.",
                    "updated": 1639407072621
                },
                {
                    "language": "ES",
                    "text": "codeName es el nombre del bot tal y como se utiliza dentro del código del sistema. Este también se utilizará como nombre de la carpeta dentro de la estructura de la carpeta Data-Storage.",
                    "updated": 1641093428757
                },
                {
                    "language": "DE",
                    "text": "codeName ist der Name des Bots, wie er im Code des Systems verwendet wird. Dieser Name wird auch als Ordnername in der Data-Storage-Ordnerstruktur verwendet.",
                    "updated": 1646079245297
                },
                {
                    "language": "TR",
                    "text": "codeName sistem kodunda kullanılan botun adıdır. Bu, Data-Storage klasör yapısında klasör adı olarak da kullanılacaktır.",
                    "updated": 1652013993681
                }
            ]
        }
    ]
}