{
    "type": "Product Definition",
    "definition": {
        "text": "The product definition node holds all definitions that make up a product, including how the product is calculated and the datasets the product is comprised of.",
        "translations": [
            {
                "language": "RU",
                "text": "Узел Product Definition содержит все определения, составляющие продукт, в том числе то, как продукт рассчитывается, и наборы данных, из которых он состоит.",
                "updated": 1639657776169
            },
            {
                "language": "TR",
                "text": "Ürün tanımı düğümü, ürünün nasıl hesaplandığı ve ürünün hangi veri kümelerinden oluştuğu da dahil olmak üzere bir ürünü oluşturan tüm tanımları tutar.",
                "updated": 1674758190642
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "A bot may feature multiple products, thus, there may be multiple product definitions. Three main aspects need to be defined in terms of products: the characteristics of the dataset, the composition of each record, and the way records are calculated.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Бот может содержать несколько продуктов, поэтому может быть несколько определений продуктов. С точки зрения продуктов необходимо определить три основных аспекта: характеристики набора данных, состав каждой записи и способ вычисления записей.",
                    "updated": 1639657804191
                },
                {
                    "language": "TR",
                    "text": "Bir bot birden fazla ürün içerebilir, dolayısıyla birden fazla ürün tanımı olabilir. Ürünler açısından üç ana hususun tanımlanması gerekir: veri kümesinin özellikleri, her bir kaydın bileşimi ve kayıtların hesaplanma şekli.",
                    "updated": 1674758233311
                }
            ]
        },
        {
            "style": "Note",
            "text": "A product definition usually references a plotter module, which provides a graphic representation of the underlying dataset",
            "translations": [
                {
                    "language": "RU",
                    "text": "Определение продукта обычно ссылается на модуль плоттера, который обеспечивает графическое представление базового набора данных.",
                    "updated": 1639657830265
                },
                {
                    "language": "TR",
                    "text": " Bir ürün tanımı genellikle altta yatan veri kümesinin grafik temsilini sağlayan bir çizici modülüne atıfta bulunur",
                    "updated": 1674758263201
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Product Definition Configuration",
            "updated": 1609788267834,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Product Definition",
                    "updated": 1639657845846
                },
                {
                    "language": "TR",
                    "text": "Ürün Tanımı Yapılandırması (Product Definition Configuration)",
                    "updated": 1674758313063
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609788279998,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1639657854144
                },
                {
                    "language": "TR",
                    "text": "Özellikler",
                    "updated": 1674758332946
                }
            ]
        },
        {
            "style": "List",
            "text": "codeName is the name of the product as it is used within the bot's code.",
            "translations": [
                {
                    "language": "RU",
                    "text": "codeName - это название продукта, используемое в коде бота.",
                    "updated": 1639657865418
                },
                {
                    "language": "TR",
                    "text": "codeName botun kodu içinde kullanıldığı şekliyle ürünün adıdır.",
                    "updated": 1674758360994
                }
            ]
        },
        {
            "style": "List",
            "text": "pluralVariableName is the plural form of the variable.",
            "translations": [
                {
                    "language": "RU",
                    "text": "pluralVariableName - это форма переменной во множественном числе.",
                    "updated": 1639657905705
                },
                {
                    "language": "TR",
                    "text": "pluralVariableName değişkenin çoğul halidir.",
                    "updated": 1674758396045
                }
            ]
        }
    ]
}