{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 3,
    "type": "Tutorial Step - Load a Fresh Workspace!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "workspace"
        },
        "text": "But before we go any further, let's make sure we are starting with a fresh workspace!",
        "translations": [
            {
                "language": "DE",
                "text": "Aber bevor wir weitergehen, lasst uns sicherstellen, dass wir mit einem frischen Workspace beginnen!\n",
                "updated": 1622984994787,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Но прежде чем мы продолжим, давайте убедимся, что мы начинаем со свежего рабочего пространства!",
                "updated": 1640544060649
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Note",
            "text": "Workspaces marked as Plugin Workspaces ship with the software. The rest are yours. When you open a plugin workspace a copy of it is made for you. Plugins allways remain unchanged.",
            "updated": 1622540310563,
            "translations": [
                {
                    "language": "DE",
                    "text": "Workspaces, die als Plugin Workspaces gekennzeichnet sind, werden mit der Software ausgeliefert. Die übrigen gehören dir. Wenn du einen Plugin Workspace öffnest, wird eine Kopie davon für dich erstellt. Plugins bleiben immer unverändert.",
                    "updated": 1622985089032,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Рабочие пространства, отмеченные как Plugin Workspaces, поставляются вместе с программным обеспечением. Остальные являются вашими. Когда вы открываете рабочее пространство плагина, его копия создается для вас. Плагины всегда остаются неизменными.",
                    "updated": 1640544101842
                }
            ]
        },
        {
            "style": "Important",
            "text": "This tutorial requires starting with a fresh Plugin Weak-hands Buster v2 workspace. So, unless you loaded the plugin workspace right before starting, please select it from the workspace panel on the left and come back to me after the workspace loads — just click Resume on my menu!",
            "updated": 1621627499351,
            "translations": [
                {
                    "language": "DE",
                    "text": "Dieses Tutorial erfordert den Start mit einem frischen Plugin Weak-hands Buster v2 Workspace. Wenn du also das Plugin Workspace nicht direkt vor dem Start geladen hast, wähle es bitte aus dem Workspace-Panel auf der linken Seite aus und komm zurück zu mir, nachdem der Workspace geladen wurde - klicke einfach auf Resume in meinem Menü!",
                    "updated": 1622985298857,
                    "style": "Important"
                },
                {
                    "language": "RU",
                    "text": "Этот учебник необходимо начинать со свежего рабочего пространства Plugin Weak-hands Buster v2. Поэтому, если вы не загрузили рабочее пространство плагина прямо перед началом, пожалуйста, выберите его на панели рабочего пространства слева и вернитесь ко мне после загрузки рабочего пространства - просто нажмите Resume в моем меню!",
                    "updated": 1640544149845
                }
            ]
        }
    ]
}