{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 30,
    "type": "Tutorial Step - Trading System Highlights!",
    "definition": {
        "icon": {
            "name": "Bullet/bullet-info",
            "project": "Foundations"
        },
        "text": "Whenever something relevant happens with any given node in the trading system hierarchy, the node is highlighted!",
        "translations": [
            {
                "language": "DE",
                "text": "Wann immer etwas Relevantes mit einem bestimmten Knoten in der Trading System Hierarchie passiert, wird der Knoten hervorgehoben!",
                "updated": 1639145593359
            },
            {
                "language": "RU",
                "text": "Когда с каким-либо узлом в иерархии торговой системы происходит что-то важное, этот узел выделяется!",
                "updated": 1640631131534
            },
            {
                "language": "TR",
                "text": "Ticaret sistemi hiyerarşisindeki herhangi bir düğümle ilgili bir şey olduğunda, düğüm vurgulanır!",
                "updated": 1642515310225
            },
            {
                "language": "ID",
                "text": "Setiap kali sesuatu yang relevan terjadi dengan node tertentu dalam hierarki trading system, node tersebut disorot!",
                "updated": 1673967556130
            },
            {
                "language": "ES",
                "text": "Cada vez que ocurre algo relevante con cualquier nodo de la jerarquía del sistema de trading, ¡el nodo aparece resaltado!",
                "updated": 1675468572902
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Turn the Trading System Highlights layer on, slide your mouse over the chart left of the position, and check these conditions and situations! Now place the mouse pointer over the candle where the strategy is triggered... (08 Mar 2020 at 01 hs)...",
            "translations": [
                {
                    "language": "DE",
                    "text": "Schalten Sie die Ebene \"Trading System Highlights\" ein, fahren Sie mit der Maus über den Chart links von der Position, und überprüfen Sie diese Bedingungen und Situationen! Bewegen Sie nun den Mauszeiger über die Kerze, bei der die Strategie ausgelöst wird... (08. März 2020 um 01 Uhr)...",
                    "updated": 1639145610016
                },
                {
                    "language": "RU",
                    "text": "Включите слой Trading System Highlights, проведите мышью по графику слева от позиции и проверьте эти условия и ситуации! Теперь наведите указатель мыши на свечу, на которой сработала стратегия... (08 марта 2020 года в 01 час)...",
                    "updated": 1640631185737
                },
                {
                    "language": "TR",
                    "text": "Trading System Highlights katmanını açın, farenizi pozisyonun solundaki grafiğin üzerine getirin ve bu koşulları ve durumları kontrol edin! Şimdi fare imlecini stratejinin tetiklendiği mumun üzerine getirin... (08 Mart 2020, 01 saatlik zaman dilimi)...",
                    "updated": 1642515357459
                },
                {
                    "language": "ID",
                    "text": "Aktifkan layer Trading System Highlights, geser mouse-mu ke kiri chart pada position, dan periksa kondisi dan situasi ini! Sekarang tempatkan penunjuk mouse di atas candle tempat strategi dipicu... (08 Mar 2020 di 01 hs)...",
                    "updated": 1673967561962
                },
                {
                    "language": "ES",
                    "text": "Activa la capa Trading System Highlights, desliza el ratón sobre el gráfico a la izquierda de la posición, ¡y comprueba estas condiciones y situaciones! Ahora coloca el puntero del ratón sobre la vela donde se activa la estrategia... (08 Mar 2020 a las 01 hs)...",
                    "updated": 1675468616974
                }
            ]
        },
        {
            "style": "Note",
            "text": "Conditions are highlighted when they validate true; situations, when all conditions validate true; stages and phases, when they become active, and so on!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Bedingungen werden hervorgehoben, wenn sie zutreffen; Situationen, wenn alle Bedingungen zutreffen; Phasen, wenn sie aktiv werden, usw.!",
                    "updated": 1639145618354
                },
                {
                    "language": "RU",
                    "text": "Условия выделяются, когда они подтверждаются; ситуации, когда все условия подтверждаются; этапы и фазы, когда они становятся активными, и так далее!",
                    "updated": 1640631220106
                },
                {
                    "language": "TR",
                    "text": "Koşullar, doğru olduklarında vurgulanır; tüm koşulların doğru olduğu durumlar; aşamalar ve aşamaların aktif olduğu durumlar vb.!",
                    "updated": 1642515928431
                },
                {
                    "language": "ID",
                    "text": "Conditions disorot saat divalidasi benar; situasi, ketika semua kondisi memvalidasi benar; stage dan phase, ketika mereka menjadi aktif, dan seterusnya!",
                    "updated": 1673967569828
                },
                {
                    "language": "ES",
                    "text": "Las condiciones se resaltan cuando se validan como verdaderas; las situaciones, cuando todas las condiciones se validan como verdaderas; las etapas y fases, cuando se activan, ¡y así sucesivamente!",
                    "updated": 1675468629584
                }
            ]
        }
    ]
}