{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 32,
    "type": "Tutorial Step - Quick Refresher on Stages!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "trigger-stage"
        },
        "text": "Notice that not all nodes are evaluated all the time! Only those in the active stage are!",
        "translations": [
            {
                "language": "DE",
                "text": "Beachten Sie, dass nicht alle Knoten die ganze Zeit ausgewertet werden! Nur diejenigen, die sich in der aktiven Phase befinden, werden ausgewertet!",
                "updated": 1639145699828
            },
            {
                "language": "RU",
                "text": "Обратите внимание, что не все узлы вычисляются постоянно! Только те, которые находятся в активной стадии!",
                "updated": 1640631384638
            },
            {
                "language": "TR",
                "text": "Tüm düğümlerin her zaman değerlendirilmediğine dikkat edin! Sadece aktif aşamada olanlar değerlendirilir!",
                "updated": 1642517648584
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This is a quick refresher on strategy stages! If you haven't read the docs on trading systems and strategies, then find the time and do it!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Dies ist eine kurze Auffrischung der Strategiephasen! Wenn Sie die Dokumente über Handelssysteme und -strategien noch nicht gelesen haben, sollten Sie sich die Zeit nehmen und dies nachholen!",
                    "updated": 1639145715393
                },
                {
                    "language": "RU",
                    "text": "Это краткий обзор этапов стратегии! Если вы еще не читали документацию по торговым системам и стратегиям, то найдите время и сделайте это!",
                    "updated": 1640631404560
                },
                {
                    "language": "TR",
                    "text": "Bu, strateji aşamaları hakkında hızlı bir bilgi tazeleme! Ticaret sistemleri ve stratejileriyle ilgili belgeleri okumadıysanız, zaman ayırın ve ilgili belgeleri okuyun!",
                    "updated": 1642517704659
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Notice how these conditions are not highlighted for the candles within the position.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Beachten Sie, dass diese Bedingungen für die Kerzen innerhalb der Position nicht hervorgehoben sind.",
                    "updated": 1639145727621
                },
                {
                    "language": "RU",
                    "text": "Обратите внимание, что эти условия не выделены для свечей внутри позиции.",
                    "updated": 1640631424384
                },
                {
                    "language": "TR",
                    "text": "Bu koşulların pozisyon içindeki mumlar için nasıl vurgulanmadığına dikkat edin.",
                    "updated": 1642517746196
                }
            ]
        },
        {
            "style": "Text",
            "text": "This is because you are looking at the Trigger Stage definitions. These definitions are evaluated until a Strategy is triggered. Once triggered, the Open Stage kicks in, and so on!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Das liegt daran, dass Sie die Trigger Stage-Definitionen betrachten. Diese Definitionen werden ausgewertet, bis eine Strategie ausgelöst wird. Sobald diese ausgelöst wurde, beginnt die Open Stage, und so weiter!",
                    "updated": 1639145749193
                },
                {
                    "language": "RU",
                    "text": "Это происходит потому, что вы смотрите на определения этапа Trigger Stage. Эти определения вычисляются до тех пор, пока не сработает стратегия. После срабатывания начинается этап Open Stage, и так далее!",
                    "updated": 1640631499087
                },
                {
                    "language": "TR",
                    "text": "Bunun nedeni, Trigger Stage tanımlarına bakıyor olmanızdır. Bu tanımlar, bir Strateji tetiklenene kadar değerlendirilir. Bir kez tetiklendiğinde,Open Stage devreye girer ve bu böyle devam eder!",
                    "updated": 1642518289084
                }
            ]
        }
    ]
}