{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 6,
    "type": "Tutorial Step - Let's Mine Some Data.....!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "run"
        },
        "text": "Now that you understand the implications of running this data mining operation, let's get on with it!",
        "translations": [
            {
                "language": "DE",
                "text": "Jetzt, da du die Auswirkungen der Ausführung dieser Data-Mining-Operation verstanden hast, lass uns loslegen!",
                "updated": 1623012038673,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Теперь, когда вы понимаете значения операции по добыче данных, давайте приступим к делу!",
                "updated": 1640545023576
            },
            {
                "language": "TR",
                "text": "Artık veri madenciliği işlemini yürütmenin sonuçlarını anladığınıza göre, başlayalım!",
                "updated": 1641752883733
            },
            {
                "language": "ID",
                "text": "Sekarang kamu memahami implikasi dari menjalankan operasi data mining ini, mari kita lanjutkan!",
                "updated": 1673830752765
            },
            {
                "language": "ES",
                "text": "Ahora que entiendes las implicaciones de ejecutar esta operación de extracción de datos, ¡vamos a ello!",
                "updated": 1675463159819
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Select \"Run All Project Data Tasks\" on the Data Tasks node menu!",
            "updated": 1622540506392,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wähle \"Run All Project Data Tasks\" im \"Data Tasks\" Knotenmenü!",
                    "updated": 1623012059116,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Выберите пункт \"Run All Project Data Tasks\" в меню узла Data Tasks!",
                    "updated": 1640545061717
                },
                {
                    "language": "TR",
                    "text": "Data Tasks düğümünün menüsünde \"Tüm Proje Veri Görevlerini Çalıştır\"ı (Run All Project Data Tasks) seçin!",
                    "updated": 1641753045485
                },
                {
                    "language": "ID",
                    "text": "Pilih \"Run All Project Data Tasks\" pada node Data Tasks di menu!",
                    "updated": 1673830758887
                },
                {
                    "language": "ES",
                    "text": "¡Selecciona \" Run All Project Data Tasks\" en el menú del nodo de 'Data Tasks'!",
                    "updated": 1675463248800
                }
            ]
        },
        {
            "style": "Note",
            "text": "If you are doing this tutorial after doing the Getting Started tutorials, chances are you may already have part of the data required, which may make things faster!",
            "updated": 1622540530483,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn du dieses Tutorial nach dem Tutorial \"Erste Schritte\" durchführst, besteht die Möglichkeit, dass du bereits einen Teil der benötigten Daten hast, was die Sache beschleunigen kann!",
                    "updated": 1623012091678,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Если вы проходите этот урок после изучения учебника Getting Started, то, скорее всего, у вас уже есть часть необходимых данных, что может ускорить процесс!",
                    "updated": 1640545123676
                },
                {
                    "language": "TR",
                    "text": "Bu öğreticiyi Başlerken öğreticilerini (Getting Started Tutorial) yaptıktan sonra yapıyorsanız, gereken bilgilerin bir kısmına zaten sahip olabilirsiniz ve bu da işleri daha hızlı hale getirebilir!",
                    "updated": 1641753477214
                },
                {
                    "language": "ID",
                    "text": "Jika kamu melakukan tutorial ini setelah melakukan tutorial Getting Started, kemungkinan besar kamu sudah memiliki sebagian data yang diperlukan, yang dapat mempercepat ini!",
                    "updated": 1673830767457
                },
                {
                    "language": "ES",
                    "text": "Si estás haciendo este tutorial después de hacer el \"Getting Started Tutorial\", lo más probable es que ya tengas parte de los datos necesarios, ¡lo que puede hacer las cosas más rápidas!",
                    "updated": 1675463305069
                }
            ]
        }
    ]
}