{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 17,
    "type": "Tutorial Step - What About the Position?",
    "definition": {
        "icon": {
            "name": "Position/position",
            "project": "Foundations"
        },
        "text": "As you very clearly pointed out, the episode counters showed a strategy, but also a position... what about that?",
        "translations": [
            {
                "language": "DE",
                "text": "Wie du festgestellt hast, zeigten die Episodenzähler eine Strategie, aber auch eine Position... was ist damit?",
                "updated": 1623014668190,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Как вы очень четко отметили, счетчики эпизодов показали стратегию, но также и позицию... как насчет этого?",
                "updated": 1640547167033
            },
            {
                "language": "TR",
                "text": "Söylediğiniz gibi, bölüm sayaçları bir strateji, ama aynı zamanda bir konum da gösteriyordu... Buna ne dersin?",
                "updated": 1642363367303
            },
            {
                "language": "ID",
                "text": "Seperti yang sudah tunjukkan dengan sangat jelas, episode counters menunjukkan strategi, tetapi juga position... bagaimana dengan itu?",
                "updated": 1673881909321
            },
            {
                "language": "ES",
                "text": "Como muy bien has señalado, los contadores de episodios mostraban una estrategia, pero también una posición... ¿qué pasa con eso?",
                "updated": 1675466493441
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Scroll down the Simulation Objects layer manager and turn on the \"Position Base Asset\" layer!",
            "updated": 1622541528562,
            "translations": [
                {
                    "language": "DE",
                    "text": "Scrolle im Simulationsobjekte Layer-Manager nach unten und schalte den Layer \"Position Base Asset\" ein!",
                    "updated": 1623014685669,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Прокрутите вниз менеджер слоев объектов Simulation Objects и включите слой \"Position Base Asset\"!",
                    "updated": 1640628234334
                },
                {
                    "language": "TR",
                    "text": "Simulation Objects katman yöneticisini aşağı kaydırın ve \"Position Base Asset\" katmanını açın!",
                    "updated": 1642169994989
                },
                {
                    "language": "ID",
                    "text": "Gulir ke bawah layer manager dari Simulation Objects dan aktifkan layer \"Position Base Asset\"!",
                    "updated": 1673881915873
                },
                {
                    "language": "ES",
                    "text": "Desplázate hacia abajo en el gestor de capas Simulation Objects y activa la capa Position Base Asset.",
                    "updated": 1675466649455
                }
            ]
        },
        {
            "style": "Text",
            "text": "Nice! A green triangle means that the position was a hit! It would be red otherwise!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Sehr schön! Ein grünes Dreieck bedeutet, dass die Position ein Treffer war! Sonst wäre es rot!",
                    "updated": 1623014705334,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Отлично! Зеленый треугольник означает, что позиция была удачной! В противном случае он был бы красным!",
                    "updated": 1640547198546
                },
                {
                    "language": "TR",
                    "text": "Güzel! Yeşil üçgen, pozisyonun isabetli olduğu anlamına gelir! Aksi takdirde kırmızı olurdu!",
                    "updated": 1642170008399
                },
                {
                    "language": "ID",
                    "text": "Bagus! Segitiga hijau berarti posisi tersebut sudah hit! Itu akan menjadi merah jika tidak!",
                    "updated": 1673881923594
                },
                {
                    "language": "ES",
                    "text": "¡Genial! ¡Un triángulo verde significa que la posición ha sido un acierto! Si no, sería rojo.",
                    "updated": 1675466569013
                }
            ]
        },
        {
            "style": "Note",
            "text": "The horizontal side of the triangle marks the Entry Target Rate. The vertical side marks the datetime the position was closed. The vertex away from the horizontal side is the Exit Target Rate.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die horizontale Seite des Dreiecks markiert den Einstiegszielkurs. Die vertikale Seite markiert das Datum, an dem die Position geschlossen wurde. Der Eckpunkt, der von der horizontalen Seite entfernt ist, ist die \"Exit Target Rate\".",
                    "updated": 1623014744537,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Горизонтальная сторона треугольника обозначает целевую ставку входа. Вертикальная сторона обозначает дату, когда позиция была закрыта. Вершина, отстоящая от горизонтальной стороны, является целевой ставкой на выход.",
                    "updated": 1640547223693
                },
                {
                    "language": "TR",
                    "text": "Üçgenin yatay tarafı Giriş Hedef Oranını (Entry Target Rate) gösterir. Dikey taraf, pozisyonun kapatıldığı tarihi gösterir. Yatay taraftan uzaktaki tepe noktası Çıkış Hedef Oranıdır (Exit Target Rate).",
                    "updated": 1642170095934
                },
                {
                    "language": "ID",
                    "text": "Sisi horizontal segitiga menandai Entry Target Rate. Sisi vertikal menandai tanggal waktu posisi ditutup. Puncak jauh dari sisi horizontal adalah Exit Target Rate.",
                    "updated": 1673881937362
                },
                {
                    "language": "ES",
                    "text": "El lado horizontal del triángulo marca la Entry Target Rate. El lado vertical marca la fecha en que se cerró la posición. El vértice alejado del lado horizontal es la Exit Target Rate.",
                    "updated": 1675466639746
                }
            ]
        }
    ]
}