{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 4,
    "type": "Tutorial Step - Freeze! Don't Move!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "stop-loss"
        },
        "text": "I've got something to tell you before we move on, but I'm struggling to find the right words... I just wouldn't want to come across as a control freak!",
        "translations": [
            {
                "language": "DE",
                "text": "Ich habe dir noch etwas zu sagen, bevor wir weitermachen, aber ich finde nicht die richtigen Worte... Ich möchte einfach nicht wie ein Kontrollfreak rüberkommen!",
                "updated": 1622985341980,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Я хочу кое-что сказать тебе, прежде чем мы продолжим, но я с трудом подбираю слова... Я просто не хочу показаться помешанным на контроле!",
                "updated": 1640544202541
            },
            {
                "language": "TR",
                "text": "Devam etmeden önce sana söylemem gereken bir şey var, ama doğru kelimeleri bulmakta zorlanıyorum... Bir kontrol manyağı gibi görünmek istemem!",
                "updated": 1641718268809
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "It's not like you may break something or anything... nothing to fear at all... it's just that... I rely on the fresh state of the workspace to predict what you will see when I take you places. I may comment on what you will experience along the journey, and use my predictions to make the tour juicier and interesting! So...",
            "translations": [
                {
                    "language": "DE",
                    "text": "Es ist nicht so, dass du etwas kaputt machen könntest oder so... überhaupt nichts zu befürchten... es ist nur so... Ich verlasse mich auf den frischen Zustand des Workspaces, um vorherzusagen, was du sehen wirst, wenn ich dich an Orte bringe. Ich kommentiere vielleicht, was du auf der Reise erleben wirst, und nutze meine Vorhersagen, um die Tour saftiger und interessanter zu machen! Also …",
                    "updated": 1622985357489,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Не то чтобы вы могли что-то сломать или что-то в этом роде... бояться нечего... просто... Я полагаюсь на свежее состояние рабочего пространства, чтобы предсказать, что вы увидите, когда я поведу вас куда-то. Я могу комментировать то, что вы испытаете во время путешествия, и использовать свои предсказания, чтобы сделать экскурсию более сочной и интересной! Итак...",
                    "updated": 1640544313672
                },
                {
                    "language": "TR",
                    "text": "Burası herhangi birşeyi bozabileceğiniz bi alan değil. Bu yüzden korkacak bir şey yok...  Sizi bir yere götürdüğümde ne göreceğinizi tahmin etmek için çalışma alanının yeni durumuna güveniyorum. Yolculuk boyunca deneyimleyeceğiniz şeyler hakkında yorum yapabilir ve tahminlerimi turu daha lezzetli ve ilginç kılmak için kullanabilirim! Böyle...",
                    "updated": 1641718400300
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Don't fool around too much unless I tell you to! I mean, you may look around, but don't make a mess! Fine! Do what you want! If you ever feel I lost you, just start over with a fresh workspace!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Na schön! Mach, was du willst! Wenn du jemals das Gefühl hast, dass ich dich abgehängt habe, fang einfach mit einem neuen Workspace an!",
                    "updated": 1622985372686,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Не шалите слишком много, пока я вам не скажу! То есть, ты можешь осмотреться, но не устраивай беспорядок! Ладно! Делай, что хочешь! Если вдруг почувствуешь, что я тебя потерял, просто начни заново, с чистого рабочего пространства!",
                    "updated": 1640544532040
                },
                {
                    "language": "TR",
                    "text": "Ben söylemedikçe çok fazla oyalanma! Demek istediğim, etrafına bakabilirsin ama ortalığı dağıtma! İstediğini yap! Eğer seni kaybettiğimi hissedersen, yeni bir çalışma alanıyla yeniden başla!",
                    "updated": 1641718475850
                }
            ]
        }
    ]
}