{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 29,
    "type": "Tutorial Step - Trading System Errors!",
    "definition": {
        "icon": {
            "name": "Bullet/bullet-error",
            "project": "Foundations"
        },
        "text": "When writing conditions and formulas, you may make mistakes. Remember conditions must evaluate to true or false and formulas to a number?",
        "translations": [
            {
                "language": "DE",
                "text": "Beim Schreiben von Bedingungen und Formeln können Ihnen Fehler unterlaufen. Erinnern Sie sich daran, dass Bedingungen als wahr oder falsch und Formeln als Zahl ausgewertet werden müssen?",
                "updated": 1639145384055
            },
            {
                "language": "RU",
                "text": "При написании условий и формул вы можете допустить ошибки. Помните, что условия должны оцениваться как true или false, а формулы - как число?",
                "updated": 1640631034056
            },
            {
                "language": "TR",
                "text": "Özet: Koşullar ve formüller yazarken hata yapabilirsiniz. Koşulların doğru veya yanlış olarak değerlendirilmesi gerektiğini ve formüllerin bir sayı olarak değerlendirilmesi gerektiğini hatırlıyor musunuz?",
                "updated": 1642514186871
            },
            {
                "language": "ID",
                "text": "Saat menulis condition dan formulas, Kamu mungkin saja membuat kesalahan. Ingat condition harus dievaluasi menjadi true atau false dan formulas menjadi number?",
                "updated": 1673967036886
            },
            {
                "language": "ES",
                "text": "Al escribir condiciones y fórmulas, puedes cometer errores. ¿Recuerdas que las condiciones deben evaluarse como verdadero o falso y las fórmulas como un número?",
                "updated": 1675468385300
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Well, if they don't, you will get an error! Turning on this layer when you're going back and forth crafting and testing a strategy is a must!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn das nicht der Fall ist, erhalten Sie eine Fehlermeldung! Es ist ein Muss, diese Ebene einzuschalten, wenn Sie eine Strategie entwickeln und testen!",
                    "updated": 1639145425324
                },
                {
                    "language": "RU",
                    "text": "Если это не так, вы получите ошибку! Включение этого слоя при создании и тестировании стратегии просто необходимо!",
                    "updated": 1640631063987
                },
                {
                    "language": "TR",
                    "text": "Peki, yapmazlarsa, <bir hata alırsınız! Bir strateji oluşturmak ve test etmek için ileri geri giderken bu katmanı açmak bir zorunluluktur!",
                    "updated": 1642514252905
                },
                {
                    "language": "ID",
                    "text": "Nah, jika tidak, Kamu akan mendapatkan error! Mengaktifkan layer ini saat kamu bolak-balik menyusun dan menguji strategi adalah suatu keharusan!",
                    "updated": 1673967043115
                },
                {
                    "language": "ES",
                    "text": "Si no es así, se producirá un error. ¡Activar esta capa cuando estás yendo y viniendo en la creación y prueba de una estrategia es imprescindible!",
                    "updated": 1675468420018
                }
            ]
        },
        {
            "style": "Callout",
            "text": "There are no errors in this trading system, but I just planted a fake one so that you may see how they are reported! Look at the Formula on the left!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Es gibt keine Fehler in diesem Trading System, aber ich habe gerade einen gefälschten eingefügt, damit Sie sehen können, wie sie gemeldet werden! Sehen Sie sich die Formel auf der linken Seite an!",
                    "updated": 1639145438062
                },
                {
                    "language": "RU",
                    "text": "В этой торговой системе нет ошибок, но я просто подбросил фальшивую, чтобы вы могли увидеть, как они появляются! Посмотрите на формулу слева!",
                    "updated": 1640631088375
                },
                {
                    "language": "TR",
                    "text": "Bu ticaret sisteminde hata yok, ancak nasıl rapor edildiğini görebilmeniz için sadece sahte bir tane yerleştirdim! Soldaki Formüle (Formula) bakın!",
                    "updated": 1642514406373
                },
                {
                    "language": "ID",
                    "text": "Tidak ada kesalahan dalam trading system ini, tetapi aku baru saja menanam yang fake sehingga kamu dapat melihat bagaimana laporannya! Lihat Formula di sebelah kiri!",
                    "updated": 1673967048833
                },
                {
                    "language": "ES",
                    "text": "¡No hay errores en este sistema de trading, pero acabo de plantar uno falso para que puedas ver cómo se reportan! ¡Mira la fórmula de la izquierda!",
                    "updated": 1675468451408
                }
            ]
        },
        {
            "style": "Text",
            "text": "Now, what if the section of the hierarchy was collapsed? Would you still be able to see error messages?<br/>Let's run a quick test! Collapse the Initial Targets node!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Was wäre nun, wenn der Abschnitt der Hierarchie eingeklappt wäre? Würden Sie dann immer noch Fehlermeldungen sehen können? Lassen Sie uns einen kurzen Test durchführen! Klappen Sie den Knoten Initial Targets zu!",
                    "updated": 1641763129918
                },
                {
                    "language": "RU",
                    "text": "Теперь, что если секция иерархии была свернута? Сможете ли вы по-прежнему видеть сообщения об ошибках? Давайте проведем быстрый тест! Сверните узел Initial Targets!",
                    "updated": 1640631111246
                },
                {
                    "language": "TR",
                    "text": "Şimdi, hiyerarşinin bölümü çökerse ne olur? Hala hata mesajlarını görebilecek misiniz? Hızlı bir test yapalım! İlk Hedefler (Initial Targets) düğümünü daraltın!",
                    "updated": 1642514362129
                },
                {
                    "language": "ID",
                    "text": "Sekarang, bagaimana jika bagian hierarki itu collapsed? Apakah kamu masih dapat melihat pesan kesalahan?Mari kita jalankan quick test! Collapse node Initial Targets!",
                    "updated": 1673967062910
                },
                {
                    "language": "ES",
                    "text": "Ahora, ¿qué pasa si la sección de la jerarquía se colapsó? ¿Todavía podrías ver los mensajes de error? Hagamos una prueba rápida. Colapsa el nodo Initial Targets.",
                    "updated": 1675468537734
                }
            ]
        }
    ]
}