{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 21,
    "type": "Tutorial Step - Phased Management",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "phase"
        },
        "text": "The Manage Stage enables the management of your stop loss and take profit targets in phases. Let's see how that looks in simulations...",
        "translations": [
            {
                "language": "DE",
                "text": "The Manage Stage ermöglicht die Verwaltung Ihrer Stop-Loss- und Take-Profit-Ziele in Phasen. Schauen wir uns an, wie das in Simulationen aussieht...",
                "updated": 1639143624751
            },
            {
                "language": "RU",
                "text": "Узел Manage Stage позволяет поэтапно управлять целями стоп-лосс и тейк-профит. Давайте посмотрим, как это выглядит в симуляторах...",
                "updated": 1640627689862
            },
            {
                "language": "TR",
                "text": "Yönetim Aşaması (The Manage Stage), aşamalı olarak zararı durdurma ve kar alma hedeflerinizin yönetimini sağlar. Simülasyonlarda nasıl göründüğünü görelim...",
                "updated": 1642404467338
            },
            {
                "language": "ID",
                "text": "Manage Stage memungkinkan pengelolaan target stop loss dan take profitmu secara bertahap. Mari kita lihat bagaimana tampilannya dalam simulasi...",
                "updated": 1673950248747
            },
            {
                "language": "ES",
                "text": "El Manage Stage permite la gestión de tus objetivos de Stop Loss y Take Profit por fases. Veamos cómo se ve en las simulaciones...",
                "updated": 1675467174643
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Turn on the \"Stop Loss\" and the \"Take Profit\" layers in the Simulation Objects layer manager!",
            "updated": 1622541793215,
            "translations": [
                {
                    "language": "DE",
                    "text": "Schalten Sie die Ebenen \"Stop Loss\" und \"Take Profit\" im Ebenenmanager der Simulationsobjekte ein!",
                    "updated": 1639144058572
                },
                {
                    "language": "RU",
                    "text": "Включите слои \"Stop Loss\" и \"Take Profit\" в менеджере слоев объектов симуляции (Simulation Objects)!",
                    "updated": 1640628140797
                },
                {
                    "language": "TR",
                    "text": "Simülasyon Nesneleri katman yöneticisinde (Simulation Objects Layer Manager) \"Zararı Durdur (Stop Loss)\" ve \"Kar Al (Take Profit)\" katmanlarını açın!",
                    "updated": 1642404764469
                },
                {
                    "language": "ID",
                    "text": "Aktifkan layer \"Stop Loss\" dan \"Take Profit\" di manajer layer Simulation Objects!",
                    "updated": 1673950256897
                },
                {
                    "language": "ES",
                    "text": "Active las capas \"Stop Loss\" y \"Take Profit\" en el gestor de capas de Simulation Objects.",
                    "updated": 1675467191613
                }
            ]
        },
        {
            "style": "Text",
            "text": "It's probably self-explanatory, right? The Phase icon marks the switching of phases, thus, of the Formula used to determine each target.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Das ist wahrscheinlich selbsterklärend, oder? Das Phase Symbol markiert den Wechsel der Phasen, also der Formel ( Formula ), die zur Bestimmung der einzelnen Ziele verwendet wird.",
                    "updated": 1639144223019
                },
                {
                    "language": "RU",
                    "text": "Это, вероятно, не требует пояснений, верно? Значок Phase обозначает переключение фаз, таким же образом, Formula, используемая для определения формулы расчета каждой цели.",
                    "updated": 1640628516781
                },
                {
                    "language": "TR",
                    "text": "Muhtemelen ne olduğunu anlamışsınızdır, değil mi? Faz simgesi, her bir hedefi belirlemek için kullanılan Formülün, dolayısıyla, fazların geçişini gösterir.",
                    "updated": 1642404816923
                },
                {
                    "language": "ID",
                    "text": "Mungkin sudah cukup jelas, bukan? Ikon Phase menandai pergantian fase, dengan demikian, Formula yang digunakan untuk menentukan setiap target.",
                    "updated": 1673950264358
                },
                {
                    "language": "ES",
                    "text": "Probablemente se explica por sí mismo, ¿verdad? El icono de Fase (Phase) marca el cambio de fases, por lo tanto, de la Fórmula utilizada para determinar cada objetivo.",
                    "updated": 1675467228214
                }
            ]
        },
        {
            "style": "Success",
            "text": "This is a fantastic feature when designing strategies, as you can literally see what the formula does, and how phases change!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Dies ist eine fantastische Funktion bei der Entwicklung von Strategien, da Sie buchstäblich sehen können, was die Formel tut und wie sich die Phasen ändern!",
                    "updated": 1639144226306
                },
                {
                    "language": "RU",
                    "text": "Это фантастическая возможность при разработке стратегий, так как вы можете буквально видеть, что делает формула и как меняются фазы!",
                    "updated": 1640628433075
                },
                {
                    "language": "TR",
                    "text": "Bu, stratejileri tasarlarken harika bir özelliktir, çünkü formülün ne yaptığını ve aşamaların nasıl değiştiğini tam anlamıyla görebilirsiniz!",
                    "updated": 1642404833533
                },
                {
                    "language": "ID",
                    "text": "Ini adalah fitur yang luar biasa saat merancang strategi, karena kamu benar-benar dapat melihat apa yang dilakukan formula, dan bagaimana fasenya berubah!",
                    "updated": 1673950275126
                },
                {
                    "language": "ES",
                    "text": "Esta es una característica fantástica a la hora de diseñar estrategias, ya que puedes ver literalmente lo que hace la fórmula, ¡y cómo cambian las fases!",
                    "updated": 1675467252178
                }
            ]
        }
    ]
}