{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 35,
    "type": "Tutorial Step - Time To Go Out and Play!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "play"
        },
        "text": "That's all folks! We've covered it all! Now it's time to go out and play! Have fun!",
        "translations": [
            {
                "language": "DE",
                "text": "Das war's, Leute! Wir haben alles besprochen! Jetzt ist es an der Zeit, rauszugehen und zu spielen! Habt Spaß!",
                "updated": 1639146094367
            },
            {
                "language": "RU",
                "text": "Вот и все, друзья! Мы рассказали обо всем! Теперь пора выходить и поиграть! Развлекайтесь!",
                "updated": 1640631960463
            },
            {
                "language": "TR",
                "text": "Hepsi bu kadar millet! Hepsini öğrendik! Şimdi dışarı çıkıp oynama zamanı! İyi eğlenceler!",
                "updated": 1642518597160
            },
            {
                "language": "ID",
                "text": "Itulah keseluruhannya teman-teman! Kita telah membahas semuanya! Sekarang saatnya untuk keluar dan bermain! Selamat bersenang-senang!",
                "updated": 1674112043152
            },
            {
                "language": "ES",
                "text": "¡Eso es todo amigos! Lo hemos cubierto todo. Es hora de salir a jugar. Diviértete.",
                "updated": 1675468969976
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Take some time to explore these layers, paying special attention to those you feel will be of the most use.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Nehmen Sie sich etwas Zeit, um diese Ebenen zu erkunden, und achten Sie dabei besonders auf die Ebenen, die Ihnen am nützlichsten erscheinen.",
                    "updated": 1639146111430
                },
                {
                    "language": "RU",
                    "text": "Потратьте некоторое время на изучение этих слоев, уделяя особое внимание тем, которые, по вашему мнению, будут наиболее полезны.",
                    "updated": 1640631979135
                },
                {
                    "language": "TR",
                    "text": "Bu katmanları keşfetmek için biraz zaman ayırın, en çok işinize yarayacağını düşündüklerinize özellikle dikkat edin.",
                    "updated": 1642518610254
                },
                {
                    "language": "ID",
                    "text": "Luangkan waktu untuk menjelajahi layer ini, berikan perhatian khusus pada layer yang menurutmu paling berguna.",
                    "updated": 1674112050485
                },
                {
                    "language": "ES",
                    "text": "Tómate tu tiempo para explorar estas capas, prestando especial atención a las que consideres más útiles.",
                    "updated": 1675468986379
                }
            ]
        },
        {
            "style": "Callout",
            "text": "The Trading Bot Layers are a fundamental tool when designing, testing, and debugging strategies! You will learn more about them and put them to good use in the tutorials that teach you how to build Trading Systems, available in the Trading System Design Tutorials Native Workspace.",
            "updated": 1617185406035,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Trading Bot Ebenen sind ein grundlegendes Werkzeug beim Entwerfen, Testen und Debuggen von Strategien! In den Tutorials zum Aufbau von Trading Systemen, die Sie im Trading System Design Tutorials Native Workspace finden, erfahren Sie mehr über sie und können sie sinnvoll einsetzen.",
                    "updated": 1639146193374
                },
                {
                    "language": "RU",
                    "text": "Слои торгового бота - это фундаментальный инструмент при разработке, тестировании и отладке стратегий! Вы узнаете больше о них и сможете применить их на практике в учебниках, обучающих созданию торговых систем, доступных в рабочем пространстве Trading System Design Tutorials Native Workspace.",
                    "updated": 1640632103029
                },
                {
                    "language": "TR",
                    "text": "Alım Satım Bot Katmanları (Trading Bot Layers), stratejiler tasarlarken, test ederken ve hata ayıklarken temel bir araçtır! \" Trading System Design Tutorials Native Workspace \" eklentisinde bulunan Ticaret Sistemlerinin nasıl kurulacağını öğreten eğitimlerde bunlar hakkında daha fazla bilgi edinecek ve bunları iyi bir şekilde kullanacaksınız.",
                    "updated": 1642518835072
                },
                {
                    "language": "ID",
                    "text": "Layer Trading Bot adalah alat fundamental saat merancang, menguji, dan men-debug strategi! Kamu akan mempelajari lebih lanjut tentang mereka dan memanfaatkannya dengan baik dalam tutorial yang mengajarkanmu cara membangun Trading Systems, tersedia di Trading System Design Tutorials Native Workspace.",
                    "updated": 1674112057223
                },
                {
                    "language": "ES",
                    "text": "Las capas del Trading Bot son una herramienta fundamental a la hora de diseñar, probar y depurar estrategias. Aprenderás más sobre ellas y les darás un buen uso en los tutoriales que te enseñan a construir Sistemas de Trading, disponibles en los Trading System Design Tutorials Native Workspaces.",
                    "updated": 1675469035698
                }
            ]
        },
        {
            "style": "Success",
            "text": "Drop by the documentation for more info!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Schauen Sie in der Dokumentation nach, um mehr zu erfahren!",
                    "updated": 1639146184287
                },
                {
                    "language": "RU",
                    "text": "Загляните в документацию для получения дополнительной информации!",
                    "updated": 1640632113660
                },
                {
                    "language": "TR",
                    "text": "Daha fazla bilgi için belgelere göz atın!",
                    "updated": 1642518825941
                },
                {
                    "language": "ID",
                    "text": "Kunjungi dokumentasi untuk info lebih lanjut!",
                    "updated": 1674112068021
                },
                {
                    "language": "ES",
                    "text": "Visita la documentación para obtener más información.",
                    "updated": 1675469048258
                }
            ]
        }
    ]
}