{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 12,
    "type": "Tutorial Step - How About the Rest?",
    "definition": {
        "icon": {
            "name": "Trading/trading-episode",
            "project": "Foundations"
        },
        "text": "Now, why don't the nodes further to the left show their values too? Say, Exit Type, Status, End Rate, Begin Rate, and so on?",
        "translations": [
            {
                "language": "DE",
                "text": "Nun, warum zeigen die Knoten weiter links nicht auch ihre Werte an? Zum Beispiel Exit Type, Status, End Rate, Begin Rate, und so weiter?",
                "updated": 1623012850714,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Теперь, почему бы узлам, расположенным дальше слева, тоже не показывать свои значения? Скажем, тип выхода (Exit Type), статус (Status), конечная ставка (End Rate), начальная ставка (Begin Rate) и так далее?",
                "updated": 1640546181925
            },
            {
                "language": "TR",
                "text": "Şimdi, neden daha soldaki düğümler de değerlerini göstermiyor? Çıkış Türü (Exit Type), Durum (Status), Bitiş Oranı (End Rate), Başlangıç Oranı (Begin Rate) vb.\n",
                "updated": 1641911229332
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Let's change that!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Ändern wir das!",
                    "updated": 1623012862833,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Давайте поменяем это!",
                    "updated": 1640546203339
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Scroll the Trading Engine layer manager until you find the \"Current Episode\" layer. Turn it on!",
            "updated": 1622541140027,
            "translations": [
                {
                    "language": "DE",
                    "text": "Blätter im Trading Engine Layer Manager, bis du den Layer Current Episode findest. Schalte sie ein!",
                    "updated": 1623012960646,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Прокрутите менеджер слоев торгового движка, пока не найдете слой \"Current Episode\". Включите его!",
                    "updated": 1640546264989
                },
                {
                    "language": "TR",
                    "text": "\"Current Episode\" katmanını bulana kadar Ticaret Motoru (Trading Engine) katman yöneticisini kaydırın.",
                    "updated": 1641911386069
                }
            ]
        },
        {
            "style": "Text",
            "text": "Now slide your mouse pointer again... et voilà!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Nun fahre wieder mit deinem Mauszeiger... et voilà!",
                    "updated": 1623013012511,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Теперь снова проведите указателем мыши... и вуаля!",
                    "updated": 1640546290110
                },
                {
                    "language": "TR",
                    "text": "Şimdi fare işaretçinizi tekrar grafiğin üzerine, mumlara doğru kaydırın.. et voilà!",
                    "updated": 1641911418855
                }
            ]
        },
        {
            "style": "Success",
            "text": "By turning layers on and off, you turn on and off the system's ability to report the values on different sections of the Trading Engine hierarchy!",
            "updated": 1617182162058,
            "translations": [
                {
                    "language": "DE",
                    "text": "Durch das Ein- und Ausschalten von Layern schaltest du die Fähigkeit des Systems ein und aus, die Werte auf verschiedenen Abschnitten der Hierarchie der Trading Engine zu melden!",
                    "updated": 1623013079166,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Включая и выключая слои, вы включаете и выключаете способность системы сообщать значения на разных участках иерархии Trading Engine!",
                    "updated": 1640546309831
                },
                {
                    "language": "TR",
                    "text": "Katmanları açıp kapatarak, sistemin Trading Engine hiyerarşisinin farklı bölümlerindeki değerleri raporlama yeteneğini açar ve kapatırsınız!",
                    "updated": 1641911445260
                }
            ]
        }
    ]
}