{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 2,
    "type": "Tutorial - Trading Bot Layers",
    "definition": {
        "icon": {
            "name": "trading-bot",
            "project": "Algorithmic-Trading"
        },
        "text": "In this tutorial I'll show you how the layers of the Trading Bot work! I mean the ones featured on charts, associated with all types of trading sessions!",
        "updated": 1617106641313,
        "translations": [
            {
                "language": "DE",
                "text": "In diesem Tutorial zeige ich dir, wie die Layer des Trading Bot funktionieren! Ich meine die, die in den Charts zu sehen sind und mit allen Arten von Trading Sessions verbunden sind!",
                "updated": 1622984863588,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "В этом уроке я покажу вам, как работают слои торгового бота! Я имею в виду те, которые изображены на графиках, связанные со всеми типами торговых сессий!",
                "updated": 1640543199664
            },
            {
                "language": "TR",
                "text": "Bu eğitimde size Trading Bot'un katmanlarının nasıl çalıştığını göstereceğim! Her türlü alım satım seansıyla ilişkili grafiklerde gösterilenleri kastediyorum!",
                "updated": 1641717504580
            },
            {
                "language": "ID",
                "text": "Dalam tutorial ini aku memperlihatkan kamu bagaimana layers dari Trading Bot bekerja! Maksudku yang ditampilkan di chart, terkait dengan semua jenis sesi trading!",
                "updated": 1673827739808
            },
            {
                "language": "ES",
                "text": "¡En este tutorial te mostraré cómo funcionan las capas del Trading Bot! Me refiero a las que aparecen en los gráficos, ¡asociadas a todo tipo de sesiones de trading!",
                "updated": 1675462580043
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Let's get on with it! The Trading Bot outputs dozens of products, and they're all featured in three separate Layer Managers:",
            "updated": 1617106677766,
            "translations": [
                {
                    "language": "DE",
                    "text": "Legen wir los! Der Trading Bot gibt Dutzende von Produkten aus, die alle in drei separaten Layer Managers (\"Ebenenmanagern\") dargestellt werden:",
                    "updated": 1622984878617,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Давайте приступим! Торговый бот выводит десятки продуктов, и все они представлены в трех отдельных менеджерах слоев Layer Manager:",
                    "updated": 1640543249899
                },
                {
                    "language": "TR",
                    "text": "Hadi devam edelim! Ticaret Botu (Trading Bot) düzinelerce ürün üretir ve bunların tümü üç ayrı Katman Yöneticisinde (Layer Managers) bulunur:",
                    "updated": 1641717582828
                },
                {
                    "language": "ID",
                    "text": "Mari kita lanjutkan! Trading Bot menghasilkan lusinan produk, dan semuanya ditampilkan dalam Layers Managers terpisah:",
                    "updated": 1673827747778
                },
                {
                    "language": "ES",
                    "text": "¡Manos a la obra! El Trading Bot emite docenas de productos, y todos ellos aparecen en tres Layer Managers separados:",
                    "updated": 1675462610696
                }
            ]
        },
        {
            "style": "List",
            "text": "Trading Engine: features layers that turn on and off the reporting of values of nodes in the Trading Engine hierarchy.",
            "updated": 1617106697101,
            "translations": [
                {
                    "language": "DE",
                    "text": "Trading Engine: Verfügt über Ebenen, die das Reporting der Werte von Knoten in der Trading Engine-Hierarchie ein- und ausschalten.",
                    "updated": 1622984891979,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Trading Engine: содержит слои, которые включают и выключают информирование о значениях узлов в иерархии Trading Engine.",
                    "updated": 1640543968756
                },
                {
                    "language": "TR",
                    "text": "Trading Engine: Trading Engine hiyerarşisindeki düğümlerin değerlerinin raporlanmasını açan ve kapatan katmanlar içerir.",
                    "updated": 1641717712023
                },
                {
                    "language": "ID",
                    "text": "Trading Engine: menampilkan layers yang bisa menghidupkan dan mematikan pelaporan value atau nilai dari node dalam hierarki Trading Engine.",
                    "updated": 1673827755659
                },
                {
                    "language": "ES",
                    "text": "Trading Engine: presenta capas que activan y desactivan la información de los valores de los nodos en la jerarquía del Trading Engine.",
                    "updated": 1675462636012
                }
            ]
        },
        {
            "style": "List",
            "text": "Trading System: features layers that turn on and off multiple types of reports at the level of the Trading System.",
            "updated": 1617106701918,
            "translations": [
                {
                    "language": "DE",
                    "text": "Trading System: Enthält Ebenen, die mehrere Arten von Berichten auf der Ebene des Handelssystems ein- und ausschalten.",
                    "updated": 1622984907055,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Trading System: имеет уровни, которые включают и выключают несколько типов отчетов на уровне торговой системы.",
                    "updated": 1640544042964
                },
                {
                    "language": "TR",
                    "text": "Trading System: Alım Satım Sistemi düzeyinde birden fazla rapor türünü açan ve kapatan katmanlara sahiptir.",
                    "updated": 1641717774994
                },
                {
                    "language": "ID",
                    "text": "Trading System: menampilkan layers yang bisa menghidupkan dan mematikan berbagai jenis laporan pada tingkatan Trading System.",
                    "updated": 1673827765144
                },
                {
                    "language": "ES",
                    "text": "Trading System: presenta capas que activan y desactivan múltiples tipos de informes a nivel del Trading System.",
                    "updated": 1675462650076
                }
            ]
        },
        {
            "style": "List",
            "text": "Simulation Objects: features layers that affect the rendering of visual information over the charts.",
            "updated": 1617106714758,
            "translations": [
                {
                    "language": "DE",
                    "text": "Simulationsobjekte: Enthält Ebenen, die das Rendern von visuellen Informationen über die Diagramme beeinflussen.",
                    "updated": 1622984919431,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Simulation Objects: слои характеристик, которые влияют на отрисовку визуальной информации на графиках.",
                    "updated": 1640544028710
                },
                {
                    "language": "TR",
                    "text": "Simulation Objects: Grafikler üzerinde görsel bilgilerin oluşturulmasını etkileyen katmanları içerir.",
                    "updated": 1641717820493
                },
                {
                    "language": "ID",
                    "text": "Simulation Objects: menampilkan layers yang memperngaruhi perenderan informasi visual di atas charts.",
                    "updated": 1673827774865
                },
                {
                    "language": "ES",
                    "text": "Simulation Objects: presenta capas que afectan a la representación de la información visual sobre los gráficos.",
                    "updated": 1675462698191
                }
            ]
        }
    ]
}