{
    "tutorial": "Trading Bot Layers",
    "pageNumber": "1",
    "type": "Trading Bot Layers Tutorial",
    "definition": {
        "text": "This tutorial walks you through the layers made available by the Trading Bot on the charts, in particular, the layers associated with all types of Trading Sessions. You will run a backtest of the BTC-USDT - Weak-hands Buster - WHB trading system and explore some of the trades while learning how to use the layers.",
        "updated": 1617107011471,
        "translations": [
            {
                "language": "DE",
                "text": "Dieses Tutorial führt dich durch die Layer, die der Trading Bot auf den Charts zur Verfügung stellt, insbesondere die Layer, die mit allen Arten von Trading Sessions verbunden sind. Du wirst einen Backtest des BTC-USDT - Weak-hands Buster - WHB Trading Systems durchführen und einige der Trades erkunden, während du lernst, wie man die Layer verwendet.",
                "updated": 1623011979138,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Este tutorial te guiará a través de las capas que ofrece el Trading Bot en los gráficos, en particular, las capas asociadas con todo tipo de sesiones de Trading. Ejecutará una prueba retrospectiva del sistema BTC-USDT - \"Weak-hands Buster\" (WHB) de trading y exploraremos alguno de los trades mientras aprendes como usar las capas.",
                "updated": 1675620887237
            },
            {
                "language": "RU",
                "text": "В этом уроке вы познакомитесь со слоями, доступными торговому боту на графиках, в частности, со слоями, связанными со всеми типами торговых сессий. Вы проведете бэктест торговой системы BTC-USDT - Weak-hands Buster - WHB и рассмотрите некоторые сделки, одновременно изучая, как использовать слои.",
                "updated": 1640543164737
            },
            {
                "language": "TR",
                "text": "Bu eğitim, Ticaret Botu (Trading Bot) tarafından grafiklerde kullanılan katmanlar, özellikle de tüm Ticaret Oturumları ile ilişkili katmanlar konusunda size yol gösterir. BTC-USDT - Weak-Hands-Buster - WHB ticaret sisteminin geriye dönük testini yapacak ve katmanları nasıl kullanacağınızı öğrenirken bazı işlemleri keşfedeceksiniz.",
                "updated": 1641717431841
            },
            {
                "language": "ID",
                "text": "Tutorial ini memandu kamu melalui layers atau lapisan yang disediakan oleh Trading Bot pada chart, khususnya layers yang terkait dengan semua jenis Trading Sessions. Kamu akan menjalankan backtest dari BTC-USDT - Weak-hands Buster - WHB trading system dan menjelajahi beberapa trade sambil mempelajari cara menggunakan layers.",
                "updated": 1673827027110
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "About This Tutorial",
            "updated": 1617111575959,
            "translations": [
                {
                    "language": "RU",
                    "text": "Об этом учебнике",
                    "updated": 1640543174520
                },
                {
                    "language": "TR",
                    "text": "Bu Eğitim Hakkında",
                    "updated": 1654394184884,
                    "style": "Title"
                },
                {
                    "language": "ES",
                    "text": "Acerca de este tutorial",
                    "updated": 1675620862994
                }
            ]
        },
        {
            "style": "List",
            "text": "Workspace: Trading Bot Layers Tutorial Native Workspace.",
            "updated": 1647873379561,
            "translations": [
                {
                    "language": "TR",
                    "text": "Çalışma alanı: Ticaret Botu Katmanları Eğitimi Eklenti Çalışma Alanı.",
                    "updated": 1654394190656,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Maintainer: @julianmolina (Telegram).",
            "translations": [
                {
                    "language": "TR",
                    "text": "Bakımcı: @julianmolina (Telegram).",
                    "updated": 1654394196136,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Responsable: @julianmolina (Telegram).",
                    "updated": 1675462422640
                }
            ]
        }
    ]
}