{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 7,
    "type": "Tutorial Step - Are We Up to Date.....?",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "indicator-process-instance"
        },
        "text": "Now we have to wait a bit! When all processes reach the 100% mark, we may proceed!",
        "translations": [
            {
                "language": "DE",
                "text": "Jetzt müssen wir noch ein wenig warten! Wenn alle Prozesse die 100%-Marke erreicht haben, können wir fortfahren!",
                "updated": 1623012126871,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Теперь нам нужно немного подождать! Когда все процессы достигнут отметки 100%, мы сможем продолжить!",
                "updated": 1640545470192
            },
            {
                "language": "TR",
                "text": "Şimdi biraz beklememiz gerekiyor! Tüm süreçler %100 'e ulaştığında, devam edebiliriz!",
                "updated": 1641754314714
            },
            {
                "language": "ID",
                "text": "Sekarang kita hanya harus menunggu sebentar! Ketika semua prosesnya sampai tertanda 100%, Lalu kita lanjut!",
                "updated": 1673831026968
            },
            {
                "language": "ES",
                "text": "Ahora tenemos que esperar un poco. Cuando todos los procesos alcancen el 100%, podremos continuar.",
                "updated": 1675463326805
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "As you probably know, the time required to mine data depends on many things. If you already have some of this data from previous activities, it may be faster!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wie du wahrscheinlich weißt, hängt die Zeit, die für das Mining von Daten benötigt wird, von vielen Dingen ab. Wenn du bereits einige dieser Daten aus früheren Aktivitäten hast, kann es schneller gehen!",
                    "updated": 1623012139487,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Как вы, вероятно, знаете, время, необходимое для добычи данных, зависит от многих вещей. Если у вас уже есть некоторые из этих данных, полученные в результате предыдущей деятельности, это может быть быстрее!",
                    "updated": 1640545491458
                },
                {
                    "language": "TR",
                    "text": "Muhtemelen bildiğiniz gibi, veri madenciliği için gereken süre birçok şeye bağlıdır. Önceki etkinliklerden bu verilerin bir kısmına zaten sahipseniz, daha hızlı olabilir!",
                    "updated": 1641754375939
                },
                {
                    "language": "ID",
                    "text": "Seperti yang telah kamu ketahui, waktu yang diperlukan untuk mining data bergantung pada banyak hal. Jika kamu sudah memiliki beberapa data ini dari aktivitas sebelumnya, itu mungkin lebih cepat!",
                    "updated": 1673831034532
                },
                {
                    "language": "ES",
                    "text": "Como probablemente sepas, el tiempo necesario para extraer datos depende de muchas cosas. Si ya tienes algunos de estos datos de actividades anteriores, ¡puede que sea más rápido!",
                    "updated": 1675463344289
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Monitor the processes for all indicators in the Sparta and Masters data mines. When all of them reach 100%, stop the data mining operation and click Next to continue.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Überwache die Prozesse für alle Indikatoren in den Datenminen von Sparta und Masters. Wenn alle 100% erreicht haben, dann stoppe die Data-Mining-Operation und klicke auf \"Weiter\", um fortzufahren.",
                    "updated": 1623012153240,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Проконтролируйте процессы для всех показателей в источниках данных Sparta и Masters. Когда все они достигнут 100%, остановите операцию добычи данных и нажмите кнопку Next для продолжения.",
                    "updated": 1640545528222
                },
                {
                    "language": "TR",
                    "text": "Sparta ve Masters veri madenlerindeki tüm göstergeler için süreçleri izleyin. Hepsi %100'e ulaştığında, veri madenciliği işlemini durdurun ve devam etmek için İleri'ye tıklayın.",
                    "updated": 1641754399144
                },
                {
                    "language": "ID",
                    "text": "Pantau proses untuk semua indikator di Sparta and Masters data mines. Ketika semuanya mencapai 100%, hentikan operasi mining data dan klik Next untuk melanjutkan.",
                    "updated": 1673831041365
                },
                {
                    "language": "ES",
                    "text": "Supervisa los procesos de todos los indicadores en las minas de datos de Sparta y Masters. Cuando todos ellos alcancen el 100%, detén la operación de minería de datos y pulsa Next para continuar.",
                    "updated": 1675463378012
                }
            ]
        },
        {
            "style": "Success",
            "text": "Bollinger Channels will likely be last!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Bollinger-Kanäle werden wahrscheinlich als letztes angezeigt!",
                    "updated": 1623012171563,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "\"Bollinger Channels\" göstergesi muhtemelen en son tamamlanan gösterge olacak!",
                    "updated": 1641754463513
                },
                {
                    "language": "ID",
                    "text": "Bollinger Channels kemungkinan akan menjadi yang terakhir!",
                    "updated": 1673831047803
                },
                {
                    "language": "ES",
                    "text": "¡Los Canales de Bollinger probablemente serán los últimos!",
                    "updated": 1675463384097
                }
            ]
        }
    ]
}