{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 8,
    "type": "Tutorial Step - Ready. Set. Go.....!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "task"
        },
        "text": "Let's do some backtesting! This should be rather quick, as we are testing six months worth of historic data on daily files.",
        "updated": 1617181836967,
        "translations": [
            {
                "language": "DE",
                "text": "Machen wir einen Backtest! Dies sollte ziemlich schnell gehen, da wir historische Daten aus sechs Monaten auf täglicher Basis testen.",
                "updated": 1623012202527,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Давайте проведем бэктестинг! Это должно быть довольно быстро, поскольку мы тестируем исторические данные за шесть месяцев на дневных файлах.",
                "updated": 1640545585904
            },
            {
                "language": "TR",
                "text": "Hadi biraz geriye dönük test yapalım! Günlük dosyalarda altı aylık geçmiş verileri test ettiğimiz için bu oldukça hızlı olmalı.",
                "updated": 1641755083890
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Running a trading task is quite similar to running a data mining task. The difference lies in that&mdash;after running the task&mdash;you also need to run the trading session.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Das Ausführen einer „Trading Task“ ist dem Ausführen einer Data-Mining-Aufgabe sehr ähnlich. Der Unterschied besteht darin, dass man, nachdem man die Aufgabe ausgeführt hat, auch die Trading Session ausführen muss.",
                    "updated": 1623012215524,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Выполнение торговой задачи очень похоже на выполнение задачи по добыче данных. Разница заключается в том, что после выполнения задачи необходимо также запустить торговую сессию.",
                    "updated": 1640545614495
                },
                {
                    "language": "TR",
                    "text": "Bir ticaret görevi yürütmek, bir veri madenciliği görevi yürütmeye oldukça benzer. Aradaki fark, görevi çalıştırdıktan sonra, ticaret oturumunu da (Trading Session) çalıştırmanız gerektiğidir.",
                    "updated": 1641755132500
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Select Run on the Task menu and then select Run on the Backtesting Session menu.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wähle zunächst im Task Menü die Option Run und anschließend im Menü Backtesting Session die Option Run.",
                    "updated": 1623012312585,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Выберите Run в меню Task, а затем выберите Run в меню Backtesting Session.",
                    "updated": 1640545626836
                },
                {
                    "language": "TR",
                    "text": "Görev menüsünde (Task) Çalıştır'ı (Run) seçin ve ardından Geri Test Oturumu (Backtesting Session) menüsünde Çalıştır'ı (Run) seçin.",
                    "updated": 1641755268205
                }
            ]
        },
        {
            "style": "Note",
            "text": "When the Backtesting Session informs it has finished, stop the task and click Next to continue.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn die Backtesting Session meldet, dass sie beendet ist, dann stoppe die Task und klicke auf \"Weiter\", um fortzufahren.",
                    "updated": 1623012332680,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Когда сессия Backtesting Session сообщит о завершении, остановите задачу и нажмите кнопку Next для продолжения.",
                    "updated": 1640545646166
                },
                {
                    "language": "TR",
                    "text": "Geri Test Oturumu (backtesting Session) bittiğini bildirdiğinde, görevi durdurun ve devam etmek için İleri'ye tıklayın.",
                    "updated": 1641755306758
                }
            ]
        }
    ]
}