{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 10,
    "type": "Tutorial Step - 1, 2, 3, Counting!",
    "definition": {
        "icon": {
            "name": "Trading/trading-episode-counters",
            "project": "Foundations"
        },
        "text": "Let's test the first Layer in the Trading Engine Layer Manager: \"Trading Episode Counters\".",
        "updated": 1622541030903,
        "translations": [
            {
                "language": "DE",
                "text": "Lass uns den ersten Layer im Trading Engine Layer Manager testen: \"Trading Episode Counters\".",
                "updated": 1623012562920,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Давайте протестируем первый слой в Layer Manager торгового движка: \" Trading Episode Counters\".",
                "updated": 1640545978777
            },
            {
                "language": "TR",
                "text": "Ticaret Motoru Katman Yöneticisindeki (Trading Engine Layer Manager) ilk Katmanı test edelim: \"Ticaret Bölüm Sayaçları\" (Trading Episode Counters)",
                "updated": 1641909931604
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Turn the layer on and slide your mouse pointer over the chart, from the far left to the far right-hand side of your screen!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Schalte den Layer ein und fahre mit dem Mauszeiger über den Chart, von ganz links nach ganz rechts auf deinem Bildschirm!",
                    "updated": 1623012556935,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Включите слой и проведите указателем мыши по графику от крайней левой до крайней правой части экрана!",
                    "updated": 1640545998049
                },
                {
                    "language": "TR",
                    "text": "Katmanı açın ve fare imlecinizi ekranınızın en solundan en sağına doğru grafiğin üzerine kaydırın!",
                    "updated": 1641910223388
                }
            ]
        },
        {
            "style": "Success",
            "text": "See what happens with the various counters on the hierarchy below... that is, Periods, Strategies, Positions, and so on! You should see something similar to what I show in the video on the next step...",
            "translations": [
                {
                    "language": "DE",
                    "text": "Schau dir an, was mit den verschiedenen Zählern in der Hierarchie darunter passiert... nämlich Periods, Strategy, Position, und so weiter! Du solltest etwas ähnliches sehen, wie ich es im Video im nächsten Schritt zeige…",
                    "updated": 1623012613201,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Посмотрите, что происходит с различными счетчиками на иерархии ниже... то есть, Periods, Strategies, Positions, и так далее! Вы должны увидеть нечто похожее на то, что я показываю в видео на следующем шаге...",
                    "updated": 1640546054732
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki hiyerarşideki çeşitli sayaçlara ne olduğunu görün... yani, Dönemler (Periods), Stratejiler (Strategies), Konumlar (Positions), vb! Bir sonraki adımda videoda gösterdiğime benzer bir şey görmelisiniz...",
                    "updated": 1641910284428
                }
            ]
        }
    ]
}