{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 15,
    "type": "Tutorial Step - Elefant? What Elefant?",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "strategy"
        },
        "text": "Will someone please acknowledge the elefant in the room? Why did those counters point to one or two strategies and one position?",
        "translations": [
            {
                "language": "DE",
                "text": "Würde bitte jemand den Elefanten im Raum benennen? Warum haben diese Zähler auf eine oder zwei Strategien und eine Position hingewiesen?",
                "updated": 1623014190902,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Go to the Simulation Objects layer manager and turn on the \"Strategies\" layer.",
            "updated": 1622541366457,
            "translations": [
                {
                    "language": "DE",
                    "text": "Gehe zum Simulation Objects Layer Manager und schalte den Layer Strategies an.",
                    "updated": 1623014259203,
                    "style": "Callout"
                }
            ]
        },
        {
            "style": "Text",
            "text": "What's that? It's a strategy! We are in a simulation! The \"Strategies\" layer marks the span of time on which a strategy is active.",
            "updated": 1622541358704,
            "translations": [
                {
                    "language": "DE",
                    "text": "Was ist das? Das ist eine Strategie! Wir befinden uns in einer Simulation! Die Ebene \"Strategien\" markiert die Zeitspanne, in der eine Strategie aktiv ist.",
                    "updated": 1623014311425,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Success",
            "text": "Notice the Plotter Panel that drifted to the corner when you turned the layer on. Now, point your mouse to the span of time between the strategy brakets and see what happens...",
            "translations": [
                {
                    "language": "DE",
                    "text": "Beachte das Plotter Panel, das in die Ecke gedriftet ist, als du die Ebene eingeschaltet hast. Zeige nun mit der Maus auf die Zeitspanne zwischen den Strategie Klammern und sieh, was passiert...",
                    "updated": 1623014486967,
                    "style": "Success"
                }
            ]
        }
    ]
}