{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 14,
    "type": "Tutorial Step - Compartmentalize It!",
    "definition": {
        "icon": {
            "name": "Layer/bot-layers",
            "project": "Foundations"
        },
        "text": "The reason why the access to values in the hierarchy is compartmentalized in layers is that layers correspond to data products output by the bot.",
        "translations": [
            {
                "language": "DE",
                "text": "Der Grund, warum der Zugriff auf Werte in der Hierarchie in Layer aufgegliedert ist, ist, dass die Layer den vom Bot ausgegebenen Datenprodukten entsprechen.",
                "updated": 1623013715544,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Причина, по которой доступ к значениям в иерархии разделен на слои, заключается в том, что слои соответствуют продуктам данных, выводимым ботом.",
                "updated": 1640546584969
            },
            {
                "language": "TR",
                "text": "Hiyerarşideki değerlere erişimin katmanlar halinde bölümlere ayrılmasının nedeni, katmanların bot tarafından çıkarılan veri ürünlerine karşılık gelmesidir.",
                "updated": 1641993616380
            },
            {
                "language": "ID",
                "text": "Alasan mengapa akses ke nilai dalam hierarki dikelompokkan dalam beberapa layers adalah karena layers sesuai dengan keluaran produk data oleh bot.",
                "updated": 1673856112269
            },
            {
                "language": "ES",
                "text": "La razón por la que el acceso a los valores de la jerarquía está compartimentado en capas es que éstas corresponden a productos de datos emitidos por el bot.",
                "updated": 1675464389437
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Compartmentalization of definitions&mdash;and information in general&mdash;is a theme in and of itself throughout the system, as it is one of the mechanisms by which complexity is successfully administered.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Aufgliederung von Definitionen - und von Informationen im Allgemeinen - ist ein Thema für sich im gesamten System, da sie einer der Mechanismen ist, mit denen die Komplexität erfolgreich verwaltet wird.",
                    "updated": 1623013735708,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Разделение определений и информации в целом - это самостоятельная тема всей системы, поскольку это один из механизмов, с помощью которого успешно управляется сложная информация.",
                    "updated": 1640546666472
                },
                {
                    "language": "TR",
                    "text": "Tanımların ve genel olarak bilginin bölümlere ayrılması, karmaşıklığın başarıyla yönetildiği mekanizmalardan biri olduğu için sistem genelinde tema bu şekildedir.",
                    "updated": 1641993666059
                },
                {
                    "language": "ID",
                    "text": "Pengelompokan definisi—dan informasi secara umum—merupakan tema tersendiri di seluruh sistem, karena merupakan salah satu mekanisme di mana kompleksitas dikelola dengan sukses.",
                    "updated": 1673856120317
                },
                {
                    "language": "ES",
                    "text": "La compartimentación de las definiciones -y de la información en general- es un tema en sí mismo en todo el sistema, ya que es uno de los mecanismos por los que se administra con éxito la complejidad.",
                    "updated": 1675464412504
                }
            ]
        },
        {
            "style": "Callout",
            "text": "When you need to use this feature to track values on the Trading Engine hierarchy, you may choose to turn on multiple layers at once... even all of them if you wish! Just keep in mind that the more layers you turn on, the more files the UI reads, thus the more load you put on your hardware!",
            "updated": 1623015208966,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn du diese Funktion nutzen musst, um Werte in der Trading Engine Hierarchie zu verfolgen, kannst du mehrere Layer auf einmal einschalten... sogar alle, wenn du willst! Denke nur daran, dass je mehr Layer du einschaltest, desto mehr Dateien liest das UI, also desto mehr forderst du deine Hardware!",
                    "updated": 1623013805354,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Когда вам нужно использовать эту функцию для отслеживания значений на иерархии Trading Engine, вы можете включить несколько слоев одновременно... даже все, если хотите! Только имейте в виду, что чем больше слоев вы включаете, тем больше файлов считывает пользовательский интерфейс (UI), а значит, тем больше нагрузка на ваше оборудование!",
                    "updated": 1640546732387
                },
                {
                    "language": "TR",
                    "text": "Trading Engine hiyerarşisindeki değerleri takip etmek için bu özelliği kullanmanız gerektiğinde, aynı anda birden fazla katmanı açmayı seçebilirsiniz... dilerseniz hepsini açabilisiniz! Ne kadar çok katmanı açarsanız, kullanıcı arayüzünün o kadar çok dosya okuduğunu ve dolayısıyla donanımınıza o kadar fazla yük bindirdiğinizi unutmayın!",
                    "updated": 1641993714855
                },
                {
                    "language": "ID",
                    "text": "Sesaat kamu perlu menggunakan fitur ini untuk melacak nilai pada hierarki Trading Engine, kamu dapat memilih untuk mengaktifkan beberapa layers sekaligus... bahkan semuanya jika kamu mau! Perlu diingat bahwa semakin banyak layers yang kamu aktifkan, semakin banyak file yang dibaca UI, sehingga semakin banyak beban yang kamu berikan pada perangkat-mu!",
                    "updated": 1673856126564
                },
                {
                    "language": "ES",
                    "text": "Cuando necesites utilizar esta característica para rastrear valores en la jerarquía del Trading Engine, puedes optar por activar varias capas a la vez... ¡incluso todas si lo deseas! Sólo ten en cuenta que cuantas más capas actives, más archivos leerá la interfaz de usuario y, por lo tanto, ¡más carga supondrá para tu hardware!",
                    "updated": 1675464444102
                }
            ]
        }
    ]
}