{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 5,
    "type": "Tutorial Step - Ready to Mine.....?",
    "definition": {
        "icon": {
            "name": "Data/data-tasks",
            "project": "Foundations"
        },
        "text": "We'll do some data mining so that we may then run a quick Backtesting Session and explore the resulting simulation...",
        "translations": [
            {
                "language": "DE",
                "text": "Wir werden ein wenig Data Mining betreiben, um dann eine schnelle Backtesting Session durchzuführen und die resultierende Simulation zu erkunden…",
                "updated": 1623011799394,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Мы проведем небольшой сбор данных, чтобы затем запустить быструю сессию бэктестинга и рассмотреть полученную симуляцию...",
                "updated": 1640544797329
            },
            {
                "language": "TR",
                "text": "Biraz veri madenciliği yapacağız, böylece daha sonra hızlı bir Geri Test Oturumu (Backtesting Session) çalıştırabilir ve ortaya çıkan simülasyonu keşfedebiliriz...",
                "updated": 1641718617305
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Note",
            "text": "The sensor bot will run on the BTC/USDT market (Binance) from January 1st, 2020, along with the indicators required by the Weak-hands Buster Trading System.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Sensor Bot wird ab dem 1. Januar 2020 auf dem BTC/USDT-Markt (Binance) laufen, zusammen mit den Indikatoren, die das Weak-hands Buster Trading System benötigt.",
                    "updated": 1623011829304,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Сенсорный бот будет работать на рынке BTC/USDT (Binance) с 1 января 2020 года вместе с индикаторами, необходимыми для торговой системы Weak-hands Buster.",
                    "updated": 1640544832506
                },
                {
                    "language": "TR",
                    "text": "Sensör botu, Weak-hands-Buster Ticaret Sisteminin (Trading System) gerektirdiği göstergelerle birlikte 1 Ocak 2020'den itibaren BTC/USDT işlem çiftinde çalışacak.",
                    "updated": 1641718719958
                }
            ]
        },
        {
            "style": "Warning",
            "text": "If you have data on this market / exchange but on a different time range, this may affect your data! Read the sensor bot documentation to learn how! If the data you have is not important, feel free to keep going!",
            "updated": 1617181661074,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn du Daten auf diesem Markt/Börse hast, aber in einem anderen Zeitbereich, kann dies deine Daten beeinflussen! Lies die Dokumentation des Sensor-Bots, um zu erfahren wie! Wenn die Daten, die in deinem System vorhanden sind, nicht wichtig sind, kannst du gerne weitermachen!",
                    "updated": 1623011859309,
                    "style": "Warning"
                },
                {
                    "language": "RU",
                    "text": "Если у вас есть данные по этому рынку / бирже, но в другом временном диапазоне, это может повлиять на ваши данные! Прочтите документацию по сенсорному боту, чтобы узнать, как это сделать! Если данные, которые у вас есть, не важны, не бойтесь двигаться дальше!",
                    "updated": 1640544916873
                },
                {
                    "language": "TR",
                    "text": "Bu işlem çifti/borsa ile ilgili fakat farklı bir zaman aralığında verileriniz varsa, bu durum verilerinizi etkileyebilir! Nasıl yapılacağını öğrenmek için sensör botu belgelerini okuyun! Sahip olduğunuz veriler önemli değilse, devam edin!",
                    "updated": 1641718794868
                }
            ]
        }
    ]
}