{
    "tutorial": "Trading Bot Layers",
    "pageNumber": 9,
    "type": "Tutorial Topic - Trading Engine Layers",
    "definition": {
        "icon": {
            "name": "Trading/trading-engine",
            "project": "Foundations"
        },
        "text": "You are familiar with the concept of the Trading Engine, right? I will teach you which layers affect which sections of the hierarchy so that you may access the info!",
        "translations": [
            {
                "language": "DE",
                "text": "Du bist mit dem Konzept der Trading Engine vertraut, richtig? Ich werde dir beibringen, welche Layer welche Bereiche der Hierarchie beeinflussen, damit du auf die Informationen zugreifen kannst!",
                "updated": 1623012463880,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Вы знакомы с концепцией Trading Engine, верно? Я научу вас, какие слои влияют на те или иные разделы иерархии, чтобы вы могли получить доступ к информации!",
                "updated": 1640545674022
            },
            {
                "language": "TR",
                "text": "Trading Engine kavramına aşinasınız, değil mi? Hangi katmanların hiyerarşinin hangi bölümlerini etkilediğini size öğreteceğim, böylece bilgilere erişebileceksiniz!",
                "updated": 1641755390092
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I'm assuming you've done the Welcome tutorial... Remember when you split the screen in half? You slid the mouse pointer over the candles on the chart, and for each candle, you could see the value of certain nodes in the trading engine hierarchy, right?",
            "translations": [
                {
                    "language": "DE",
                    "text": "Ich gehe davon aus, dass du das Willkommenstutorial gemacht hast... Erinnerst du dich, als du den Bildschirm in zwei Hälften geteilt hast? Du hast den Mauszeiger über die Kerzen im Chart gleiten lassen und für jede Kerze konntest du den Wert bestimmter Knoten in der Hierarchie der Trading Engine sehen, richtig?",
                    "updated": 1623012496814,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Я предполагаю, что вы прошли учебник Welcome... Помните, как вы делили экран пополам? Вы скользили указателем мыши по свечам на графике, и для каждой свечи вы могли видеть значение определенных узлов в иерархии торгового движка (Trading Engine), верно?",
                    "updated": 1640545754679
                },
                {
                    "language": "TR",
                    "text": "Hoş Geldiniz eğitimini (Welcome Tutorial) tamamladığınızı varsayıyorum... Ekranı ikiye böldüğünüz zamanı hatırlıyor musunuz? Fare imlecini grafikteki mumların üzerine kaydırdınız ve her bir mum için ticaret motoru hiyerarşisindeki belirli düğümlerin değerini görebiliyordunuz, değil mi?",
                    "updated": 1641755469399
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Well, that's what it's all about! When you turn a certain layer on, you turn on the visualization of values for a certain section of the hierarchy.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Nun, genau darum geht es! Wenn du einen bestimmten Layer einschaltest, schaltest du die Visualisierung von Werten für einen bestimmten Abschnitt der Hierarchie ein.",
                    "updated": 1623012414141,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Так вот в чем дело! Когда вы включаете определенный слой, вы включаете визуализацию значений для определенного участка иерархии.",
                    "updated": 1640545822698
                },
                {
                    "language": "TR",
                    "text": "Her şey bundan ibaret! Belirli bir katmanı açtığınızda, hiyerarşinin belirli bir bölümü için değerlerin görselleştirilmesini açarsınız.",
                    "updated": 1641755510121
                }
            ]
        },
        {
            "style": "Text",
            "text": "Let's take a closer look!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Schauen wir uns das mal genauer an!",
                    "updated": 1623012425935,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Давайте посмотрим поближе!",
                    "updated": 1640545835549
                },
                {
                    "language": "TR",
                    "text": "Hadi daha yakından bakalım!",
                    "updated": 1641755527766
                }
            ]
        }
    ]
}