{
    "type": "Key Reference",
    "definition": {
        "text": "Anahtar referansı, Kripto Ekosistemi ( Crypto Ecosystem ) hiyerarşisinde belirli bir borsadaki belirli bir kullanıcı hesabında tanımlanan bir borsa hesap anahtarına referanstır.",
        "translations": [
            {
                "language": "RU",
                "text": "Key Reference - это ссылка на ключ учетной записи биржи, как определено в конкретной учетной записи пользователя, в конкретной бирже в иерархии Crypto Ecosystem.",
                "updated": 1638360087485
            }
        ],
        "updated": 1701083529498
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Genellikle, borsalar yalnızca parasal işlemler için borsa hesap anahtarınız aracılığıyla kimlik doğrulaması gerektirir. Ancak bazı borsalar, örneğin belirli bir kotanın üzerindeki bilgileri almak veya OHLCV verileri yerine ham işlem verilerini almak için başka bağlamlarda da kimlik doğrulaması gerektirebilir.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Обычно биржи требуют аутентификации с помощью ключа вашей учетной записи только для денежных транзакций. Однако некоторые биржи могут потребовать аутентификации и в других контекстах, например, для получения информации сверх определенной квоты или для получения необработанных данных сделок вместо данных OHLCV.",
                    "updated": 1638360137217
                }
            ],
            "updated": 1701083538011
        },
        {
            "style": "Text",
            "text": "Bu nedenlerle, değişim anahtarı referansları hem veri madenciliği hem de ticaret işlemleri bağlamında mevcuttur ve her zaman ilgili göreve eklenir.",
            "translations": [
                {
                    "language": "RU",
                    "text": "По этим причинам ссылки на ключи биржи доступны как в контексте интеллектуального анализа данных, так и в торговых операциях и всегда привязаны к соответствующей задаче.",
                    "updated": 1638360172550
                }
            ],
            "updated": 1701083545354
        },
        {
            "style": "Text",
            "text": "İleriye dönük testler ve canlı alım satım seansları, kullanıcının borsa ile doğrulama yapması gereken türden bir senaryo olduğundan, her zaman temel referansların ayarlanmasını gerektirir.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Форвард-тестирование и торговые сессии в реальном времени всегда требуют настройки ссылок на ключи, так как это тот сценарий, в котором пользователь должен пройти проверку на бирже.",
                    "updated": 1638430243621
                }
            ],
            "updated": 1701083549777
        },
        {
            "style": "Text",
            "text": "Her durumda, anahtar referans düğümü, Kripto Ekosistemi ( Crypto Ecosystem ) hiyerarşisinde tanımlandığı gibi, borsadaki bir hesaptan geçerli bir borsa hesap anahtarına referans vermelidir.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Во всех случаях узел Key Reference должен ссылаться на действительный ключ учетной записи биржи, как определено в иерархии Crypto Ecosystem.",
                    "updated": 1638360299740
                }
            ],
            "updated": 1701083560066
        },
        {
            "style": "Important",
            "text": "Most exchanges do not allow the same exchange account key to be used with multiple processes querying the exchange API. This means that if you are trading with multiple trading systems or multiple sessions on the same exchange, each session requires different exchange account keys.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Большинство бирж не позволяют использовать один и тот же ключ учетной записи биржи для нескольких процессов, запрашивающих API биржи. Это означает, что если вы торгуете с использованием нескольких торговых систем или нескольких сессий на одной и той же бирже, для каждой сессии требуются разные ключи учетной записи биржи.",
                    "updated": 1638360345878
                }
            ]
        }
    ]
}