{
    "type": "Actual Rate",
    "definition": {
        "text": "Actual rate is the number reported by the exchange as the rate at which an order was filled.",
        "translations": [
            {
                "language": "RU",
                "text": "Actual rate - это число, указанное биржей в качестве курса, по которому была исполнена заявка.",
                "updated": 1638622472910
            },
            {
                "language": "TR",
                "text": "Gerçek oran, bir emrin yerine getirildiği oran olarak döviz tarafından bildirilen sayıdır.",
                "updated": 1652017508810
            },
            {
                "language": "DE",
                "text": "Der tatsächliche Kurs ist der von der Börse gemeldete Kurs, zu dem ein Auftrag ausgeführt wurde.",
                "updated": 1701930790529
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "When the system consults the status of open orders with the exchange, the exchange responds with the size filled and the actual rate for the particular order. In case an order is filled incrementally, the value is updated accordingly.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда система проверяет статус открытых ордеров на бирже, биржа отвечает заполненным размером и фактическим курсом для конкретного ордера. Если ордер исполняется постепенно, значение обновляется соответствующим образом.",
                    "updated": 1638622573324
                },
                {
                    "language": "TR",
                    "text": "Sistem, açık emirlerin durumunu borsa ile görüştüğünde, borsa, belirli bir emir için doldurulan miktar ve gerçek kur ile yanıt verir. Kademeli olarak sipariş verilmesi durumunda değer buna göre güncellenir.",
                    "updated": 1652017517346
                },
                {
                    "language": "DE",
                    "text": "Wenn das System den Status offener Aufträge bei der Börse abfragt, antwortet die Börse mit der gefüllten Größe und dem aktuellen Kurs für den jeweiligen Auftrag. Wenn ein Auftrag schrittweise ausgeführt wird, wird der Wert entsprechend aktualisiert.",
                    "updated": 1701930790679,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "The system uses the actual rate to update the calculation of balances, which are otherwise calculated with the original rate, by default.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Система использует фактический курс для обновления расчета остатков, которые в противном случае по умолчанию рассчитываются с использованием исходного курса.",
                    "updated": 1638622609744
                },
                {
                    "language": "TR",
                    "text": "Sistem, aksi takdirde varsayılan olarak orijinal oran ile hesaplanan bakiye hesaplamasını güncellemek için gerçek oranı kullanır.",
                    "updated": 1652017525236
                },
                {
                    "language": "dDEe",
                    "text": "Das System verwendet den tatsächlichen Kurs, um die Berechnung der Salden zu aktualisieren, die ansonsten standardmäßig mit dem ursprünglichen Kurs berechnet werden.",
                    "updated": 1701930790883,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609873831169
        },
        {
            "style": "Title",
            "text": "Actual Rate Configuration",
            "updated": 1611924565404,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Actual Rate",
                    "updated": 1638622635546
                },
                {
                    "language": "TR",
                    "text": "Gerçek Oran Yapılandırması",
                    "updated": 1652017562673
                },
                {
                    "language": "DE",
                    "text": "Konfiguration Actual Rate",
                    "updated": 1701930791074,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609873980538,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1638622658924
                },
                {
                    "language": "TR",
                    "text": "Özellikleri",
                    "updated": 1652017578619
                },
                {
                    "language": "DE",
                    "text": "Eigenschaften",
                    "updated": 1701930791205,
                    "style": "Subtitle"
                }
            ]
        },
        {
            "style": "List",
            "text": "initialValue allows resetting the initial state of the node to an arbitrary value.",
            "updated": 1609875415147,
            "translations": [
                {
                    "language": "RU",
                    "text": "initialValue позволяет сбросить начальное состояние узла на произвольное значение.",
                    "updated": 1638622678585
                },
                {
                    "language": "TR",
                    "text": "initialValue düğümün başlangıç ​​durumunun keyfi bir değere sıfırlanmasına izin verir.",
                    "updated": 1652017612829
                },
                {
                    "language": "DE",
                    "text": "initialValue ermöglicht es, den Ausgangszustand des Knotens auf einen beliebigen Wert zurückzusetzen.",
                    "updated": 1701930791336,
                    "style": "List"
                }
            ]
        }
    ]
}