{
    "type": "Actual Rate",
    "definition": {
        "text": "Actual rate is the number reported by the exchange as the rate at which an order was filled.",
        "translations": [
            {
                "language": "RU",
                "text": "Actual rate - это число, указанное биржей в качестве курса, по которому была исполнена заявка.",
                "updated": 1638622472910
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "When the system consults the status of open orders with the exchange, the exchange responds with the size filled and the actual rate for the particular order. In case an order is filled incrementally, the value is updated accordingly.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда система проверяет статус открытых ордеров на бирже, биржа отвечает заполненным размером и фактическим курсом для конкретного ордера. Если ордер исполняется постепенно, значение обновляется соответствующим образом.",
                    "updated": 1638622573324
                }
            ]
        },
        {
            "style": "Text",
            "text": "The system uses the actual rate to update the calculation of balances, which are otherwise calculated with the original rate, by default.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Система использует фактический курс для обновления расчета остатков, которые в противном случае по умолчанию рассчитываются с использованием исходного курса.",
                    "updated": 1638622609744
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609873831169
        },
        {
            "style": "Title",
            "text": "Actual Rate Configuration",
            "updated": 1611924565404,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Actual Rate",
                    "updated": 1638622635546
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609873980538,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1638622658924
                }
            ]
        },
        {
            "style": "List",
            "text": "initialValue allows resetting the initial state of the node to an arbitrary value.",
            "updated": 1609875415147,
            "translations": [
                {
                    "language": "RU",
                    "text": "initialValue позволяет сбросить начальное состояние узла на произвольное значение.",
                    "updated": 1638622678585
                }
            ]
        }
    ]
}