{
    "topic": "App Commands Errors",
    "pageNumber": "2",
    "type": "App Error - Github Credentials Missing",
    "definition": {
        "text": "To manage contributions from within the app or update the app by running a command, you must first provide your Github.com credentials so that the Client can get you authenticated when pushing your changes to the remote repository.",
        "updated": 1611129104270,
        "translations": [
            {
                "language": "ES",
                "text": "Para administrar las contribuciones desde la aplicación o actualizar la aplicación ejecutando un comando, primero debe proporcionar sus credenciales de Github.com para que el Client (Cliente) puede conseguir que se autentique cuando envíe sus cambios al repositorio remoto.",
                "updated": 1637851982343 }, {
                "language": "DE",
                "text": "Um Beiträge aus der App heraus zu verwalten oder die App durch Ausführen eines Befehls zu aktualisieren, müssen Sie zunächst Ihre Github.com Anmeldedaten (Github-credentials) angeben, damit der Client Sie authentifizieren kann, wenn Sie Ihre Änderungen an das remote Repository übertragen.",
                "updated": 1637872276765
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Anchor",
            "text": "Anchor Github Credentials Missing",
            "updated": 1609855373585
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. Please solve this issue and try again.",
            "updated": 1620591786589,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Github-Anmeldeinformationen (Github Credentials) fehlen. Bitte lösen Sie dieses Problem und versuchen Sie es erneut.",
                    "updated": 1637872324423
                }
            ]
        },
        {
            "style": "Text",
            "text": "To solve this issue follow the following instructions on how to set up your GitHub.com credentials so that the system can automate the tasks needed to submit your contributions to the main repository of the Superalgos project.",
            "updated": 1609945787577,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para resolver este problema, siga las siguientes instrucciones sobre cómo configurar sus credenciales de GitHub.com para que el sistema pueda automatizar las tareas necesarias para enviar sus contribuciones al repositorio principal del proyecto Superalgos.",
                    "updated": 1637852010003}, {
                    "language": "DE",
                    "text": "Um dieses Problem zu lösen, befolgen Sie die folgenden Anweisungen, um Ihre GitHub.com-Anmeldedaten (GitHub.com credentials) einzurichten, damit das System die Aufgaben automatisieren kann, die erforderlich sind, um Ihre Beiträge in das main repository des Superalgos-Projekts einzureichen.",
                    "updated": 1637872432244
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Hierarchy APIs Not Found"
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The Hierarchy APIs was not found at your workspace. Please create it following the guide below and try again.",
            "updated": 1620591795457,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Github-Anmeldeinformationen (Github Credentials) fehlen. Die Hierarchy APIs wurden in Ihrem Workspace nicht gefunden. Bitte erstellen Sie sie gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1637872483733
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Github API Node Not Found",
            "updated": 1610559802944
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The Hierarchy APIs does not have a child of type Github API. Please create it following the guide below and try again.",
            "updated": 1620591802895,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github-Anmeldeinformationen (Github Credentials) fehlen. Die Hierarchie-APIs haben kein child (Node welche von Node abgeht) vom Typ Github API. Bitte erstellen Sie sie gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1637872623504
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Config Property Username Not Found",
            "updated": 1610559852624
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The property username is missing or empty. Please create it following the guide below and try again.",
            "updated": 1620591810613,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github-Anmeldeinformationen (Github Credentials) fehlen. Die Eigenschaft username fehlt oder ist leer. Bitte erstellen Sie sie gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1637872711952
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Config Property Token Not Found",
            "updated": 1610559914327
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The property token is missing or empty. Please create it following the guide below and try again.",
            "updated": 1610559900470,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github-Anmeldeinformationen (Github Credentials) fehlen. Das Property-Token fehlt oder ist leer.  Bitte erstellen Sie sie gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1637872739244
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Applies to",
            "translations": [
                {
                    "language": "DE",
                    "text": "Gilt für:",
                    "updated": 1637872755816
                }
            ]
        },
        {
            "style": "List",
            "text": "App Contribute Command"
        },
        {
            "style": "List",
            "text": "App Update Command"
        },
        {
            "style": "List",
            "text": "Governance Workspaces"
        },
        {
            "style": "Include",
            "text": "Foundations->Topic->App Contribute Command->Block Authentication",
            "updated": 1609945833844
        }
    ]
}
