{
    "topic": "App Commands Errors",
    "pageNumber": "2",
    "type": "App Error - Github Credentials Missing",
    "definition": {
        "text": "To manage contributions from within the app or update the app by running a command, you must first provide your Github.com credentials so that the Client can get you authenticated when pushing your changes to the remote repository.",
        "updated": 1611129104270,
        "translations": [
            {
                "language": "ES",
                "text": "Para administrar las contribuciones desde la aplicación o actualizar la aplicación ejecutando un comando, primero debe proporcionar sus credenciales de Github.com para que el Client (Cliente) puede conseguir que se autentique cuando envíe sus cambios al repositorio remoto.",
                "updated": 1637851982343
            },
            {
                "language": "DE",
                "text": "Um Beiträge aus der App heraus zu verwalten oder die App durch Ausführen eines Befehls zu aktualisieren, müssen Sie zunächst Ihre Github.com-Anmeldedaten angeben, damit der Client Sie authentifizieren kann, wenn Sie Ihre Änderungen an das entfernte Repository übertragen.",
                "updated": 1702243135143
            },
            {
                "language": "RU",
                "text": "Чтобы управлять вкладами из приложения или обновлять приложение с помощью команды, вы должны сначала предоставить свои учетные данные Github.com, чтобы Client мог пройти аутентификацию при отправке ваших изменений в удаленный репозиторий.",
                "updated": 1637948791548
            },
            {
                "language": "TR",
                "text": "Uygulama içinden katkıları yönetmek veya bir komut çalıştırarak uygulamayı güncellemek için öncelikle Github.com kimlik bilgilerinizi vermelisiniz, böylece İstemci değişikliklerinizi uzak depoya gönderirken kimliğinizin doğrulanmasını sağlayabilir.",
                "updated": 1654392802186
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Anchor",
            "text": "Anchor Github Credentials Missing",
            "updated": 1609855373585,
            "translations": [
                {
                    "language": "TR",
                    "text": "Çapa Github Kimlik Bilgileri Eksik",
                    "updated": 1654392808252,
                    "style": "Anchor"
                }
            ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. Please solve this issue and try again.",
            "updated": 1620591786589,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github-Anmeldeinformationen fehlen. Bitte lösen Sie dieses Problem und versuchen Sie es erneut.",
                    "updated": 1702243205494
                },
                {
                    "language": "RU",
                    "text": "Учетные данные Github отсутствуют. Пожалуйста, решите эту проблему и попробуйте еще раз.",
                    "updated": 1637948882840
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Lütfen bu sorunu çözün ve tekrar deneyin.",
                    "updated": 1654392814120,
                    "style": "Error"
                }
            ]
        },
        {
            "style": "Text",
            "text": "To solve this issue follow the following instructions on how to set up your GitHub.com credentials so that the system can automate the tasks needed to submit your contributions to the main repository of the Superalgos project.",
            "updated": 1609945787577,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para resolver este problema, siga las siguientes instrucciones sobre cómo configurar sus credenciales de GitHub.com para que el sistema pueda automatizar las tareas necesarias para enviar sus contribuciones al repositorio principal del proyecto Superalgos.",
                    "updated": 1637852010003
                },
                {
                    "language": "DE",
                    "text": "Um dieses Problem zu lösen, befolgen Sie die folgenden Anweisungen, um Ihre GitHub.com-Anmeldedaten einzurichten, damit das System die Aufgaben automatisieren kann, die erforderlich sind, um Ihre Beiträge in das Hauptrepository des Superalgos-Projekts einzureichen.",
                    "updated": 1702243231654
                },
                {
                    "language": "RU",
                    "text": "Чтобы решить эту проблему, следуйте приведенным ниже инструкциям по настройке учетных данных GitHub.com, чтобы система могла автоматизировать задачи, необходимые для отправки ваших вкладов в главный репозиторий проекта Superalgos.",
                    "updated": 1637948857944
                },
                {
                    "language": "TR",
                    "text": "Bu sorunu çözmek için GitHub.com kimlik bilgilerinizi nasıl ayarlayacağınıza ilişkin aşağıdaki talimatları izleyin, böylece sistem katkılarınızı Superalgos projesinin ana deposuna göndermek için gereken görevleri otomatikleştirebilir.",
                    "updated": 1654392819656,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Hierarchy APIs Not Found",
            "translations": [
                {
                    "language": "TR",
                    "text": "Çapa Hiyerarşisi API'leri Bulunamadı",
                    "updated": 1654392826520,
                    "style": "Anchor"
                }
            ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The Hierarchy APIs was not found at your workspace. Please create it following the guide below and try again.",
            "updated": 1620591795457,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github-Anmeldeinformationen fehlen. Die Hierarchy APIs wurden in Ihrem Arbeitsbereich nicht gefunden. Bitte erstellen Sie sie gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1702243301753
                },
                {
                    "language": "RU",
                    "text": "Учетные данные Github отсутствуют. API-интерфейсы иерархии не найдены в вашем рабочем пространстве. Создайте его, следуя приведенному ниже руководству, и повторите попытку.",
                    "updated": 1637948923688
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Hiyerarşi API'leri çalışma alanınızda bulunamadı. Lütfen aşağıdaki kılavuzu izleyerek oluşturun ve tekrar deneyin.",
                    "updated": 1654392832224,
                    "style": "Error"
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Github API Node Not Found",
            "updated": 1610559802944,
            "translations": [
                {
                    "language": "TR",
                    "text": "Anchor Github API Düğümü Bulunamadı",
                    "updated": 1654392838240,
                    "style": "Anchor"
                }
            ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The Hierarchy APIs does not have a child of type Github API. Please create it following the guide below and try again.",
            "updated": 1620591802895,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github-Anmeldeinformationen fehlen. Die Hierarchie- APIs haben kein untergeordnetes Element vom Typ Github API. Bitte erstellen Sie es gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1702243321080
                },
                {
                    "language": "RU",
                    "text": "Учетные данные Github отсутствуют. API-интерфейсы Hierarchy не имеют дочернего типа Github API. Создайте его, следуя приведенному ниже руководству, и повторите попытку.",
                    "updated": 1637948957902
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Hiyerarşi API'lerinin Github API türünde bir alt öğesi yok. Lütfen aşağıdaki kılavuzu izleyerek oluşturun ve tekrar deneyin.",
                    "updated": 1654392843915,
                    "style": "Error"
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Config Property Username Not Found",
            "updated": 1610559852624,
            "translations": [
                {
                    "language": "TR",
                    "text": "Anchor Config Özelliği Kullanıcı Adı Bulunamadı",
                    "updated": 1654392849309,
                    "style": "Anchor"
                }
            ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The property username is missing or empty. Please create it following the guide below and try again.",
            "updated": 1620591810613,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github-Anmeldeinformationen fehlen. Die Eigenschaft username fehlt oder ist leer. Bitte erstellen Sie sie gemäß der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1702243331428
                },
                {
                    "language": "RU",
                    "text": "Учетные данные Github отсутствуют. Имя пользователя свойства отсутствует или пусто. Создайте его, следуя приведенному ниже руководству, и повторите попытку.",
                    "updated": 1637948980483
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Kullanıcı adı özelliği eksik veya boş. Lütfen aşağıdaki kılavuzu izleyerek oluşturun ve tekrar deneyin.",
                    "updated": 1654392858449,
                    "style": "Error"
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Anchor Config Property Token Not Found",
            "updated": 1610559914327,
            "translations": [
                {
                    "language": "TR",
                    "text": "Anchor Config Özellik Belirteci Bulunamadı",
                    "updated": 1654392864228,
                    "style": "Anchor"
                }
            ]
        },
        {
            "style": "Error",
            "text": "Github Credentials are Missing. The property token is missing or empty. Please create it following the guide below and try again.",
            "updated": 1610559900470,
            "translations": [
                {
                    "language": "DE",
                    "text": "Github-Anmeldeinformationen fehlen. Das Property-Token fehlt oder ist leer. Bitte erstellen Sie es anhand der unten stehenden Anleitung und versuchen Sie es erneut.",
                    "updated": 1702243340741
                },
                {
                    "language": "RU",
                    "text": "Учетные данные Github отсутствуют. Маркер свойства отсутствует или пуст. Создайте его, следуя приведенному ниже руководству, и повторите попытку.",
                    "updated": 1637949010712
                },
                {
                    "language": "TR",
                    "text": "Github Kimlik Bilgileri Eksik. Özellik belirteci eksik veya boş. Lütfen aşağıdaki kılavuzu izleyerek oluşturun ve tekrar deneyin.",
                    "updated": 1654392869887,
                    "style": "Error"
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Applies to",
            "translations": [
                {
                    "language": "DE",
                    "text": "Gilt für:",
                    "updated": 1637872755816
                },
                {
                    "language": "RU",
                    "text": "Относится к",
                    "updated": 1637949043289
                },
                {
                    "language": "TR",
                    "text": "Şunlar için geçerlidir",
                    "updated": 1654392875386,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "List",
            "text": "App Contribute Command",
            "translations": [
                {
                    "language": "TR",
                    "text": "App Contribute Komutu",
                    "updated": 1654392880843,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Befehl App Contribute ((App Contribute Command))",
                    "updated": 1702243358525
                }
            ]
        },
        {
            "style": "List",
            "text": "App Update Command",
            "translations": [
                {
                    "language": "TR",
                    "text": "Uygulama Güncelleme Komutu",
                    "updated": 1654392886824,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "App Update Befehl (App Update Command)",
                    "updated": 1702243379413
                }
            ]
        },
        {
            "style": "List",
            "text": "Governance Workspaces",
            "translations": [
                {
                    "language": "TR",
                    "text": "Yönetişim Çalışma Alanları",
                    "updated": 1654392892603,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Governance-Arbeitsbereiche (Governance Workspaces)",
                    "updated": 1702243386686
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Topic->App Contribute Command->Block Authentication",
            "updated": 1609945833844,
            "translations": [
                {
                    "language": "TR",
                    "text": "Foundations->Topic->App Contribute Command->Block Authentication",
                    "updated": 1654392898162,
                    "style": "Include"
                }
            ]
        }
    ]
}