{
    "type": "Master Script",
    "definition": {
        "text": "A master script contains the definitions of any number of template scripts along with the master JavaScript code providing the logic to implement them.",
        "translations": [
            {
                "language": "RU",
                "text": "Главный скрипт (сценарий) содержит определения любого количества шаблонных сценариев вместе с главным кодом JavaScript, обеспечивающим логику их реализации.",
                "updated": 1645168640374
            },
            {
                "language": "TR",
                "text": "Bir ana komut dosyası, herhangi bir sayıda şablon komut dosyasının tanımlarını ve bunları uygulamak için mantık sağlayan ana JavaScript kodunu içerir.",
                "updated": 1701087891003
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "In general terms, master scripts serve to atomize the complexity of the task at hand by subdividing the task into any number of specific scopes, handled by individual template scripts. The master script controls the execution of template scripts and solves issues beyond their scope.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В общих чертах, мастер-скрипты служат для распыления сложности выполняемой задачи путем разделения задачи на любое количество конкретных областей, обрабатываемых отдельными шаблонными скриптами. Мастер-скрипт контролирует выполнение шаблонных скриптов и решает вопросы, выходящие за их рамки.",
                    "updated": 1645168656671
                },
                {
                    "language": "TR",
                    "text": "Genel anlamda, ana komut dosyaları, görevi ayrı şablon komut dosyaları tarafından ele alınan herhangi bir sayıda özel kapsama bölerek eldeki görevin karmaşıklığını atomize etmeye hizmet eder. Ana komut dosyası, şablon komut dosyalarının yürütülmesini kontrol eder ve kapsamları dışındaki sorunları çözer.",
                    "updated": 1701087895651
                }
            ]
        },
        {
            "style": "Text",
            "text": "The current implementation of the Masters super scripts hierarchy features two master scripts you may use as examples. The Setup Market master script deals with all the steps required to install a new market, while the Delete Market Dependencies master script deals with uninstalling markets.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Текущая реализация иерархии суперскриптов Masters включает два мастер-скрипта, которые вы можете использовать в качестве примеров. Мастер-скрипт Setup Market рассматривает все шаги, необходимые для установки нового рынка, а мастер-скрипт Delete Market Dependencies рассматривает удаление рынков.",
                    "updated": 1645168678498
                },
                {
                    "language": "TR",
                    "text": "Ustalar süper komut dosyaları hiyerarşisinin mevcut uygulamasında örnek olarak kullanabileceğiniz iki ana komut dosyası bulunmaktadır. Setup Market ana komut dosyası yeni bir market kurmak için gereken tüm adımlarla ilgilenirken, Delete Market Dependencies ana komut dosyası marketleri kaldırmakla ilgilenir.",
                    "updated": 1701087901843
                }
            ]
        }
    ]
}