{
    "topic": "User Profile",
    "pageNumber": 1,
    "type": "Building Your Profile",
    "definition": {
        "text": "Building your User Profile involves linking your Governance Address to your identity in Github.com, using the Profile Constructor. ",
        "updated": 1630067747645,
        "translations": [
            {
                "language": "RU",
                "text": "Создание вашего профиля пользователя User Profile включает в себя привязку вашего адреса управления Governance Address к вашей учетной записи в Github.com, используя конструктор профилей Profile Constructor.",
                "updated": 1638705526912
            },
            {
                "language": "ES",
                "text": "Construyendo tu User Profile implica vincular tu Governance Address a tu identidad en Github.com, utilizando el Profile Constructor.",
                "updated": 1682595702917
            },
            {
                "language": "TR",
                "text": "Kullanıcı Profilinizi oluşturmak, Profil Oluşturucu'yu (Profile Constructor) kullanarak Yönetim Adresinizi (Governance Address) Github.com'daki kimliğinize bağlamayı içerir.",
                "updated": 1645106256449
            },
            {
                "language": "DE",
                "text": "Die Erstellung Ihres Benutzerprofils (User Profile) beinhaltet die Verknüpfung Ihrer Governance-Adresse (Governance Address) mit Ihrer Identität in Github.com unter Verwendung des Profile Constructor.",
                "updated": 1682280973694
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This guide will get you up to speed in just a few minutes. This is what you’ll need (requirements):",
            "updated": 1630066775182,
            "translations": [
                {
                    "language": "RU",
                    "text": "Это руководство введет вас в курс дела всего за несколько минут. Это то, что вам понадобится (требования):",
                    "updated": 1638705547441
                },
                {
                    "language": "TR",
                    "text": "Bu kılavuz, birkaç dakika içinde hız kazanmanızı sağlayacaktır. İhtiyacınız olan şey (gereksinimler):",
                    "updated": 1645106314882
                },
                {
                    "language": "ES",
                    "text": "Esta guía te ayudará a ponerte al día en pocos minutos. Esto es lo que necesitarás (requisitos):",
                    "updated": 1682595717886
                },
                {
                    "language": "DE",
                    "text": "Mit dieser Anleitung sind Sie in wenigen Minuten startklar. Das werden Sie brauchen (Anforderungen):",
                    "updated": 1682280985667
                }
            ]
        },
        {
            "style": "List",
            "text": "Up-to-date software: the latest version of the Superalgos Platform in the Develop branch.",
            "updated": 1630067794445,
            "translations": [
                {
                    "language": "RU",
                    "text": "Актуальное программное обеспечение: последняя версия платформы Superalgos в ветке Develop.",
                    "updated": 1638705573108
                },
                {
                    "language": "ES",
                    "text": "Software actualizado: la última versión de la Plataforma Superalgos en la rama Develop.",
                    "updated": 1640974986926
                },
                {
                    "language": "TR",
                    "text": "Yazılımın Güncel Sürümü: Develop dalında Superalgos Platformunun en son sürümü.",
                    "updated": 1645106363304
                },
                {
                    "language": "DE",
                    "text": "Aktuelle Software: die neueste Version der Superalgos Platform im Develop -Zweig.",
                    "updated": 1682281009503
                }
            ]
        },
        {
            "style": "List",
            "text": "Prior knowledge: a basic understanding of how the Superalgos Platform works. If you haven't yet, make sure you do the tutorials in the Getting Started Tutorials Native Workspace before diving into the Governance Project.",
            "updated": 1630067826681,
            "translations": [
                {
                    "language": "RU",
                    "text": "Предварительные знания: базовое понимание того, как работает платформа Superalgos. Если вы еще этого не сделали, убедитесь, что вы изучили учебные материалы в рабочем пространстве подключаемого модуля Getting Started Tutorials Native Workspace , прежде чем погрузиться в проект управления Governance Project.",
                    "updated": 1638705588992
                },
                {
                    "language": "ES",
                    "text": "Conocimientos previos: conocimiento básico del funcionamiento de la Plataforma Superalgos. Si aún no lo has hecho, asegúrate de seguir los tutoriales en el Getting Started Tutorials Native Workspace antes de sumergirte en el Governance Project.",
                    "updated": 1682595753905
                },
                {
                    "language": "TR",
                    "text": "Ön bilgi: Superalgos Platformunun nasıl çalıştığına dair temel bir anlayış. Henüz yapmadıysanız, Yönetişim Projesine dalmadan önce Başlarken Öğreticiler Eklentisi Çalışma Alanındaki (Getting Started Tutorials Native Workspace) öğreticileri yaptığınızdan emin olun.",
                    "updated": 1645106428430
                },
                {
                    "language": "DE",
                    "text": "Vorkenntnisse: ein grundlegendes Verständnis für die Funktionsweise der Superalgos-Plattform. Wenn Sie das noch nicht getan haben, stellen Sie sicher, dass Sie die Tutorials im Getting Started Tutorials Native Workspace (Getting Started Tutorials Native Workspace ) durcharbeiten, bevor Sie sich mit dem Governance-Projekt beschäftigen.",
                    "updated": 1682281022028
                }
            ]
        },
        {
            "style": "List",
            "text": "Identity: your GitHub.com username.",
            "updated": 1630066924264,
            "translations": [
                {
                    "language": "RU",
                    "text": "Идентификация: ваше имя пользователя на GitHub.com.",
                    "updated": 1638705611232
                },
                {
                    "language": "ES",
                    "text": "Identidad: tu nombre de usuario de GitHub.com.",
                    "updated": 1682595762988
                },
                {
                    "language": "TR",
                    "text": "Kimlik: GitHub.com kullanıcı adınız.",
                    "updated": 1645106448971
                },
                {
                    "language": "DE",
                    "text": "Identität: Ihr GitHub.com-Benutzername.",
                    "updated": 1682281036385
                }
            ]
        },
        {
            "style": "List",
            "text": "Optional: Trust Wallet, or any wallet that may import a Binance Smart Chain (BSC) private key.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Необязательно: Trust Wallet или любой кошелек, который может импортировать закрытый ключ Binance Smart Chain (BSC).",
                    "updated": 1638705637928
                },
                {
                    "language": "ES",
                    "text": "Opcional: Trust Wallet o cualquier billetera que puedas importar una clave privada de Binance Smart Chain (BSC).",
                    "updated": 1682595770064
                },
                {
                    "language": "TR",
                    "text": "İsteğe Bağlı Olarak: Trust Wallet veya Binance Smart Chain (BSC) özel anahtarını içe aktarabilen herhangi bir cüzdan.",
                    "updated": 1645106482294
                },
                {
                    "language": "DE",
                    "text": "Optional: Trust Wallet oder eine beliebige Wallet, die einen Binance Smart Chain (BSC) Private Key importieren kann.",
                    "updated": 1682281046585
                }
            ]
        },
        {
            "style": "Success",
            "text": "The process described below is covered, step by step, in the Creating Your User Profile Tutorial. Doing the tutorial is highly recommended. If you do, then you do not need to follow the below instructions.",
            "updated": 1630067119898,
            "translations": [
                {
                    "language": "RU",
                    "text": "Описанный ниже процесс шаг за шагом описан в руководстве Creating Your User Profile Tutorial. Настоятельно рекомендуется пройти обучение. Если вы это сделали, то вам не нужно следовать приведенным ниже инструкциям.",
                    "updated": 1638705658357
                },
                {
                    "language": "ES",
                    "text": "El proceso que se describe a continuación se cubre en el Creating Your User Profile Tutorial. Es muy recomendable hacer el tutorial. Si lo haces, no es necesario que sigas las instrucciones a continuación.",
                    "updated": 1682595792629
                },
                {
                    "language": "TR",
                    "text": "Aşağıda açıklanan süreç, Kullanıcı Profilinizi Oluşturma Eğitiminde (Creating Your User Profile Tutorial) adım adım anlatılmaktadır. Öğreticiyi yapmak şiddetle tavsiye edilir. Bunu yaparsanız, aşağıdaki talimatları izlemeniz gerekmez.",
                    "updated": 1645106640338
                },
                {
                    "language": "DE",
                    "text": "Der im Folgenden beschriebene Vorgang wird Schritt für Schritt im Lernprogramm zum Erstellen Ihres Benutzerprofils (Creating Your User Profile Tutorial) beschrieben. Es wird dringend empfohlen, den Lehrgang zu absolvieren. Wenn Sie dies tun, brauchen Sie die folgenden Anweisungen nicht zu befolgen.",
                    "updated": 1682281079527
                }
            ]
        },
        {
            "style": "Title",
            "text": "Let’s Do This!",
            "translations": [
                {
                    "language": "RU",
                    "text": "Давай сделаем это!",
                    "updated": 1638705675315
                },
                {
                    "language": "TR",
                    "text": "Hadi Yapalım",
                    "updated": 1645106656040
                },
                {
                    "language": "ES",
                    "text": "Hagámoslo",
                    "updated": 1682595804253
                },
                {
                    "language": "DE",
                    "text": "Packen wir's an!",
                    "updated": 1682281088343
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "1. Load the Token Distribution Superalgos Native Workspace ",
            "translations": [
                {
                    "language": "RU",
                    "text": "1. Загрузите модуль Token Distribution Superalgos Native Workspace ",
                    "updated": 1638705693035
                },
                {
                    "language": "ES",
                    "text": "1. Cargue el espacio de trabajo del complemento Superalgos de distribución de tokens (Token Distribution Superalgos Native Workspace) ",
                    "updated": 1682595904895
                },
                {
                    "language": "TR",
                    "text": "1. Token Distribution Superalgos Native Workspace Eklentisini yükleyin.",
                    "updated": 1645106679051
                },
                {
                    "language": "DE",
                    "text": "Laden Sie den Arbeitsbereich für das Superalgos-Native Token Distribution",
                    "updated": 1682281095606
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may start with the Token Distribution Superalgos Native Workspace so that you may later interact with the top-level Superalgos Project definitions.",
            "updated": 1630435453964,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете начать с рабочего пространства плагина Token Distribution Superalgos Native Workspace , чтобы позже взаимодействовать с определениями верхнего уровня проекта Superalgos Project.",
                    "updated": 1638705889923
                },
                {
                    "language": "ES",
                    "text": "Puedes comenzar con el Native Workspace de distribución de tokens Superalgos para que luego pueda interactuar con el nivel superior de definiciones del Superalgos Project.",
                    "updated": 1640975408974
                },
                {
                    "language": "TR",
                    "text": "Daha sonra üst düzey Superalgos Projesi özellikleriyle etkileşime geçebilmek için Token Distribution Superalgos Native Workspace ile başlayabilirsiniz.",
                    "updated": 1645106733427
                },
                {
                    "language": "DE",
                    "text": "Sie können mit dem Superalgos-Native-Arbeitsbereich (Native Workspace ) für die Token-Verteilung beginnen, damit Sie später mit den Superalgos-Projektdefinitionen (Superalgos Project definitions) auf oberster Ebene interagieren können.",
                    "updated": 1682281109896
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "2. Spawn and Configure the Profile Constructor",
            "updated": 1630079965869,
            "translations": [
                {
                    "language": "RU",
                    "text": "2. 2. Создайте и настройте конструктор профиля Profile Constructor",
                    "updated": 1638705920631
                },
                {
                    "language": "ES",
                    "text": "2. Generar y configurar el constructor de perfiles",
                    "updated": 1682595920322
                },
                {
                    "language": "TR",
                    "text": "2. Profil Oluşturucuyu Oluşturun ve Yapılandırın",
                    "updated": 1645106937529
                },
                {
                    "language": "DE",
                    "text": "2. Erzeugen und Konfigurieren des Profilkonstrukteurs",
                    "updated": 1682281126313
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Profile Constructor is the device you will use to link your Github.com identity with the BSC address where you hold or plan to hold your Superalgos SA Tokens. We call it your Governance Address.",
            "updated": 1630080366604,
            "translations": [
                {
                    "language": "RU",
                    "text": "Profile Constructor - это устройство, которое вы будете использовать, чтобы связать вашу учетную запись на Github.com с адресом BSC, на котором вы держите или планируете хранить свои токены Superalgos SA. Мы называем это вашим управленческим адресом Governance Address.",
                    "updated": 1638706238530
                },
                {
                    "language": "ES",
                    "text": "El Profile Constructor es el dispositivo que utilizarás para vincular tu identidad de Github.com con la dirección BSC donde tienes o planeas guardar tus Tokens de Superalgos SA. Lo llamamos tu Governance Address.",
                    "updated": 1682596026879
                },
                {
                    "language": "TR",
                    "text": "Profil Oluşturucu (Profile Constructor ), Github.com kimliğinizi Superalgos SA Jetonlarınızı tuttuğunuz veya tutmayı planladığınız BSC adresiyle ilişkilendirmek için kullanacağınız cihazdır. Biz buna Yönetim Adresiniz (Governance Address) diyoruz.",
                    "updated": 1645107637902
                },
                {
                    "language": "DE",
                    "text": "Der Profile Constructor ist das Gerät, mit dem Sie Ihre Github.com-Identität mit der BSC-Adresse verknüpfen, unter der Sie Ihre Superalgos SA-Token halten oder zu halten gedenken. Wir nennen es Ihre Governance-Adresse (Governance Address).",
                    "updated": 1682281136186
                }
            ]
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Governance Address->Content"
        },
        {
            "style": "Important",
            "text": "Once you are done setting up the address, you need to back up your private key in whatever way you desire, and delete the Profile Constructor so that the private key is removed from the Workspace. No worries… I’ll remind you of all this when the time comes.",
            "translations": [
                {
                    "language": "RU",
                    "text": "После того, как вы закончите настройку адреса, вам необходимо создать резервную копию вашего закрытого ключа любым способом и удалить конструктор профиля Profile Constructor, чтобы закрытый ключ был удален из рабочего пространства Workspace. Не беспокойтесь ... Я вам обо всем этом напомню, когда придет время.",
                    "updated": 1639119004963
                },
                {
                    "language": "ES",
                    "text": "Una vez que hayas terminado de configurar la dirección, debes hacer una copia de seguridad de tu clave privada de la forma que desees y eliminarla del Profile Constructor para que la clave privada se elimine del Workspace. No te preocupes... te recordaré todo esto cuando llegue el momento.",
                    "updated": 1682596106278
                },
                {
                    "language": "TR",
                    "text": "Adresi ayarlamayı bitirdikten sonra, özel anahtarınızı istediğiniz şekilde yedeklemeniz ve Özel anahtarın Çalışma Alanından kaldırılması için Profil Oluşturucu'yu silmeniz gerekir. Merak etme… Zamanı geldiğinde tüm bunları sana hatırlatacağım.",
                    "updated": 1645107664433
                },
                {
                    "language": "DE",
                    "text": "Sobald Sie mit der Einrichtung der Adresse fertig sind, müssen Sie Ihren privaten Schlüssel auf die von Ihnen gewünschte Weise sichern und den Profile Constructor löschen, damit der private Schlüssel aus dem Arbeitsbereich (Workspace) entfernt wird. Keine Sorge... Ich werde Sie zu gegebener Zeit an all das erinnern.",
                    "updated": 1682281160951
                }
            ]
        },
        {
            "style": "List",
            "text": "Go to the Governance Project hierarchy and select Add Profile Constructor on the menu.",
            "updated": 1630079909997,
            "translations": [
                {
                    "language": "RU",
                    "text": "Перейдите в иерархию Governance Project и выберите в меню Add Profile Constructor.",
                    "updated": 1639119096275
                },
                {
                    "language": "ES",
                    "text": "Ve a la jerarquía Governance Project y selecciona Add Profile Constructor en el menú.",
                    "updated": 1682596225469
                },
                {
                    "language": "TR",
                    "text": "Yönetişim Projesi hiyerarşisine (Governance Project)  gidin ve menüden Profil Oluşturucu Ekle'yi (Add Profile Constructor) seçin.",
                    "updated": 1645107706235
                },
                {
                    "language": "DE",
                    "text": "Gehen Sie zur Hierarchie des Governance Project und wählen Sie im Menü Profilkonstrukteur hinzufügen.",
                    "updated": 1682281174744
                }
            ]
        },
        {
            "style": "List",
            "text": "Access the configuration and enter your GitHub.com username.",
            "updated": 1630080009714,
            "translations": [
                {
                    "language": "RU",
                    "text": "Войдите в конфигурацию и введите свое имя пользователя GitHub.com.",
                    "updated": 1639119120828
                },
                {
                    "language": "ES",
                    "text": "Accede a la configuración e ingresa tu nombre de usuario de GitHub.com.",
                    "updated": 1640975652096
                },
                {
                    "language": "TR",
                    "text": "Yapılandırmayı açın (Configure) ve GitHub.com kullanıcı adınızı girin.",
                    "updated": 1645107792239
                },
                {
                    "language": "DE",
                    "text": "Rufen Sie die Konfiguration auf und geben Sie Ihren GitHub.com-Benutzernamen ein.",
                    "updated": 1682281183464
                }
            ]
        },
        {
            "style": "List",
            "text": "If you already have a Superalgos SA Token address, you may enter the associated mnemonic phrase to verify the ownership of the address. If you don't have an address, leave the mnemonic property empty so that the Profile Constructor creates a new address for you.",
            "updated": 1630080154442,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если у вас уже есть адрес токена Superalgos SA Token , вы можете ввести соответствующую мнемоническую фразу, чтобы подтвердить право собственности на адрес. Если у вас нет адреса, оставьте мнемоническое свойство пустым, чтобы конструктор профиля Profile Constructor создал для вас новый адрес.",
                    "updated": 1639119426332
                },
                {
                    "language": "ES",
                    "text": "Si ya tienes una Superalgos SA Token address, puedes ingresar la frase mnemotécnica asociada para verificar la propiedad de la dirección. Si no tienes una dirección, deja la propiedad mnemotécnica vacía para que el Profile Constructor te cree una nueva dirección.",
                    "updated": 1682596246169
                },
                {
                    "language": "TR",
                    "text": "Halihazırda bir Superalgos SA Token adresiniz varsa, adresin sahipliğini doğrulamak için mnemonic ifadeyi girebilirsiniz. Bir adresiniz yoksa, Profil Oluşturucu'nun sizin adınıza yeni bir adres oluşturması için mnemonic özelliğini boş bırakın.",
                    "updated": 1645107881873
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie bereits eine Superalgos SA Token address haben, können Sie die zugehörige mnemonische Phrase eingeben, um den Besitz der Adresse zu verifizieren. Wenn Sie keine Adresse haben, lassen Sie die mnemonische Eigenschaft leer, damit der Profile Constructor eine neue Adresse für Sie erstellt.",
                    "updated": 1682281192948
                }
            ]
        },
        {
            "style": "List",
            "text": "Go ahead and select Add Profile Constructor too.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Продолжайте и тоже выберите Add Profile Constructor.",
                    "updated": 1639119683507
                },
                {
                    "language": "ES",
                    "text": "Continúa y selecciona Add Profile Constructor también.",
                    "updated": 1682596255878
                },
                {
                    "language": "TR",
                    "text": "Bu bilgileri doldurduktan sonra yapılandırıcı penceresinden çıkın. Sizin için otomatik kaydedilecektir.",
                    "updated": 1645107974033
                },
                {
                    "language": "DE",
                    "text": "Fahren Sie fort und wählen Sie ebenfalls Profilkonstrukteur hinzufügen.",
                    "updated": 1682281202476
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "3. Build Your Profile",
            "translations": [
                {
                    "language": "RU",
                    "text": "3. Создайте свой профиль",
                    "updated": 1639119719570
                },
                {
                    "language": "TR",
                    "text": "3. Profilinizi yapılandırın",
                    "updated": 1645107992392
                },
                {
                    "language": "ES",
                    "text": "3. Construye tu perfil",
                    "updated": 1682596272283
                },
                {
                    "language": "DE",
                    "text": "3. Erstellen Sie Ihr Profil",
                    "updated": 1682281211763
                }
            ]
        },
        {
            "style": "Text",
            "text": "The next step involves building the profile, but before you do so, let me explain what the process involves:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Следующий шаг включает построение профиля, но прежде чем вы это сделаете, позвольте мне объяснить, что включает в себя этот процесс:",
                    "updated": 1639120608949
                },
                {
                    "language": "ES",
                    "text": "El siguiente paso consiste en construir el perfil, pero antes de hacerlo, déjame explicarte en qué consiste el proceso:",
                    "updated": 1682596286528
                },
                {
                    "language": "TR",
                    "text": "Bir sonraki adım, profili oluşturmayı içerir, ancak bunu yapmadan önce, sürecin ne olduğunu açıklamama izin verin:",
                    "updated": 1645108018650
                },
                {
                    "language": "DE",
                    "text": "Der nächste Schritt besteht in der Erstellung des Profils, aber bevor Sie das tun, möchte ich Ihnen erklären, wie der Prozess abläuft:",
                    "updated": 1682281221183
                }
            ]
        },
        {
            "style": "List",
            "text": "If you didn't enter a mnemonic, a BSC address and the corresponding private key will be generated.",
            "updated": 1630080750557,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы не ввели мнемонику, будут сгенерированы адрес BSC и соответствующий закрытый ключ.",
                    "updated": 1639120625911
                },
                {
                    "language": "ES",
                    "text": "Si no ingresaste un mnemónico, se generará una dirección BSC y la clave privada correspondiente.",
                    "updated": 1682596296565
                },
                {
                    "language": "TR",
                    "text": "mnemonic girmediyseniz, bir BSC adresi ve bu adresle ilgili özel anahtar oluşturulacaktır.",
                    "updated": 1645108069938
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie keine Mnemonik eingegeben haben, werden eine BSC-Adresse und der entsprechende private Schlüssel generiert.",
                    "updated": 1682281229049
                }
            ]
        },
        {
            "style": "List",
            "text": "A cryptographic message with your GitHub.com username will be signed with the private key corresponding to the address just generated or the mnemonic you entered. This message will be stored in your User Profile so that we may authenticate it comes from you once you submit your profile as a Plugin in the Governance Project.",
            "updated": 1630080772975,
            "translations": [
                {
                    "language": "RU",
                    "text": "Криптографическое сообщение с вашим именем пользователя GitHub.com будет подписано закрытым ключом, соответствующим только что сгенерированному адресу или введенной вами мнемонике. Это сообщение будет храниться в вашем профиле пользователя User Profile, чтобы мы могли подтвердить, что оно исходит от вас после того, как вы отправите свой профиль в качестве плагина в проект управления Governance Project.",
                    "updated": 1639120761084
                },
                {
                    "language": "ES",
                    "text": "Se firmará un mensaje criptográfico con tu nombre de usuario de GitHub.com con la clave privada correspondiente a la dirección recién generada o el mnemónico que ingresaste. Este mensaje se almacenará en tu User Profile para que podamos autenticar que proviene de ti una vez que envíes tu perfil como un complemento en el Governance Project.",
                    "updated": 1682596328860
                },
                {
                    "language": "TR",
                    "text": "GitHub.com kullanıcı adınızı içeren bir kriptografik mesaj, az önce oluşturulan adrese veya girdiğiniz anımsatıcıya karşılık gelen özel anahtarla imzalanacaktır. Bu mesaj, Profilinizi Yönetişim Projesinde bir eklenti olarak gönderdiğinizde sizden geldiğini doğrulayabilmemiz için Kullanıcı Profilinizde saklanacaktır.",
                    "updated": 1645108090908
                },
                {
                    "language": "DE",
                    "text": "Eine kryptografische Nachricht mit Ihrem GitHub.com-Benutzernamen wird mit dem privaten Schlüssel signiert, der der soeben generierten Adresse oder dem von Ihnen eingegebenen Mnemonik entspricht. Diese Nachricht wird in Ihrem Benutzerprofil (User Profile) gespeichert, damit wir authentifizieren können, dass sie von Ihnen stammt, sobald Sie Ihr Profil als Plugin im Governance-Projekt (Governance Project) einreichen.",
                    "updated": 1682281237455
                }
            ]
        },
        {
            "style": "Text",
            "text": "Ok… let’s do this!",
            "translations": [
                {
                    "language": "RU",
                    "text": "Хорошо ... давай сделаем это!",
                    "updated": 1639120777219
                },
                {
                    "language": "ES",
                    "text": "Ok ... hagamos esto!",
                    "updated": 1640976022711
                },
                {
                    "language": "TR",
                    "text": "Tamam hadi yapalım!",
                    "updated": 1645108102339
                },
                {
                    "language": "DE",
                    "text": "Okay... los geht's!",
                    "updated": 1682281244243
                }
            ]
        },
        {
            "style": "List",
            "text": "Access the menu of the Profile Constructor and click the Build Profile option. Click again to confirm the operation.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Войдите в меню Profile Constructor и выберите опцию Build Profile. Щелкните еще раз, чтобы подтвердить операцию.",
                    "updated": 1639120856856
                },
                {
                    "language": "ES",
                    "text": "Accede al menú del Profile Constructor y haz clic en la opción Build Profile. Haz clic nuevamente para confirmar la operación.",
                    "updated": 1682596347680
                },
                {
                    "language": "TR",
                    "text": "Profil Oluşturucu menüsüne erişin ve Profil Oluştur seçeneğine tıklayın. İşlemi onaylamak için tekrar tıklayın.",
                    "updated": 1645108122610
                },
                {
                    "language": "DE",
                    "text": "Rufen Sie das Menü des Profilkonstrukteurs (Profile Constructor) auf und klicken Sie auf die Option Profil erstellen. Klicken Sie erneut, um den Vorgang zu bestätigen.",
                    "updated": 1682281254375
                }
            ]
        },
        {
            "style": "Text",
            "text": "That's it!",
            "updated": 1630082601712,
            "translations": [
                {
                    "language": "ES",
                    "text": "Eso es!",
                    "updated": 1640976107632
                },
                {
                    "language": "DE",
                    "text": "Das war's!",
                    "updated": 1682281262255
                }
            ]
        },
        {
            "style": "Note",
            "text": "If you already have tokens in your Governance Address, you should see the Blockchain Power coming into your User Profile. It may take a minute or so for the system to get the data from the blockchain. If you have no tokens, then you will get zero Blockchain Power.",
            "updated": 1630082879935,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если у вас уже есть токены в вашем адресе управления Governance Address, вы должны увидеть, что Blockchain Power входит в ваш профиль пользователя User Profile. Системе может потребоваться около минуты для получения данных из цепочки блоков. Если у вас нет токенов, вы получите нулевой Blockchain Power.",
                    "updated": 1639120978871
                },
                {
                    "language": "ES",
                    "text": "Si ya tiene tokens en tu Governance Address, deberías ver el poder de Blockchain entrando en tu User Profile. El sistema puede tardar aproximadamente un minuto en obtener los datos de la cadena de bloques. Si no tiene tokens, obtendrás cero Blockchain Power.",
                    "updated": 1682596371886
                },
                {
                    "language": "TR",
                    "text": "Yönetim Adresinizde zaten jetonlarınız varsa, Kullanıcı Profilinize Blockchain Gücünün geldiğini görmelisiniz. Sistemin blok zincirinden veri alması bir dakika kadar sürebilir. Jetonunuz yoksa, sıfır Blockchain Gücü alacaksınız.",
                    "updated": 1645108154481
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie bereits Token in Ihrer Governance Address haben, sollten Sie sehen, dass die Blockchain-Power in Ihrem Benutzerprofil (User Profile) erscheint. Es kann etwa eine Minute dauern, bis das System die Daten aus der Blockchain abruft. Wenn Sie keine Token haben, erhalten Sie keine Blockchain-Power.",
                    "updated": 1682281269591
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Governance/Docs/building-profile/building-profile-07.png"
        },
        {
            "style": "Title",
            "text": "Check Your Configurations",
            "updated": 1630082922435,
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверьте свои конфигурации",
                    "updated": 1639120996979
                },
                {
                    "language": "TR",
                    "text": "Yapılandırmanızı kontrol edin",
                    "updated": 1645108168232
                },
                {
                    "language": "ES",
                    "text": "Comprueba tus configuraciones",
                    "updated": 1682596392350
                },
                {
                    "language": "DE",
                    "text": "Überprüfen Sie Ihre Konfigurationen",
                    "updated": 1682281278695
                }
            ]
        },
        {
            "style": "Text",
            "text": "Now, take a minute to check the configuration of the User Profile node. You should see a message similar to the one below:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Теперь найдите минутку, чтобы проверить конфигурацию узла профиля пользователя User Profile. Вы должны увидеть сообщение, подобное приведенному ниже:",
                    "updated": 1639121054881
                },
                {
                    "language": "ES",
                    "text": "Ahora, tóma un minuto para comprobar la configuración del nodo User Profile. Deberías ver un mensaje similar al siguiente:",
                    "updated": 1682596402700
                },
                {
                    "language": "TR",
                    "text": "Şimdi, Kullanıcı Profili düğümünün yapılandırmasını kontrol etmek için bir dakikanızı ayırın. Aşağıdakine benzer bir mesaj görmelisiniz:",
                    "updated": 1645108184516
                },
                {
                    "language": "DE",
                    "text": "Nehmen Sie sich nun eine Minute Zeit, um die Konfiguration des Knotens Benutzerprofil (User Profile) zu überprüfen. Sie sollten eine ähnliche Meldung wie die folgende sehen:",
                    "updated": 1682281290725
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n    \"signature\": {\n        \"message\": \"your-github-username\",\n        \"messageHash\": \"0xbb06ac085e61117b629bda325683fe7c15bd286ccf830393fc95211964f43ecb\",\n        \"v\": \"0x1c\",\n        \"r\": \"0xe513bfb3e6ca55e782a9c1947164243b49f577f3534c3495f935917de8da3c6c\",\n        \"s\": \"0x552578693365057338b081ed2dff2de8a268f56714c4265955627ab8eb07f671\",\n        \"signature\": \"0xe513bfb3e6ca55e782a9c1947164243b49f577f3534c3495f935917de8da3c6c552578693365057338b081ed2dff2de8a268f56714c4265955627ab8eb07f6711c\"\n    }\n}",
            "updated": 1624722387880
        },
        {
            "style": "Text",
            "text": "This is how the governance system will know that this User Profile belongs to the private key that signed the message, which in turn belongs to the address that will hold the tokens that confer your profile with Token Power.",
            "updated": 1630080906578,
            "translations": [
                {
                    "language": "RU",
                    "text": "Таким образом система управления узнает, что этот профиль пользователя принадлежит закрытому ключу, подписавшему сообщение, который, в свою очередь, принадлежит адресу, на котором будут храниться токены, присваивающие вашему профилю Token Power.",
                    "updated": 1639121096766
                },
                {
                    "language": "ES",
                    "text": "Así es como el sistema de gobernanza sabrá que este User Profile pertenece a la clave privada que firmó el mensaje, que a su vez pertenece a la dirección que albergará los tokens que confieren tu perfil con Token Power",
                    "updated": 1682596457251
                },
                {
                    "language": "TR",
                    "text": "Yönetim sistemi bu şekilde, Kullanıcı Profilinin (User Profile) mesajı imzalayan özel anahtara ait olduğunu ve bunun da profilinize Token Gücü veren Tokenleri tutacak adrese ait olduğunu bilecektir.",
                    "updated": 1645108270008
                },
                {
                    "language": "DE",
                    "text": "Auf diese Weise weiß das Governance-System, dass dieses Benutzerprofil (User Profile) zu dem privaten Schlüssel gehört, mit dem die Nachricht signiert wurde, der wiederum zu der Adresse gehört, die die Token enthält, die Ihrem Profil die Token Power verleihen.",
                    "updated": 1682281535620
                }
            ]
        },
        {
            "style": "Title",
            "text": "Back-Up Your Keys",
            "updated": 1630083527720,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сделайте резервную копию ваших ключей",
                    "updated": 1639121109072
                },
                {
                    "language": "TR",
                    "text": "Anahtarınızı yedekleyin",
                    "updated": 1645108285155
                },
                {
                    "language": "ES",
                    "text": "Haz copias de seguridad de tus llaves",
                    "updated": 1682596475972
                },
                {
                    "language": "DE",
                    "text": "Sichern Sie Ihren Schlüssel",
                    "updated": 1682281546223
                }
            ]
        },
        {
            "style": "Note",
            "text": "If you used a mnemonic to authenticate an existing address, you may safely disregard what comes next.",
            "updated": 1630083542691,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы использовали мнемонику для аутентификации существующего адреса, вы можете спокойно не обращать внимания на то, что будет дальше.",
                    "updated": 1639121134445
                },
                {
                    "language": "ES",
                    "text": "Si usaste un mnemónico para autenticar una dirección existente, puedes ignorar lo que viene a continuación.",
                    "updated": 1682596492453
                },
                {
                    "language": "TR",
                    "text": "Mevcut bir adresin kimliğini doğrulamak için bir anımsatıcı kullandıysanız, bir sonraki adımı güvenle göz ardı edebilirsiniz.",
                    "updated": 1645108490254
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie eine Mnemonik verwendet haben, um eine bestehende Adresse zu authentifizieren, können Sie die folgenden Schritte getrost ignorieren.",
                    "updated": 1682281554884
                }
            ]
        },
        {
            "style": "Warning",
            "text": "This is very important! If you chose to generate a new address, you must back up your private key! Later on, you will hold Superalgos SA Tokens in this address. Before you do that, you must safely store the private key that you will use to access the address.",
            "updated": 1630083582536,
            "translations": [
                {
                    "language": "RU",
                    "text": "Это очень важно! Если вы решили сгенерировать новый адрес, вы должны создать резервную копию своего закрытого ключа! Позже по этому адресу вы будете хранить токены Superalgos SA Tokens. Перед тем, как сделать это, вы должны безопасно сохранить закрытый ключ, который вы будете использовать для доступа к адресу.",
                    "updated": 1639121187554
                },
                {
                    "language": "ES",
                    "text": "¡Esto es muy importante! Si eliges generar una nueva dirección, ¡debes hacer una copia de seguridad de tu clave privada! Posteriormente, tendrás los Tokens de Superalgos SA en esta dirección. Antes de hacerlo, debes almacenar de forma segura la clave privada que utilizarás para acceder a la dirección.",
                    "updated": 1682596532098
                },
                {
                    "language": "TR",
                    "text": "Bu çok önemli! Yeni bir adres oluşturmayı seçtiyseniz, özel anahtarınızı yedeklemelisiniz! Daha sonra Superalgos SA Jetonlarını bu adreste tutacaksınız. Bunu yapmadan önce, adrese erişmek için kullanacağınız özel anahtarı (private key) güvenli bir şekilde saklamanız gerekir.",
                    "updated": 1645108552391
                },
                {
                    "language": "DE",
                    "text": "Dies ist sehr wichtig! Wenn Sie sich entschieden haben, eine neue Adresse zu generieren, müssen Sie Ihren privaten Schlüssel sichern! Später werden Sie Superalgos SA Token in dieser Adresse halten. Bevor Sie das tun, müssen Sie den privaten Schlüssel, mit dem Sie auf die Adresse zugreifen werden, sicher aufbewahren.",
                    "updated": 1682281581167
                }
            ]
        },
        {
            "style": "Important",
            "text": "At this point, Superalgos doesn’t offer a built-in solution to securely back up your private keys. All the system does at this point is create a BSC address / private key pair and deliver it in the configuration of the Profile Constructor node. It is up to you to decide how you are going to handle this sensitive information.",
            "updated": 1630083613308,
            "translations": [
                {
                    "language": "RU",
                    "text": "На данный момент Superalgos не предлагает встроенного решения для безопасного резервного копирования ваших закрытых ключей. Все, что система делает на этом этапе, - это создает пару адрес BSC / закрытый ключ и доставляет ее в конфигурации узла Profile Constructor. Вам решать, как вы собираетесь обрабатывать эту конфиденциальную информацию.",
                    "updated": 1639121302011
                },
                {
                    "language": "ES",
                    "text": "En este punto, Superalgos no ofrece una solución integrada para realizar copias de seguridad de tus claves privadas de forma segura. Todo lo que hace el sistema en este punto es crear un par de dirección BSC / clave privada y entregarlo en la configuración del nodo Profile Constructor. Depende de ti decidir cómo vas a manejar esta información confidencial.",
                    "updated": 1682596559251
                },
                {
                    "language": "TR",
                    "text": "Bu noktada Superalgos, özel anahtarlarınızı güvenli bir şekilde yedeklemek için yerleşik bir çözüm sunmaz. Sistemin bu noktada yaptığı tek şey, bir BSC adresi / özel anahtar çifti oluşturmak ve bunu Profil Oluşturucu düğümünün konfigürasyonunda size teslim etmektir. Bu hassas bilgileri nasıl saklayacağına karar vermek size kalmıştır.",
                    "updated": 1645108605282
                },
                {
                    "language": "DE",
                    "text": "Zu diesem Zeitpunkt bietet Superalgos keine eingebaute Lösung zur sicheren Sicherung Ihrer privaten Schlüssel. Alles, was das System zu diesem Zeitpunkt tut, ist, ein BSC-Adress-/Privatschlüssel-Paar zu erstellen und es in der Konfiguration des Profile Constructor-Knotens (Profile Constructor node) bereitzustellen. Es liegt an Ihnen zu entscheiden, wie Sie mit diesen sensiblen Informationen umgehen wollen.",
                    "updated": 1682281678720
                }
            ]
        },
        {
            "style": "Text",
            "text": "Access the configuration of the Profile Constructor. You will find the address and private key in the following format, so that you may back up the information in whatever way you see fit.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Войдите в конфигурации Profile Constructor. Вы найдете адрес и закрытый ключ в следующем формате, чтобы вы могли создать резервную копию информации любым удобным для вас способом.",
                    "updated": 1639121390421
                },
                {
                    "language": "ES",
                    "text": "Accede a la configuración del Profile Constructor. Encontrarás la dirección y la clave privada en el siguiente formato, de modo que puedas realizar una copia de seguridad de la información de la forma que consideres conveniente.",
                    "updated": 1682596578877
                },
                {
                    "language": "TR",
                    "text": "Profil Oluşturucu yapılandırmasını (Profile Constructor) açın. Adresi ve özel anahtarı aşağıdaki biçimde bulacaksınız, böylece bilgileri uygun gördüğünüz şekilde yedekleyebilirsiniz.",
                    "updated": 1645108786958
                },
                {
                    "language": "DE",
                    "text": "Rufen Sie die Konfiguration des Profile Constructor auf. Sie finden die Adresse und den privaten Schlüssel in folgendem Format, so dass Sie die Informationen auf die von Ihnen gewünschte Weise sichern können.",
                    "updated": 1682281691618
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n    \"githubUsername\": \"your-github-username\",\n    \"address\": \"0x840B9F33bA8aad161E44b0BA181d7c1C16a0a01c\",\n    \"privateKey\": \"0x60af9fbb54c48c238a91564e92a3b383a5d87efe82388ac96d98a67e249df427\"\n}",
            "updated": 1624722475127
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Delete the Constructor",
            "updated": 1630083196550,
            "translations": [
                {
                    "language": "RU",
                    "text": "Удалите конструктор",
                    "updated": 1639121409096
                },
                {
                    "language": "TR",
                    "text": "Profil oluşturucuyu silin",
                    "updated": 1645108908647
                },
                {
                    "language": "ES",
                    "text": "Borrar el constructor",
                    "updated": 1682596591840
                },
                {
                    "language": "DE",
                    "text": "Löschen Sie den Konstruktor",
                    "updated": 1682281699966
                }
            ]
        },
        {
            "style": "Warning",
            "text": "Once you are satisfied with your backup of the private key, or if you used a mnemonic of an existing address, you must delete the Profile Constructor node! It is not safe to store your private key at the Workspace, as you may accidentally submit it to GitHub.com with one of your contributions. Also, remember that workspaces are saved on disk as unencrypted JSON files, with no security whatsoever.",
            "updated": 1630083271674,
            "translations": [
                {
                    "language": "RU",
                    "text": "Как только вы убедитесь, что создали резервную копию закрытого ключа или если вы использовали мнемонику существующего адреса, вы должны удалить узел Profile Constructor! Хранить ваш закрытый ключ в рабочем пространстве небезопасно, так как вы можете случайно отправить его на GitHub.com вместе с одним из ваших вкладов. Также, помните, что рабочие пространства сохраняются на диске в виде незашифрованных файлов JSON без какой-либо защиты.",
                    "updated": 1639121598233
                },
                {
                    "language": "ES",
                    "text": "Una vez que estés satisfecho con tu copia de seguridad de la clave privada, o si utilizaste un mnemónico de una dirección existente, debes eliminarla del nodo Profile Constructor! No es seguro almacenar tu clave privada en el Workspace, ya que puedes enviarlo accidentalmente a GitHub.com con una de tus contribuciones. Además, recuerda que los espacios de trabajo se guardan en el disco como archivos JSON sin cifrar, sin ningún tipo de seguridad.",
                    "updated": 1682596628801
                },
                {
                    "language": "TR",
                    "text": "Özel anahtarın yedeklediğinizden eminseniz veya mevcut bir adresin mnemonic'ğini kullandıysanız, Profil Oluşturucu düğümünü (Profile Constructor) silmelisiniz! Katkılarınızdan biriyle yanlışlıkla GitHub.com'a gönderebileceğiniz için özel anahtarınızı Çalışma Alanında saklamak güvenli değildir. Ayrıca, çalışma alanlarının hiçbir güvenlik olmaksızın diske şifrelenmemiş JSON dosyaları olarak kaydedildiğini unutmayın.",
                    "updated": 1645108884012
                },
                {
                    "language": "DE",
                    "text": "Sobald Sie mit Ihrer Sicherung des privaten Schlüssels zufrieden sind oder eine Eselsbrücke für eine bestehende Adresse verwendet haben, müssen Sie den Knoten Profilkonstrukteur (Profile Constructor node) löschen! Es ist nicht sicher, Ihren privaten Schlüssel im Arbeitsbereich (Workspace) zu speichern, da Sie ihn versehentlich mit einem Ihrer Beiträge an GitHub.com übermitteln könnten. Denken Sie auch daran, dass Arbeitsbereiche auf der Festplatte als unverschlüsselte JSON-Dateien gespeichert werden, die keinerlei Sicherheit bieten.",
                    "updated": 1682281711528
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "Import Private Key in a Wallet",
            "updated": 1630083092448
        },
        {
            "style": "Title",
            "text": "Import Private Key in a Wallet",
            "translations": [
                {
                    "language": "RU",
                    "text": "Импортируйте закрытый ключ в кошелек",
                    "updated": 1639121758029
                },
                {
                    "language": "TR",
                    "text": "Özel Anahtarı Cüzdana Aktarın",
                    "updated": 1645108990759
                },
                {
                    "language": "ES",
                    "text": "Importar clave privada en una cartera",
                    "updated": 1682596640767
                },
                {
                    "language": "DE",
                    "text": "Private Key in eine Wallet importieren",
                    "updated": 1682281720295
                }
            ]
        },
        {
            "style": "Text",
            "text": "This step is not required for interacting with governance, however, we’ll cover it as you will, most likely, want to do it at some point, and it is recommended anyway, even if not strictly necessary.",
            "updated": 1630435748864,
            "translations": [
                {
                    "language": "RU",
                    "text": "Этот шаг не требуется для взаимодействия с управлением, однако мы рассмотрим его, поскольку вы, скорее всего, захотите это сделать в какой-то момент, и в любом случае рекомендуется, даже если это не является строго необходимым.",
                    "updated": 1639121800996
                },
                {
                    "language": "ES",
                    "text": "Este paso no es necesario para interactuar con la gobernanza, sin embargo, lo cubriremos ya que, muy probablemente, desees hacerlo en algún momento, y se recomienda de todos modos, incluso si no es estrictamente necesario.",
                    "updated": 1682596651109
                },
                {
                    "language": "TR",
                    "text": "Bu adım yönetişim ile etkileşim için gerekli değildir, ancak büyük olasılıkla bir noktada yapmak isteyeceğiniz için bu adımı ele alacağız ve kesinlikle gerekli olmasa bile yine de önerilir.",
                    "updated": 1645109010343
                },
                {
                    "language": "DE",
                    "text": "Dieser Schritt ist für die Interaktion mit der Governance nicht erforderlich, wird aber dennoch behandelt, da Sie ihn höchstwahrscheinlich irgendwann durchführen möchten und er ohnehin empfohlen wird, auch wenn er nicht unbedingt notwendig ist.",
                    "updated": 1682281727366
                }
            ]
        },
        {
            "style": "Note",
            "text": "This step is relevant only if you created a new BSC address. If instead, you entered the mnemonic of an existing address, then you may safely skip this part.",
            "updated": 1630083638851,
            "translations": [
                {
                    "language": "RU",
                    "text": "Этот шаг актуален только в том случае, если вы создали новый адрес BSC. Если вместо этого вы ввели мнемонику существующего адреса, то можете спокойно пропустить эту часть.",
                    "updated": 1639121818165
                },
                {
                    "language": "ES",
                    "text": "Este paso es relevante solo si creaste una nueva dirección BSC. Si, en cambio, ingresaste el mnemónico de una dirección existente, puedes omitir esta parte con seguridad.",
                    "updated": 1682596674971
                },
                {
                    "language": "TR",
                    "text": "Bu adım, yalnızca yeni bir BSC adresi oluşturduysanız geçerlidir. Bunun yerine, mevcut bir adresin anımsatıcısını girdiyseniz, bu bölümü güvenle atlayabilirsiniz.Çünkü zaten bir cüzdanınız vardır.",
                    "updated": 1645109040819
                },
                {
                    "language": "DE",
                    "text": "Dieser Schritt ist für die Interaktion mit der Governance nicht erforderlich, wird aber dennoch behandelt, da Sie ihn höchstwahrscheinlich irgendwann durchführen möchten und er ohnehin empfohlen wird, auch wenn er nicht unbedingt notwendig ist.",
                    "updated": 1682281737811
                }
            ]
        },
        {
            "style": "Text",
            "text": "The idea is to import the address / private key you just created into a functional hardware or software wallet, so that you may control the tokens you will eventually send to this address.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Идея состоит в том, чтобы импортировать адрес / закрытый ключ, который вы только что создали, в функциональный аппаратный или программный кошелек, чтобы вы могли контролировать токены, которые вы в конечном итоге отправите на этот адрес.",
                    "updated": 1639121840964
                },
                {
                    "language": "ES",
                    "text": "La idea es importar la dirección / clave privada que acabsa de crear en una billetera funcional de hardware o software, para que puedas controlar los tokens que eventualmente enviarás a esta dirección.",
                    "updated": 1682596689774
                },
                {
                    "language": "TR",
                    "text": "Buradaki fikir, az önce oluşturduğunuz adresi / özel anahtarı işlevsel bir donanım veya yazılım cüzdanına aktarmaktır, böylece sonunda bu adrese göndereceğiniz jetonları kontrol edebilirsiniz.",
                    "updated": 1645109068299
                },
                {
                    "language": "DE",
                    "text": "Die Idee ist, die Adresse / den privaten Schlüssel, den Sie gerade erstellt haben, in eine funktionierende Hardware- oder Software-Brieftasche zu importieren, so dass Sie die Token kontrollieren können, die Sie schließlich an diese Adresse senden werden.",
                    "updated": 1682281753511
                }
            ]
        },
        {
            "style": "Text",
            "text": "This is not required to interact with governance, as all you need to do so is send Superalgos SA Tokens to the address. However, it is rather obvious that at some point you may want to move those tokens. You also want to make sure that you do indeed control the address before sending tokens there. So, let’s get on with it!",
            "translations": [
                {
                    "language": "RU",
                    "text": "Это не требуется для взаимодействия с управлением, так как все, что вам нужно сделать, это отправить токены Superalgos SA по указанному адресу. Однако довольно очевидно, что в какой-то момент вы можете захотеть переместить эти токены. Вы также хотите убедиться, что действительно контролируете адрес, прежде чем отправлять туда токены. Итак, давайте продолжим!",
                    "updated": 1639121876780
                },
                {
                    "language": "ES",
                    "text": "Esto no es necesario para interactuar con la gobernanza, ya que todo lo que necesita para hacerlo es enviar Tokens de Superalgos SA a la dirección. Sin embargo, es bastante obvio que en algún momento es posible que desees mover esos tokens. También debes asegurarte de controlar la dirección antes de enviar tokens allí. Entonces, ¡sigamos con esto!",
                    "updated": 1682596710959
                },
                {
                    "language": "TR",
                    "text": "Yönetişim ile etkileşim kurmak için bu adım gerekli değildir, çünkü yapmanız gereken tek şey Superalgos SA Jetonlarını adrese göndermektir. Ancak, bir noktada bu jetonları taşımak isteyebileceğiniz oldukça açık. Ayrıca, oraya jeton göndermeden önce adresi gerçekten kontrol ettiğinizden emin olmak istersiniz. Öyleyse devam edelim!",
                    "updated": 1645109118264
                },
                {
                    "language": "DE",
                    "text": "Dies ist nicht erforderlich, um mit Governance zu interagieren, da Sie lediglich Superalgos SA Token an die Adresse senden müssen. Es liegt jedoch auf der Hand, dass Sie diese Token irgendwann einmal verschieben möchten. Außerdem sollten Sie sicherstellen, dass Sie die Adresse tatsächlich kontrollieren, bevor Sie Token dorthin senden. Also, los geht's!",
                    "updated": 1682281763726
                }
            ]
        },
        {
            "style": "Success",
            "text": "We’ll cover how to import your private key into Trust Wallet. If you’re using any other wallet, you’ll need to figure out the equivalent process.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Мы расскажем, как импортировать ваш закрытый ключ в Trust Wallet. Если вы используете какой-либо другой кошелек, вам потребуется выполнить аналогичный процесс.",
                    "updated": 1639121892767
                },
                {
                    "language": "ES",
                    "text": "Cubriremos cómo importar tu clave privada a Trust Wallet. Si estás utilizando cualquier otra billetera, deberás averiguar el proceso equivalente.",
                    "updated": 1682596729322
                },
                {
                    "language": "TR",
                    "text": "Özel anahtarınızı Trust Wallet'a nasıl aktaracağınızı ele alacağız. Başka bir cüzdan kullanıyorsanız, aynı işlemi o cüzdan için nasıl yapacağınızı öğrenin.",
                    "updated": 1645109153986
                },
                {
                    "language": "DE",
                    "text": "Wir beschreiben, wie Sie Ihren privaten Schlüssel in Trust Wallet importieren. Wenn Sie eine andere Wallet verwenden, müssen Sie den entsprechenden Prozess herausfinden.",
                    "updated": 1682281771750
                }
            ]
        },
        {
            "style": "List",
            "text": "Click the “Settings” button.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Нажмите кнопку \"Settings\".",
                    "updated": 1639122079595
                },
                {
                    "language": "ES",
                    "text": "Haz clic en el botón \"Configuración\".",
                    "updated": 1682596736320
                },
                {
                    "language": "TR",
                    "text": "“Settings” butonuna tıklayın.",
                    "updated": 1645109187702
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf die Schaltfläche \"Settings\".",
                    "updated": 1682281779712
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Governance/Docs/building-profile/building-profile-01.png",
            "updated": 1624724741735
        },
        {
            "style": "List",
            "text": "Click on the “Wallets” option.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Нажмите на опцию “Wallets”.",
                    "updated": 1639121976304
                },
                {
                    "language": "ES",
                    "text": "Haga clic en la opción \"Carteras\".",
                    "updated": 1640976683448
                },
                {
                    "language": "TR",
                    "text": "“Cüzdanlar” se��eneğine tıklayın.",
                    "updated": 1645109217977
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf die Option \"Wallets\".",
                    "updated": 1682281790015
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Governance/Docs/building-profile/building-profile-02.png",
            "updated": 1624724761481
        },
        {
            "style": "List",
            "text": "Click on the plus sign ( + ) on the top-right corner.",
            "updated": 1624724858681,
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните значок плюса (+) в правом верхнем углу.",
                    "updated": 1639121993270
                },
                {
                    "language": "ES",
                    "text": "Haga clic en el signo más (+) en la esquina superior derecha.",
                    "updated": 1640976698173
                },
                {
                    "language": "TR",
                    "text": "Sağ üst köşedeki artı işaretine ( + ) tıklayın.",
                    "updated": 1645109233660
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf das Pluszeichen ( + ) in der oberen rechten Ecke.",
                    "updated": 1682281802238
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Governance/Docs/building-profile/building-profile-03.png",
            "updated": 1624724767511
        },
        {
            "style": "List",
            "text": "Click on the “I Already Have a Wallet” option.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Нажмите на опцию “I Already Have a Wallet”.",
                    "updated": 1639122022520
                },
                {
                    "language": "ES",
                    "text": "Haz clic en la opción \"Ya tengo una billetera\".",
                    "updated": 1682596753156
                },
                {
                    "language": "TR",
                    "text": "“Zaten Cüzdanım Var” seçeneğine tıklayın.",
                    "updated": 1645109249613
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf die Option \"I Already Have a Wallet\".",
                    "updated": 1682281812884
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Governance/Docs/building-profile/building-profile-04.png",
            "updated": 1624724776081
        },
        {
            "style": "List",
            "text": "Click “Smart Chain”.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Нажмите “Smart Chain”.",
                    "updated": 1639122035614
                },
                {
                    "language": "ES",
                    "text": "Haz Click en “Smart Chain”.",
                    "updated": 1682596761691
                },
                {
                    "language": "TR",
                    "text": "“Smart Chain”'e tıklayın.",
                    "updated": 1645109277283
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf \"Smart Chain\".",
                    "updated": 1682281823341
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Governance/Docs/building-profile/building-profile-05.png",
            "updated": 1624724782260
        },
        {
            "style": "List",
            "text": "Click on the “Private Key” tab.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните вкладку “Private Key”.",
                    "updated": 1639122063201
                },
                {
                    "language": "ES",
                    "text": "Haz clic en la pestaña \"Clave privada\".",
                    "updated": 1682596769902
                },
                {
                    "language": "TR",
                    "text": "“Private Key” sekmesine tıklayın",
                    "updated": 1645109305735
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf die Registerkarte \"Private Key\".",
                    "updated": 1682281853901
                }
            ]
        },
        {
            "style": "Note",
            "text": "We have no images of the previous and the next few screens as Trust Wallet won't allow capturing these pages.",
            "updated": 1630082470933,
            "translations": [
                {
                    "language": "RU",
                    "text": "У нас нет изображений предыдущего и нескольких следующих экранов, так как Trust Wallet не позволяет захватывать эти страницы.",
                    "updated": 1639122097953
                },
                {
                    "language": "ES",
                    "text": "No tenemos imágenes de las pantallas anteriores y siguientes, ya que Trust Wallet no permitirá capturar estas páginas.",
                    "updated": 1640976760133
                },
                {
                    "language": "TR",
                    "text": "Trust Wallet bu sayfaların ekran görüntüsünün alınmasına izin vermediğinden, önceki ve sonraki birkaç ekranın görüntüsü yoktur.",
                    "updated": 1645109336086
                },
                {
                    "language": "DE",
                    "text": "Wir haben keine Bilder des vorherigen und der nächsten Bildschirme, da Trust Wallet die Erfassung dieser Seiten nicht zulässt.",
                    "updated": 1682281872133
                }
            ]
        },
        {
            "style": "List",
            "text": "Copy your Private Key and click “PASTE”. I know, Trust Wallet runs on your mobile phone, so you need to figure out how to access your private key from your phone.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Скопируйте свой закрытый ключ и нажмите “PASTE”. Я знаю, что Trust Wallet работает на вашем мобильном телефоне, поэтому вам нужно выяснить, как получить доступ к своему закрытому ключу с вашего телефона.",
                    "updated": 1639122147590
                },
                {
                    "language": "ES",
                    "text": "Copia tu clave privada y haz clic en \"PEGAR\". Lo sé, Trust Wallet se ejecuta en tu teléfono móvil, por lo que debes averiguar cómo acceder a tu clave privada desde tu teléfono.",
                    "updated": 1682596797372
                },
                {
                    "language": "TR",
                    "text": "Private Key'inizi kopyalayın ve “Yapıştır”a tıklayın. Biliyorum, Trust Wallet cep telefonunuzda çalışıyor, bu yüzden telefonunuzdan özel anahtarınıza nasıl erişeceğinizi öğrenmeniz gerekiyor.",
                    "updated": 1645109372899
                },
                {
                    "language": "DE",
                    "text": "Kopieren Sie Ihren privaten Schlüssel und klicken Sie auf \"EINFÜGEN\". Ich weiß, dass Trust Wallet auf Ihrem Mobiltelefon läuft, also müssen Sie herausfinden, wie Sie von Ihrem Telefon aus auf Ihren privaten Schlüssel zugreifen können.",
                    "updated": 1682281883823
                }
            ]
        },
        {
            "style": "List",
            "text": "Enter a Name for the wallet (something along the lines of “Superalgos Profile”?) and click the “IMPORT” button.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Введите имя кошелька (что-то вроде “Superalgos Profile”?) И нажмите кнопку “IMPORT”.",
                    "updated": 1639122218943
                },
                {
                    "language": "ES",
                    "text": "Ingresa un Nombre para la billetera (algo parecido a “Perfil de Superalgos”?) Y haz clic en el botón “IMPORTAR”.",
                    "updated": 1682596807780
                },
                {
                    "language": "TR",
                    "text": "Cüzdan için bir Ad girin. Örneğin \"Superalgos Profili\" ya da sizin belirleyeceğiniz başka birşey) ve \"IMPORT\" düğmesini tıklayın.",
                    "updated": 1645109437872
                },
                {
                    "language": "DE",
                    "text": "Geben Sie einen Namen für die Wallet ein (etwa \"Superalgos Profile\"?) und klicken Sie auf die Schaltfläche \"IMPORT\".",
                    "updated": 1682281995086
                }
            ]
        },
        {
            "style": "List",
            "text": "You should get a message along the lines of “Your wallet was successfully created”. This means you have control of the address!",
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы должны получить сообщение вроде “Your wallet was successfully created”. Это означает, что вы контролируете адрес!",
                    "updated": 1639122267263
                },
                {
                    "language": "TR",
                    "text": "“Cüzdanınız başarıyla oluşturuldu” mesajı almalısınız. Bu, adresin kontrolünün sizde olduğu anlamına gelir!",
                    "updated": 1645109469698
                },
                {
                    "language": "ES",
                    "text": "Deberías recibir un mensaje del tipo \"Tu monedero se ha creado correctamente\". Esto significa que tienes el control de la dirección.",
                    "updated": 1682596823457
                },
                {
                    "language": "DE",
                    "text": "Sie sollten eine Meldung erhalten, die in etwa lautet \"Ihre Wallet wurde erfolgreich erstellt\". Das bedeutet, dass Sie die Kontrolle über die Adresse haben!",
                    "updated": 1682282011145
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Governance/Docs/building-profile/building-profile-06.png",
            "updated": 1624724788900
        }
    ]
}