{
    "topic": "Community Workspaces",
    "pageNumber": "11",
    "type": "Blank Template Native Workspace",
    "definition": {
        "text": "This is a minimalist workspace you may use to start from a clean slate.",
        "updated": 1622623695656,
        "translations": [
            {
                "language": "RU",
                "text": "Это минималистичное рабочее пространство, которое можно использовать, чтобы начать с чистого листа.",
                "updated": 1639056805363
            },
            {
                "language": "TR",
                "text": "Özet: Bu, temiz bir sayfadan başlamak için kullanabileceğiniz minimalist bir çalışma alanıdır.",
                "updated": 1644676397369
            },
            {
                "language": "DE",
                "text": "Dies ist ein minimalistischer Arbeitsbereich, den Sie für einen Neuanfang nutzen können.",
                "updated": 1688936685897
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Features",
            "updated": 1622623856267,
            "translations": [
                {
                    "language": "RU",
                    "text": "Особенности",
                    "updated": 1639056834037
                },
                {
                    "language": "TR",
                    "text": "Özellikler",
                    "updated": 1644676418222
                },
                {
                    "language": "DE",
                    "text": "Eigenschaften",
                    "updated": 1688936693644
                }
            ]
        },
        {
            "style": "List",
            "text": "The basic system components including the Masters Trading Mine and the Candles Data Mine.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Основные компоненты системы, включая Masters Trading Mine и Candles Data Mine.",
                    "updated": 1639056900855
                },
                {
                    "language": "TR",
                    "text": "Masters Trading Mine ve Candles Data Mine dahil olmak üzere temel sistem bileşenleri.",
                    "updated": 1644676430681
                },
                {
                    "language": "DE",
                    "text": "Die grundlegenden Systemkomponenten, einschließlich der Masters Trading Mine und der Candles Data Mine.",
                    "updated": 1688936709185
                }
            ]
        },
        {
            "style": "List",
            "text": "The BTC-USDT Market installed on the Binance exchange.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Рынок BTC-USDT установлена ​​на бирже Binance.",
                    "updated": 1639056945367
                },
                {
                    "language": "TR",
                    "text": "Binance borsasında kurulu BTC-USDT Piyasası.",
                    "updated": 1644676451630
                },
                {
                    "language": "DE",
                    "text": "Der BTC-USDT-Markt (BTC-USDT Market) ist auf der Binance-Börse installiert.",
                    "updated": 1688936735192
                }
            ]
        },
        {
            "style": "Success",
            "text": "You may switch to a different market by changing the configuration of the assets under the Exchange Assets node, and you may switch to a different exchange by changing the configuration of the Crypto Exchange node. You may find the configuration of other exchanges in the Tested Exchanges topic.",
            "updated": 1622626283772,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете переключиться на другой рынок, изменив конфигурацию активов в узле Exchange Assets, и вы можете переключиться на другую биржу, изменив конфигурацию узла Crypto Exchange. Вы можете найти конфигурацию других бирж в теме Tested Exchanges.",
                    "updated": 1639057074827
                },
                {
                    "language": "TR",
                    "text": "İpucu: Borsa Varlıkları ( Exchange Assets ) düğümü altındaki varlıkların konfigürasyonunu değiştirerek farklı bir borsaya, Kripto Borsası ( Crypto Exchange ) düğümünün konfigürasyonunu değiştirerek farklı bir borsaya geçiş yapabilirsiniz. Diğer borsaların yapılandırmasını Test Edilen Borsalar konusunda bulabilirsiniz.",
                    "updated": 1644676608101
                },
                {
                    "language": "DE",
                    "text": "Sie können zu einem anderen Markt wechseln, indem Sie die Konfiguration der Assets unter dem Knoten Exchange Assets ändern, und Sie können zu einer anderen Börse wechseln, indem Sie die Konfiguration des Krypto-Börsenknotens (Crypto Exchange node) ändern. Die Konfiguration anderer Börsen finden Sie unter dem Thema Getestete Börsen.",
                    "updated": 1688936775544
                }
            ]
        },
        {
            "style": "Title",
            "text": "Maintainer",
            "translations": [
                {
                    "language": "RU",
                    "text": "Разработчик",
                    "updated": 1639057086016
                },
                {
                    "language": "DE",
                    "text": "Verfasser",
                    "updated": 1688936675306
                }
            ]
        },
        {
            "style": "Link",
            "text": "@julianmolina (Telegram)->t.me/julianmolina",
            "updated": 1622624415709
        }
    ]
}