{
    "topic": "Community Workspaces",
    "pageNumber": "1",
    "type": "Native Workspaces",
    "definition": {
        "text": "Superalgos ships with several Native Workspaces set up by the community to facilitate user onboarding. This topic covers each of them and explains their purpose.",
        "updated": 1616145035073,
        "translations": [
            {
                "language": "ES",
                "text": "Superalgos conecta con varios plugin  workspaces configurados por la comunidad para facilitar la incorporación de usuarios. Este tema cubre cada uno de ellos y explica su propósito.",
                "updated": 1628037130662,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Superalgos поставляется с несколькими рабочими пространствами плагинов, созданными сообществом для облегчения адаптации пользователей. Эта тема охватывает каждый из них и объясняет их назначение.",
                "updated": 1635629505051
            },
            {
                "language": "TR",
                "text": "Superalgos, kullanıcı katılımını kolaylaştırmak için topluluk tarafından kurulan çeşitli eklenti çalışma alanları ile birlikte gelir. Bu konu bu alanların tanımlarını kapsar ve amaçlarını açıklar.",
                "updated": 1639143664276
            },
            {
                "language": "DE",
                "text": "Superalgos wird mit mehreren nativen Arbeitsbereichen ausgeliefert, die von der Community eingerichtet wurden, um das Onboarding der Benutzer zu erleichtern. Dieses Thema behandelt jeden von ihnen und erklärt ihren Zweck.",
                "updated": 1688852383266
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Each Native Workspaces shipping with Superalgos was built with a specific purpose.",
            "updated": 1687799181657,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada Native Workspace incluído en Superalgos ha sido cnstruido para un propósito específico.",
                    "updated": 1633281831625,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Каждое рабочее пространство плагина, поставляемое с Superalgos, было создано с определенной целью.",
                    "updated": 1639055532864
                },
                {
                    "language": "TR",
                    "text": "Superalgos ile birlikte gelen her eklenti çalışma alanı, belirli bir amaç için oluşturulmuştur.",
                    "updated": 1639759987512
                },
                {
                    "language": "DE",
                    "text": "Jeder Native Workspaces, der mit Superalgos ausgeliefert wird, wurde zu einem bestimmten Zweck gebaut.",
                    "updated": 1688852393851
                }
            ]
        }
    ]
}