{
    "type": "Data Mines Data",
    "definition": {
        "text": "Session independent data refers to data generated by sensors and indicators, not related to trading sessions.",
        "translations": [
            {
                "language": "RU",
                "text": "Данные, не зависящие от сессии, относятся к данным, генерируемым датчиками и индикаторами, не связанными с торговыми сессиями.",
                "updated": 1638730696734
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "As explained in the sorting of tasks page, data mines data is sorted by exchange, market, and the corresponding data mine, sensor or indicator bot, and bot product. That is, most of the nodes in this section of the hierarchy play an organizational role.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Как объясняется на странице сортировки задач, данные добытчиков данных сортируются по бирже, рынку и соответствующему боту-добытчику данных, датчику или индикатору и продукту бота. То есть большинство узлов в этом разделе иерархии играют организационную роль.",
                    "updated": 1638731034927
                }
            ]
        },
        {
            "style": "Text",
            "text": "Many of them require references to the nodes that delimit the context for which the data is applicable. For example, the market data products node must reference one of the installed markets, in particular, the market on which the data mining operation is run. These references help other entities understand the context to which the data belongs to.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Многие из них требуют ссылок на узлы, которые ограничивают контекст, для которого применимы данные. Например, узел продуктов с рыночными данными должен ссылаться на один из установленных рынков, в частности, на рынок, на котором выполняется операция интеллектуального анализа данных. Эти ссылки помогают другим сущностям понять контекст, которому принадлежат данные.",
                    "updated": 1638731065361
                }
            ]
        },
        {
            "style": "Text",
            "text": "Whenever you create data mining tasks manually from within the Network hierarchy (as opposed to using the install market function under the exchange markets node of the Crypto Ecosystem hierarchy",
            "translations": [
                {
                    "language": "RU",
                    "text": "Всякий раз, когда вы создаете задачи интеллектуального анализа данных вручную из иерархии Network (в отличие от использования функции рынка установки в узле биржевых рынков иерархии Crypto Ecosystem)",
                    "updated": 1638731183010
                }
            ]
        }
    ]
}