{
    "type": "Data Mines Data",
    "definition": {
        "text": "Session independent data refers to data generated by sensors and indicators, not related to trading sessions.",
        "translations": [
            {
                "language": "RU",
                "text": "Данные, не зависящие от сессии, относятся к данным, генерируемым датчиками и индикаторами, не связанными с торговыми сессиями.",
                "updated": 1638730696734
            },
            {
                "language": "TR",
                "text": "Seans bağımsız veriler, işlem seanslarıyla ilgili olmayan sensörler ve göstergeler tarafından üretilen verileri ifade eder.",
                "updated": 1654391700640
            },
            {
                "language": "DE",
                "text": "Sitzungsunabhängige Daten beziehen sich auf Daten, die von Sensoren und Indikatoren generiert werden und nicht mit Handelssitzungen zusammenhängen.",
                "updated": 1708265572742
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "As explained in the sorting of tasks page, data mines data is sorted by exchange, market, and the corresponding data mine, sensor or indicator bot, and bot product. That is, most of the nodes in this section of the hierarchy play an organizational role.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Как объясняется на странице сортировки задач, данные добытчиков данных сортируются по бирже, рынку и соответствующему боту-добытчику данных, датчику или индикатору и продукту бота. То есть большинство узлов в этом разделе иерархии играют организационную роль.",
                    "updated": 1638731034927
                },
                {
                    "language": "TR",
                    "text": "Görevlerin sıralanması sayfasında açıklandığı gibi, veri madeni verileri borsa, piyasa ve ilgili veri madeni, sensör veya gösterge botu ve bot ürününe göre sıralanır. Yani, hiyerarşinin bu bölümündeki düğümlerin çoğu organizasyonel bir rol oynamaktadır.",
                    "updated": 1654391707384,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wie auf der Seite \"Sortierung der Aufgaben\" erläutert, werden die Daten der Datenminen nach Börse, Markt und der entsprechenden Datenmine, dem Sensor- oder Indikatorbot und dem Botprodukt sortiert. Das heißt, die meisten Knoten in diesem Abschnitt der Hierarchie spielen eine organisatorische Rolle.",
                    "updated": 1708265572914,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Many of them require references to the nodes that delimit the context for which the data is applicable. For example, the market data products node must reference one of the installed markets, in particular, the market on which the data mining operation is run. These references help other entities understand the context to which the data belongs to.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Многие из них требуют ссылок на узлы, которые ограничивают контекст, для которого применимы данные. Например, узел продуктов с рыночными данными должен ссылаться на один из установленных рынков, в частности, на рынок, на котором выполняется операция интеллектуального анализа данных. Эти ссылки помогают другим сущностям понять контекст, которому принадлежат данные.",
                    "updated": 1638731065361
                },
                {
                    "language": "TR",
                    "text": "Bunların birçoğu, verilerin uygulanabilir olduğu bağlamı sınırlayan düğümlere referanslar gerektirir. Örneğin, market veri ürünleri düğümü, kurulu marketlerden birine, özellikle de veri madenciliği işleminin yürütüldüğü markete referans vermelidir. Bu referanslar, diğer varlıkların verilerin ait olduğu bağlamı anlamasına yardımcı olur.",
                    "updated": 1656932454504,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Viele von ihnen erfordern Verweise auf die Knoten, die den Kontext abgrenzen, für den die Daten gelten. So muss beispielsweise der Knoten \"Marktdatenprodukte\" auf einen der installierten Märkte verweisen, insbesondere auf den Markt, auf dem die Data-Mining-Operation durchgeführt wird. Diese Verweise helfen anderen Einheiten, den Kontext zu verstehen, zu dem die Daten gehören.",
                    "updated": 1708265573180,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Whenever you create data mining tasks manually from within the Network hierarchy (as opposed to using the install market function under the exchange markets node of the Crypto Ecosystem hierarchy",
            "translations": [
                {
                    "language": "RU",
                    "text": "Всякий раз, когда вы создаете задачи интеллектуального анализа данных вручную из иерархии Network (в отличие от использования функции рынка установки в узле биржевых рынков иерархии Crypto Ecosystem)",
                    "updated": 1638731183010
                },
                {
                    "language": "TR",
                    "text": "Veri madenciliği görevlerini Ağ hiyerarşisi içinden manuel olarak oluşturduğunuzda (Kripto Ekosistemi hiyerarşisinin borsa piyasaları düğümü altındaki piyasa yükle işlevini kullanmanın aksine",
                    "updated": 1654391718644,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie Data-Mining-Aufgaben manuell innerhalb der Netzwerkhierarchie erstellen (im Gegensatz zur Verwendung der Funktion \"Markt installieren\" unter dem Knoten \"Börsenmärkte\" der Crypto Ecosystem Hierarchie",
                    "updated": 1708265573415,
                    "style": "Text"
                }
            ]
        }
    ]
}