{
    "topic": "Debugging Your Indicator",
    "pageNumber": 4,
    "type": "Debugging - Start Your Processes",
    "definition": {
        "text": "Now we have a breakpoint configured we can start the TS in Visual Studio Code. Then in the Superalgos UI we can find a Task and start this using Debug mode.",
        "updated": 1623409454402,
        "translations": [
            {
                "language": "CN",
                "text": "Start the Task in Debug mode while running a debug session in your IDE. ",
                "updated": 1614338791705,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Jetzt haben wir einen breakpoint konfiguriert und können den TS in Visual Studio Code starten. In der Superalgos UI (Benutzeroberfläche) können wir dann eine Task finden und diese im Debug-Modus starten.",
                "updated": 1638032216795
            },
            {
                "language": "RU",
                "text": "Теперь у нас настроена точка прерывания, и мы можем запустить TS в Visual Studio Code. Затем в пользовательском интерфейсе Superalgos мы можем найти задачу и запустить ее в режиме отладки.",
                "updated": 1640281308480
            },
            {
                "language": "TR",
                "text": "Özet: Artık yapılandırılmış bir kesme noktamız var, TS'yi Visual Studio Kodunda başlatabiliriz. Ardından Superalgos kullanıcı arayüzünde ( UI ) bir Görev ( Task ) bulabilir ve bunu Hata Ayıklama modunu kullanarak başlatabiliriz.",
                "updated": 1645358839506
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "As we covered before there are three core components to Superalgos, the Client, TS and UI. ",
            "updated": 1623409529218,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wie bereits erwähnt, besteht Superalgos aus drei Kernkomponenten: dem Client, dem TS und der UI.",
                    "updated": 1638032441543
                },
                {
                    "language": "RU",
                    "text": "Как мы уже говорили, Superalgos состоит из трех основных компонентов: Client, TS и UI.",
                    "updated": 1640281325849
                },
                {
                    "language": "TR",
                    "text": "Daha önce ele aldığımız gibi, Superalgos, İstemci ( Client ), TS ve UI için üç temel bileşen vardır.",
                    "updated": 1645358885021
                }
            ]
        },
        {
            "style": "Text",
            "text": "First, we need to make sure the Client and UI are running. If they are not already running, you can start the UI by going to the terminal, ensuring you are in the Superalgos root directory and enter \"node run\".",
            "updated": 1623409611552,
            "translations": [
                {
                    "language": "DE",
                    "text": "Zunächst müssen wir sicherstellen, dass der Client und die UI ausgeführt werden. Wenn sie noch nicht laufen, können Sie die UI starten, indem Sie im Terminal sicherstellen, dass Sie sich im Superalgos root directory (Stammverzeichnis) befinden und \"node run\" eingeben.",
                    "updated": 1638035462816
                },
                {
                    "language": "RU",
                    "text": "Во-первых, необходимо убедиться, что Client и UI запущены. Если они еще не запущены, вы можете запустить UI, перейдя в терминал, убедившись, что вы находитесь в корневом каталоге Superalgos, и введя \"node run\".",
                    "updated": 1640281349350
                },
                {
                    "language": "TR",
                    "text": "İlk olarak, Client ve UI'nin çalıştığından emin olmamız gerekiyor. Zaten çalışmıyorlarsa, Superalgos kök dizininde olduğunuzdan emin olarak terminale giderek kullanıcı arayüzünü başlatabilir ve \"node run\" yazabilirsiniz.",
                    "updated": 1645358914556
                }
            ]
        },
        {
            "style": "Success",
            "text": "If the Terminal is not visible click on View -> Terminal and it should appear at the bottom.",
            "updated": 1623410067613,
            "translations": [
                {
                    "language": "DE",
                    "text": " Wenn das Terminal nicht sichtbar ist, klicken Sie auf View -> Terminal und es sollte am unteren Rand erscheinen.",
                    "updated": 1638035499037
                },
                {
                    "language": "RU",
                    "text": "Если терминал не виден, нажмите View -> Terminal, и он должен появиться внизу.",
                    "updated": 1640281376425
                },
                {
                    "language": "TR",
                    "text": "İpucu: Terminal görünmüyorsa Görünüm -> Terminal'e tıklayın,altta görünecektir.",
                    "updated": 1645358948379
                }
            ]
        },
        {
            "style": "Note",
            "text": "If needed you can run this with any parameters like \"node run minMemo noBrowser\" as required.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Bei Bedarf können Sie dies mit beliebigen Parametern wie \"node run minMemo noBrowser\" ausführen.",
                    "updated": 1638035735520
                },
                {
                    "language": "RU",
                    "text": "При необходимости вы можете запустить его с любыми параметрами, например \"node run minMemo noBrowser\".",
                    "updated": 1640281394038
                },
                {
                    "language": "TR",
                    "text": "Not: Gerekirse bunu \"node run minMemo noBrowser\" gibi herhangi bir parametreyle de çalıştırabilirsiniz.",
                    "updated": 1645358982158
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/debugging-your-indicator/10_node-run.png",
            "updated": 1623409808656
        },
        {
            "style": "Text",
            "text": "At this stage you should be able to access Superalgos in the browser using http://localhost:34248/ (or the particular hostname and port you use).",
            "updated": 1623409750881,
            "translations": [
                {
                    "language": "DE",
                    "text": "Zu diesem Zeitpunkt sollten Sie in der Lage sein, Superalgos im Browser über http://localhost:34248/ (oder den von Ihnen verwendeten Hostnamen und Port) zu erreichen.",
                    "updated": 1638035762798
                },
                {
                    "language": "RU",
                    "text": "На этом этапе вы должны иметь возможность получить доступ к Superalgos в браузере, используя http://localhost:34248/ (или конкретное имя хоста и порт, которые вы используете).",
                    "updated": 1640281412984
                },
                {
                    "language": "TR",
                    "text": "Bu aşamada, tarayıcıda http://localhost:34248/ (veya kullandığınız belirli ana bilgisayar adı ve bağlantı noktası) kullanarak Superalgos'a erişebilmelisiniz.",
                    "updated": 1645359006162
                }
            ]
        },
        {
            "style": "Text",
            "text": "Next we are going to start the TS in debug mode. To do this start a Debug Session in Visual Studio Code by clicking \"Run -> Start Debugging\" F5",
            "updated": 1623410434222,
            "translations": [
                {
                    "language": "DE",
                    "text": "Als nächstes werden wir den TS im Debug Modus starten. Starten Sie dazu eine Debug Session in Visual Studio Code, indem Sie auf \"Run -> Start Debugging\" F5 klicken.",
                    "updated": 1638035870215
                },
                {
                    "language": "RU",
                    "text": "Далее мы собираемся запустить TS в режиме отладки. Для этого запустите сеанс отладки в Visual Studio Code, нажав \"Run -> Start Debugging\" F5",
                    "updated": 1640281434218
                },
                {
                    "language": "TR",
                    "text": "Ardından, TS'yi hata ayıklama modunda başlatacağız. Bunu yapmak için, \"Çalıştır -> Hata Ayıklamayı Başlat\" F5'i tıklatarak Visual Studio Kodunda bir Hata Ayıklama Oturumu başlatın.",
                    "updated": 1645359026081
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/debugging-your-indicator/11_start-debugging.png",
            "updated": 1623409861513
        },
        {
            "style": "Text",
            "text": "To confirm the TS is running, you can click on the Run and Debug icon which will open a new left-hand panel. In here under the Call Stack you should be able to see the TaskServer running.",
            "updated": 1623410288365,
            "translations": [
                {
                    "language": "DE",
                    "text": "Um zu bestätigen, dass der TS läuft, können Sie auf das Symbol Ausführen und Debuggen klicken, wodurch sich ein neues Fenster auf der linken Seite öffnet. Hier unter dem Call Stack sollten Sie den TaskServer laufen sehen können.",
                    "updated": 1638035990486
                },
                {
                    "language": "RU",
                    "text": "Чтобы убедиться, что TS запущен, вы можете щелкнуть на значке Run and Debug, который откроет новую левую панель. Здесь под стеком вызовов (\"Call Stack\") вы должны увидеть запущенный TaskServer.",
                    "updated": 1640281470468
                },
                {
                    "language": "TR",
                    "text": "TS'nin çalıştığını doğrulamak için, yeni bir sol panel açacak olan Çalıştır ve Hata Ayıklama simgesine tıklayabilirsiniz. Burada Çağrı Yığını altında TaskServer'ın çalıştığını görebilmeniz gerekir.",
                    "updated": 1645359054107
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/debugging-your-indicator/12_run-and-debug.png"
        },
        {
            "style": "Text",
            "text": "Now the TS is running we can start a Task via the Debug action.",
            "updated": 1623410467602,
            "translations": [
                {
                    "language": "DE",
                    "text": "Jetzt, wo der TS läuft, können wir über die Debug Aktion eine Task starten.",
                    "updated": 1638036015855
                },
                {
                    "language": "RU",
                    "text": "Теперь TS запущен, и мы можем запустить задачу с помощью действия Debug.",
                    "updated": 1640281504313
                },
                {
                    "language": "TR",
                    "text": "Artık TS çalışıyor, Hata Ayıklama eylemi aracılığıyla bir Görev başlatabiliriz.",
                    "updated": 1645359075635
                }
            ]
        },
        {
            "style": "Text",
            "text": "Go to your Network node and find the Data Task for your indicator.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Gehen Sie zu Ihrer Network node und suchen Sie die Data Task für Ihren Indikator.",
                    "updated": 1638036155109
                },
                {
                    "language": "RU",
                    "text": "Перейдите в узел Network и найдите Data Task для вашего индикатора.",
                    "updated": 1640281518305
                },
                {
                    "language": "TR",
                    "text": "Ağ düğümünüze gidin ve göstergeniz için Veri Görevini ( Data Task ) bulun.",
                    "updated": 1645359107870
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/debugging-your-indicator/13_network.png",
            "updated": 1623410476464
        },
        {
            "style": "Text",
            "text": "Expand the Data Tasks and hover over the Task node for your indicator and click \"Debug\" (the Task will start up, but in Debug mode).",
            "updated": 1614332581381,
            "translations": [
                {
                    "language": "DE",
                    "text": "Erweitern Sie die Data Tasks, bewegen Sie den Mauszeiger über die Task Node für Ihren Indikator und klicken Sie auf \"Debug\" (die Task wird gestartet, aber im Debug-Modus).",
                    "updated": 1638036387502
                },
                {
                    "language": "RU",
                    "text": "Разверните Data Tasks, наведите курсор на узел Task для вашего индикатора и нажмите \"Debug\" (Задача запустится, но в режиме Debug).",
                    "updated": 1640281549332
                },
                {
                    "language": "TR",
                    "text": "Veri Görevlerini ( Data Task ) genişletin ve göstergeniz için Görev düğümünün üzerine gelin ve \"Hata Ayıkla\" yı tıklayın (Görev başlar, ancak Hata Ayıklama modunda).",
                    "updated": 1645359179564
                }
            ]
        },
        {
            "style": "Important",
            "text": "If you receive an error stating \"Parent Task Not Running\" this can be ignored. As we are using the Debug action the task will start anyway.",
            "updated": 1623410561295,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn Sie die Fehlermeldung \"Parent Task Not Running\" erhalten, können Sie dies ignorieren. Da wir die Debug Aktion verwenden, wird die Aufgabe trotzdem gestartet.",
                    "updated": 1638036480125
                },
                {
                    "language": "RU",
                    "text": "Если вы получите ошибку \"Parent Task Not Running\", ее можно проигнорировать. Поскольку мы используем действие Debug, задача все равно запустится.",
                    "updated": 1640281571919
                },
                {
                    "language": "TR",
                    "text": "Önemli: \"Üst Görev Çalışmıyor\" şeklinde bir hata alırsanız, bu göz ardı edilebilir. Hata Ayıklama eylemini kullandığımız için görev zaten başlayacaktır.",
                    "updated": 1645359199820
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/debugging-your-indicator/14_expand-data-tasks.png",
            "updated": 1623410569919
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/debugging-your-indicator/15_debug-your-indicator-task.png",
            "updated": 1623410589000
        },
        {
            "style": "Text",
            "text": "If your Task has dependencies (for example above we are debugging Resistances and Supports, but these need the Exchange Raw Data and Candles running before they will run) start the needed tasks connected to your indicator by hovering over the nodes and click \"Run\".",
            "updated": 1623410869266,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn Ihre Task Abhängigkeiten hat (z. B. debuggen wir oben Resistances und Supports, aber diese benötigen Exchange Raw Data und Candles, bevor sie ausgeführt werden können), starten Sie die benötigten Tasks, die mit Ihrem Indikator verbunden sind, indem Sie mit dem Mauszeiger über der Node schweben und auf \"Run\" klicken.",
                    "updated": 1638036654674
                },
                {
                    "language": "RU",
                    "text": "Если ваша задача имеет зависимости (например, выше мы отлаживаем Resistances и Supports, но для их запуска необходимы Exchange Raw Data и Candles), запустите необходимые задачи, связанные с вашим индикатором, наведя курсор на узлы и нажав \"Run\".",
                    "updated": 1640281597533
                },
                {
                    "language": "TR",
                    "text": "Görevinizin bağımlılıkları varsa (örneğin yukarıda Dirençler ve Desteklerde hata ayıklıyoruz, ancak bunlar çalışmadan önce Exchange Ham Verileri ( Raw Data ) ve Mumların çalışmasına ihtiyaç duyuyorsa), imleci düğümlerin üzerine getirerek göstergenize bağlı gerekli görevleri başlatın ve \"Çalıştır\" ı tıklayın.",
                    "updated": 1645359318046
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/debugging-your-indicator/16_run-ohlcvs.png",
            "updated": 1623411034335
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/debugging-your-indicator/17_run-dependencies.png",
            "updated": 1623411039717
        },
        {
            "style": "Text",
            "text": "If you have a look in the Debug Code terminal you should now see your indicator running as normal.",
            "updated": 1623410912711,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn Sie einen Blick in das Debug Code Terminal werfen, sollten Sie nun sehen, dass Ihr indicator ganz normal läuft.",
                    "updated": 1638036732977
                },
                {
                    "language": "RU",
                    "text": "Если вы посмотрите в терминал Debug Code, то увидите, что ваш индикатор работает в обычном режиме.",
                    "updated": 1640281617522
                },
                {
                    "language": "TR",
                    "text": "Hata Ayıklama Kodu terminaline bir göz atarsanız, göstergenizin normal şekilde çalıştığını görmelisiniz.",
                    "updated": 1645359338272
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/debugging-your-indicator/18_check-debug-terminal.png",
            "updated": 1623411066811
        },
        {
            "style": "Note",
            "text": "Deleting existing data from your indicator in the ..Superalgos/Data-Storage/ folder might speed up the data mining process.",
            "updated": 1623410940602,
            "translations": [
                {
                    "language": "DE",
                    "text": "Das Löschen vorhandener Daten aus Ihrem Indikator im Superalgos/Data-Storage/ Ordner kann den Data Mining Prozess beschleunigen.",
                    "updated": 1638036825328
                },
                {
                    "language": "RU",
                    "text": "Удаление существующих данных из вашего индикатора в папке ...Superalgos/Data-Storage/ может ускорить процесс поиска данных.",
                    "updated": 1640281641941
                },
                {
                    "language": "TR",
                    "text": "Not: ..Superalgos/Data-Storage/ klasöründeki göstergenizden mevcut verileri silmek, veri madenciliği sürecini hızlandırabilir.",
                    "updated": 1645359356680
                }
            ]
        }
    ]
}