{
    "type": "Plugins",
    "definition": {
        "text": "The plugins hierarchy defines which plugins are to be included in the current workspace. In the context of this hierarchy, plugins are JSON files featuring the description of a hierarchy such as a data mine, trading mine, trading engine, or trading system.",
        "translations": [
            {
                "language": "ES",
                "text": "The plugins hierarchy define cual plugins se incluirán en el actual workspace. En el contexto de esta jerarquía, plugins son archivos JSON con la descripción de una jerarquía como un data mine, trading mine, trading engine, o trading system.",
                "updated": 1628037249031
            },
            {
                "language": "RU",
                "text": "Иерархия Plugins определяет, какие плагины должны быть включены в текущую рабочую область Workspace. В контексте этой иерархии плагины - это файлы JSON, содержащие описание иерархии, такой как Data Mine, Trading Mine, Trading Engine или Trading System.",
                "updated": 1638340280833
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "In the context of a community-driven project, a plugin is a device that serves to distribute community-generated intelligence. The project distributes several plugins contributed by the community.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В контексте проекта, управляемого сообществом, плагин - это устройство, которое служит для распространения информации, созданной сообществом. Проект распространяет несколько плагинов, предоставленных сообществом.",
                    "updated": 1638340321953
                }
            ]
        },
        {
            "style": "Important",
            "text": "Hierarchies included in the workspace as plugins are not saved at the workspace level. As such, changes made in those hierarchies do not persist. If you wish to modify a plugin and keep working with the modified version in the future, you must either clone or backup the plugin and work on the resulting copy instead.",
            "updated": 1609866745275,
            "translations": [
                {
                    "language": "RU",
                    "text": "Иерархии (Hierarchies), включенные в рабочую область как плагины, не сохраняются на уровне рабочей области. Таким образом, изменения, внесенные в эти иерархии, не сохраняются. Если вы хотите изменить плагин и продолжить работу с измененной версией в будущем, вы должны либо клонировать, либо сделать резервную копию плагина и вместо этого работать с полученной копией.",
                    "updated": 1638340382678
                }
            ]
        }
    ]
}