{
    "type": "Plugins",
    "definition": {
        "text": "The plugins hierarchy defines which plugins are to be included in the current workspace. In the context of this hierarchy, plugins are JSON files featuring the description of a hierarchy such as a data mine, trading mine, trading engine, or trading system.",
        "translations": [
            {
                "language": "ES",
                "text": "The plugins hierarchy define cual plugins se incluirán en el actual workspace. En el contexto de esta jerarquía, plugins son archivos JSON con la descripción de una jerarquía como un data mine, trading mine, trading engine, o trading system.",
                "updated": 1628037249031
            },
            {
                "language": "EL",
                "text": "Η ιεραρχία των πρόσθετων καθορίζει ποιά πρόσθετα θα συμπεριληφθούν στον τρέχοντα χώρο εργασίας. Στο πλαίσιο αυτής της ιεραρχίας, τα πρόσθετα είναι αρχεία JSON που διαθέτουν την περιγραφή μιας ιεραρχίας όπως ένα εξορυκτήριο δεδομένων, ένα εξορυκτήριο συναλλαγών, μια μηχανή συναλλαγών ή ένα σύστημα συναλλαγών.",
                "updated": 1641828795260
            },
            {
                "language": "DE",
                "text": "Die Plugin-Hierarchie definiert, welche Plugins in den aktuellen Arbeitsbereich aufgenommen werden sollen. Im Kontext dieser Hierarchie sind Plugins JSON-Dateien mit der Beschreibung einer Hierarchie, z. B. einer Data Mine, Trading Mine, Trading Engine oder eines Trading Systems.",
                "updated": 1641764838784
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "In the context of a community-driven project, a plugin is a device that serves to distribute community-generated intelligence. The project distributes several plugins contributed by the community.",
            "translations": [
                {
                    "language": "EL",
                    "text": "Στο πλαίσιο ενός έργου που βασίζεται σε κοινότητα, ένα πρόσθετο είναι μια συσκευή που χρησιμεύει για τη διανομή πληροφοριών που δημιουργείται από την κοινότητα. Το έργο διανέμει πολλά πρόσθετα που συνεισφέρει η κοινότητα.",
                    "updated": 1641828813002
                },
                {
                    "language": "DE",
                    "text": "Im Kontext eines community-gesteuerten Projekts ist ein Plugin ein Gerät, das dazu dient, von der Community generierte Intelligenz zu verbreiten. Das Projekt vertreibt mehrere Plugins, die von der Community beigesteuert werden.",
                    "updated": 1641764929240
                }
            ]
        },
        {
            "style": "Important",
            "text": "Hierarchies included in the workspace as plugins are not saved at the workspace level. As such, changes made in those hierarchies do not persist. If you wish to modify a plugin and keep working with the modified version in the future, you must either clone or backup the plugin and work on the resulting copy instead.",
            "updated": 1609866745275,
            "translations": [
                {
                    "language": "EL",
                    "text": "Οι Hierarchies (Ιεραρχίες) που περιλαμβάνονται στον χώρο εργασίας ως πρόσθετα δεν αποθηκεύονται σε επίπεδο χώρου εργασίας. Ως εκ τούτου, οι αλλαγές που έγιναν σε αυτές τις ιεραρχίες δεν παραμένουν. Εάν θέλετε να τροποποιήσετε ένα πρόσθετο και να συνεχίσετε να εργάζεστε με την τροποποιημένη έκδοση στο μέλλον, πρέπει είτε να κλωνοποιήσετε είτε να δημιουργήσετε αντίγραφα ασφαλείας του πρόσθετου και να εργαστείτε στο αντίγραφο που προκύπτει.",
                    "updated": 1641828828968
                },
                {
                    "language": "RU",
                    "text": "Иерархии (Hierarchies), включенные в рабочее пространство как плагины, не сохраняются на уровне рабочего пространства. Таким образом, изменения, внесенные в эти иерархии, не сохраняются. Если вы хотите изменить плагин и продолжить работу с измененной версией в будущем, вы должны либо клонировать, либо сделать резервную копию плагина и вместо этого работать с полученной копией.",
                    "updated": 1639552903709
                },
                {
                    "language": "DE",
                    "text": "Hierarchien, die als Plugins in den Arbeitsbereich eingebunden sind, werden nicht auf Arbeitsbereichsebene gespeichert. Änderungen, die in diesen Hierarchien vorgenommen werden, bleiben daher nicht erhalten. Wenn Sie ein Plugin ändern und in Zukunft mit der geänderten Version weiterarbeiten möchten, müssen Sie das Plugin entweder klonen oder sichern und stattdessen mit der resultierenden Kopie arbeiten.",
                    "updated": 1641764949101
                }
            ]
        }
    ]
}