{
    "topic": "Integrations",
    "pageNumber": "1",
    "type": "Telegram Announcements",
    "definition": {
        "text": "Setup a Telegram bot to broadcast the activity of trading sessions to a Telegram group. You may produce plain-text or dynamic-content announcements at every event in your trading systems.",
        "updated": 1611484869105,
        "translations": [
            {
                "language": "ID",
                "text": "Penyiapan Telegram bot untuk membroadcast aktivitas dari sesi trading ke grup Telegram. Kamu dapat membuat plain-text atau pengumuman berbentuk dynamic-contenct  di setiap event pada trading sistem milikmu.",
                "updated": 1616926732019,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Richten Sie einen Telegram-Bot ein, um die Aktivität von trading sessions an eine Telegram-Gruppe zu senden. Sie können bei jedem Ereignis in Ihrer trading session Ankündigungen im Klartext oder mit dynamischem Inhalt erstellen. Ins deutsche übersetzt von gitforkgit.",
                "updated": 1634135285796
            },
            {
                "language": "RU",
                "text": "Настройте Telegram-бота для трансляции активности торговых сессий в группу Telegram. Вы можете создавать объявления в виде обычного текста или динамического контента при каждом событии в ваших торговых системах.",
                "updated": 1640368937595
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Overview",
            "updated": 1634135230540,
            "translations": [
                {
                    "language": "DE",
                    "text": "Übersicht:",
                    "updated": 1634135272764
                },
                {
                    "language": "RU",
                    "text": "Обзор",
                    "updated": 1640368949943
                }
            ]
        },
        {
            "style": "Text",
            "text": "The announcements feature allows users to set up notifications tied to specific events, and triggered once each particular event becomes active while running any of the available types of trading sessions.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Fitur pengumuman memungkinkan pengguna untuk mengatur pemberitahuan yang terkait dengan event tertentu, dan terpicu setelah setiap event menjadi aktif saat menjalankan salah satu jenis sesi trading yang tersedia.",
                    "updated": 1616927035635,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die Ankündigungsfunktion ermöglicht es den Benutzern, an bestimmte Ereignisse gebundene Benachrichtigungen einzurichten, die ausgelöst werden, sobald ein bestimmtes Ereignis während der Ausführung einer der verfügbaren Arten von trading sessions aktiv wird.",
                    "updated": 1634135336601
                },
                {
                    "language": "RU",
                    "text": "Функция оповещений позволяет пользователям настраивать уведомления, привязанные к определенным событиям, которые срабатывают, как только каждое конкретное событие становится активным во время проведения любого из доступных типов торговых сессий.",
                    "updated": 1640368983977
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may use this feature to stay informed about the actions of your strategies while trading live, or to broadcast signals over a Telegram group while paper trading, for instance.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Kamu akan menggunakan fitur ini tetap mendapat informasi tentang tindakan dari strategi saat live trading, atau untuk membroadcast sinyal melalui grup Telegram, misalnya paper trading.",
                    "updated": 1616927218638,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie können diese Funktion nutzen, um über die Aktionen Ihrer Strategien informiert zu bleiben, während Sie live traden, oder um Signale über eine Telegram-Gruppe zu senden, während Sie z.B. paper traden.",
                    "updated": 1634135938242
                },
                {
                    "language": "RU",
                    "text": "Вы можете использовать эту функцию для получения информации о действиях ваших стратегий во время торговли в реальном времени или, например, для трансляции сигналов через группу Telegram во время бумажной торговли.",
                    "updated": 1640369008708
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Supported events are:",
            "translations": [
                {
                    "language": "ID",
                    "text": "Events yang didukung:",
                    "updated": 1616927255808,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Unterstützte Ereignisse sind:",
                    "updated": 1634135999559
                },
                {
                    "language": "RU",
                    "text": "Поддерживаются следующие события:",
                    "updated": 1640369021549
                }
            ]
        },
        {
            "style": "List",
            "text": "Trigger-on event",
            "translations": [
                {
                    "language": "RU",
                    "text": "Событие включения триггера",
                    "updated": 1640369301684
                }
            ]
        },
        {
            "style": "List",
            "text": "Trigger-off event",
            "translations": [
                {
                    "language": "RU",
                    "text": "Событие отключения триггера",
                    "updated": 1640369258044
                }
            ]
        },
        {
            "style": "List",
            "text": "Take position event",
            "translations": [
                {
                    "language": "RU",
                    "text": "Событие занятия позиции",
                    "updated": 1640369407631
                }
            ]
        },
        {
            "style": "List",
            "text": "Stop and take profit next-phase events",
            "translations": [
                {
                    "language": "RU",
                    "text": "События стоп и тейк-профит следующей фазы",
                    "updated": 1640369468305
                }
            ]
        },
        {
            "style": "Text",
            "text": "In addition, you can implement announcements at the level of stop and take profit phases, a particular case that shall be discussed too.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Selain itu, kamu dapat mengimplementasikan pengumuman di level fase stop dan take profit, hal-hal lain juga akan kita bahas nantinya.",
                    "updated": 1616927456192,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Darüber hinaus können Sie Ankündigungen auf der Ebene der Stop and Take Profit-Phasen implementieren, ein Sonderfall, der ebenfalls diskutiert werden soll.",
                    "updated": 1634136066228
                },
                {
                    "language": "RU",
                    "text": "Кроме того, вы можете реализовать оповещения на уровне фаз стоп и тейк-профит - частный случай, о котором мы еще поговорим.",
                    "updated": 1640369560088
                }
            ]
        },
        {
            "style": "Text",
            "text": "The current implementation is based on broadcasting announcements via Telegram bots. The system uses Telegram’s bots API to interact with a Telegram bot you will create. The bot will be added as a user in the Telegram group of your choice in which it will deliver the announcements as per the configuration you will set up in the system.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Implementasi pada saat ini berdasar pada membroadcast pengumuman dari Telegram bot. Sistem menggunakan Telegram bot API untuk menghubungkan Telegram bot yang kamu buat. Bot akan ditambahkan sebagai user di Telegram grup pilihanmu yang akan mengirimkan pengumuman sesuai konfigurasi yang kamu atur pada sistem.",
                    "updated": 1616927659463,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die aktuelle Implementierung basiert auf der Verbreitung von Ankündigungen über Telegram-Bots. Das System verwendet die Bots-API von Telegram, um mit einem von Ihnen erstellten Telegram-Bot zu interagieren. Der Bot wird als Benutzer in der Telegram-Gruppe Ihrer Wahl hinzugefügt, in der er die Ankündigungen gemäß der von Ihnen im System eingerichteten Konfiguration übermittelt.",
                    "updated": 1634136109323
                },
                {
                    "language": "RU",
                    "text": "Текущая реализация основана на трансляции оповещений через ботов Telegram. Система использует API ботов Telegram для взаимодействия с созданным вами ботом Telegram. Бот будет добавлен в качестве пользователя в выбранную вами группу Telegram, в которой он будет доставлять объявления в соответствии с конфигурацией, которую вы установите в системе.",
                    "updated": 1640369605419
                }
            ]
        },
        {
            "style": "Title",
            "text": "Setting Up a Telegram Bot and a Telegram Group",
            "translations": [
                {
                    "language": "ID",
                    "text": "Menyiapkan Telegram Bot dan Telegram Grup",
                    "updated": 1616927728752,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Einrichten eines Telegram-Bots und einer Telegram-Gruppe:",
                    "updated": 1634136130771
                },
                {
                    "language": "RU",
                    "text": "Настройка Telegram-бота и группы Telegram",
                    "updated": 1640369622837
                }
            ]
        },
        {
            "style": "Text",
            "text": "Telegram’s documentation explains the details of how to use Telegram bots:",
            "updated": 1611485108327,
            "translations": [
                {
                    "language": "ID",
                    "text": "Dokumentasi Telegram menjelaskan secara detail cara menggunakan Telegram bot:",
                    "updated": 1616927702979,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die Dokumentation von Telegram erklärt die Details zur Verwendung von Telegram-Bots:",
                    "updated": 1634136144109
                },
                {
                    "language": "RU",
                    "text": "В документации Telegram подробно объясняется, как использовать ботов Telegram:",
                    "updated": 1640369635963
                }
            ]
        },
        {
            "style": "Link",
            "text": "Bots: An introduction for developers->core.telegram.org/bots",
            "updated": 1611485151851
        },
        {
            "style": "Text",
            "text": "You may choose to read Telegram’s documentation or simple follow the next few steps, which have been extracted for your convenience:",
            "translations": [
                {
                    "language": "ID",
                    "text": "Kamu dapat memilih untuk membaca dokumentasi Telegram atau mengikuti beberapa step berikut, yang telah diekstrak untuk kemudahanmu:",
                    "updated": 1616927824426,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie können entweder die Dokumentation von Telegram lesen oder einfach die folgenden Schritte befolgen, die wir hier für Sie extrahiert haben:",
                    "updated": 1634136212355
                },
                {
                    "language": "RU",
                    "text": "Вы можете прочитать документацию Telegram или просто выполнить следующие несколько шагов, которые были извлечены для вашего удобства:",
                    "updated": 1640369655144
                }
            ]
        },
        {
            "style": "List",
            "text": "1. Go to Telegram and find the user @BotFather: You may use the link or simply search for the user.",
            "updated": 1611485257909,
            "translations": [
                {
                    "language": "ID",
                    "text": "1. Pergi ke Telegram dan cari user @BotFather: Kamu dapat menggunakan tautan atau langsung mencari user.",
                    "updated": 1616927906032,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "1. Gehen Sie zu Telegram und suchen Sie den Benutzer @BotFather: Du kannst den Link verwenden oder einfach nach dem Benutzer suchen.",
                    "updated": 1634136636781
                },
                {
                    "language": "RU",
                    "text": "1. Зайдите в Telegram и найдите пользователя @BotFather: Вы можете воспользоваться ссылкой или просто найти пользователя в поиске.",
                    "updated": 1640369672116
                }
            ]
        },
        {
            "style": "List",
            "text": "2. Type and send /newbot: BotFather will ask you to pick a name for your bot. Once the name is set, it will respond with the token (a text string) to access the HTTP API.",
            "updated": 1611485277898,
            "translations": [
                {
                    "language": "ID",
                    "text": "2. Ketik dan kirimkan /newbot: BotFather akan memintamu untuk memasukkan nama bot. Setelah ditetapkan, ia akan merespon dengan token (sebuah text string) untuk mengakses HTTP API.",
                    "updated": 1616928012542,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Tippen und senden Sie /newbot: BotFather fordert Sie auf, einen Namen für Ihren Bot zu wählen. Sobald der Name festgelegt ist, antwortet er mit dem Token (einer Textzeichenfolge) für den Zugriff auf die HTTP-API.",
                    "updated": 1634136805349
                },
                {
                    "language": "RU",
                    "text": "2. Введите и отправьте /newbot: BotFather попросит вас выбрать имя для вашего бота. Как только имя будет задано, он ответит токеном (текстовой строкой) для доступа к HTTP API.",
                    "updated": 1640369701206
                }
            ]
        },
        {
            "style": "Important",
            "text": "You will need this token at a later time.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Kamu akan membuuhkan token ini nantinya.",
                    "updated": 1616928036024,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie benötigen diesen Token später noch.",
                    "updated": 1634136830601
                },
                {
                    "language": "RU",
                    "text": "Этот токен вам понадобится позже.",
                    "updated": 1640369730092
                }
            ]
        },
        {
            "style": "List",
            "text": "3. Create a Telegram: Your bot will broadcast the announcements here.",
            "updated": 1611485421498,
            "translations": [
                {
                    "language": "ID",
                    "text": "3. Buat Telegram Grup: Bot-mu akan membroadcast pengumuman disini nantinya.",
                    "updated": 1616928100241,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "3. Создайте Telegram: Ваш бот будет транслировать объявления здесь.",
                    "updated": 1640369753929
                }
            ]
        },
        {
            "style": "List",
            "text": "4. Add your bot in the group: And add @myidbot as user in the group too.",
            "updated": 1611485472896,
            "translations": [
                {
                    "language": "ID",
                    "text": "4. Tambahkan bot-mu kedalam grup: Dan tambahkan juga @myidbot sebagai user didalamnya.",
                    "updated": 1616928168243,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "4. Füge deinen Bot in die Gruppe ein: Und fügen Sie @myidbot auch als Benutzer in der Gruppe hinzu.",
                    "updated": 1634137115127
                },
                {
                    "language": "RU",
                    "text": "4. Добавьте своего бота в группу: И добавьте @myidbot как пользователя в группу тоже.",
                    "updated": 1640369780909
                }
            ]
        },
        {
            "style": "List",
            "text": "5. Type and send /getgroupid in the group: IDBot will answer with the group’s ID.",
            "updated": 1611485491256,
            "translations": [
                {
                    "language": "ID",
                    "text": "5. Ketik dan kirimkan /getgroupid didalam grup: IDBot akan menjawab dengan sebuah group’s ID.",
                    "updated": 1616928215518,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Tippen und senden Sie /getgroupid in die Gruppe: Der IDBot wird mit der ID der Gruppe antworten.",
                    "updated": 1634137139192
                },
                {
                    "language": "RU",
                    "text": "5. Введите и отправьте /getgroupid в группе: IDBot ответит идентификатором группы.",
                    "updated": 1640369799710
                }
            ]
        },
        {
            "style": "Important",
            "text": "You will need this ID at a later time.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Kamu juga akan membutuhkan ID ini nantinya.",
                    "updated": 1616928242124,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie benötigen diese ID später noch.",
                    "updated": 1634137252418
                },
                {
                    "language": "RU",
                    "text": "Этот ID позже вам понадобится.",
                    "updated": 1640369844813
                }
            ]
        },
        {
            "style": "Title",
            "text": "Setting Up the Telegram Bot in Superalgos",
            "translations": [
                {
                    "language": "ID",
                    "text": "Menyiapkan Bot Telegram di Superalgos",
                    "updated": 1616928254405,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Einrichten des Telegram-Bots in Superalgos:",
                    "updated": 1634137346218
                },
                {
                    "language": "RU",
                    "text": "Настройка Telegram-бота в Superalgos",
                    "updated": 1640419944040
                }
            ]
        },
        {
            "style": "Text",
            "text": "You will set up your bot in a backtesting session, so that you may easily test the announcements.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Kamu akan mensetup bot pada backtesting session, sehingga kamu lebih mudah dalam mengetest pengumuman.",
                    "updated": 1616928314869,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie werden Ihren Bot in einer Backtesting-Session einrichten, so dass Sie die Ankündigungen leicht testen können.",
                    "updated": 1634137383775
                },
                {
                    "language": "RU",
                    "text": "Вы настроите своего бота в сессии бэктестинга, чтобы можно было легко протестировать его оповещения.",
                    "updated": 1640419981074
                }
            ]
        },
        {
            "style": "List",
            "text": "1. Go to any of your backtesting sessions and add a Social Bot node using the session’s menu: A social bot will be added along with a telegram bot.",
            "updated": 1611485546279,
            "translations": [
                {
                    "language": "ID",
                    "text": "1. Pergi ke backtesting sessions dan tambahkan Social Bot node dari session’s menu: social bot akan ditambahkan bersama telegram bot.",
                    "updated": 1616928451125,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "1. Gehen Sie zu einer Ihrer Backtesting-Sessions und fügen Sie über das Menü der Session eine Social Bot-node hinzu: Ein Social Bot wird zusammen mit einem Telegram-Bot hinzugefügt.",
                    "updated": 1634137642393
                },
                {
                    "language": "RU",
                    "text": "1. Перейдите в любую из ваших сессий бэктестинга и добавьте узел Social Bot, используя меню сессии: Social Bot будет добавлен вместе с ботом Telegram.",
                    "updated": 1640420020338
                }
            ]
        },
        {
            "style": "List",
            "text": "2. Select Edit Telegram Bot on the telegram bot menu: Replace the placeholder text with the actual botToken and chatId you got earlier.",
            "updated": 1611485581216,
            "translations": [
                {
                    "language": "ID",
                    "text": "2. Pilih Edit Telegram Bot di telegram bot menu: Ubah placeholder text dengan aktual botToken dan chatId yang kamu dapatkan sebelumnya.",
                    "updated": 1616928506093,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Wählen Sie Edit Telegram Bot im Telegram-Bot-Menü: Ersetzen Sie den Platzhaltertext durch den tatsächlichen botToken und die chatId, die Sie zuvor erhalten haben.",
                    "updated": 1634137756639
                },
                {
                    "language": "RU",
                    "text": "2. Выберите Edit Telegram Bot в меню бота Telegram: Замените текст заполнителя на реальные botToken и chatId, которые вы получили ранее.",
                    "updated": 1640420076331
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "For example:",
            "translations": [
                {
                    "language": "ID",
                    "text": "Contohnya:",
                    "updated": 1616928514397,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Zum Beispiel:",
                    "updated": 1634137878962
                },
                {
                    "language": "RU",
                    "text": "Например:",
                    "updated": 1640420088668
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n\"botToken\": \"927642627:2B1QkNX2620C2B1ZTp9JrQUV04YKtJrQ2t4\",\n\"chatId\":-388158765\n}",
            "updated": 1611485597629
        },
        {
            "style": "Text",
            "text": "The system now has everything it needs to communicate with your Telegram bot.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Sistem sekarang memiliki semua yang dibutuhkan untuk berkomunikasi dengan Telegram Bots milikmu.",
                    "updated": 1616928562420,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Das System hat nun alles, was es braucht, um mit Ihrem Telegram Bot zu kommunizieren.",
                    "updated": 1634137902314
                },
                {
                    "language": "RU",
                    "text": "Теперь у системы есть все необходимое для связи с вашим Telegram-ботом.",
                    "updated": 1640420106799
                }
            ]
        },
        {
            "style": "Title",
            "text": "Create Your Announcements",
            "translations": [
                {
                    "language": "ID",
                    "text": "Membuat Pengumumanmu",
                    "updated": 1616928589846,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Erstellen Sie Ihre Ankündigungen:",
                    "updated": 1634138052389
                },
                {
                    "language": "RU",
                    "text": "Создавайте свои оповещения",
                    "updated": 1640420128168
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may create as many announcements as you wish, on any of the events listed in the Overview section above by clicking Add Announcement on the corresponding event node menu.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Kamu akan membuat pengumuman sebanyak yang kamu mau, sesuai dengan event terdaftar pada Overview section diatas dengan mengclick Add Announcement di koresponden menu event node.",
                    "updated": 1616928711745,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie können beliebig viele Ankündigungen zu den oben im Abschnitt Übersicht aufgeführten Ereignissen erstellen, indem Sie im Menü der entsprechenden Ereignis Node auf Add Announcement klicken.",
                    "updated": 1634138203849
                },
                {
                    "language": "RU",
                    "text": "Вы можете создать сколько угодно оповещений по любому из событий, перечисленных в разделе \"Обзор\" выше, нажав Add Announcement в меню соответствующего узла события.",
                    "updated": 1640420373437
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are two different ways in which you may customize announcements:",
            "translations": [
                {
                    "language": "ID",
                    "text": "Ada dua cara berbeda untuk mengkostumisasi pengumuman:",
                    "updated": 1616928734728,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Es gibt zwei verschiedene Möglichkeiten, wie Sie Announcememts (Ankündigungen) anpassen können:",
                    "updated": 1634138277445
                },
                {
                    "language": "RU",
                    "text": "Существует два различных способа настройки уведомлений:",
                    "updated": 1640420389974
                }
            ]
        },
        {
            "style": "List",
            "text": "Plain text",
            "translations": [
                {
                    "language": "DE",
                    "text": "Klartext (Klarer Text)",
                    "updated": 1634138443719
                },
                {
                    "language": "RU",
                    "text": "Обычный текст",
                    "updated": 1640420403726
                }
            ]
        },
        {
            "style": "List",
            "text": "Dynamic content",
            "translations": [
                {
                    "language": "DE",
                    "text": "Dynamischer Inhalt",
                    "updated": 1634138310912
                },
                {
                    "language": "RU",
                    "text": "Динамическое содержимое",
                    "updated": 1640420419291
                }
            ]
        },
        {
            "style": "Success",
            "text": "The Weak-hands buster strategy shipping with Superalgos features a complete set of announcements. Check them out and reuse them in your setup!",
            "updated": 1611485640517,
            "translations": [
                {
                    "language": "ID",
                    "text": "Strategi Weak-hands buster berkaitan dengan fitur Superalgos sebagai serangkaian lengkap dari pengumuman. Lihat mereka dan siapkan kembali di setup!",
                    "updated": 1616928883164,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Die mit Superalgos ausgelieferte Weak-hands-Buster-Strategie enthält ein komplettes Set von announcements. Sieh sie dir an und nutze sie in deinem Setup.",
                    "updated": 1634138392687
                },
                {
                    "language": "RU",
                    "text": "Стратегия Weak-hands buster, поставляемая вместе с Superalgos, содержит полный набор уведомлений. Проверьте их и используйте в своих настройках!",
                    "updated": 1640420499913
                }
            ]
        },
        {
            "style": "Title",
            "text": "Plain Text",
            "translations": [
                {
                    "language": "DE",
                    "text": "Klartext (Klarer Text):",
                    "updated": 1634138453511
                },
                {
                    "language": "RU",
                    "text": "Обычный текст",
                    "updated": 1640420508663
                }
            ]
        },
        {
            "style": "Text",
            "text": "To set a plain text announcement, click Edit Announcement on the announcement node menu and set a message on the field text.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Untuk membuat pengumuman plain text, click Edit Announcement pada announcement node menu dan set pesan di tempat text.",
                    "updated": 1616928982224,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Um eine Klartext-Ansage zu erstellen, klicken Sie im Menü der Announcement Node auf Edit Announcement und geben Sie eine Nachricht in das Feld Text ein.",
                    "updated": 1634138630132
                },
                {
                    "language": "RU",
                    "text": "Чтобы задать обычное текстовое уведомление, нажмите Edit Announcement в меню узла уведомлений и задайте сообщение в тексте поля.",
                    "updated": 1640420536383
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "For example:",
            "translations": [
                {
                    "language": "ID",
                    "text": "Contohnya:",
                    "updated": 1616928991922,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Zum Beispiel:",
                    "updated": 1634138698640
                },
                {
                    "language": "RU",
                    "text": "Например:",
                    "updated": 1640420544201
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n\"text\": \"WHB Triggered-on!\"\n}",
            "updated": 1611485680647
        },
        {
            "style": "Title",
            "text": "Dynamic Content",
            "translations": [
                {
                    "language": "DE",
                    "text": "Dynamischer Inhalt:",
                    "updated": 1634138806038
                },
                {
                    "language": "RU",
                    "text": "Динамическое содержимое",
                    "updated": 1640420559479
                }
            ]
        },
        {
            "style": "Text",
            "text": "To broadcast more elaborate messages that may include dynamic values of any of the current indicators or internal variables, set the message in the formula attached to the announcement instead.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Untuk membroadcast pesan yang lebih rumit yang mungkin menyertakan dynamic content dari salah satu indikator atau variabel internal, atur pesan dengan formula dibawah kedalam pengumuman.",
                    "updated": 1616929292467,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Um umfangreichere Nachrichten zu senden, die dynamische Werte der aktuellen Indikatoren oder internen Variablen enthalten können, legen Sie die Nachricht stattdessen in der Formel fest, die der Ankündigung beigefügt ist.",
                    "updated": 1634138901663
                },
                {
                    "language": "RU",
                    "text": "Для трансляции более сложных сообщений, которые могут включать динамические значения любого из текущих индикаторов или внутренних переменных, задайте сообщение в формуле, прикрепленной к уведомлению.",
                    "updated": 1640420614008
                }
            ]
        },
        {
            "style": "Text",
            "text": "The typical set up for a dynamic message consists of building a string by alternating “text between double quotes” with variables, separating them with plus signs (+).",
            "translations": [
                {
                    "language": "ID",
                    "text": "Penyiapan sederhana untuk pesan Dynamic terdiri dari pembuatan string dengan mengganti \"text diantara tanda kutip\" dengan variabel, dan memisahkannya dengan tanda tambah (+).",
                    "updated": 1616929904380,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Der typische Aufbau einer dynamischen Nachricht besteht darin, dass eine Zeichenkette abwechselnd aus \"Text in Anführungszeichen\" und Variablen besteht, die durch Pluszeichen (+) voneinander getrennt sind.",
                    "updated": 1634139436330
                },
                {
                    "language": "RU",
                    "text": "Типичная установка для динамического сообщения состоит в построении строки путем чередования \"текста в двойных кавычках\" с переменными, разделяя их знаками плюс (+).",
                    "updated": 1640420637971
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example, a typical announcement formula for the take position event may look like this:",
            "translations": [
                {
                    "language": "ID",
                    "text": "Contohnya, formula pengumuman sederhana untuk ambil posisi pada suatu event.",
                    "updated": 1616929983820,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Eine typische announcement-Formel für das Ereignis \"take position\" könnte zum Beispiel so aussehen:",
                    "updated": 1634139522688
                },
                {
                    "language": "RU",
                    "text": "Например, типичная формула оповещения для события \" take position\" может выглядеть следующим образом:",
                    "updated": 1640420680708
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "\"Selling BTC at $\" + candle.close.toFixed(0) + \", with stop at $\" + stopLoss.toFixed(0) + \" and TP target at $\" +  takeProfit.toFixed(0)"
        },
        {
            "style": "Text",
            "text": ".toFixed(0) rounds the number to zero decimal places. The above formula would result in something like:",
            "translations": [
                {
                    "language": "ID",
                    "text": ".toFixed(0) membulatkan angka ke tempat nol desimal. formula di atas akan menghasilkan sesuatu seperti:",
                    "updated": 1616930071150,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": ".toFixed(0) rundet die Zahl auf null Dezimalstellen. Die obige Formel würde etwa Folgendes ergeben:",
                    "updated": 1634139757535
                },
                {
                    "language": "RU",
                    "text": ".toFixed(0) округляет число до нуля после запятой. Приведенная выше формула даст в результате что-то вроде:",
                    "updated": 1640420695703
                }
            ]
        },
        {
            "style": "Json",
            "text": "Selling BTC at $9703, with stop at $9896 and TP target at $9115",
            "translations": [
                {
                    "language": "RU",
                    "text": "Продажа BTC за $9703, с параметрами SL на $9896 и TP на $9115",
                    "updated": 1640420903222
                }
            ]
        },
        {
            "style": "Note",
            "text": "If your formula is valid, the system will ignore the plain text version you may have set up in the announcement configuration. If for any reason the formula results in an error, then the plain text version will be used.",
            "updated": 1611485748590,
            "translations": [
                {
                    "language": "ID",
                    "text": "Jika formulamu valid, Sistem akan mengabaikan versi plain text yang telah kamu atur untuk konfigurasi pengumuman. Jika dalam suatu keadaan formua menghasilkan error, maka versi plain text akan digunakan.",
                    "updated": 1616930177921,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Wenn Ihre Formel gültig ist, ignoriert das System die Klartextversion, die Sie möglicherweise in der announcement configuration (Ankündigungskonfiguration) eingerichtet haben. Sollte die Formel aus irgendeinem Grund zu einem Fehler führen, wird die Klartextversion verwendet.",
                    "updated": 1634140201126
                },
                {
                    "language": "RU",
                    "text": "Если ваша формула верна, система проигнорирует версию обычного текста, которую вы могли установить в конфигурации объявления. Если по какой-либо причине формула приведет к ошибке, то будет использована обычная текстовая версия.",
                    "updated": 1640420935860
                }
            ]
        },
        {
            "style": "Title",
            "text": "Announcements on Stop and Take Profit Phases",
            "translations": [
                {
                    "language": "DE",
                    "text": "Ankündigungen zu Stop und Take Profit Phases:",
                    "updated": 1634140248939
                },
                {
                    "language": "RU",
                    "text": "Объявления о фазах Stop и Take Profit",
                    "updated": 1640420964593
                }
            ]
        },
        {
            "style": "Text",
            "text": "We mentioned earlier that, beyond setting announcements on events, you may also implement announcements at the level of a stop or take profit phase. These are useful to broadcast the management of dynamic stop and take profit targets.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Kami telah jelaskan sebelumnya bahwa, selain menetapkan pengumuman dalam event, Kamu juga dapat menerapkan pengumuman pada level fase stop atau take profit, Hal ini berguna untuk membroadcast manajemen dari dynamic target stop dan target take profit.",
                    "updated": 1616930312081,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wir haben bereits erwähnt, dass Sie nicht nur Ankündigungen zu Ereignissen einstellen können, sondern auch Ankündigungen auf der Ebene einer Stop- oder Take-Profit-Phase implementieren können. Diese sind nützlich, um die Verwaltung von dynamischen Stop- und Take-Profit-targets zu übertragen.",
                    "updated": 1634140571230
                },
                {
                    "language": "RU",
                    "text": "Ранее мы упоминали, что, помимо установки уведомлений о событиях, вы также можете реализовать уведомления на уровне стопа или тейк-профита. Они полезны для трансляции управления динамическими целями стопа и тейк-профита.",
                    "updated": 1640421001890
                }
            ]
        },
        {
            "style": "Text",
            "text": "When implemented at the level of a phase, the announcement is triggered every time the value of the underlying variable (the stop or take profit target) changes. This is an important difference, as the value may change at every candle (if you are using formulas that use variables).",
            "translations": [
                {
                    "language": "ID",
                    "text": "Ketika diterapkan pada level suatu fasem pengumuman akan memicu setiap kali nilai variable yang mendasari (target stop atau take profit) berubah. Hal ini adalah perbedaan penting, karena nilainya dapat berubah di setiap candle (jika kamu menggunakan formula yang menggunakan variabel).",
                    "updated": 1616930435548,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Bei der Implementierung auf Phasenebene wird die announcement (Ankündigung) jedes Mal ausgelöst, wenn sich der Wert der zugrundeliegenden Variable (das Stop- oder Take-Profit-Ziel) ändert. Dies ist ein wichtiger Unterschied, da sich der Wert bei jeder candle (Kerze) ändern kann (wenn Sie Formeln verwenden, die Variablen nutzen).",
                    "updated": 1634141019584
                },
                {
                    "language": "RU",
                    "text": "При реализации на уровне фазы уведомление срабатывает каждый раз, когда изменяется значение базовой переменной (цель стопа или тейк-профита). Это важное отличие, поскольку значение может меняться на каждой свече (если вы используете формулы, в которых используются переменные).",
                    "updated": 1640421032325
                }
            ]
        },
        {
            "style": "Text",
            "text": "This could result in too many announcements in relatively short intervals.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Hal ini dapat mengakibatkan terlalu banyak pengumuman dalam interval yang relatif singkat.",
                    "updated": 1616930454433,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Dies könnte dazu führen, dass in relativ kurzen Abständen zu viele  announcements (Ankündigungen) gemacht werden.",
                    "updated": 1634141068598
                },
                {
                    "language": "RU",
                    "text": "Это может привести к появлению слишком большого количества уведомлений за относительно короткие промежутки времени.",
                    "updated": 1640421057372
                }
            ]
        },
        {
            "style": "Text",
            "text": "The valueVariation parameter introduced in the announcement configuration may be used to filter out announcements until a certain threshold is achieved. The value you enter will set the percentage of variation that needs to occur before a new announcement is broadcasted.",
            "translations": [
                {
                    "language": "ID",
                    "text": "mempengenalkan kedalam konfigurasi pengumuman untuk digunakan dalam memfilter pengumuman hingga ketreshold tertentu. Nilai yang kamu masukkan akan diatur dalam persentase variasi yang dibutuhkan sebelum pengumuman dibroadcast.",
                    "updated": 1616930623021,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Der in der (announcement configuration) Ansagekonfiguration eingeführte Parameter \"valueVariation\" kann verwendet werden, um Ansagen herauszufiltern, bis ein bestimmter Schwellenwert erreicht ist. Der von Ihnen eingegebene Wert legt den Prozentsatz der Abweichung fest, der auftreten muss, bevor eine neue Ansage gesendet wird.",
                    "updated": 1634141303521
                },
                {
                    "language": "RU",
                    "text": "Параметр valueVariation, введенный в конфигурацию уведомления, можно использовать для фильтрации уведомлений до достижения определенного порога. Введенное вами значение будет задавать процент отклонения, который должен произойти, прежде чем новое уведомление будет транслироваться.",
                    "updated": 1640421131555
                }
            ]
        },
        {
            "style": "Text",
            "text": "For instance, \"valueVariation\": 0.5 means a new announcement will be broadcasted every time the value of the underlying variable changes by 0.5%.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Contohnya, \"valueVariation\": 0.5 artinya pengumuman baru akan di broadcast setiap kali nilai dari dasar variabel berubah sebanyak 0.5%.",
                    "updated": 1616930700904,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Zum Beispiel bedeutet \"valueVariation\": 0,5  dass jedes Mal, wenn sich der Wert der zugrunde liegenden Variablen um 0,5 % ändert, eine neue Meldung gesendet wird.",
                    "updated": 1634141412852
                },
                {
                    "language": "RU",
                    "text": "Например, \"valueVariation\": 0.5 означает, что новое объявление будет транслироваться каждый раз, когда значение базовой переменной изменится на 0.5%.",
                    "updated": 1640421146222
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n\"text\": \"Write here what you want to announce.\",\n\"valueVariantion\": 0.5\n}",
            "updated": 1611485849624
        },
        {
            "style": "Title",
            "text": "Finishing the Setup",
            "translations": [
                {
                    "language": "ID",
                    "text": "Menyelesaikan Setup",
                    "updated": 1616930723890,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Fertigstellung der Einrichtung:",
                    "updated": 1634141441661
                },
                {
                    "language": "RU",
                    "text": "Завершение настройки",
                    "updated": 1640421156173
                }
            ]
        },
        {
            "style": "Text",
            "text": "It is unlikely that you will want to use the announcements feature from within a backtesting session. A more likely scenario is you will want to use it with a paper trading session (to generate signals) or from a live trading session, to monitor the activity of your live trading.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Kemungkinan kecil kamu akan menggunakan fitur pengumuman dari backtesting session. Skenario yang lebih memungkinkan jika kamu ingin menggunakannya dengan paper trading session (Menggenerate sinyal) atau dari live trading session, untuk memonitor aktivitas dari live tradingmu.",
                    "updated": 1616930923555,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Es ist unwahrscheinlich, dass Sie die Ankündigungsfunktion im Rahmen einer Backtesting-Sitzung verwenden möchten. Wahrscheinlicher ist es, dass Sie die Funktion in einer paper trading session (zur Generierung von Signalen) oder in einer Live-trading-session verwenden möchten, um die Aktivitäten Ihres Live-Handels zu überwachen.",
                    "updated": 1634141656071
                },
                {
                    "language": "RU",
                    "text": "Маловероятно, что вы захотите использовать функцию уведомлений в рамках сессии бэктестинга. Более вероятно, что вы захотите использовать ее в бумажной торговой сессии (для генерации сигналов) или в реальной торговой сессии, чтобы отслеживать активность вашей реальной торговли.",
                    "updated": 1640421191287
                }
            ]
        },
        {
            "style": "Text",
            "text": "All you need to do to finish your set up is detach the social bot node from the backtesting session and attach it to the session you wish to use it in. Make sure the corresponding tasks are stopped before detaching and attaching the social bot.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Yang perlu kamu lakukan untuk menyelesaikan penyiapan ini adalah melepaskan social bot node dari backtesting session dan pasangkan kepada session yang kamu inginkan. Pastikan tasks yang berjalan sudah berhenti sebelum melepaskan dan memasangkan social bot.",
                    "updated": 1616931073057,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Um die Einrichtung abzuschließen, müssen Sie nur noch die Social Bot Node von der Backtesting-Sitzung trennen und sie an die Sitzung anhängen, in der Sie sie verwenden möchten. Vergewissern Sie sich, dass die dazugehörigen Aufgaben gestoppt sind, bevor Sie den Social Bot abnehmen und anhängen.",
                    "updated": 1634141864376
                },
                {
                    "language": "RU",
                    "text": "Для завершения настройки достаточно отсоединить узел Social Bot от сессии бэктестинга и присоединить его к сессии, в которой вы хотите его использовать. Убедитесь, что соответствующие задачи остановлены перед отсоединением и присоединением бота Social Bot.",
                    "updated": 1640421271954
                }
            ]
        },
        {
            "style": "Title",
            "text": "Commercial Setups",
            "translations": [
                {
                    "language": "ID",
                    "text": "Setup untuk Komersial",
                    "updated": 1616931096555,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Kommerzielle Einrichtungen:",
                    "updated": 1634141888154
                },
                {
                    "language": "RU",
                    "text": "Коммерческие настройки",
                    "updated": 1640421303408
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you are settting up a signals business or require a more complex setup to broadcast announcements from multiple sessions, multiple strategies, or even to multiple groups, the following considerations may help you decide how to move forwards.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Jika kamu sedang menyiapkan bisnis sinyal atau memerlukan penyiapan yang lebih kompleks untuk membroadcast pengumuman dari beberapa sessions, beberapa strategi, atau bahkan kebeberapa grup, Hal ini akan membantu mempertimbangkan keputusanmu untuk keberikutnya.",
                    "updated": 1616931205053,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie ein Signal-business einrichten oder eine komplexere Einrichtung benötigen, um Ankündigungen von mehreren Sitzungen, mehreren Strategien zu empfangen oder sogar an mehrere Gruppen zu senden, können Ihnen die folgenden Überlegungen bei der Entscheidung helfen, wie Sie vorgehen wollen.",
                    "updated": 1634142140213
                },
                {
                    "language": "RU",
                    "text": "Если вы создаете бизнес по сигналам или вам требуется более сложная настройка для трансляции уведомлений из нескольких сессий, нескольких стратегий или даже для нескольких групп, следующие соображения могут помочь вам решить, как двигаться дальше.",
                    "updated": 1640421356486
                }
            ]
        },
        {
            "style": "Important",
            "text": "Telegram does not allow running multiple instances of the same bot. Doing so may produce warnings, cause errors, delays in message delivery, lost messages, and erratic behavior in general.",
            "updated": 1611485876079,
            "translations": [
                {
                    "language": "ID",
                    "text": "Telegram tidak mengizinkan menjalankan banyak instance dari bot yang sama. Melakukan hal tersebut dapat menghasilkan peringatan, menyebabkan kesalahan, keterlambatan pengiriman pesan, pesan hilang, dan perilaku tidak menentu secara umum dari malfungsi bot.",
                    "updated": 1616931335441,
                    "style": "Important"
                },
                {
                    "language": "RU",
                    "text": "Telegram не позволяет запускать несколько экземпляров одного и того же бота. Это может вызвать предупреждения, ошибки, задержки в доставке сообщений, потерю сообщений и нестабильное поведение в целом.",
                    "updated": 1640421374136
                }
            ]
        },
        {
            "style": "Text",
            "text": "The solution is quite simple. Set up multiple bots. The rule of thumb is you should use one bot for each trading session. Remember you can include as many bots as you wish in your Telegram groups. That is, you may have different bots broadcast from different sessions in the same group.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Solusinya cukup mudah. Siapkan multiple bot. Aturan mainnya adalah kamu harus menggunakan satu untuk setiap sesi trading. Ingat kamu dapat memasukkan bot sebanyak kamu inginkan kedalam grup Telegrammu. Aritnya, kamu mungkin memiliki bot berbeda yang dibroadcast dari session berbeda dalam grup yang sama.",
                    "updated": 1616931501454,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Telegram erlaubt es nicht, mehrere Instanzen desselben Bots zu betreiben. Dies kann zu Warnungen, Fehlern, Verzögerungen bei der Nachrichtenzustellung, verlorenen Nachrichten und allgemeinem unregelmäßigem Verhalten führen.",
                    "updated": 1634142192077,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Решение довольно простое. Установите несколько ботов. По эмпирическому правилу, вы должны использовать одного бота для каждой торговой сессии. Помните, что вы можете включать в свои группы Telegram столько ботов, сколько захотите. То есть в одной группе могут быть разные боты, вещающие с разных сессий.",
                    "updated": 1640421401034
                }
            ]
        },
        {
            "style": "Success",
            "text": "If you wish to broadcast signals from multiple sessions to the same Telegram Group, you may name each bot in a way that each references their specific session, so that group members know exactly what each message is referring to.",
            "updated": 1611485909076,
            "translations": [
                {
                    "language": "ID",
                    "text": "Jika kamu ingin membroadcast sinyal dari beberapa session kedalam grup Telegram yang sama, kamu dapat menamai setiap bot dengan referesinya masing-masing terhadap spesifik session. Sehingga anggota grup tahu persis apa yang dirujuk setiap pesan.",
                    "updated": 1616931602612,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Die Lösung ist ganz einfach. Richten Sie mehrere Bots ein. Als Faustregel gilt, dass Sie für jede Trading-Session einen Bot verwenden sollten. Denken Sie daran, dass Sie so viele Bots in Ihre Telegram-Gruppen aufnehmen können, wie Sie möchten. Das heißt, Sie können verschiedene Bots von verschiedenen Sitzungen in derselben Gruppe senden lassen.",
                    "updated": 1634142359920
                },
                {
                    "language": "RU",
                    "text": "Если вы хотите транслировать сигналы из нескольких сессий в одну группу Telegram, вы можете назвать каждого бота таким образом, чтобы каждый из них ссылался на свою конкретную сессию, чтобы члены группы точно знали, к чему относится каждое сообщение.",
                    "updated": 1640421422341
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example, let’s say you are broadcasting signals from different markets… you may name your bots BTC/USDT, ETH/USDT and XMR/BTC.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Misalnya, kamu membroadcast sinyal dari market yang berbeda… Kamu dapat menamai bot dengan BTC / USDT, ETH / USDT, dan XMR / BTC.",
                    "updated": 1616931653602,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Nehmen wir zum Beispiel an, Sie senden Signale von verschiedenen Märkten... Sie können Ihre Bots BTC/USDT, ETH/USDT und XMR/BTC nennen.",
                    "updated": 1634142490405
                },
                {
                    "language": "RU",
                    "text": "Допустим, вы транслируете сигналы с разных рынков... вы можете назвать своих ботов BTC/USDT, ETH/USDT и XMR/BTC.",
                    "updated": 1640421440246
                }
            ]
        },
        {
            "style": "Text",
            "text": "Or maybe you have different strategies, then simply name the bots after each strategy.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Atau mungkin kamu memiliki strategi yang berbeda, maka cukup beri nama bot dengan setiap strategi.",
                    "updated": 1616931697879,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Oder vielleicht haben Sie verschiedene Strategien, dann benennen Sie die Bots einfach nach jeder Strategie.",
                    "updated": 1634142528664
                },
                {
                    "language": "RU",
                    "text": "Или, может быть, у вас есть разные стратегии, тогда просто назовите ботов в честь каждой стратегии.",
                    "updated": 1640421452375
                }
            ]
        },
        {
            "style": "Text",
            "text": "This makes it really easy for group members to know what market or strategy the bot broadcasting the signal is referring to.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Ini membuatnya sangat mudah bagi anggota grup untuk mengetahui market atau strategi apa yang dirujuk oleh bot yang membroadcast sinyal.",
                    "updated": 1616931728131,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "So können die Gruppenmitglieder leicht erkennen, auf welchen Markt oder welche Strategie sich der Bot, der das Signal sendet, bezieht.",
                    "updated": 1634142549897
                },
                {
                    "language": "RU",
                    "text": "Это позволяет членам группы легко понять, к какому рынку или стратегии относится бот, передающий сигнал.",
                    "updated": 1640421465853
                }
            ]
        },
        {
            "style": "Text",
            "text": "Another example… let’s say you are running a trading operation for friends and family. Each person is working with a different initial capital, different assets or different exchanges. in such case, you may set up multiple Telegram groups and multiple bots, so that each person may get precise information on what the bots are doing.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Contoh lain… misalkan kamu menjalankan trading operation untuk teman dan keluarga. Setiap orang bekerja dengan modal awal yang berbeda, aset yang berbeda, atau exchange yang berbeda. dalam kasus seperti itu, kamu dapat mengatur beberapa grup Telegram dan beberapa bot, sehingga setiap orang dapat memperoleh informasi yang tepat tentang apa yang dilakukan bot tersebut.",
                    "updated": 1616931801957,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Ein anderes Beispiel... nehmen wir an, Sie betreiben eine trading operation für Freunde und Familie. Jede Person arbeitet mit einem anderen Anfangskapital, anderen Vermögenswerten oder anderen exchanges. In diesem Fall können Sie mehrere Telegram-Gruppen und mehrere Bots einrichten, so dass jede Person genaue Informationen darüber erhält, was die Bots tun.",
                    "updated": 1634142831015
                },
                {
                    "language": "RU",
                    "text": "Другой пример... Допустим, вы ведете торговые операции для друзей и членов семьи. Каждый человек работает с разным начальным капиталом, разными активами или разными биржами. В таком случае вы можете создать несколько групп Telegram и несколько ботов, чтобы каждый человек мог получать точную информацию о том, что делают боты.",
                    "updated": 1640421492655
                }
            ]
        }
    ]
}