{
    "topic": "Productivity Tools",
    "pageNumber": "2",
    "type": "Clones",
    "definition": {
        "text": "The clone feature is designed to produce copies of data structures when you need to replicate structures of nodes and expect the copies to behave similarly to the original.",
        "updated": 1615832633335,
        "translations": [
            {
                "language": "ES",
                "text": "La función clone está diseñada para producir copias de estructuras de datos cuando necesita replicar estructuras de nodos y espera que las copias se comporten de manera similar al original.",
                "updated": 1628036115149
            },
            {
                "language": "TR",
                "text": "Klonlama özelliği, düğüm yapılarını çoğaltmanız gerektiğinde ve kopyaların orijinaline benzer şekilde davranmasını beklediğinizde veri yapılarının kopyalarını üretmek için tasarlanmıştır.",
                "updated": 1639485185668
            },
            {
                "language": "RU",
                "text": "Функция клонирования предназначена для создания копий структур данных, когда вам нужно повторить структуры узлов и ожидать, что копии будут вести себя аналогично оригиналу.",
                "updated": 1640436163796
            },
            {
                "language": "DE",
                "text": "Die Funktion \"Klonen\" wurde entwickelt, um Kopien von Datenstrukturen zu erstellen, wenn Sie Strukturen von Knoten replizieren müssen und erwarten, dass sich die Kopien ähnlich wie das Original verhalten.",
                "updated": 1681245510659
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Introduction",
            "updated": 1611490329180,
            "translations": [
                {
                    "language": "RU",
                    "text": "Введение",
                    "updated": 1640436169498
                },
                {
                    "language": "DE",
                    "text": "Einführung",
                    "updated": 1681245518525
                }
            ]
        },
        {
            "style": "Text",
            "text": "We will analyze the case of clones under the same lens we analyzed how backups work: we will study how clones treat outgoing, incoming and internal references.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Yedeklemelerin nasıl çalıştığını anlattığımız gibi aynı şekilde klonların durumunuda analiz edeceğiz: klonların giden, gelen ve dahili referanslarla nasıl çalıştığını inceleyeceğiz.",
                    "updated": 1639727583977
                },
                {
                    "language": "RU",
                    "text": "Мы проанализируем случай с клонами через ту же призму, через которую мы анализировали работу резервного копирования: мы изучим, как клоны относятся к исходящим, входящим и внутренним ссылкам.",
                    "updated": 1640436212272
                },
                {
                    "language": "DE",
                    "text": "Wir werden den Fall der Klone unter demselben Blickwinkel analysieren, unter dem wir die Funktionsweise von Backups untersucht haben: Wir werden untersuchen, wie Klone ausgehende, eingehende und interne Referenzen behandeln.",
                    "updated": 1681245584286
                }
            ]
        },
        {
            "style": "Note",
            "text": "Unlike backups, clones behave in the same way independently of the existence of the original structure of nodes in the workspace, therefore, we will not make such distinction in the following paragraphs.",
            "updated": 1615832413196,
            "translations": [
                {
                    "language": "TR",
                    "text": "Yedeklemelerden farklı olarak klonlar, çalışma alanındaki düğümlerin orijinal yapısının varlığından bağımsız olarak davranırlar, bu nedenle aşağıdaki paragraflarda böyle bir ayrım yapmayacağız.",
                    "updated": 1639727826510
                },
                {
                    "language": "RU",
                    "text": "В отличие от резервного копирования, клоны ведут себя одинаково независимо от существования исходной структуры узлов в рабочем пространстве, поэтому в следующих параграфах мы не будем делать такого различия.",
                    "updated": 1640436240617
                },
                {
                    "language": "DE",
                    "text": "Im Gegensatz zu Backups verhalten sich Klone unabhängig vom Vorhandensein der ursprünglichen Knotenstruktur im Arbeitsbereich auf die gleiche Weise, daher wird in den folgenden Abschnitten keine Unterscheidung getroffen.",
                    "updated": 1681245600381
                }
            ]
        },
        {
            "style": "Title",
            "text": "Outgoing References",
            "translations": [
                {
                    "language": "TR",
                    "text": "Giden Referanslar",
                    "updated": 1639727842811
                },
                {
                    "language": "RU",
                    "text": "Исходящие ссылки",
                    "updated": 1640436250595
                },
                {
                    "language": "DE",
                    "text": "Ausgehende Referenzen",
                    "updated": 1681245607032
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Outgoing references are kept intact.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Giden referanslar bozulmadan korunur.",
                    "updated": 1639727871092
                },
                {
                    "language": "RU",
                    "text": "Исходящие ссылки сохраняются в неизменном виде.",
                    "updated": 1640436257985
                },
                {
                    "language": "DE",
                    "text": "Ausgehende Referenzen werden beibehalten.",
                    "updated": 1681245622261
                }
            ]
        },
        {
            "style": "Text",
            "text": "Pretty much like with backups, a clone preserves outgoing references.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Yedeklemelerde olduğu gibi, bir klon giden referansları korur.",
                    "updated": 1639727911841
                },
                {
                    "language": "RU",
                    "text": "Как и при резервном копировании, клон сохраняет исходящие ссылки.",
                    "updated": 1640436268193
                },
                {
                    "language": "DE",
                    "text": "Ähnlich wie bei Backups bleiben bei einem Klon die ausgehenden Referenzen erhalten.",
                    "updated": 1681245634803
                }
            ]
        },
        {
            "style": "Text",
            "text": "The same example as with backups apply: cloning a Task running a Backtesting Session produces a copy of the Task with the Trading Process Instance maintaining the reference to the Trading Bot Multi-Time-Frame process, Trading Session Reference maintaining the reference to the corresponding Trading System, and the Trading Engine Reference keeping the reference to the Trading Engine hierarchy.",
            "updated": 1615832824246,
            "translations": [
                {
                    "language": "TR",
                    "text": "Yedeklerdeki kurallar geçerlidir: Bir Geri Test Oturumu ( Backtesting Session ) çalıştıran bir Görevin klonlanması, Trading Process Instance ile Trading Bot Multi-Time-Frame process'e referansı koruyan Görevin bir kopyasını üretir.",
                    "updated": 1639733042252
                },
                {
                    "language": "RU",
                    "text": "Применяется тот же пример, что и с резервным копированием: клонирование задачи, выполняющей сессию бэктестинга, создает копию задачи с экземпляром торгового процесса, сохраняющим ссылку на многотаймфреймовый процесс торгового бота, ссылку на торговую сессию, сохраняющую ссылку на соответствующую торговую систему, и ссылку на торговый движок, сохраняющую ссылку на иерархию торгового движка.",
                    "updated": 1640436301725
                },
                {
                    "language": "DE",
                    "text": "Es gilt das gleiche Beispiel wie für Backups: Das Klonen eines Task ´s, der eine Backtesting-Sitzung (Backtesting Session) ausführt, erzeugt eine Kopie des Task ´s, wobei die Instanz des Handelsprozesses (Trading Process Instance) den Verweis auf den Multi-Time-Frame-Prozess (Trading Bot Multi-Time-Frame) des Handelsroboters, die Referenz der Handelssitzung (Trading Session Reference) den Verweis auf das entsprechende Handelssystem (Trading System) und die Referenz der Handelsmaschine (Trading Engine Reference) den Verweis auf die Hierarchie der Handelsmaschine (Trading Engine) beibehält.",
                    "updated": 1681245650205
                }
            ]
        },
        {
            "style": "Gif",
            "text": "GIFs/Foundations/Docs/design-space/clones-01.gif",
            "updated": 1611490442818
        },
        {
            "style": "Title",
            "text": "Incoming References",
            "translations": [
                {
                    "language": "TR",
                    "text": "Gelen Referanslar",
                    "updated": 1639733053281
                },
                {
                    "language": "RU",
                    "text": "Входящие ссылки",
                    "updated": 1640436311700
                },
                {
                    "language": "DE",
                    "text": "Eingehende Referenzen",
                    "updated": 1681245675329
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Incoming references are discarded.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Gelen referanslar iptal olur:",
                    "updated": 1639733147674
                },
                {
                    "language": "RU",
                    "text": "Входящие ссылки отбрасываются.",
                    "updated": 1640436320019
                },
                {
                    "language": "DE",
                    "text": "Eingehende Verweise werden verworfen.",
                    "updated": 1681245682438
                }
            ]
        },
        {
            "style": "Text",
            "text": "Let’s go back to the example of a Trading System, like we did when exploring backups:",
            "updated": 1615838266411,
            "translations": [
                {
                    "language": "TR",
                    "text": "Yedekler konusunda olduğu gibi,Ticaret Sistemi ( Trading System ) örneğine geri dönelim:",
                    "updated": 1639733230695
                },
                {
                    "language": "RU",
                    "text": "Давайте вернемся к примеру торговой системы, как мы это делали при изучении резервного копирования:",
                    "updated": 1640436333485
                },
                {
                    "language": "DE",
                    "text": "Kehren wir zu dem Beispiel eines Handelssystems (Trading System) zurück, wie wir es bei der Untersuchung der Backups getan haben:",
                    "updated": 1681245692283
                }
            ]
        },
        {
            "style": "Gif",
            "text": "GIFs/Foundations/Docs/design-space/clones-02.gif",
            "updated": 1611490471957
        },
        {
            "style": "Text",
            "text": "The capture above shows that restoring a clone of a trading system does not restore incoming references, even when the original structure of nodes is deleted before restoration.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Yukarıdaki videoda,klonlanmış Trading system düğümü geri yüklendiğinde, orjinal düğüm silinse de  gelen referansların yüklenmediğini görüyorsunuz.",
                    "updated": 1639733443540
                },
                {
                    "language": "RU",
                    "text": "Приведенный выше фрагмент показывает, что восстановление клона торговой системы не восстанавливает входящие ссылки, даже если исходная структура узлов удалена перед восстановлением.",
                    "updated": 1640436383846
                },
                {
                    "language": "DE",
                    "text": "Die obige Abbildung zeigt, dass die Wiederherstellung eines Klons eines Handelssystems eingehende Referenzen nicht wiederherstellt, selbst wenn die ursprüngliche Struktur der Knoten vor der Wiederherstellung gelöscht wird.",
                    "updated": 1681245708945
                }
            ]
        },
        {
            "style": "Title",
            "text": "Internal References",
            "translations": [
                {
                    "language": "TR",
                    "text": "Dahili Referanslar",
                    "updated": 1639733458461
                },
                {
                    "language": "RU",
                    "text": "Внутренние ссылки",
                    "updated": 1640436393056
                },
                {
                    "language": "DE",
                    "text": "Interne Referenzen",
                    "updated": 1681245718188
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Internal references are kept intact.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Dahili referanslar olduğu gibi korunur.",
                    "updated": 1639733485229
                },
                {
                    "language": "RU",
                    "text": "Внутренние ссылки сохраняются в неизменном виде.",
                    "updated": 1640436401634
                },
                {
                    "language": "DE",
                    "text": "Interne Verweise werden beibehalten.",
                    "updated": 1681245734564
                }
            ]
        },
        {
            "style": "Text",
            "text": "Going back to the shapes node example, the capture below shows how restoring a clone keeps internal references intact:",
            "updated": 1615838297924,
            "translations": [
                {
                    "language": "TR",
                    "text": "Shape düğümü örneğine geri dönersek, aşağıdaki video, bir klonu geri yüklemenin dahili referansları koruduğunu gösterir:",
                    "updated": 1639733528241
                },
                {
                    "language": "RU",
                    "text": "Возвращаясь к примеру с узлом Shape, ниже показано, как при восстановлении клона внутренние ссылки остаются нетронутыми:",
                    "updated": 1640436435805
                },
                {
                    "language": "DE",
                    "text": "Um auf das Beispiel des Shapes-Knotens zurückzukommen, zeigt die folgende Abbildung, wie bei der Wiederherstellung eines Klons die internen Referenzen intakt bleiben:",
                    "updated": 1681245741467
                }
            ]
        },
        {
            "style": "Gif",
            "text": "GIFs/Foundations/Docs/design-space/clones-03.gif",
            "updated": 1611490496345
        },
        {
            "style": "Title",
            "text": "Conclusion",
            "translations": [
                {
                    "language": "TR",
                    "text": "Sonuç",
                    "updated": 1639733544334
                },
                {
                    "language": "RU",
                    "text": "Заключение",
                    "updated": 1640436443663
                },
                {
                    "language": "DE",
                    "text": "Schlussfolgerung",
                    "updated": 1681245755590
                }
            ]
        },
        {
            "style": "Text",
            "text": "The clone feature is designed to produce copies of data structures when you need to replicate nodes and expect the copies to behave similarly to the original.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Klonlama özelliği, düğümleri çoğaltmanız gerektiğinde ve kopyaların orijinaline benzer şekilde davranmasını beklediğiniz durumlarda veri yapılarının kopyalarını üretmek için tasarlanmıştır.",
                    "updated": 1639733583210
                },
                {
                    "language": "RU",
                    "text": "Функция клонирования предназначена для создания копий структур данных, когда вам нужно повторить узлы и ожидать, что копии будут вести себя аналогично оригиналу.",
                    "updated": 1640436468063
                },
                {
                    "language": "DE",
                    "text": "Die Klonfunktion wurde entwickelt, um Kopien von Datenstrukturen zu erstellen, wenn Sie Knoten replizieren müssen und erwarten, dass sich die Kopien ähnlich wie das Original verhalten.",
                    "updated": 1681245764655
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}