{
    "type": "Data Formula",
    "definition": {
        "text": "A data formula is a device used to assign a value to the panel data, usually in the form of the name of the corresponding record property.",
        "translations": [
            {
                "language": "RU",
                "text": "Data Formula - это устройство, используемое для присвоения значения данным панели, обычно в виде имени соответствующего свойства записи.",
                "updated": 1638730053531
            },
            {
                "language": "TR",
                "text": "Veri formülü, panel verilerine genellikle ilgili kayıt özelliğinin adı biçiminde bir değer atamak için kullanılan bir araçtır.",
                "updated": 1654391638903
            },
            {
                "language": "DE",
                "text": "Eine Datenformel ist ein Hilfsmittel, das dazu dient, den Paneldaten einen Wert zuzuweisen, normalerweise in Form des Namens der entsprechenden Datensatzeigenschaft.",
                "updated": 1708265570803
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования.",
                    "updated": 1638730063418
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle deyin. Yeni paragraflar yazmak için ENTER tuşuna basın. Düzenleme modundan çıkmak için ESC.",
                    "updated": 1654391645019,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen.",
                    "updated": 1708265571007,
                    "style": "Text"
                }
            ]
        }
    ]
}