{
    "type": "End",
    "definition": {
        "text": "End is the datetime on which the object represented by the parent node ceased to exist. In case the object has not been closed yet, it is the datetime at the moment of evaluation.",
        "translations": [
            {
                "language": "RU",
                "text": "End - это дата и время, в которые объект, представленный родительским узлом, перестал существовать. В случае, если объект еще не был закрыт, это дата и время на момент оценки.",
                "updated": 1638771563592
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "In the context of a candle, it is the datetime of the close of the candle as provided by the exchange.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В контексте свечи это дата и время закрытия свечи, предоставленная биржей.",
                    "updated": 1638771609137
                }
            ]
        },
        {
            "style": "Text",
            "text": "In every other context, the datetime is given by the datetime of the moment of evaluation. When evaluating a point in time in which the object remains open, end stores the datetime of that moment, because the object existed until that point in time when the value was last being updated. Once the object is closed, the end value is not modified again.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В любом другом контексте дата-время определяется датой и временем момента оценки. При оценке момента времени, в котором объект остается открытым, End сохраняет дату и время этого момента, поскольку объект существовал до того момента времени, когда значение обновлялось в последний раз. Как только объект закрыт, конечное значение больше не изменяется.",
                    "updated": 1638771716969
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609873831169
        },
        {
            "style": "Title",
            "text": "End Configuration",
            "updated": 1609880073775,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация End",
                    "updated": 1638771749313
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609873980538,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1638771755962
                }
            ]
        },
        {
            "style": "List",
            "text": "initialValue allows resetting the initial state of the node to an arbitrary value.",
            "updated": 1609875415147,
            "translations": [
                {
                    "language": "RU",
                    "text": "initialValue позволяет сбросить начальное состояние узла на произвольное значение.",
                    "updated": 1638771766287
                }
            ]
        }
    ]
}