{
    "topic": "Frequently Asked Questions",
    "pageNumber": "2",
    "type": "How does the system handle changes to trading system during live trading?",
    "definition": {
        "text": "You need to restart the Trading Session and sometimes the Task in order for the Bot to get the new definitions.",
        "updated": 1622293227672,
        "translations": [
            {
                "language": "DE",
                "text": "Sie müssen die Trading Session (Handelssitzung) und manchmal auch die Task neu starten, damit der Bot die neuen Definitionen erhält.",
                "updated": 1640212896177
            },
            {
                "language": "RU",
                "text": "Вам необходимо перезапустить торговую сессию (Trading Session), а иногда и задачу (Task), чтобы бот получил новые определения.",
                "updated": 1640282447773
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Users cannot change the definitions and feed them to a running bot in real time. If the definitions are at the Trading System level, or the Session Parameters level, you can change them and they will be sent to the running Task the next time you stop and run the Trading Session again.",
            "updated": 1622293262444,
            "translations": [
                {
                    "language": "DE",
                    "text": "Benutzer können die Definitionen nicht ändern und sie in Echtzeit an einen laufenden Bot weiterleiten. Wenn sich die Definitionen auf der Ebene des Trading System oder der Session Parameters (Sitzungsparameter) befinden, können Sie sie ändern und sie werden an die laufende Aufgabe gesendet, wenn Sie die Trading Session das nächste Mal anhalten und erneut starten.",
                    "updated": 1640213014971
                },
                {
                    "language": "RU",
                    "text": "Пользователи не могут изменять определения и передавать их работающему боту в режиме реального времени. Если определения находятся на уровне торговой системы (Trading System) или на уровне параметров сессии (Session Parameters), вы можете изменить их, и они будут отправлены в запущенную задачу (Task) в следующий раз, когда вы остановите и снова запустите торговую сессию.",
                    "updated": 1640282542998
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the definitions are at the Task level or upwards, like a change of market, you will need to stop the Task and run it again in order to be recognized.",
            "updated": 1640213065343,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn die Definitionen auf der Task Ebene oder höher liegen, z. B. bei einem Marktwechsel (change of market), müssen Sie die Task anhalten und erneut ausführen, damit er erkannt wird.",
                    "updated": 1640213189966
                },
                {
                    "language": "RU",
                    "text": "Если определения находятся на уровне задачи или выше, например, смена рынка, вам нужно будет остановить задачу и запустить ее снова, чтобы она была обнаружена.",
                    "updated": 1640282628385
                }
            ]
        }
    ]
}