{
    "topic": "Pluvtech Data Mine",
    "pageNumber": "3",
    "type": "Waddah Attar",
    "definition": {
        "text": "The Waddah Attar Indicator may help identify the likely trend and/or turning points in the market.",
        "updated": 1622686933380,
        "translations": [
            {
                "language": "RU",
                "text": "Индикатор Waddah Attar может помочь определить вероятную тенденцию и/или поворотные моменты на рынке.",
                "updated": 1645609837387
            },
            {
                "language": "DE",
                "text": "Der Waddah Attar Indikator kann helfen, den wahrscheinlichen Trend und/oder Wendepunkte auf dem Markt zu erkennen.",
                "updated": 1647446786047
            },
            {
                "language": "TR",
                "text": "Waddah Attar Göstergesi, piyasadaki olası eğilimi ve/veya dönüm noktalarını belirlemeye yardımcı olabilir.",
                "updated": 1697833918546
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Info:",
            "updated": 1622481793076,
            "translations": [
                {
                    "language": "RU",
                    "text": "Информация:",
                    "updated": 1645609843803
                },
                {
                    "language": "DE",
                    "text": "Infos:",
                    "updated": 1647446797950
                },
                {
                    "language": "TR",
                    "text": "Bilgi:",
                    "updated": 1697833925666
                }
            ]
        },
        {
            "style": "Text",
            "text": "Merges the Bollinger Bands and MACD together in a special way. This allows it to identify the start of the price explosion situations with very high accuracy. These explosions happen every day and sometimes multiple times a day. By using the Waddah Attar Explosion indicator you can know when this explosion begins and when they end with a high degree of success.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Особым образом объединяет полосы Боллинджера и MACD. Это позволяет ему с очень высокой точностью определять начало ситуаций ценового всплеска. Такие всплески происходят каждый день, а иногда и несколько раз в день. Используя индикатор Waddah Attar Explosion, вы можете с высокой степенью успеха узнать, когда начинается такоие всплески и когда они заканчиваются.",
                    "updated": 1645609959792
                },
                {
                    "language": "DE",
                    "text": "Kombiniert die Bollinger Bänder und den MACD auf eine besondere Art und Weise. Dadurch kann er den Beginn von Preisexplosionen mit sehr hoher Genauigkeit erkennen. Diese Explosionen finden jeden Tag statt, manchmal sogar mehrmals am Tag. Mit dem Waddah Attar Explosion Indikator können Sie mit einem hohen Maß an Erfolg erkennen, wann diese Explosionen beginnen und wann sie enden.",
                    "updated": 1647446836014
                },
                {
                    "language": "TR",
                    "text": "Bollinger Bantları ve MACD'yi özel bir şekilde bir araya getirir. Bu, fiyat patlaması durumlarının başlangıcını çok yüksek doğrulukla belirlemesini sağlar. Bu patlamalar her gün ve bazen günde birden çok kez gerçekleşir. Waddah Attar Explosion göstergesini kullanarak bu patlamanın ne zaman başladığını ve ne zaman bittiğini yüksek bir başarı ile öğrenebilirsiniz.",
                    "updated": 1697833971638
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are three elements of the Waddah Attar explosion indicator:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Индикатор Waddah Attar состоит из трех элементов:",
                    "updated": 1645609984680
                },
                {
                    "language": "DE",
                    "text": "Der Waddah Attar Explosionsindikator besteht aus drei Elementen:",
                    "updated": 1647446846852
                },
                {
                    "language": "TR",
                    "text": "Waddah Attar patlama göstergesinin üç unsuru vardır:",
                    "updated": 1697834005858
                }
            ]
        },
        {
            "style": "List",
            "text": "1. Explosion line: Price explosion begins when the explosion line is at its lowest value and starts to increase with price action.",
            "translations": [
                {
                    "language": "RU",
                    "text": "1. Explosion line: Ценовой всплеск начинается, когда линия всплеска находится на самом низком значении и начинает расти по мере ценового действия.",
                    "updated": 1645610021801
                },
                {
                    "language": "DE",
                    "text": "<b>1. Explosionslinie:</b> Die Kursexplosion beginnt, wenn die Explosionslinie ihren niedrigsten Wert erreicht hat und mit der Kursbewegung ansteigt.",
                    "updated": 1647446857301
                },
                {
                    "language": "TR",
                    "text": "1. Patlama çizgisi ( Explosion line ) : Fiyat patlaması, patlama çizgisi en düşük değerdeyken başlar ve fiyat hareketiyle artmaya başlar.",
                    "updated": 1697834037954
                }
            ]
        },
        {
            "style": "List",
            "text": "2. Uptrend/Downtrend: Specifies a strong trend in up direction (green) or down direction (red). A buy signal could be generated when the trend is higher than the explosion line.",
            "translations": [
                {
                    "language": "RU",
                    "text": "2. Uptrend/Downtrend: Указывает на сильный тренд в направлении вверх (зеленый) или вниз (красный). Сигнал на покупку может быть сгенерирован, если тренд выше линии пробоя.",
                    "updated": 1645610053715
                },
                {
                    "language": "DE",
                    "text": "<b>2. Aufwärtstrend/Abwärtstrend:</b> Gibt einen starken Trend in Aufwärtsrichtung (grün) oder Abwärtsrichtung (rot) an. Ein Kaufsignal könnte generiert werden, wenn der Trend höher als die Explosionslinie ist.",
                    "updated": 1647446871728
                },
                {
                    "language": "TR",
                    "text": "2. Yukarı Trend/Aşağı Trend ( Uptrend/Downtrend ) : Yukarı yönde (yeşil) veya aşağı yönde (kırmızı) güçlü bir eğilim belirtir. Trend patlama çizgisinden daha yüksek olduğunda bir alım sinyali oluşturulabilir.",
                    "updated": 1697834075594
                }
            ]
        },
        {
            "style": "List",
            "text": "3. Deadzone: Attempts to filter out weak signals. It is recommended only to enter a trade when the explosion and/or trend values are above the deadzone.",
            "translations": [
                {
                    "language": "RU",
                    "text": "3. Deadzone: Пытается отфильтровать слабые сигналы. Рекомендуется входить в сделку только тогда, когда значения всплеска и/или тренда находятся выше мертвой зоны.",
                    "updated": 1645610121671
                },
                {
                    "language": "DE",
                    "text": "<b>3. Totzone:</b> Versucht, schwache Signale herauszufiltern. Es wird empfohlen, nur dann in einen Handel einzusteigen, wenn die Explosions- und/oder Trendwerte oberhalb der Deadzone liegen.",
                    "updated": 1647446883935
                },
                {
                    "language": "TR",
                    "text": "3. Ölü bölge ( Deadzone ) : Zayıf sinyalleri filtrelemeye çalışır. Yalnızca patlama ve/veya trend değerleri ölü bölgenin üzerinde olduğunda bir ticarete girilmesi önerilir.",
                    "updated": 1697834110922
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Pluvtech-Waddah.png",
            "updated": 1611661370646
        },
        {
            "style": "Text",
            "text": "The parameters of the Waddah Attar indicator can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Initialization under ’Waddah Attar’ Product Definition.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Параметры индикатора Waddah Attar можно изменить, найдя и открыв Javascript Code в разделе Data Building Procedure -> Procedure Initialization в разделе 'Waddah Attar' Product Definition.",
                    "updated": 1645610144863
                },
                {
                    "language": "DE",
                    "text": "Die Parameter des Waddah Attar-Indikators können geändert werden, indem der Javascript Code unter Data Building Procedure -> Procedure Initialization unter der Waddah Attar’ Product Definition gesucht und geöffnet wird.",
                    "updated": 1647446989210
                },
                {
                    "language": "TR",
                    "text": "Waddah Attar göstergesinin parametreleri, 'Waddah Attar' Ürün Tanımı altında Veri Oluşturma Prosedürü ( Data Building Procedure ) -> Prosedür Başlatma ( Procedure Initialization ) altındaki Javascript Kodu ( Javascript Code ) bulunup açılarak değiştirilebilir.",
                    "updated": 1697834195386
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Pluvtech-Waddah-params.png",
            "updated": 1611673329568
        },
        {
            "style": "Title",
            "text": "Products & Properties",
            "translations": [
                {
                    "language": "RU",
                    "text": "Продукты и свойства",
                    "updated": 1645610150399
                },
                {
                    "language": "DE",
                    "text": "Produkte und Eigenschaften",
                    "updated": 1647447031454
                },
                {
                    "language": "TR",
                    "text": "Ürünler & Özellikler",
                    "updated": 1697834213225
                }
            ]
        },
        {
            "style": "Text",
            "text": "The following properties are available to access:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Доступны следующие свойства:",
                    "updated": 1645610156321
                },
                {
                    "language": "DE",
                    "text": "Die folgenden Eigenschaften sind für den Zugriff verfügbar:",
                    "updated": 1647447041468
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki özelliklere erişilebilir:",
                    "updated": 1697834221176
                }
            ]
        },
        {
            "style": "Table",
            "text": "| Product Name | Product Variable | Properties |\n| Waddah Attar | Waddah | trendUp, trendDown, explosion, deadZone |",
            "updated": 1636853769,
            "translations": [
                {
                    "language": "DE",
                    "text": "| Produktname | Produktvariable | Eigenschaften |\n| Waddah Attar | Waddah | trendUp, trendDown, explosion, deadZone |\n",
                    "updated": 1647447069102
                }
            ]
        },
        {
            "style": "Text",
            "text": "Example:",
            "updated": 1611661674316,
            "translations": [
                {
                    "language": "RU",
                    "text": "Пример:",
                    "updated": 1645610162177
                },
                {
                    "language": "DE",
                    "text": "Beispiel:",
                    "updated": 1647447120620
                },
                {
                    "language": "TR",
                    "text": "Örnek:",
                    "updated": 1697834227776
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Waddah Attar indicator could be used to generate a buy signal when the explosion line is above the deadzone, and the up trend is above the explosion line:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Индикатор Waddah Attar можно использовать для генерирования сигнала на покупку, когда линия всплеска находится выше мертвой зоны, а восходящий тренд - выше линии всплеска:",
                    "updated": 1645610200828
                },
                {
                    "language": "DE",
                    "text": "Der Waddah Attar Indikator könnte verwendet werden, um ein Kaufsignal zu generieren, wenn die Explosionslinie oberhalb der Totzone liegt und der Aufwärtstrend oberhalb der Explosionslinie verläuft:",
                    "updated": 1647447131401
                },
                {
                    "language": "TR",
                    "text": "Waddah Attar göstergesi, patlama çizgisi ölü bölgenin üzerinde olduğunda ve yükseliş eğilimi patlama çizgisinin üzerinde olduğunda bir satın alma sinyali oluşturmak için kullanılabilir:",
                    "updated": 1697834244928
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "chart.at01hs.Waddah.trendUp > chart.at01hs.Waddah.explosion && chart.at01hs.Waddah.explosion > chart.at01hs.Waddah.deadZone",
            "updated": 1636853769
        },
        {
            "style": "Text",
            "text": "To increase confirmation confidence, this indicator can be paired with other indicators such as the Supertrend or Average True Range (ATR) indicators.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Для повышения уверенности подтверждения этот индикатор можно использовать в паре с другими индикаторами, такими как индикаторы Supertrend или Average True Range (ATR).",
                    "updated": 1645610214876
                },
                {
                    "language": "DE",
                    "text": "Um das Vertrauen in die Bestätigung zu erhöhen, kann dieser Indikator mit anderen Indikatoren wie dem Supertrend oder dem Average True Range (ATR) Indikator gekoppelt werden.",
                    "updated": 1647447210781
                },
                {
                    "language": "TR",
                    "text": "Teyit güvenini artırmak için bu gösterge, Süper Trend veya Ortalama Gerçek Aralık (ATR) göstergeleri gibi diğer göstergelerle eşleştirilebilir.",
                    "updated": 1697834267602
                }
            ]
        },
        {
            "style": "Title",
            "text": "Maintainer:",
            "updated": 1622481793076,
            "translations": [
                {
                    "language": "DE",
                    "text": "Betreuer:",
                    "updated": 1647447240524
                }
            ]
        },
        {
            "style": "Link",
            "text": "@pluvtech (Telegram)->t.me/pluvtech"
        }
    ]
}