{
    "topic": "Pluvtech Data Mine",
    "pageNumber": "7",
    "type": "McGinley Moving Average",
    "definition": {
        "text": "The McGinley Dynamic indicator is a type of moving average that was designed to track the market better than existing moving average indicators. It is a technical indicator that improves upon moving average lines by adjusting for shifts in market speed.",
        "updated": 1622686933380,
        "translations": [
            {
                "language": "RU",
                "text": "Индикатор McGinley Dynamic - это тип скользящей средней, который был разработан для отслеживания рынка лучше, чем существующие индикаторы скользящих средних. Это технический индикатор, который улучшает линии скользящей средней, корректируя изменения в скорости движения рынка.",
                "updated": 1645610522384
            },
            {
                "language": "DE",
                "text": " Der McGinley Dynamic Indikator ist eine Art gleitender Durchschnitt, der entwickelt wurde, um den Markt besser zu verfolgen als bestehende gleitende Durchschnittsindikatoren. Es handelt sich um einen technischen Indikator, der die gleitenden Durchschnittslinien verbessert, indem er Verschiebungen der Marktgeschwindigkeit ausgleicht.",
                "updated": 1647855742198
            },
            {
                "language": "TR",
                "text": "McGinley Dinamik göstergesi, piyasayı mevcut hareketli ortalama göstergelerinden daha iyi takip etmek için tasarlanmış bir tür hareketli ortalamadır. Piyasa hızındaki değişimleri ayarlayarak hareketli ortalama çizgilerini geliştiren teknik bir göstergedir.",
                "updated": 1697834910322
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Info:",
            "updated": 1622481793076,
            "translations": [
                {
                    "language": "RU",
                    "text": "Информация:",
                    "updated": 1645610557220
                },
                {
                    "language": "TR",
                    "text": "Bilgi:",
                    "updated": 1697834915634
                }
            ]
        },
        {
            "style": "Text",
            "text": "In his research, McGinley found moving averages had many problems. In the first place, they were inappropriately applied. Moving averages in different periods operate with varying degrees in different markets. For example, how can one know when to use a 10-day, 20-day, or 50-day moving average in a fast or slow market? In order to solve the problem of choosing the right length of the moving average, the McGinley Dynamic was built to automatically adjust to the current speed of the market.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В ходе своего исследования МакГинли обнаружил, что у скользящих средних много проблем. Прежде всего, они применялись неправильно. Скользящие средние за разные периоды действуют на разных рынках в разной степени. Например, как узнать, когда использовать 10-дневную, 20-дневную или 50-дневную скользящую среднюю на быстром или медленном рынке? Для того чтобы решить проблему выбора правильной длины скользящей средней, была построена система McGinley Dynamic, которая автоматически подстраивается под текущую скорость рынка.",
                    "updated": 1645610591961
                },
                {
                    "language": "DE",
                    "text": "Bei seinen Untersuchungen stellte McGinley fest, dass gleitende Durchschnitte viele Probleme aufwiesen. Erstens wurden sie in unangemessener Weise angewandt. Gleitende Durchschnitte in verschiedenen Zeiträumen funktionieren auf verschiedenen Märkten in unterschiedlichem Maße. Wie kann man zum Beispiel wissen, wann man einen 10-, 20- oder 50-tägigen gleitenden Durchschnitt in einem schnellen oder langsamen Markt verwenden sollte? Um das Problem der Wahl der richtigen Länge des gleitenden Durchschnitts zu lösen, wurde der McGinley Dynamic so konzipiert, dass er sich automatisch an die aktuelle Geschwindigkeit des Marktes anpasst.",
                    "updated": 1647855758627
                },
                {
                    "language": "TR",
                    "text": "McGinley araştırmasında hareketli ortalamaların birçok sorunu olduğunu tespit etti. İlk olarak, uygunsuz bir şekilde uygulanıyorlardı. Farklı dönemlerdeki hareketli ortalamalar farklı piyasalarda farklı derecelerde işlemektedir. Örneğin, hızlı ya da yavaş bir piyasada 10 günlük, 20 günlük ya da 50 günlük bir hareketli ortalamanın ne zaman kullanılacağı nasıl bilinebilir? Doğru hareketli ortalama uzunluğunu seçme sorununu çözmek için McGinley Dynamic, piyasanın mevcut hızına göre otomatik olarak ayarlanacak şekilde geliştirilmiştir.",
                    "updated": 1697834937225
                }
            ]
        },
        {
            "style": "Link",
            "text": "McGinley - (Investopedia)->www.investopedia.com/terms/m/mcginley-dynamic.asp"
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Pluvtech-McGinley.png",
            "updated": 1611661370646
        },
        {
            "style": "Text",
            "text": "The length of the McGinley indicator calculation can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Initialization under ’McGinley’ Product Definition.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Период расчета индикатора McGinley можно изменить, найдя и открыв Javascript Code в разделе Data Building Procedure -> Procedure Initialization в разделе'McGinley'Product Definition.",
                    "updated": 1645610833870
                },
                {
                    "language": "DE",
                    "text": "Die Länge der Berechnung des McGinley Indikators kann geändert werden, indem der Javascript Code unter Data Building Procedure -> Procedure Initialization  unter’McGinley’ Product Definition gesucht und geöffnet wird.",
                    "updated": 1647855850830
                },
                {
                    "language": "TR",
                    "text": "McGinley gösterge hesaplamasının uzunluğu, 'McGinley' Ürün Tanımı altında Veri Oluşturma Prosedürü ( Data Building Procedure ) -> Prosedür Başlatma ( Procedure Initialization ) altındaki Javascript Kodu bulunup açılarak değiştirilebilir.",
                    "updated": 1697834974097
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Pluvtech-McGinley-params.png",
            "updated": 1611673329568
        },
        {
            "style": "Title",
            "text": "Products & Properties",
            "translations": [
                {
                    "language": "RU",
                    "text": "Продукты и свойства",
                    "updated": 1645610618139
                },
                {
                    "language": "DE",
                    "text": "Produkte und Eigenschaften",
                    "updated": 1647855893699
                },
                {
                    "language": "TR",
                    "text": "Ürünler & Özellikler",
                    "updated": 1697834981561
                }
            ]
        },
        {
            "style": "Text",
            "text": "The following properties are available to access:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Доступны следующие свойства:",
                    "updated": 1645610623977
                },
                {
                    "language": "DE",
                    "text": "Die folgenden Eigenschaften sind für den Zugriff verfügbar:",
                    "updated": 1647855904068
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki özelliklere erişilebilir:",
                    "updated": 1697834984921
                }
            ]
        },
        {
            "style": "Table",
            "text": "| Product Name | Product Variable | Properties |\n| McGinley | MD | md |",
            "updated": 1636853769,
            "translations": [
                {
                    "language": "DE",
                    "text": "| Produktname | Produktvariable | Eigenschaften |\n| McGinley | MD | md |\n",
                    "updated": 1647855950568
                }
            ]
        },
        {
            "style": "Text",
            "text": "Example:",
            "updated": 1611661674316,
            "translations": [
                {
                    "language": "RU",
                    "text": "Пример:",
                    "updated": 1645610631881
                },
                {
                    "language": "DE",
                    "text": "Beispiel:",
                    "updated": 1647855978435
                },
                {
                    "language": "TR",
                    "text": "Örnek:",
                    "updated": 1697834989056
                }
            ]
        },
        {
            "style": "Text",
            "text": "The McGinley indicator could be used to generate a buy signal when a candle closes above the indicator value:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Индикатор McGinley можно использовать для генерации сигнала на покупку, когда свеча закрывается выше значения индикатора:",
                    "updated": 1645610640217
                },
                {
                    "language": "DE",
                    "text": "Der McGinley Indikator könnte verwendet werden, um ein Kaufsignal zu generieren, wenn eine Kerze oberhalb des Indikatorwertes schließt:",
                    "updated": 1647856010066
                },
                {
                    "language": "TR",
                    "text": "McGinley göstergesi, bir mum gösterge değerinin üzerinde kapandığında bir satın alma sinyali oluşturmak için kullanılabilir:",
                    "updated": 1697834993609
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "chart.at01hs.candle.close > chart.at01hs.MD.md",
            "updated": 1636853769
        },
        {
            "style": "Text",
            "text": "It is suggested that the McGinley indicator could be used in conjunction with completmentary indicators such as MACD, RSI or TDI",
            "translations": [
                {
                    "language": "RU",
                    "text": "Предлагается использовать индикатор McGinley в сочетании с дополнительными индикаторами, такими как MACD, RSI или TDI.",
                    "updated": 1645610649330
                },
                {
                    "language": "DE",
                    "text": "Es wird vorgeschlagen, dass der McGinley Indikator in Verbindung mit ergänzenden Indikatoren wie MACD, RSI oder TDI verwendet werden kann.",
                    "updated": 1647856068758
                },
                {
                    "language": "TR",
                    "text": "McGinley göstergesinin MACD, RSI veya TDI gibi tamamlayıcı göstergelerle birlikte kullanılabileceği önerilmektedir",
                    "updated": 1697835000313
                }
            ]
        },
        {
            "style": "Title",
            "text": "Maintainer:",
            "updated": 1622481793076,
            "translations": [
                {
                    "language": "DE",
                    "text": "Betreuer:",
                    "updated": 1647856094123
                }
            ]
        },
        {
            "style": "Link",
            "text": "@pluvtech (Telegram)->t.me/pluvtech"
        }
    ]
}