{
    "type": "Close Execution",
    "definition": {
        "text": "The close execution node groups all execution algorithms involved in the process of closing a position.",
        "translations": [
            {
                "language": "RU",
                "text": "Узел выполнения закрытия группирует все алгоритмы выполнения, участвующие в процессе закрытия позиции.",
                "updated": 1638646656797
            },
            {
                "language": "TR",
                "text": "Yakın yürütme düğümü, bir pozisyonu kapatma sürecinde yer alan tüm yürütme algoritmalarını gruplandırır.",
                "updated": 1652797981812
            },
            {
                "language": "DE",
                "text": "Der Ausführungsknoten Schließen fasst alle Ausführungsalgorithmen zusammen, die an der Schließung einer Position beteiligt sind.",
                "updated": 1708265556878
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The close execution section of the close stage works similarly to the open execution in the open stage. Please refer to the explanations of the open stage for the details.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Секция выполнения закрытия на этапе закрытия работает аналогично открытому исполнению на этапе открытия. Пожалуйста, обратитесь к объяснениям открытого этапа для получения подробной информации.",
                    "updated": 1638646699239
                },
                {
                    "language": "TR",
                    "text": "Kapalı aşamadaki kapalı yürütme bölümü, açık aşamadaki açık yürütmeye benzer şekilde çalışır. Detaylar için lütfen açık sahne açıklamalarına bakınız.",
                    "updated": 1652797993519
                },
                {
                    "language": "DE",
                    "text": "Der Ausführungsabschnitt \"Schließen\" in der Abschlussphase funktioniert ähnlich wie der Abschnitt \"Öffnen\" in der Eröffnungsphase. Einzelheiten entnehmen Sie bitte den Erläuterungen zur offenen Phase.",
                    "updated": 1708265557066,
                    "style": "Text"
                }
            ]
        }
    ]
}