{
    "type": "Distribution Event",
    "definition": {
        "text": "The Superalgos Project distributes its native Superalgos SA Tokens after each release to reward contributions and incentivize desirable behaviors. The Distribution Event represents the moment in time and the act of running the process that distributes tokens from the Treasury Account to the Governance Address associated with each User Profile that participates in governance.",
        "updated": 1630570602251,
        "translations": [
            {
                "language": "ES",
                "text": "El Superalgos Project distribuye sus tokens nativos de Superalgos SA después de cada lanzamiento para recompensar las contribuciones e incentivar los comportamientos deseables. El evento de distribución representa el momento en el tiempo y el acto de ejecutar el proceso que distribuye los tokens fdesde la Treasury Account ( Cuenta del tesoro) a la Governance Address asociada con cada User Profile  que participa en la gobernanza.",
                "updated": 1637851695478
            },
            {
                "language": "TR",
                "text": "Superalgos Projesi, katkıları ödüllendirmek ve istenen davranışları teşvik etmek için her sürümden sonra kendine ait Superalgos SA Tokens dağıtır. Dağıtım Etkinliği, Hazine Hesabından (Treasury Account) yönetişime katılan her Kullanıcı Profili ile ilişkili Yönetim Adresine jeton dağıtan süreci yürütme eylemini ve zamanını temsil eder.",
                "updated": 1644578543030
             },
             {
                "language": "RU",
                "text": "Проект Superalgos распределяет свои собственные токены Superalgos SA после каждого релиза, чтобы вознаградить вклады и стимулировать желаемое поведение. Событие распределения (Distribution Event) представляет собой момент времени и акт запуска процесса, который распределяет токены со счета казначейства (Treasury Account) на адрес управления (Governance Address), связанный с каждым профилем пользователя, участвующим в управлении.",
                "updated": 1645082663327
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1630233421503
        },
        {
            "style": "Text",
            "text": "The Superalgos Project announces each release through all official channels, including the Telegram Announcements channel and the Superalgos Medium Blog.",
            "updated": 1630235099973,
            "translations": [
                {
                    "language": "ES",
                    "text": "El Superalgos Project anuncia cada lanzamiento a través de todos los canales oficiales, incluido el canal de Anuncios de Telegram y el Blog de Superalgos Medium.",
                    "updated": 1637851873356
                },
                {
                    "language": "TR",
                    "text": "Superalgos Projesi, her sürümü Telegram Duyuruları kanalı (Telegram Announcements) ve Superalgos Medium Blog da dahil olmak üzere tüm resmi kanallar aracılığıyla duyurur.",
                    "updated": 1644578697103
                },
                {
                    "language": "RU",
                    "text": "Проект Superalgos объявляет о каждом релизе через все официальные каналы, включая канал объявлений Telegram и блог Superalgos Medium.",
                    "updated": 1645082679811
                }
            ]
        },
        {
            "style": "Text",
            "text": "At the moment of the announcement, a time window opens for the Community to participate in governance. At this point, the window is of an indeterminate span. Users may set up their User Profiles until the window closes. ",
            "translations": [
                {
                    "language": "ES",
                    "text": "En el momento del anuncio, se abre una ventana de tiempo para que la Community participe en la gobernanza.. En este punto, la ventana tiene un tramo indeterminado. Los usuarios pueden configurar sus perfiles de usuario hasta que se cierre la ventana.",
                    "updated": 1637851833645
                },
                {
                    "language": "TR",
                    "text": "Duyuru anında, Topluluğun yönetişime katılması için bir zaman belirlenir. Bu genelde 7 ile 8 günlük bir süreçtir. Kullanıcılar, bu süre zarfında Kullanıcı Profillerini ayarlayabilir.",
                    "updated": 1644578812881
                },
                {
                    "language": "RU",
                    "text": "В момент объявления открывается временное окно для участия Сообщества в управлении. На данный момент это окно имеет неопределенный срок. Пользователи могут настраивать свои профили пользователей до закрытия окна.",
                    "updated": 1645082705250
                }
            ]
        },
        {
            "style": "Text",
            "text": "Once the window closes, no further modifications are accepted on governance hierarchies until the Distribution Event takes place.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Una vez que se cierra la ventana, no se aceptan más modificaciones en las jerarquías de gobierno hasta que tenga lugar el Evento de distribución.",
                    "updated": 1637851866405
                },
                {
                    "language": "TR",
                    "text": "Bu zaman sone erdiğinde , Dağıtım Olayı gerçekleşene kadar yönetim hiyerarşilerinde başka değişiklik kabul edilmez.",
                    "updated": 1644578840183
                },
                {
                    "language": "RU",
                    "text": "После закрытия окна дальнейшие изменения в иерархиях управления не принимаются до тех пор, пока не произойдет событие распределения.",
                    "updated": 1645082731472
                }
            ]
        }
    ]
}