{
    "type": "Sensor Bot Instance",
    "definition": {
        "text": "A sensor bot instance is a reference to a Sensor Bot as defined in a data mine. The instance of the bot runs the defined processes and generates the defined data products.",
        "updated": 1609617856257,
        "translations": [
            {
                "language": "TR",
                "text": "Sensor Bot Instance, bir veri madeninde tanımlandığı şekliyle Sensör Botuna yapılan bir referanstır. Bot örneği, tanımlanmış süreçleri çalıştırır ve tanımlanmış veri ürünlerini oluşturur.",
                "updated": 1640087119868
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The sensor bot instance holds no definitions as to what the bot does. Instead, its process instance references a process definition in the corresponding data mine. That is how the sensor bot instance obtains the information regarding what it needs to do once it is run.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Sensor Bot Instance, botun ne yaptığına ilişkin hiçbir tanım içermez. Bunun yerine, işlem örneği karşılık gelen veri madenindeki bir işlem tanımına başvurur. Sensor Bot Instance, çalıştırıldığında ne yapması gerektiğine dair bilgileri bu şekilde elde eder.",
                    "updated": 1640087297247
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Sensor Bot Instance Configuration",
            "updated": 1609613944104,
            "translations": [
                {
                    "language": "TR",
                    "text": "Sensor Bot Instance Yapılandırması",
                    "updated": 1640087322258
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "translations": [
                {
                    "language": "TR",
                    "text": "Özellikler",
                    "updated": 1640087336292
                }
            ]
        },
        {
            "style": "List",
            "text": "startDate is the desired starting date of the data product the sensor bot instance builds, in the YYYY-MM-DD format. The sensor bot instance queries its data source for data starting on the configured startDate.",
            "updated": 1609614002529,
            "translations": [
                {
                    "language": "TR",
                    "text": "startDate , Sensor Bot Instance'ın oluşturduğu veri ürününün YYYY-AA-GG biçiminde istenilen başlangıç tarihidir. Sensor Bot Instance, yapılandırılmış startDate'den başlayarak veri kaynağını sorgular.",
                    "updated": 1640087453380
                }
            ]
        },
        {
            "style": "Text",
            "text": "   The actual date in which the dataset starts depends on external factors: A. The market may start at a later date. B. The exchange may limit how far in the past data may be retrieved. In both cases, the sensor bot automatically discovers the date closest to the desired starting date* that is possible to start with, and proceeds accordingly.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Veri kümesinin başlayacağı gerçek tarih, dış etkenlere bağlıdır: A. Piyasa sişzin yazdığınızdan daha sonraki bir tarihte başlayabilir. B. Borsa, geçmişteki verilerin ne kadar geri alınabileceğini sınırlayabilir. Her iki durumda da sensör bot, başlaması mümkün olan istenen başlangıç tarihine* en yakın tarihi otomatik olarak tespit eder ve ona göre hareket eder.",
                    "updated": 1640087547196
                }
            ]
        },
        {
            "style": "Text",
            "text": "In the case the startDate is changed after the sensor bot has started building a data product, either for an earlier or later date, the sensor re-evaluates the feasibility of starting at the new date. The actual date may or may not change; regardless, the sensor bot discards the existing data product and starts over from the newly discovered date. In other words, if the startDate is changed, the sensor bot starts over.",
            "updated": 1609614011955,
            "translations": [
                {
                    "language": "TR",
                    "text": "startDate 'in, sensör botunun daha erken veya daha sonraki bir tarih için bir veri ürünü oluşturmaya başladıktan sonra değiştirilmesi durumunda, sensör yeni tarihe göre fizibilitesini yeniden değerlendirir. Gerçek tarih değiştirilse de değiştirilmesede; ne olursa olsun, sensör botu mevcut veri ürününü yok sayar ve yeni tarihten itibaren yeniden başlar. Başka bir deyişle, startDate değiştirilirse sensör bot baştan başlar.",
                    "updated": 1640087887430
                }
            ]
        },
        {
            "style": "Note",
            "text": "Notice that the above starts a chain reaction among all indicator bots that have a data dependency with the sensor bot's output dataset. Also, if the actual date ends up changing, all indicators that determine the starting date of the market by looking at the date discovered by the sensor bot have to discard their existing data products and start over from the new date.",
            "updated": 1609614020847,
            "translations": [
                {
                    "language": "TR",
                    "text": "Yukarıdakilerin, sensör botunun çıktı veri kümesiyle veri bağımlılığı olan tüm gösterge botları arasında bir zincirleme reaksiyon başlattığına dikkat edin. Ayrıca fiili tarihin değişmesi durumunda, sensör bot tarafından keşfedilen tarihe bakarak piyasanın başlangıç tarihini belirleyen tüm göstergeler, mevcut veri ürünlerini atıp yeni tarihten başlamak zorundadır.",
                    "updated": 1640087883567
                }
            ]
        },
        {
            "style": "Note",
            "text": "You do not start or stop a sensor bot instance directly. Instead, you start or stop the corresponding task.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Sensor Bot Instance'ı  doğrudan başlatamaz veya durduramazsınız. Bunun yerine, ilgili görevi başlatır veya durdurursunuz.",
                    "updated": 1640087947935
                }
            ]
        }
    ]
}