{
    "type": "Execution Algorithm",
    "definition": {
        "text": "An execution algorithm is a set of instructions used to place and manage orders at the exchange.",
        "translations": [
            {
                "language": "ES",
                "text": "Un execution algorithmes es un conjunto de instrucciones que se utilizan para realizar y gestionar pedidos en el exchange.",
                "updated": 1624459612098
            },
            {
                "language": "RU",
                "text": "Execution Algorithm - это набор инструкций, используемых для размещения и управления ордерами на бирже.",
                "updated": 1638785781426
            },
            {
                "language": "TR",
                "text": "Yürütme algoritması, borsada sipariş vermek ve yönetmek için kullanılan bir dizi talimattır.",
                "updated": 1639222248452
            },
            {
                "language": "DE",
                "text": "Ein Ausführungsalgorithmus (Execution Algorithm) ist ein Satz von Anweisungen, die zur Platzierung und Verwaltung von Aufträgen an der Börse verwendet werden.",
                "updated": 1641668828160
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Any given strategy may have simple or very complex execution requirements. To deal with complexity, Superalgos allows users to set up as many execution algorithms as required.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Любая заданная стратегия может иметь простые или очень сложные требования к исполнению. Чтобы справиться со сложностью, Superalgos позволяет пользователям настраивать столько алгоритмов выполнения, сколько требуется.",
                    "updated": 1638785805848
                },
                {
                    "language": "DE",
                    "text": "Jede Strategie kann einfache oder sehr komplexe Ausführungsanforderungen haben. Um mit der Komplexität umzugehen, erlaubt Superalgos den Benutzern, so viele Ausführungsalgorithmen wie nötig einzurichten.",
                    "updated": 1641668853883
                },
                {
                    "language": "TR",
                    "text": "Herhangi bir stratejinin basit veya çok karmaşık uygulama gereksinimleri olabilir. Karmaşıklıkla başa çıkmak için Superalgos, kullanıcıların gerektiği kadar çok yürütme algoritması kurmasına olanak tanır.",
                    "updated": 1654392426778,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Then, the logic in each algorithm may remain simple, while the combined work of multiple algorithms may deal with the required complexity.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Тогда логика в каждом алгоритме может оставаться простой, в то время как совместная работа нескольких алгоритмов может иметь дело с требуемой сложностью.",
                    "updated": 1638785824016
                },
                {
                    "language": "DE",
                    "text": "Dann kann die Logik in jedem Algorithmus einfach bleiben, während die kombinierte Arbeit mehrerer Algorithmen die erforderliche Komplexität bewältigen kann.",
                    "updated": 1641668866711
                },
                {
                    "language": "TR",
                    "text": "Daha sonra, her bir algoritmadaki mantık basit kalabilirken, birden fazla algoritmanın birleşik çalışması gerekli karmaşıklıkla başa çıkabilir.",
                    "updated": 1654392432651,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Each algorithm may be assigned a fraction of the target size (see the configuration section), thus, the extent of each algorithm's involvement in the execution is defined by this parameter.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Каждому алгоритму может быть назначена часть целевого размера (см. Раздел конфигурации), таким образом, степень участия каждого алгоритма в выполнении определяется этим параметром.",
                    "updated": 1638785855815
                },
                {
                    "language": "DE",
                    "text": "Jedem Algorithmus kann ein Teil der Zielgröße zugewiesen werden (siehe Abschnitt \"Konfiguration\"), so dass der Umfang der Beteiligung jedes Algorithmus an der Ausführung durch diesen Parameter definiert wird.",
                    "updated": 1641668881717
                },
                {
                    "language": "TR",
                    "text": "Her algoritmaya hedef boyutun (Target Rate) bir kısmı atanabilir (yapılandırma bölümüne bakın), böylece her algoritmanın yürütmeye katılımının kapsamı bu parametre ile tanımlanabilir.",
                    "updated": 1654754405021
                }
            ]
        },
        {
            "style": "Text",
            "text": "An execution algorithm is a set of instructions in the sense that the orders defined in each algorithm are themselves the instructions. That is, an execution algorithm is a set of predefined orders which may be created or canceled given specific market situations.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Алгоритм выполнения (Execution Algorithm) - это набор инструкций в том смысле, что ордеры, определенные в каждом алгоритме, сами являются инструкциями. То есть алгоритм выполнения - это набор предопределенных ордеров, которые могут быть созданы или отменены в определенных рыночных ситуациях.",
                    "updated": 1639841395922
                },
                {
                    "language": "DE",
                    "text": "Ein Ausführungsalgorithmus ist ein Satz von Anweisungen in dem Sinne, dass die in jedem Algorithmus definierten Aufträge selbst die Anweisungen sind. Das heißt, ein Ausführungsalgorithmus ist eine Reihe von vordefinierten Aufträgen, die in bestimmten Marktsituationen erstellt oder storniert werden können.",
                    "updated": 1641668900730
                },
                {
                    "language": "TR",
                    "text": "Bir yürütme algoritması, her bir algoritmada tanımlanan emirlerin kendilerinin talimatlar olması anlamında bir talimatlar kümesidir. Diğer bir deyişle, bir uygulama algoritması, belirli piyasa durumları göz önüne alındığında oluşturulabilen veya iptal edilebilen önceden tanımlanmış bir dizi emirdir.",
                    "updated": 1654392444416,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Execution Algorithm Configuration",
            "updated": 1617197817510,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Execution Algorithm",
                    "updated": 1638785949446
                },
                {
                    "language": "TR",
                    "text": "Yürütme Algoritması Yapılandırması",
                    "updated": 1654392450016,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "List",
            "text": "percentageOfStageTargetSize is the definition of how much of the target size of the whole stage will be handled by the one specific execution algorithm, expressed as a percentage of the total target size. Posible values are real numbers between 0 and 100, including the extremes. If you set the value to 0, the algorithm will not be executed.",
            "translations": [
                {
                    "language": "RU",
                    "text": "процентOfStageTargetSize - это определение того, какая часть целевого размера всего этапа будет обрабатываться одним конкретным алгоритмом выполнения, выраженное в процентах от общего целевого размера. Возможные значения - это действительные числа от 0 до 100, включая крайние значения. Если вы установите значение 0, алгоритм не будет выполняться.",
                    "updated": 1638785982625
                },
                {
                    "language": "DE",
                    "text": "percentageOfStageTargetSize ist die Definition, wie viel von der Zielgröße (Target Size) der gesamten Stage von einem bestimmten Ausführungsalgorithmus bearbeitet wird, ausgedrückt als Prozentsatz der gesamten Zielgröße. Mögliche Werte sind reelle Zahlen zwischen 0 und 100, einschließlich der Extremwerte. Wenn Sie den Wert auf 0 setzen, wird der Algorithmus nicht ausgeführt.",
                    "updated": 1641668982666
                },
                {
                    "language": "TR",
                    "text": "percentageOfStageTargetSize, tüm aşamanın hedef boyutunun (Target Size) ne kadarının belirli bir yürütme algoritması tarafından ele alınacağının tanımıdır ve toplam hedef boyutun yüzdesi olarak ifade edilir. Olası değerler, uç değerler de dahil olmak üzere 0 ile 100 arasındaki gerçek sayılardır. Değeri 0 olarak ayarlarsanız, algoritma yürütülmeyecektir.",
                    "updated": 1654755909073
                }
            ]
        }
    ]
}
