{
    "type": "Execution Algorithm",
    "definition": {
        "text": "An execution algorithm is a set of instructions used to place and manage orders at the exchange.",
        "translations": [
            {
                "language": "ES",
                "text": "Un execution algorithmes es un conjunto de instrucciones que se utilizan para realizar y gestionar pedidos en el exchange.",
                "updated": 1624459612098
            },
            {
                "language": "RU",
                "text": "Алгоритм выполнения - это набор инструкций, используемых для размещения и управления ордерами на бирже.",
                "updated": 1637756233547
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Any given strategy may have simple or very complex execution requirements. To deal with complexity, Superalgos allows users to set up as many execution algorithms as required."
        },
        {
            "style": "Text",
            "text": "Then, the logic in each algorithm may remain simple, while the combined work of multiple algorithms may deal with the required complexity."
        },
        {
            "style": "Text",
            "text": "Each algorithm may be assigned a fraction of the target size (see the configuration section), thus, the extent of each algorithm's involvement in the execution is defined by this parameter."
        },
        {
            "style": "Text",
            "text": "An execution algorithm is a set of instructions in the sense that the orders defined in each algorithm are themselves the instructions. That is, an execution algorithm is a set of predefined orders which may be created or canceled given specific market situations."
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Execution Algorithm Configuration",
            "updated": 1617197817510
        },
        {
            "style": "List",
            "text": "percentageOfStageTargetSize is the definition of how much of the target size of the whole stage will be handled by the one specific execution algorithm, expressed as a percentage of the total target size. Posible values are real numbers between 0 and 100, including the extremes. If you set the value to 0, the algorithm will not be executed."
        }
    ]
}