{
    "type": "Create Order Event",
    "definition": {
        "text": "The create order event controls the placement of orders.",
        "translations": [
            {
                "language": "RU",
                "text": "Create Order Event контролирует размещение ордеров.",
                "updated": 1638648176725
            },
            {
                "language": "TR",
                "text": "Sipariş oluşturma olayı, siparişlerin yerleşimini kontrol eder.",
                "updated": 1652798860066
            },
            {
                "language": "DE",
                "text": "Das Ereignis \"Auftrag erstellen\" steuert die Auftragserteilung.",
                "updated": 1708265561257
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Even though the decision to take a position may have been made, the user may still decide to exert additional control over the placement of orders. Such is the intent of the create order event.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Даже если решение открыть позицию могло быть принято, пользователь все равно может принять решение о дополнительном контроле над размещением ордеров. Такова цель события Create Order Event.",
                    "updated": 1638648234620
                },
                {
                    "language": "TR",
                    "text": "Bir pozisyon alma kararı verilmiş olsa bile, kullanıcı yine de emirlerin verilmesi üzerinde ek kontrol uygulamaya karar verebilir. Create order olayının amacı budur.",
                    "updated": 1652798868336
                },
                {
                    "language": "DE",
                    "text": "Auch wenn die Entscheidung, eine Position einzunehmen, bereits gefallen ist, kann der Benutzer immer noch beschließen, zusätzliche Kontrolle über die Platzierung von Aufträgen auszuüben. Dies ist der Zweck des Ereignisses \"Order erstellen\".",
                    "updated": 1708265561398,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "An order defined in an execution algorithm will be executed only if the event evaluates true.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Порядок, определенный в алгоритме выполнения, будет выполнен, только если событие оценивается как true.",
                    "updated": 1638648264876
                },
                {
                    "language": "TR",
                    "text": "Yürütme algoritmasında tanımlanan bir sipariş, yalnızca olayın true olarak değerlendirilmesi durumunda yürütülür.",
                    "updated": 1652798892681
                },
                {
                    "language": "DE",
                    "text": "Ein in einem Ausführungsalgorithmus definierter Auftrag wird nur ausgeführt, wenn das Ereignis als wahr bewertet wird.",
                    "updated": 1708265561601,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you wish orders to be placed as defined immediately after the take position event has been triggered, the use the statement true your only create order event condition.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы хотите, чтобы ордера размещались, как определено, сразу после того, как было инициировано событие открытия позиции, используйте оператор true для вашего единственного условия события создания ордера.",
                    "updated": 1638648287533
                },
                {
                    "language": "TR",
                    "text": "Pozisyon alma olayının tetiklenmesinden hemen sonra emirlerin tanımlandığı gibi verilmesini istiyorsanız, sadece emir oluşturma olay koşulunuz için true ifadesini kullanın.",
                    "updated": 1652798919883
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie möchten, dass Aufträge wie definiert unmittelbar nach dem Auslösen des Take-Position-Ereignisses platziert werden, verwenden Sie die Anweisung true Ihre einzige Bedingung für das Erzeugen von Aufträgen.",
                    "updated": 1708265561757,
                    "style": "Text"
                }
            ]
        }
    ]
}