{
    "type": "Epochs",
    "definition": {
        "text": "An epoch, in Machine Learning, is the entire processing by the learning algorithm of the entire train-set. ... It has been used for a long time in the field of Machine Learning. One epoch is the time step that is incremented every time it has went through all the samples in the training set.",
        "updated": 1615896049640,
        "translations": [
            {
                "language": "RU",
                "text": "Эпоха в машинном обучении - это полный цикл обработки алгоритмом обучения всего набора данных. Это понятие уже давно используется в области машинного обучения. Одна эпоха - это шаг по времени, который увеличивается каждый раз, когда алгоритм проходит через все образцы обучающего набора.",
                "updated": 1645247775685
            },
            {
                "language": "TR",
                "text": "Makine Öğreniminde bir epok, tüm eğitim setinin öğrenme algoritması tarafından işlenmesinin tamamıdır. ... Makine Öğrenimi alanında uzun süredir kullanılmaktadır. Bir epok, eğitim setindeki tüm örneklerden her geçtiğinde artırılan zaman adımıdır.",
                "updated": 1654397087655
            },
            {
                "language": "DE",
                "text": "Beim maschinellen Lernen (Machine Learning) ist eine Epoche die gesamte Verarbeitung des gesamten Zuges durch den Lernalgorithmus.... Sie wird seit langem im Bereich des maschinellen Lernens (Machine Learning) verwendet. Eine Epoche ist der Zeitschritt, der jedes Mal erhöht wird, wenn der Algorithmus alle Proben des Trainingssatzes durchlaufen hat.",
                "updated": 1707239461748
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645247781129
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397094618,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1707239469579
                }
            ]
        }
    ]
}