{
    "type": "Plugin Workspace",
    "definition": {
        "text": "Refers to a Workspace created by a user, contributed to the project as a plugin and distributed with the software package. Plugin workspaces are useful to give users access to ready-to-run strategies, demos, tutorials, or introductions to areas of the system under development.",
        "updated": 1629895587555,
        "translations": [
            {
                "language": "ES",
                "text": "Se refiere a un Workspace creado por un usuario, contribuido al proyecto como un plugin y distribuido con todo el paquete de software. Plugin workspaces son útiles para dar acceso a los usuarios a estrategias, demostraciones, tutoriales o áreas del sistema en desarrollo listas para ejecutar.",
                "updated": 1624493472781,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Plugin Workspace относится к Workspace, созданному пользователем, внесенному в проект в виде плагина и распространяемому вместе с программным пакетом. Plugin Workspace полезны для предоставления пользователям доступа к готовым к запуску стратегиям, демонстрациям, учебным пособиям или введениям в области разрабатываемой системы.",
                "updated": 1638287343879
            },
            {
                "language": "TR",
                "text": "Bir kullanıcı tarafından oluşturulan veya projeye eklenti olarak katkıda bulunan ve yazılım paketi ile dağıtılan bir Çalışma Alanı anlamına gelir. Eklenti çalışma alanları, kullanıcıların çalışmaya hazır stratejilere, demolara, öğreticilere veya sistemin geliştirilmekte olan alanlarına erişim sağlamaları için kullanışlıdır.",
                "updated": 1639143538988
            },
            {
                "language": "EL",
                "text": " Αναφέρεται σε έναν Workspace (Χώρο Εργασίας) που δημιουργήθηκε από έναν χρήστη, συνεισέφερε στο έργο ως πρόσθετο και διανεμήθηκε με το πακέτο λογισμικού. Οι χώροι εργασίας των πρόσθετων είναι χρήσιμοι για να παρέχουν στους χρήστες πρόσβαση σε έτοιμες προς εκτέλεση στρατηγικές, επιδείξεις, σεμινάρια ή εισαγωγές σε περιοχές του υπό ανάπτυξη συστήματος.",
                "updated": 1640003937042
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode. Then you can use docs.save to save your changes and app.contribute to send it to the main repository.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования. Затем вы можете использовать docs.save для сохранения изменений и app.contribute для отправки их в основной репозиторий.",
                    "updated": 1638287372079
                },
                {
                    "language": "EL",
                    "text": "Κάντε δεξί κλικ και Επεξεργασία για να μπείτε στη λειτουργία επεξεργασίας και να αλλάξετε αυτό το κείμενο. ENTER για να γράψετε νέες παραγράφους. ESC για έξοδο από τη λειτουργία επεξεργασίας. Στη συνέχεια, μπορείτε να χρησιμοποιήσετε το docs.save για να αποθηκεύσετε τις αλλαγές σας και το app.contribute για να το στείλετε στο κύριο αποθετήριο.",
                    "updated": 1640003972070
                }
            ]
        }
    ]
}