{
    "type": "Social Trading Bot Reference",
    "definition": {
        "text": "This node stores a reference to the Social Trading Bot being used by its parent Trading Bot Instance to send or receive Trading Signals on the Superalgos peer to peer network.",
        "updated": 1642822544007,
        "translations": [
            {
                "language": "RU",
                "text": "Этот узел хранит ссылку на Social Trading Bot, используемого его родительским экземпляром торгового бота для отправки или получения торговых сигналов в одноранговой сети Superalgos.",
                "updated": 1645182446137
            },
            {
                "language": "TR",
                "text": "Bu düğüm, ana Ticaret Botu Örneği ( Trading Bot Instance ) tarafından Superalgos eşler arası ağında Ticaret Sinyalleri ( Trading Signals ) göndermek veya almak için kullanılan Sosyal Ticaret Botuna ( Social Trading Bot ) bir referans depolar.",
                "updated": 1672063502367
            },
            {
                "language": "DE",
                "text": "Dieser Knoten speichert einen Verweis auf den Social Trading Bot, der von seiner übergeordneten Trading Bot Instance zum Senden oder Empfangen von Handelssignalen (Trading Signals) im Superalgos Peer-to-Peer-Netzwerk verwendet wird.",
                "updated": 1711290893322
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If a user is sending trading signals, the social trading bot that will be referenced should be set up under the user's profile.",
            "updated": 1642822646027,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если пользователь посылает торговые сигналы, социальный торговый бот, на которого будет ссылаться пользователь, должен быть настроен в профиле пользователя.",
                    "updated": 1645182455948
                },
                {
                    "language": "TR",
                    "text": "Bir kullanıcı alım satım sinyalleri gönderiyorsa, referans alınacak sosyal alım satım botu kullanıcının profili altında ayarlanmalıdır.",
                    "updated": 1672063543524
                },
                {
                    "language": "DE",
                    "text": "Wenn ein Nutzer Handelssignale sendet, sollte der Social Trading Bot, auf den verwiesen wird, unter dem Profil des Nutzers eingerichtet werden.",
                    "updated": 1711290905360
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the user is receiving signals, then the social trading bot to be referenced will be found under the signal providers user profile.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если пользователь получает сигналы, то социальный торговый бот, на которого нужно ссылаться, будет найден в профиле пользователя, предоставляющего сигналы.",
                    "updated": 1645182467556
                },
                {
                    "language": "TR",
                    "text": "Kullanıcı sinyal alıyorsa, başvurulacak sosyal ticaret botu sinyal sağlayıcıların kullanıcı profili altında bulunacaktır.",
                    "updated": 1672063582583
                },
                {
                    "language": "DE",
                    "text": "Wenn der Nutzer Signale empfängt, wird der zu referenzierende Social Trading Bot unter dem Nutzerprofil des Signalanbieters zu finden sein.",
                    "updated": 1711290915898
                }
            ]
        }
    ]
}