{
    "type": "Main Loop",
    "definition": {
        "text": "Most Bots in Superalgos are not awake all the time. As a strategy to preserve hardware resourses, they run and go to sleep for a configurable amount of time, or until they are woken up by the finishing of some other task they are waiting for. Each cycle of running and sleeping is a loop at the Main Loop of a Bot.",
        "updated": 1621955130672,
        "translations": [
            {
                "language": "RU",
                "text": "Большинство ботов в Superalgos не спят все время. В качестве стратегии сохранения аппаратных ресурсов они запускаются и переходят в спящий режим в течение настраиваемого количества времени или до тех пор, пока они не будут разбужены завершением какой-либо другой задачи, которую они ждут. Каждый цикл работы и сна - это цикл в основном цикле бота.",
                "updated": 1638285721759
            },
            {
                "language": "TR",
                "text": "Superalgos'taki çoğu Bot her zaman uyanık değildir. Donanım kaynaklarını korumak için bir strateji olarak, yapılandırılabilir bir süre boyunca veya bekledikleri başka bir görevin tamamlanmasıyla uyandırılana kadar çalışır ve uyurlar. Her bir çalışma ve uyku döngüsü, bir Botun Ana Döngüsündeki bir döngüdür.",
                "updated": 1671108160642
            },
            {
                "language": "DE",
                "text": "Die meisten Bots in Superalgos sind nicht die ganze Zeit wach. Um die Hardware-Ressourcen zu schonen, laufen sie und gehen für eine konfigurierbare Zeitspanne in den Schlaf, oder bis sie durch die Beendigung einer anderen Aufgabe, auf die sie warten, geweckt werden. Jeder Zyklus von Laufen und Schlafen ist eine Schleife in der Hauptschleife eines Bots. ",
                "updated": 1684512018170
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode. Then you can use docs.save to save your changes and app.contribute to send it to the main repository.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования. Затем вы можете использовать docs.save для сохранения изменений и app.contribute для отправки их в основной репозиторий.",
                    "updated": 1638285735882
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und Bearbeiten, um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen. Dann können Sie docs.save verwenden, um Ihre Änderungen zu speichern und app.contribute, um sie an das Haupt-Repository zu senden.",
                    "updated": 1684512043347
                }
            ]
        }
    ]
}