{
    "topic": "Contributing to Superalgos",
    "pageNumber": "6",
    "type": "How to Contribute Tutorials",
    "definition": {
        "text": "Tutorials are the ultimate educational resource available in Superalgos, and they play a crucial role during the onboarding of new users. Contributing tutorials is a great way to help the project grow the user base and is highly appreciated!",
        "updated": 1617710488028,
        "translations": [
            {
                "language": "ES",
                "text": "Los tutoriales son la última fuente educativa disponible en Superalgos, y juegan un papel crucial durante la introducción de los usuarios nuevos. Contribuir con los tutoriales es un excelente modo de ayudar al proyecto para que su base de usuarios crezca y lo apreciamos muchísimo!",
                "updated": 1633370243631
            },
            {
                "language": "RU",
                "text": "Учебники являются основным образовательным ресурсом, доступным в Superalgos, и играют важную роль в процессе обучения новых пользователей. Вклад в создание учебников - это отличный способ помочь проекту расширить пользовательскую базу, и он высоко ценится!",
                "updated": 1640268509443
            },
            {
                "language": "TR",
                "text": "Özet: Öğreticiler Superalgos'ta bulunan en iyi eğitim kaynağıdır ve yeni kullanıcıların göreve sunulması sırasında çok önemli bir rol oynarlar. Katkıda bulunan öğreticiler, projenin kullanıcı tabanını büyütmesine yardımcı etmenin harika bir yoludur ve çok takdir edilir!",
                "updated": 1645296933905
            },
            {
                "language": "DE",
                "text": "Tutorials sind die ultimative Bildungsressource, die in Superalgos zur Verfügung steht, und sie spielen eine entscheidende Rolle bei der Einarbeitung neuer Benutzer. Das Beitragen von Tutorials ist eine großartige Möglichkeit, dem Projekt zu helfen, die Benutzerbasis zu vergrößern und wird sehr geschätzt!",
                "updated": 1681511558110
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This page discusses best practices to build and contribute Superalgos tutorials. It doesn't cover the actual mechanics of building tutorials. Instead, it focuses on what is desirable.",
            "updated": 1617732597782,
            "translations": [
                {
                    "language": "ES",
                    "text": "Esta página habla acerca de las mejores prácticas para construir y contribuir tutoriales de Superalgos. No cubre la mecánica actual de construir tutoriales. en lugar de eso está enfocado en lo que sería deseable.",
                    "updated": 1640113151245
                },
                {
                    "language": "RU",
                    "text": "На этой странице обсуждаются лучшие методы создания и предоставления учебников Superalgos. Здесь не рассматривается фактическая механика создания учебников. Вместо этого она сосредоточена на том, что желательно.",
                    "updated": 1640268528110
                },
                {
                    "language": "TR",
                    "text": "Bu sayfada, Superalgos eğitimlerini oluşturmak ve katkıda bulunmak için en iyi uygulamalar anlatılmaktadır. Yapı eğitimlerinin gerçek mekaniğini kapsamaz. Bunun yerine, neyin arzu edildiğine odaklanır.",
                    "updated": 1645296990967
                },
                {
                    "language": "DE",
                    "text": "Auf dieser Seite werden die besten Praktiken zur Erstellung von Superalgos-Tutorials besprochen. Sie befasst sich nicht mit den eigentlichen Mechanismen der Erstellung von Tutorials. Stattdessen konzentriert sie sich darauf, was wünschenswert ist.",
                    "updated": 1681511589694
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->The Quest for Quality",
            "updated": 1642954690025
        },
        {
            "style": "Title",
            "text": "The Associated Workspace",
            "translations": [
                {
                    "language": "TR",
                    "text": "İlişkili Çalışma Alanı",
                    "updated": 1645297076525
                },
                {
                    "language": "RU",
                    "text": "Сопряженное рабочее пространство",
                    "updated": 1647782985241
                },
                {
                    "language": "DE",
                    "text": "Der assoziierte Arbeitsbereich",
                    "updated": 1681511618290
                }
            ]
        },
        {
            "style": "Text",
            "text": "To deliver the best possible experience, a tutorial must be featured in a specific Workspace, and the workspace must be custom-tailored to serve the tutorial. The workspace must be clean and feature the assets required for the learning experience to be optimal. It is best to keep the workspace clean, light, and stripped of unnecessary resources.",
            "updated": 1617732813825,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para ofrecer a mejor experiencia posible, un tutorial debe aparecer en un Workspace, específico y el workspace debe ser personalizado para servir al tutorial. El workspace debe ser limpio y segurar los elementos necesarios para que la experiencia de aprendizaje sea óptima- Es lo mejor mantener el workspace limpio, ligero, y despojado de recursos innecesarios.",
                    "updated": 1633365163709
                },
                {
                    "language": "RU",
                    "text": "Чтобы обеспечить наилучший опыт, учебное пособие должно быть размещено в определенном рабочем пространстве, а рабочее пространство должно быть настроено специально для этого учебного пособия. Рабочее пространство должно быть чистым и содержать активы, необходимые для оптимального обучения. Лучше всего, чтобы рабочее пространство было чистым, простым и лишенным ненужных ресурсов.",
                    "updated": 1640268750436
                },
                {
                    "language": "TR",
                    "text": "Mümkün olan en iyi deneyimi sunmak için, bir öğretici belirli bir Çalışma Alanında ( Workspace ) yer almalı ve çalışma alanı öğreticiye hizmet edecek şekilde özel olarak uyarlanmalıdır. Çalışma alanı temiz olmalı ve öğrenme deneyiminin optimal olması için gereken varlıklara sahip olmalıdır. Çalışma alanını temiz, hafif ve gereksiz kaynaklardan arındırılmış tutmak en iyisidir.",
                    "updated": 1645297122788
                },
                {
                    "language": "DE",
                    "text": "Um ein optimales Lernerlebnis zu bieten, muss ein Lernprogramm in einem bestimmten Arbeitsbereich (Workspace) angezeigt werden, der auf das Lernprogramm zugeschnitten ist. Der Arbeitsbereich muss übersichtlich sein und die für ein optimales Lernerlebnis erforderlichen Elemente enthalten. Am besten ist es, den Arbeitsbereich sauber und übersichtlich zu halten und ihn von unnötigen Ressourcen zu befreien.",
                    "updated": 1681511644487
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Use the USDT/BTC Market in Binance.com",
            "updated": 1621871090187,
            "translations": [
                {
                    "language": "RU",
                    "text": "Используйте рынок USDT/BTC в Binance.com",
                    "updated": 1640268767774
                },
                {
                    "language": "TR",
                    "text": "Binance.com'da USDT/BTC Pazarını kullanın",
                    "updated": 1645297152658
                },
                {
                    "language": "DE",
                    "text": "Nutzen Sie den USDT/BTC-Markt auf Binance.com",
                    "updated": 1681511754119
                }
            ]
        },
        {
            "style": "Text",
            "text": "If your tutorial deals with data, it is best to use the same exchange, market, and date ranges already in use in the Getting Started Native Workspace tutorials. This way, users will already have the data and can go through the tutorial easier.",
            "updated": 1621871223112,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si el tutorial trata con datos, es lo mejor utilizar el mismo exchange, market, y rango de datoss, ya en uso en los tutoriales de Getting Started Native Workspace. De este modo, los usuarios ya tendrán los datos y pueden ir a través del tutorial con mayor facilidad.",
                    "updated": 1640113215381
                },
                {
                    "language": "RU",
                    "text": "Если ваш учебник посвящен данным, лучше всего использовать те же биржи, рынки и диапазоны дат, которые уже используются в учебниках Getting Started Native Workspace. Таким образом, пользователи уже будут иметь необходимые данные и смогут легче пройти обучение.",
                    "updated": 1640268844627
                },
                {
                    "language": "TR",
                    "text": "Eğitiminiz verilerle ilgiliyse, Eklenti Çalışma Alanına ( Native Workspace ) Başlarken eğitimlerinde halihazırda kullanımda olan aynı borsa, pazar ve tarih aralıklarını kullanmak en iyisidir. Bu şekilde, kullanıcılar verilere zaten sahip olacak ve öğreticiyi daha kolay geçebilir.",
                    "updated": 1645297237805
                },
                {
                    "language": "DE",
                    "text": "Wenn sich Ihr Tutorial mit Daten befasst, ist es am besten, dieselben Börsen-, Markt- und Datumsbereiche zu verwenden, die bereits in den Tutorials für den Plugin-Arbeitsbereich (Native Workspace) \"Erste Schritte\" verwendet werden. Auf diese Weise verfügen die Benutzer bereits über die Daten und können das Lernprogramm leichter durcharbeiten.",
                    "updated": 1681511787796
                }
            ]
        },
        {
            "style": "Note",
            "text": "If for whatever reason the tutorial must deal with other markets and/or exchanges to deliver the content, then go ahead and ignore the above.",
            "updated": 1621871324929,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si por cualquier razón el tutorial debiera tratar con otros mercados y/o exchanges para enviar el contenido, entonces siga adelante e ignore lo de aquí arriba.",
                    "updated": 1633365546892
                },
                {
                    "language": "RU",
                    "text": "Если по каким-либо причинам учебник должен иметь дело с другими рынками и/или биржами для доставки контента, тогда продолжайте и игнорируйте вышесказанное.",
                    "updated": 1640268870336
                },
                {
                    "language": "TR",
                    "text": " Not: Her ne sebeple olursa olsun, öğreticinin içeriği sunmak için diğer pazarlarla ve/veya borsalarla ilgilenmesi gerekiyorsa, devam edin ve yukarıdakileri göz ardı edin.",
                    "updated": 1645297270857
                },
                {
                    "language": "DE",
                    "text": "Stellen Sie sicher, dass Sie einen Schritt einbauen, der es den Nutzern ermöglicht, zu BinanceUS zu wechseln, falls sie dies benötigen, genau wie im tutorial Willkommen bei Superalgos.",
                    "updated": 1681511818855
                }
            ]
        },
        {
            "style": "Success",
            "text": "Make sure you include a step allowing users to switch to BinanceUS, in case they need to, just like in the Welcome to Superalgos Tutorial.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Asegúrese de incluir un paso permitiendo a los usuarios enlazar con BinanceUS, en caso de que lo necesiten como en el caso del tutorial de Welcome to Superalgos.",
                    "updated": 1633365690047
                },
                {
                    "language": "RU",
                    "text": "Обязательно включите шаг, позволяющий пользователям перейти на BinanceUS в случае необходимости, как в учебном пособии Welcome to Superalgos.",
                    "updated": 1640268916224
                },
                {
                    "language": "TR",
                    "text": "İpucu: Superalgos'a Hoş Geldiniz Eğitiminde ( Welcome to Superalgos Tutorial ) olduğu gibi, kullanıcıların ihtiyaç duymaları durumunda BinanceUS'a geçmelerine izin veren bir adım eklediğinizden emin olun.",
                    "updated": 1645297368332
                },
                {
                    "language": "DE",
                    "text": "Stellen Sie sicher, dass Sie einen Schritt einbauen, der es den Nutzern ermöglicht, zu BinanceUS zu wechseln, falls sie dies benötigen, genau wie im tutorial Willkommen bei Superalgos (Welcome to Superalgos Tutorial).",
                    "updated": 1681511865312
                }
            ]
        },
        {
            "style": "Title",
            "text": "Tutorial Series & Planning",
            "translations": [
                {
                    "language": "TR",
                    "text": "Eğitim Serisi ve Planlama",
                    "updated": 1645297394508
                },
                {
                    "language": "RU",
                    "text": "Серия уроков и планирование",
                    "updated": 1647782996406
                },
                {
                    "language": "DE",
                    "text": "Tutorials & Planungen",
                    "updated": 1681511948841
                }
            ]
        },
        {
            "style": "Text",
            "text": "Some topics are broad, have ramifications, or require a nuanced analysis to be covered thoroughly. In such cases, planning for a series of tutorials is ideal.",
            "updated": 1617712578718,
            "translations": [
                {
                    "language": "ES",
                    "text": "Algunos tópicos son amplios, tienen ramificaciones, o requieren un análisis más profundo para ser cubiertos por completo. en estos casos, la planificación de una serie de tutoriales es lo ideal.",
                    "updated": 1640113411134
                },
                {
                    "language": "RU",
                    "text": "Некоторые темы обширны, имеют большое значение или требуют глубокого анализа. В таких случаях идеальным вариантом является планирование серии учебных пособий.",
                    "updated": 1640268959282
                },
                {
                    "language": "TR",
                    "text": "Bazı konular geniştir, sonuçları vardır veya kapsamlı bir şekilde ele alınması için nüanslı bir analiz gerektirir. Bu gibi durumlarda, bir dizi öğreticiyi planlamak idealdir.",
                    "updated": 1645297425858
                },
                {
                    "language": "DE",
                    "text": "Einige Themen sind sehr umfangreich, haben weitreichende Auswirkungen oder erfordern eine differenzierte Analyse, um gründlich behandelt zu werden. In solchen Fällen ist es ideal, eine Reihe von Tutorials zu planen.",
                    "updated": 1681511971164
                }
            ]
        },
        {
            "style": "Text",
            "text": "Take, for example, the series of tutorials in the Trading System Design Tutorials Native Workspace:",
            "updated": 1617712745906,
            "translations": [
                {
                    "language": "ES",
                    "text": "Tome, por ejemplo, las series de tutoriales en el Trading System Design Tutorials Native Workspace:",
                    "updated": 1633365963577
                },
                {
                    "language": "RU",
                    "text": "Возьмем, к примеру, серию учебников в Trading System Design Tutorials Native Workspace:",
                    "updated": 1640269077954
                },
                {
                    "language": "TR",
                    "text": "Örneğin, İşlem Sistemi Tasarım Öğreticileri Eklentisi Çalışma Alanındaki ( Trading System Design Tutorials Native Workspace ) öğreticiler dizisini alın:",
                    "updated": 1645297485094
                },
                {
                    "language": "DE",
                    "text": "Nehmen Sie zum Beispiel die Reihe der Tutorials im Plugin-Arbeitsbereich (Trading System Design Tutorials Native Workspace) für das Design von Handelssystemen:",
                    "updated": 1681512080387
                }
            ]
        },
        {
            "style": "List",
            "text": "The first tutorial in the series gives a broad introduction to the topic, mostly in conceptual terms. This allows users to see the big picture and learn how the concepts are structured and why they are structured the way they are.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El primer tutorial en la serie da una introducción amplia del tópico, mayormente en términos conceptuales. Esto permite a los usuarios ver la la idea completa y aprender acerca de cómo los conceptos han sido estructurados y porque están estructurados así.",
                    "updated": 1640113306197
                },
                {
                    "language": "RU",
                    "text": "Первый учебник в серии дает широкое введение в тему, в основном в концептуальных терминах. Это позволяет пользователям увидеть общую картину и узнать, как структурированы концепции и почему они структурированы именно так, как они структурированы.",
                    "updated": 1640269102327
                },
                {
                    "language": "TR",
                    "text": "Serideki ilk öğretici, konuya çoğunlukla kavramsal terimlerle geniş bir giriş sağlar. Bu, kullanıcıların büyük resmi görmelerine ve kavramların nasıl yapılandırıldığını ve neden oldukları gibi yapılandırıldıklarını öğrenmelerine olanak tanır.",
                    "updated": 1645297506496
                },
                {
                    "language": "DE",
                    "text": "Das erste tutorial der Reihe gibt eine umfassende Einführung in das Thema, meist in konzeptioneller Hinsicht. Dies ermöglicht es den Benutzern, das Gesamtbild zu sehen und zu lernen, wie die Konzepte strukturiert sind und warum sie so strukturiert sind, wie sie sind.",
                    "updated": 1681512149400
                }
            ]
        },
        {
            "style": "List",
            "text": "The second tutorial in the series proposes an exercise that takes several more tutorials to develop and implement. That is, the tutorial sets the basis for what the series will cover.",
            "updated": 1617732839409,
            "translations": [
                {
                    "language": "ES",
                    "text": "El segundo tutorial en la serie propone un ejercicio que incluye varios tutoriales para desarrollar e implementar. Esto es, el tutorial sienta las bases de lo que la serie cubrirá.",
                    "updated": 1640111459663
                },
                {
                    "language": "RU",
                    "text": "Во втором учебнике серии предлагается упражнение, для разработки и реализации которого потребуется еще несколько учебников. Иными словами, этот учебник закладывает основу для того, о чем пойдет речь в последующих сериях.",
                    "updated": 1640269131610
                },
                {
                    "language": "TR",
                    "text": "Serideki ikinci öğretici, geliştirmek ve uygulamak için birkaç öğretici daha gerektiren bir alıştırma önermektedir. Yani öğretici, dizinin neleri kapsayacağının temelini oluşturuyor.",
                    "updated": 1645297524401
                },
                {
                    "language": "DE",
                    "text": "Das zweite Tutorial der Reihe schlägt eine Übung vor, für deren Entwicklung und Umsetzung mehrere weitere Tutorials erforderlich sind. Das heißt, das Tutorial legt die Grundlage für die weiteren Themen der Reihe.",
                    "updated": 1681512160598
                }
            ]
        },
        {
            "style": "List",
            "text": "The remaining tutorials in the series dissect the exercise proposed earlier and cover with a fine level of detail the implementation. At the same time, they cover all the context and many lateral topics.",
            "updated": 1617732881797,
            "translations": [
                {
                    "language": "ES",
                    "text": "El tutorial siguiente en la serie disecciona el ejercicio propuesto anteriormente y cubre con un nivel fino de detalles la implementación. Al mismo tiempo, ellos cubren todo el contexto y muchos temas laterales.",
                    "updated": 1640113344402
                },
                {
                    "language": "RU",
                    "text": "Остальные учебные пособия серии разбирают предложенное ранее упражнение и с мельчайшими подробностями описывают его реализацию. В то же время они охватывают весь контекст и многие сопутствующие темы.",
                    "updated": 1640269169974
                },
                {
                    "language": "TR",
                    "text": "Dizideki kalan öğreticiler, daha önce önerilen alıştırmayı inceliyor ve uygulamayı ince bir ayrıntı düzeyiyle ele alıyor. Aynı zamanda, tüm bağlamı ve birçok yan konuyu kapsarlar.",
                    "updated": 1645297554270
                },
                {
                    "language": "DE",
                    "text": "Die verbleibenden Tutorien der Reihe nehmen die zuvor vorgeschlagene Übung auseinander und behandeln die Umsetzung mit einem hohen Maß an Detailgenauigkeit. Gleichzeitig decken sie den gesamten Kontext und viele Randthemen ab.",
                    "updated": 1681512187774
                }
            ]
        },
        {
            "style": "Note",
            "text": "The whole series threads a common theme and develops it from the simplest to the most complex concepts, step by step. A tutorial series must be exhaustive and eventually, cover the whole topic. It must become the ultimate tool to learn about the subject matter!",
            "updated": 1617732933799,
            "translations": [
                {
                    "language": "ES",
                    "text": "Toda la serie enhebra un tema común y lo desarrolla desde lo más simple a  los conceptos más complejos, paso a paso. Una serie de tutoriales debe ser exhaustiva y ocasionalmente cubrir el tópico completo. Debe convertirse en la herramienta definitiva para aprender sobre el tema!",
                    "updated": 1640113505527
                },
                {
                    "language": "RU",
                    "text": "Вся серия посвящена общей теме и шаг за шагом развивает ее от самых простых до самых сложных концепций. Серия учебников должна быть исчерпывающей и в конечном итоге охватывать всю тему. Она должна стать основным инструментом для изучения предмета!",
                    "updated": 1640269193931
                },
                {
                    "language": "TR",
                    "text": "Not: Serinin tamamı ortak bir temayı işliyor ve onu adım adım en basitten en karmaşık kavramlara doğru geliştiriyor. Bir eğitim dizisi kapsamlı olmalı ve nihayetinde tüm konuyu kapsamalıdır. Konu hakkında bilgi edinmek için nihai araç haline gelmelidir!",
                    "updated": 1645297590879
                },
                {
                    "language": "DE",
                    "text": "Die gesamte Reihe behandelt ein gemeinsames Thema und entwickelt es Schritt für Schritt von den einfachsten zu den komplexesten Konzepten. Eine Lehrgangsserie muss erschöpfend sein und schließlich das gesamte Thema abdecken. Sie muss das ultimative Werkzeug sein, um etwas über das Thema zu lernen!",
                    "updated": 1681512210194
                }
            ]
        },
        {
            "style": "Success",
            "text": "Consult with project maintainers what would be good names for each tutorial in the series. Naming tutorials with clear and descriptive names is important.",
            "updated": 1621875606145,
            "translations": [
                {
                    "language": "ES",
                    "text": "Consulte a los que mantienen el proyecto (project maintainers) cual serían buenos nombres para cada tutorial de la serie. Nombrar tutoriales con nombres claros y descriptivos es importante.",
                    "updated": 1640111508245
                },
                {
                    "language": "RU",
                    "text": "Посоветуйтесь с сопровождающими проекта, какие имена будут хорошими для каждого учебника в серии. Важно давать учебным пособиям понятные и понятные названия.",
                    "updated": 1640269229492
                },
                {
                    "language": "TR",
                    "text": "İpucu: Serideki her öğretici için iyi adların ne olacağını proje yöneticilerine danışın. Öğreticileri açık ve açıklayıcı adlarla adlandırmak önemlidir.",
                    "updated": 1645297616448
                },
                {
                    "language": "DE",
                    "text": "Beraten Sie sich mit den Projektbetreuern, welche Namen für die einzelnen Tutorials der Reihe geeignet wären. Die Benennung von Tutorials mit klaren und beschreibenden Namen ist wichtig.",
                    "updated": 1681512281947
                }
            ]
        },
        {
            "style": "Title",
            "text": "The Target Audience",
            "translations": [
                {
                    "language": "TR",
                    "text": "Hedef Kitle",
                    "updated": 1645297662218
                },
                {
                    "language": "RU",
                    "text": "Целевая аудитория",
                    "updated": 1647783004577
                },
                {
                    "language": "DE",
                    "text": "Die Zielgruppe",
                    "updated": 1681512304100
                }
            ]
        },
        {
            "style": "Text",
            "text": "People are different. We all have slightly different wirings in our heads, and we all learn differently. In that sense, building tutorials is a bit of a challenge. Some people like tutorials that go straight to the point and show them how to solve a very specific issue. Others prefer tutorials that get to the bone, explain every detail, and properly cover the context.",
            "updated": 1617733011186,
            "translations": [
                {
                    "language": "ES",
                    "text": "La gente es diferente. todos tenemos un cableado ligeramente diferente en nuestras cabezas, y todos aprendemos  distinto. En ese sentido, construir tutoriales tiene un poco de desafío. A alguna gente le gustan los tutoriales que van derecho al punto y muestran como resolver un tema bien específico. otros prefieren tutoriales que van al hueso, explican cada detalle y cubre adecuadamente el contenido.",
                    "updated": 1633367166012
                },
                {
                    "language": "RU",
                    "text": "Люди разные. У всех нас немного разные провода в голове, и все мы учимся по-разному. В этом смысле создание учебных пособий - непростая задача. Некоторым людям нравятся учебники, которые сразу переходят к делу и показывают, как решить очень конкретную проблему. Другие предпочитают учебные пособия, которые проникают в суть, объясняют каждую деталь и должным образом охватывают суть вопроса.",
                    "updated": 1640269326682
                },
                {
                    "language": "TR",
                    "text": "İnsanlar farklıdır. Hepimizin kafası biraz farklı çalışır ve hepimiz farklı şekilde öğreniriz. Bu anlamda, öğreticiler oluşturmak biraz zor. Bazı insanlar doğrudan konuya giden ve onlara çok özel bir sorunun nasıl çözüleceğini gösteren öğreticilerden hoşlanır. Diğerleri, özüne inen, her ayrıntıyı açıklayan ve bağlamı uygun şekilde kapsayan öğreticileri tercih eder.",
                    "updated": 1645297755712
                },
                {
                    "language": "DE",
                    "text": "Menschen sind unterschiedlich. Wir haben alle etwas andere Verdrahtungen in unseren Köpfen, und wir alle lernen anders. In diesem Sinne ist die Erstellung von Tutorials eine kleine Herausforderung. Manche Leute mögen Tutorials, die direkt auf den Punkt kommen und ihnen zeigen, wie sie ein ganz bestimmtes Problem lösen können. Andere bevorzugen Tutorials, die bis ins kleinste Detail gehen, jedes Detail erklären und den Kontext richtig erfassen.",
                    "updated": 1681512787539
                }
            ]
        },
        {
            "style": "Text",
            "text": "At this early stage, we can't afford to duplicate efforts and build different tutorials for different kinds of learners. We have to choose the method that best serves the project.",
            "updated": 1617714108723,
            "translations": [
                {
                    "language": "ES",
                    "text": "Es en esta etapa temprana, que no podemos darnos el lujo de duplicar esfuerzos y construir tutoriales diferentes para distintas clases de aprendices. Tenemos que elegir el método que mejor sirva al proyecto.",
                    "updated": 1640113524529
                },
                {
                    "language": "RU",
                    "text": "На этом раннем этапе мы не можем позволить себе дублировать усилия и создавать разные учебники для разных типов учащихся. Мы должны выбрать тот метод, который лучше всего подходит для проекта.",
                    "updated": 1640269347480
                },
                {
                    "language": "TR",
                    "text": "Bu erken aşamada, çabaları çoğaltmayı ve farklı türdeki öğrenciler için farklı öğreticiler oluşturmayı göze alamayız. Projeye en iyi hizmet eden yöntemi seçmeliyiz.",
                    "updated": 1645297780414
                },
                {
                    "language": "DE",
                    "text": "In diesem frühen Stadium können wir es uns nicht leisten, doppelte Arbeit zu leisten und verschiedene Tutorials für verschiedene Arten von Lernenden zu erstellen. Wir müssen die Methode wählen, die dem Projekt am besten dient.",
                    "updated": 1681513035818
                }
            ]
        },
        {
            "style": "Important",
            "text": "We choose to focus on building comprehensive tutorials that everyone can follow and that leave no one behind. We believe that a tutorial that goes slow, covering every detail, and taking the time to explain the nuance is the right approach at this stage. By building tutorials in a such manner, we guarantee that those who are willing to invest the time to learn the system have adequate material to quickly become power users.",
            "updated": 1621870335450,
            "translations": [
                {
                    "language": "ES",
                    "text": "Elegimos enfocarnos en construir tutoriales comprensibles que todos puedan seguir y que no deje a nadie atrás. Creemos que un tutorial que va lento, cubriendo cada detalle, y tomándose el tiempo de explicar los matices es el enfoque correcto en esta etapa. Al construir tutoriales de esta manera, garantizamos que aquellos que están dispuestos a invertir tiempo en aprender el sistema tengan el material adecuado para convertirse rápidamente en usuarios poderosos.",
                    "updated": 1640111615070
                },
                {
                    "language": "RU",
                    "text": "Мы решили сосредоточиться на создании всеобъемлющих учебников, которым может следовать каждый и которые никого не оставят позади. Мы считаем, что неторопливый учебник, охватывающий каждую деталь и уделяющий время объяснению всех нюансов, является правильным подходом на данном этапе. Создавая учебники таким образом, мы гарантируем, что те, кто готов потратить время на изучение системы, получат достаточно материала, чтобы быстро стать опытными пользователями.",
                    "updated": 1640269397281
                },
                {
                    "language": "TR",
                    "text": "Önemli: Herkesin takip edebileceği ve kimseyi geride bırakmayan kapsamlı eğitimler oluşturmaya odaklanmayı seçiyoruz. Yavaş ilerleyen, her ayrıntıyı kapsayan ve nüansı açıklamaya zaman ayıran bir eğitimin bu aşamada doğru yaklaşım olduğuna inanıyoruz. Öğreticileri bu şekilde oluşturarak, sistemi öğrenmek için zaman ayırmaya istekli olanların hızla ileri düzey kullanıcılar olmak için yeterli materyale sahip olmasını garanti ediyoruz.",
                    "updated": 1645297802561
                },
                {
                    "language": "DE",
                    "text": "Wir haben uns entschieden, uns auf die Erstellung umfassender Tutorials zu konzentrieren, denen jeder folgen kann und die niemanden zurücklassen. Wir glauben, dass ein tutorial, das langsam vorgeht, jedes Detail abdeckt und sich die Zeit nimmt, jede Nuance zu erklären, der richtige Ansatz in dieser Phase ist. Auf diese Weise garantieren wir, dass diejenigen, die bereit sind, die Zeit zu investieren, um das System zu erlernen, genügend Material haben, um schnell zu Power-Usern zu werden.",
                    "updated": 1681513073215
                }
            ]
        },
        {
            "style": "Text",
            "text": "Such tutorials may be slightly annoying to fast-learners, or to people that just want a specific question answered. But such needs are already covered by the searchable knowledge base comprised in the Docs.",
            "updated": 1617714293925,
            "translations": [
                {
                    "language": "ES",
                    "text": "Estos tutoriales pueden resultar ligeramente molestos para los que aprenden rápido o para gente que solo busca respuesta a una pregunta específica. Pero esas necesidades ya son cubiertas en la base de conocimientos con capacidad de búsqueda  incluida en los Docs.",
                    "updated": 1633368103703
                },
                {
                    "language": "RU",
                    "text": "Такие руководства могут немного раздражать тех, кто быстро учится, или тех, кто просто хочет получить ответ на конкретный вопрос. Но такие потребности уже удовлетворены базой знаний с возможностью поиска, содержащейся во вкладке Docs.",
                    "updated": 1640269464902
                },
                {
                    "language": "TR",
                    "text": "Bu tür öğreticiler, hızlı öğrenenler veya yalnızca belirli bir sorunun yanıtlanmasını isteyen kişiler için biraz can sıkıcı olabilir. Ancak bu tür ihtiyaçlar, Dokümanlar'da bulunan aranabilir bilgi tabanı tarafından zaten karşılanmaktadır.",
                    "updated": 1645297829350
                },
                {
                    "language": "DE",
                    "text": "Solche Tutorien können für Schnelllerner oder für Leute, die nur eine bestimmte Frage beantwortet haben wollen, etwas störend sein. Aber solche Bedürfnisse werden bereits durch die durchsuchbare Wissensdatenbank in den Docs abgedeckt.",
                    "updated": 1681513085636
                }
            ]
        },
        {
            "style": "Title",
            "text": "Communication Resources",
            "translations": [
                {
                    "language": "TR",
                    "text": "İletişim Kaynakları",
                    "updated": 1645297838983
                },
                {
                    "language": "RU",
                    "text": "Коммуникационные ресурсы",
                    "updated": 1647782155431
                },
                {
                    "language": "DE",
                    "text": "Ressourcen für die Kommunikation",
                    "updated": 1681513095473
                }
            ]
        },
        {
            "style": "Text",
            "text": "Let's get into some of the specifics on building tutorials for Superalgos!",
            "updated": 1617720149756,
            "translations": [
                {
                    "language": "ES",
                    "text": "Analicemos algunos de los detalles sobre la construcción de los tutoriales para Superalgos!",
                    "updated": 1640113587890
                },
                {
                    "language": "RU",
                    "text": "Давайте разберемся в некоторых особенностях создания учебников для Superalgos!",
                    "updated": 1640269498860
                },
                {
                    "language": "TR",
                    "text": "Superalgos için öğreticiler oluşturmanın bazı özelliklerine bakalım!",
                    "updated": 1645297875376
                },
                {
                    "language": "DE",
                    "text": "Lassen Sie uns auf einige der Besonderheiten bei der Erstellung von Tutorials für Superalgos eingehen!",
                    "updated": 1681513126726
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Superalgos tutorials have evolved through several months worth of feedback from early adopters. We feel we have found a sweet spot, and have started to develop a style in the way we use the space available in each tutorial step. The following are some notes that will help you build tutorials that match the format of existing tutorials.",
            "updated": 1617733117832,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los tutoriales de Superalgos han evolucionado a lo largo de varios meses valiosos feedbacks de los primeros usuarios. Sentimos que hemos encontrado un modo propio, y hemos comenzado a desarrollar un estilo en el modo en que utilizamos el espacio disponible en cada paso de un tutorial. A continuaciòn algunas notas que le ayudarán a construir tutoriales que combinen con el formato de los tutoriales existentes.",
                    "updated": 1640113597334
                },
                {
                    "language": "RU",
                    "text": "Учебники Superalgos развивались в течение нескольких месяцев на основе отзывов первых пользователей. Мы чувствуем, что нашли оптимальный вариант, и начали вырабатывать свой стиль в использовании свободного пространства на каждом этапе обучения. Ниже приведены некоторые замечания, которые помогут вам создать учебники, соответствующие формату существующих учебников.",
                    "updated": 1640269597893
                },
                {
                    "language": "TR",
                    "text": "Superalgos eğitimleri, ilk benimseyenlerden gelen birkaç aylık geri bildirimle gelişti. Tatlı bir nokta bulduğumuzu hissediyoruz ve her eğitim adımında mevcut alanı kullanma şeklimizde bir stil geliştirmeye başladık. Aşağıda, mevcut eğitimlerin biçimiyle eşleşen öğreticiler oluşturmanıza yardımcı olacak bazı notlar bulunmaktadır.",
                    "updated": 1645297901612
                },
                {
                    "language": "DE",
                    "text": "Die Superalgos-Tutorials haben sich über mehrere Monate hinweg durch das Feedback der ersten Nutzer entwickelt. Wir sind der Meinung, dass wir einen guten Punkt gefunden haben und haben begonnen, einen Stil zu entwickeln, wie wir den verfügbaren Platz in jedem Schritt des Tutorials nutzen. Im Folgenden finden Sie einige Hinweise, die Ihnen helfen werden, Tutorials zu erstellen, die dem Format der bestehenden Tutorials entsprechen.",
                    "updated": 1681513191502
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Use Precise Language",
            "updated": 1642954727527
        },
        {
            "style": "Title",
            "text": "Consistent Use of Space and Styles",
            "translations": [
                {
                    "language": "TR",
                    "text": "Alan ve Stillerin Tutarlı Kullanımı",
                    "updated": 1645297965519
                },
                {
                    "language": "RU",
                    "text": "Последовательное использование пространства и стилей",
                    "updated": 1647783018408
                },
                {
                    "language": "DE",
                    "text": "Konsistente Nutzung von Raum und Stilen",
                    "updated": 1681513238065
                }
            ]
        },
        {
            "style": "Text",
            "text": "Use the different sections on the page and the different paragraph styles for consistent purposes. This helps users get accustomed to a certain format so that they know what to expect from each section of the page. Consistency in the way the information is delivered makes tutorials more usable!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Use las diferentes secciones de la página y los distintos estilos de párrafos para popósitos concretos. Esto ayudará a los usuarios a acostumbrarse a cierto formato para qué sepan que esperar en cada sección de la página. La consistencia en el modo en que la información es enviada hace que los tutoriales sean más útiles!",
                    "updated": 1640113829127
                },
                {
                    "language": "RU",
                    "text": "Используйте различные разделы на странице и различные стили абзацев для последовательных целей. Это поможет пользователям привыкнуть к определенному формату, чтобы они знали, чего ожидать от каждого раздела страницы. Последовательность в подаче информации делает учебники более удобными для использования!",
                    "updated": 1640269901730
                },
                {
                    "language": "TR",
                    "text": "Tutarlı amaçlar için sayfadaki farklı bölümleri ve farklı paragraf stillerini kullanın. Bu, kullanıcıların sayfanın her bölümünden ne bekleyeceklerini bilmeleri için belirli bir biçime alışmalarına yardımcı olur. Bilginin iletilme biçimindeki tutarlılık, öğreticileri daha kullanışlı hale getirir!",
                    "updated": 1645297979034
                },
                {
                    "language": "DE",
                    "text": "Verwenden Sie die verschiedenen Abschnitte auf der Seite und die verschiedenen Absatzformate für einheitliche Zwecke. Dies hilft den Benutzern, sich an ein bestimmtes Format zu gewöhnen, so dass sie wissen, was sie von jedem Abschnitt der Seite erwarten können. Konsistenz in der Art und Weise, wie die Informationen vermittelt werden, erhöht die Benutzerfreundlichkeit von Tutorials!",
                    "updated": 1681513286600
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "The Definition Box",
            "translations": [
                {
                    "language": "RU",
                    "text": "Блок определения",
                    "updated": 1640269922736
                },
                {
                    "language": "TR",
                    "text": "Tanım Kutusu",
                    "updated": 1645297995449
                },
                {
                    "language": "DE",
                    "text": "Das Definitionsfeld",
                    "updated": 1681513333112
                }
            ]
        },
        {
            "style": "Text",
            "text": "The definition box is the space to the right of the icon, below the title. Use this space to introduce what the step is about, that is, to set up the story the step will tell, or to provide some basic context. ",
            "updated": 1617902992986,
            "translations": [
                {
                    "language": "ES",
                    "text": "El box de definición es el espacio a la derecha del ícono, debajo del título. Use este espacio para introducir acerca de qué es el paso, esto es, establecer la historia que el paso contará, o proveer algún contexto básico.",
                    "updated": 1640113873421
                },
                {
                    "language": "RU",
                    "text": "Блок определения - это пространство справа от значка, под заголовком. Используйте это место, чтобы пояснить, о чем идет речь в данном шаге, то есть, чтобы рассказать историю, которую будет рассказывать шаг, или обеспечить некоторый базовый контекст.",
                    "updated": 1640269988109
                },
                {
                    "language": "TR",
                    "text": "Tanım kutusu, başlığın altında, simgenin sağındaki boşluktur. Adımın ne hakkında olduğunu tanıtmak, yani adımın anlatacağı hikayeyi kurmak veya bazı temel bağlamları sağlamak için bu alanı kullanın.",
                    "updated": 1645298008152
                },
                {
                    "language": "DE",
                    "text": "Das Definitionsfeld ist der Bereich rechts neben dem Symbol, unterhalb des Titels. Verwenden Sie diesen Bereich, um den Schritt vorzustellen, d. h. um die Geschichte, die der Schritt erzählt, darzustellen, oder um einen grundlegenden Kontext anzugeben.",
                    "updated": 1681513342649
                }
            ]
        },
        {
            "style": "Note",
            "text": "To use the definition box correctly, explain the context in four to five lines. Avoid one or two lines or anything over five.",
            "updated": 1617903200520,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para usar la box de definición correctamente, explique el contexto en cuatro o cinco líneas. Evite una o dos líneas o sobrepasar las cinco.",
                    "updated": 1640113929610
                },
                {
                    "language": "RU",
                    "text": "Чтобы правильно использовать блок определений, объясните контекст в четырех-пяти строках. Избегайте одной-двух строк или чего-либо более пяти.",
                    "updated": 1640270017216
                },
                {
                    "language": "TR",
                    "text": "Not: Tanım kutusunu doğru kullanmak için bağlamı dört ila beş satırda açıklayın. Bir veya iki satırdan veya beşten fazla satırdan kaçının.",
                    "updated": 1645298057489
                },
                {
                    "language": "DE",
                    "text": "Um das Definitionsfeld korrekt zu verwenden, sollten Sie den Zusammenhang in vier bis fünf Zeilen erläutern. Vermeiden Sie ein oder zwei Zeilen oder mehr als fünf.",
                    "updated": 1681513352368
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "The Call For Action",
            "translations": [
                {
                    "language": "RU",
                    "text": "Призыв к действиям",
                    "updated": 1640270041186
                },
                {
                    "language": "TR",
                    "text": "Eylem Çağrısı",
                    "updated": 1645298082494
                },
                {
                    "language": "DE",
                    "text": "Der Aufruf zum Handeln",
                    "updated": 1681513362126
                }
            ]
        },
        {
            "style": "Text",
            "text": "The most important section on any given step is the call for action, that is, the instruction that the user must follow to progress in the tutorial. Many times users redo tutorials or go back a few steps just to make sure they did everything right. ",
            "updated": 1617904108044,
            "translations": [
                {
                    "language": "ES",
                    "text": "La sección más importante de cualquier paso es el llamado a la acción, esto es, la instrucción que el usuario debe seguir para progresar en el tutorial. Muchas veces los usuarios rehacen los tutoriales o vuelven atrás un par de pasos para asegurarse que hicieron todo correctamente.",
                    "updated": 1640111708495
                },
                {
                    "language": "RU",
                    "text": "Самым важным разделом любого шага является призыв к действию, то есть инструкция, которой должен следовать пользователь, чтобы продвинуться в обучении. Часто пользователи повторяют уроки или возвращаются на несколько шагов назад, чтобы убедиться, что они все сделали правильно.",
                    "updated": 1640270123759
                },
                {
                    "language": "TR",
                    "text": "Herhangi bir adımdaki en önemli bölüm, eylem çağrısı, yani kullanıcının öğreticide ilerlemek için izlemesi gereken talimattır. Çoğu zaman kullanıcılar, her şeyi doğru yaptıklarından emin olmak için öğreticileri yeniden yapar veya birkaç adım geri gider.",
                    "updated": 1645298095827
                },
                {
                    "language": "DE",
                    "text": "Der wichtigste Abschnitt eines jeden Schrittes ist die Aufforderung zum Handeln, d. h. die Anweisung, die der Benutzer befolgen muss, um im Lernprogramm weiterzukommen. Oftmals wiederholen Benutzer Tutorials oder gehen ein paar Schritte zurück, nur um sicherzustellen, dass sie alles richtig gemacht haben.",
                    "updated": 1681513447708
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Always use the callout style — the one applied to this paragraph — for the call for action! Similarly, try to avoid using this style for anything else. If the particular step doesn't have a call for action, then the step should not feature this style at all!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Siempre respete el estilo — el que está en este párrafo — para el llamado a la acción! Al igual, trate de evitar usar este estilo para ninguna otra cosa- Si un paso en particular no tiene llamado a la acción, entonces este estilo no debería estar para nada!",
                    "updated": 1640111715747
                },
                {
                    "language": "RU",
                    "text": "Для призыва к действию всегда используйте стиль callout - тот, который применен к этому абзацу! Аналогично, старайтесь не использовать этот стиль ни для чего другого. Если в конкретном шаге нет призыва к действию, то этот шаг вообще не должен быть оформлен в этом стиле!",
                    "updated": 1640270184122
                },
                {
                    "language": "TR",
                    "text": "Eylem çağrısı için her zaman bu paragrafa uygulanan açıklama stilini kullanın! Benzer şekilde, bu stili başka herhangi bir şey için kullanmaktan kaçının. Belirli bir adımın bir eylem çağrısı yoksa, adımın bu stili hiç içermemesi gerekir!",
                    "updated": 1645298114511
                },
                {
                    "language": "DE",
                    "text": "Verwenden Sie für die Handlungsaufforderung immer den Stil \"Callout\", wie er in diesem Absatz verwendet wird! Versuchen Sie auch, diesen Stil nicht für andere Dinge zu verwenden. Wenn der betreffende Schritt keine Handlungsaufforderung enthält, sollte der Schritt überhaupt nicht mit diesem Stil versehen werden!",
                    "updated": 1681513460427
                }
            ]
        },
        {
            "style": "Text",
            "text": "Each tutorial step should have a single call for action, that is, a single instruction that the user must carry out. This is the ideal case scenario. There may be exceptions, for example, when we ask the user to read a page in the Docs and do something else as the main instruction.",
            "updated": 1617904124728,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada paso del tutorial debería tener un solo llamado a la acción, esto es, una sola instrucciòn que el usuario debe llevar a cabo.  Puede haber excepciones, por ejemplo, cuando le solicitamos al usuario que lea una página en los docs y hacer algo más como la instrucción principal.",
                    "updated": 1633438088497
                },
                {
                    "language": "RU",
                    "text": "Каждый шаг учебника должен содержать один призыв к действию, то есть одну инструкцию, которую пользователь должен выполнить. Это идеальный сценарий. Могут быть исключения, например, когда мы просим пользователя прочитать страницу в Docs и сделать что-то еще в качестве основной инструкции.",
                    "updated": 1640270239442
                },
                {
                    "language": "TR",
                    "text": "Her öğretici adımın tek bir eylem çağrısı, yani kullanıcının gerçekleştirmesi gereken tek bir talimat olmalıdır. Bu ideal durum senaryosudur. Örneğin, kullanıcıdan Dokümanlar'daki bir sayfayı okumasını ve ana talimat olarak başka bir şey yapmasını istediğimizde istisnalar olabilir.",
                    "updated": 1645298130349
                },
                {
                    "language": "DE",
                    "text": "Jeder Schritt des Tutorials sollte eine einzige Handlungsaufforderung enthalten, d. h. eine einzige Anweisung, die der Benutzer ausführen muss. Dies ist der Idealfall. Es kann Ausnahmen geben, z. B. wenn wir den Benutzer auffordern, eine Seite in den Dokumenten zu lesen und als Hauptanweisung etwas anderes zu tun.",
                    "updated": 1681513471121
                }
            ]
        },
        {
            "style": "Success",
            "text": "In general terms and when possible, try to avoid giving the user more than one task on the same step. Instead, if you expect the user to perform several sequential actions, try to split the process into more than one step — as many as it takes.",
            "updated": 1617904133804,
            "translations": [
                {
                    "language": "ES",
                    "text": "En términos generales y cuando es posible, intente evitar darle al usuario más de una tarea en el mismo paso. En vez de eso, si espera que el usuario haga varias acciones secuencialmente, intente repartir el proceso en más de un paso — tantos como sean necesarios.",
                    "updated": 1633438316138
                },
                {
                    "language": "RU",
                    "text": "В общих чертах и по возможности старайтесь не давать пользователю более одной задачи на одном шаге. Вместо этого, если вы ожидаете, что пользователь выполнит несколько последовательных действий, постарайтесь разбить процесс на несколько шагов - столько, сколько потребуется.",
                    "updated": 1640270322688
                },
                {
                    "language": "TR",
                    "text": "İpucu: Genel anlamda ve mümkün olduğunda, kullanıcıya aynı adımda birden fazla görev vermekten kaçınmaya çalışın. Bunun yerine, kullanıcının birkaç ardışık eylem gerçekleştirmesini bekliyorsanız, süreci birden fazla adıma bölmeye çalışın - mümkün olduğu kadar çok.",
                    "updated": 1645298149905
                },
                {
                    "language": "DE",
                    "text": "Generell sollten Sie, wenn möglich, vermeiden, dem Benutzer mehr als eine Aufgabe im selben Schritt zu übertragen. Wenn Sie erwarten, dass der Benutzer mehrere aufeinanderfolgende Aktionen ausführt, versuchen Sie stattdessen, den Prozess in mehrere Schritte aufzuteilen - so viele, wie nötig sind.",
                    "updated": 1681513483014
                }
            ]
        },
        {
            "style": "Text",
            "text": "In some cases, you may need the user to take a very simple action so that the main call for action may be delivered. In such cases, you may use the definition box to tell the user how to get ready to execute the call for action delivered later in the page.",
            "translations": [
                {
                    "language": "ES",
                    "text": "En algunos casos, puede necesitar que el usuario haga una acción muy simple para que el principal llamado a la acción pueda realizarse. En esos casos, puede utilizar la definition box para decirle al usuario como estar listo para ejecutar el llamado a la acción, que será entregado más adelante en la ´página.",
                    "updated": 1640113942422
                },
                {
                    "language": "RU",
                    "text": "В некоторых случаях вам может понадобиться, чтобы пользователь совершил очень простое действие, чтобы можно было выполнить основной призыв к действию. В таких случаях вы можете использовать блок определения, чтобы сообщить пользователю, как подготовиться к выполнению призыва к действию, представленного далее на странице.",
                    "updated": 1640270375251
                },
                {
                    "language": "TR",
                    "text": "Bazı durumlarda, ana harekete geçirici mesajın iletilebilmesi için kullanıcının çok basit bir işlem yapması gerekebilir. Bu gibi durumlarda, kullanıcıya sayfanın ilerleyen kısımlarında verilen eylem çağrısını yürütmeye nasıl hazırlanacağını anlatmak için tanım kutusunu kullanabilirsiniz.",
                    "updated": 1645298168707
                },
                {
                    "language": "DE",
                    "text": "In manchen Fällen muss der Benutzer eine sehr einfache Aktion ausführen, damit die eigentliche Aufforderung zur Aktion erfolgen kann. In solchen Fällen können Sie das Definitionsfeld verwenden, um dem Benutzer mitzuteilen, wie er sich auf die Ausführung der Aufforderung zur Handlung vorbereiten soll, die später auf der Seite erfolgt.",
                    "updated": 1681513492624
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Alternating Colors",
            "updated": 1642954766494
        },
        {
            "style": "Title",
            "text": "Use of Docs Pages",
            "translations": [
                {
                    "language": "TR",
                    "text": "Doküman Sayfalarının Kullanımı",
                    "updated": 1645298269689
                },
                {
                    "language": "RU",
                    "text": "Использование страниц документации",
                    "updated": 1647782201432
                },
                {
                    "language": "DE",
                    "text": "Verwendung von Docs-Seiten",
                    "updated": 1681513540295
                }
            ]
        },
        {
            "style": "Text",
            "text": "When you need the user to learn about a specific concept to get the proper context on the subject, do not replicate in the tutorial information that exists in the Docs. Duplicating information is not a good idea, as it makes it harder to maintain the Docs and tutorials.",
            "updated": 1617730695174,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando necesite que el usuario aprenda un concepto específico para obtener un contexto adecuado del tema, no repita en el tutorial la información que ya existe en los Docs. Duplicar la información no es una buena idea, ya que hace más difícil mantener los Docs y los tutoriales.",
                    "updated": 1640114025286
                },
                {
                    "language": "RU",
                    "text": "Когда вам нужно, чтобы пользователь узнал о конкретной концепции, чтобы получить правильный контекст по теме, не дублируйте в учебнике информацию, которая существует в Docs. Дублирование информации - не лучшая идея, так как это усложняет поддержку документации и учебников.",
                    "updated": 1640271624404
                },
                {
                    "language": "TR",
                    "text": "Konuyla ilgili doğru bağlamı elde etmek için kullanıcının belirli bir kavram hakkında bilgi edinmesine ihtiyaç duyduğunuzda, Dokümanlar'da bulunan eğitim bilgilerini tekrarlamayın. Belgeleri ve öğreticileri korumayı zorlaştırdığından, bilgileri çoğaltmak iyi bir fikir değildir.",
                    "updated": 1645298286953
                },
                {
                    "language": "DE",
                    "text": "Wenn der Benutzer etwas über ein bestimmtes Konzept lernen muss, um den richtigen Kontext zu diesem Thema zu erhalten, sollten Sie in den Tutorials keine Informationen wiederholen, die bereits in den Docs vorhanden sind. Das Duplizieren von Informationen ist keine gute Idee, da es die Pflege der Dokumente und Tutorials erschwert.",
                    "updated": 1681513797391
                }
            ]
        },
        {
            "style": "Success",
            "text": "Asking the user to read a page or a section of a page in the Docs is the correct approach. This has the added benefit of making the user aware that the Docs cover the topic too.",
            "updated": 1617724009821,
            "translations": [
                {
                    "language": "ES",
                    "text": "Pedirle al usuario leer una página o una parte de la página en los Docs es el acercamiento adecuado. Esto tiene el beneficio adicional de hacer que el usuario se de cuenta de que los Docs también cubren el tópico.",
                    "updated": 1640114018246
                },
                {
                    "language": "RU",
                    "text": "Правильным подходом будет попросить пользователя прочитать страницу или раздел страницы в документации. Это дает дополнительное преимущество - пользователь узнает, что в документации также рассматривается эта тема.",
                    "updated": 1640271660066
                },
                {
                    "language": "TR",
                    "text": "İpucu: Kullanıcıdan Dokümanlar'daki bir sayfayı veya sayfanın bir bölümünü okumasını istemek doğru yaklaşımdır. Bu, kullanıcının Dokümanlar'ın konuyu kapsadığını bilmesini sağlama avantajına da sahiptir.",
                    "updated": 1645298311327
                },
                {
                    "language": "DE",
                    "text": "Bitten Sie den Benutzer, eine Seite oder einen Abschnitt einer Seite in den Docs zu lesen, ist der richtige Ansatz. Dies hat den zusätzlichen Vorteil, dass der Benutzer darauf aufmerksam gemacht wird, dass die Docs das Thema ebenfalls behandeln.",
                    "updated": 1681513810444
                }
            ]
        },
        {
            "style": "Important",
            "text": "If you find that the relevant page in the Docs is outdated, doesn't cover the topic with the appropriate depth, or maybe even doesn't exist, helping create, complete, and/or improve the delivery of the information in the Docs is just as valuable as building the tutorial! Long format explanations do not fit well in tutorials. They do fit well in the Docs!",
            "updated": 1617733203373,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si encuentra que la página relevante de los Docs está desactualizada, no cubre el tópico con la profundidad apropiada, o puede que no exista, ayudar a crearla, completar, y/o mejorar el envio de la información en los Docs es tan valioso como construir el tutorial! Explicaciones en formato largo no encajan bien con los tutoriales. Ellas van bien en los Docs!",
                    "updated": 1633440056942
                },
                {
                    "language": "RU",
                    "text": "Если вы обнаружили, что соответствующая страница в документации устарела, не охватывает тему с должной глубиной или, возможно, даже не существует, помощь в создании, дополнении и/или улучшении предоставления информации в документации будет не менее ценной, чем создание учебника! Длинные формы объяснений не очень подходят для учебников. Зато они хорошо подходят в документации!",
                    "updated": 1640271718287
                },
                {
                    "language": "TR",
                    "text": "Önemli: Dokümanlar'daki ilgili sayfanın güncel olmadığını, konuyu uygun derinlikte kapsamadığını veya belki de mevcut olmadığını fark ederseniz, bu sayfadaki bilgilerin oluşturulmasına, tamamlanmasına ve/veya sunumunun iyileştirilmesine yardımcı olur. Dokümanlar, öğreticiyi oluşturmak kadar değerlidir! Uzun formatlı açıklamalar öğreticilere pek uymuyor. Dokümanlar'a iyi uyuyorlar!",
                    "updated": 1645298340158
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie feststellen, dass die relevante Seite in den Docs veraltet ist, das Thema nicht mit der angemessenen Tiefe abdeckt oder vielleicht sogar gar nicht existiert, ist Ihre Hilfe bei der Erstellung, Vervollständigung und/oder Verbesserung der Informationen in den Docs genauso wertvoll wie die Erstellung des Tutorials! Langformatige Erklärungen passen nicht gut in Tutorials. Sie passen aber gut in die Docs!",
                    "updated": 1681513822135
                }
            ]
        },
        {
            "style": "Title",
            "text": "Interactivity",
            "updated": 1617724494717,
            "translations": [
                {
                    "language": "RU",
                    "text": "Интерактивность",
                    "updated": 1640271731763
                },
                {
                    "language": "TR",
                    "text": "Etkileşim",
                    "updated": 1645298376053
                },
                {
                    "language": "DE",
                    "text": "Interaktivität",
                    "updated": 1681513834648
                }
            ]
        },
        {
            "style": "Text",
            "text": "The whole point of tutorials — and the main difference with the Docs as learning material — is that they offer the opportunity for hands-on learning. Tutorials are interactive while the Docs are less so!",
            "updated": 1617730782624,
            "translations": [
                {
                    "language": "ES",
                    "text": "El punto de los tutoriales — y la diferencia principal con los Docs como material de aprendizaje — es que ellos ofrecen la oportunidad  para el aprendizaje práctico Los tutoriales son interactivos mientras que los Docs no tanto!",
                    "updated": 1633440286430
                },
                {
                    "language": "RU",
                    "text": "Суть учебников - и главное отличие от документов как учебного материала - в том, что они предоставляют возможность практического обучения. Учебники интерактивны, в то время как документы менее интерактивны!",
                    "updated": 1640271759540
                },
                {
                    "language": "TR",
                    "text": "Öğreticilerin tüm amacı - ve öğrenme materyali olarak Dokümanlar ile arasındaki temel fark - uygulamalı öğrenme fırsatı sunmalarıdır. Dokümanlar daha az etkileşimliyken öğreticiler etkileşimlidir!",
                    "updated": 1645298393507
                },
                {
                    "language": "DE",
                    "text": "Der Sinn von Tutorials - und der Hauptunterschied zu den Docs als Lernmaterial - ist, dass sie die Möglichkeit zum praktischen Lernen bieten. Tutorials sind interaktiv, während die Docs es weniger sind!",
                    "updated": 1681513851717
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Make sure you use this quality to the fullest, but also try to maintain a certain balance!",
            "updated": 1617725782977,
            "translations": [
                {
                    "language": "ES",
                    "text": "Asegúrese de usar esta cualidad al máximo, pero también intente mantener un cierto balance!",
                    "updated": 1640114093816
                },
                {
                    "language": "RU",
                    "text": "Убедитесь, что вы используете это качество в полной мере, но при этом старайтесь соблюдать определенный баланс!",
                    "updated": 1640271797532
                },
                {
                    "language": "TR",
                    "text": "Bu kaliteyi sonuna kadar kullandığınızdan emin olun, ancak aynı zamanda belirli bir dengeyi korumaya çalışın!",
                    "updated": 1645298413848
                },
                {
                    "language": "DE",
                    "text": "Nutzen Sie diese Eigenschaft in vollem Umfang, aber achten Sie auch auf ein gewisses Gleichgewicht!",
                    "updated": 1681513863319
                }
            ]
        },
        {
            "style": "List",
            "text": "If the tutorial is talking about a hierarchy, a group of nodes, or a particular node, make sure that the tutorial step takes you to that place in the Workspace. This adds a visual element to the explanation and helps the user get familiar with the data structures involved.",
            "updated": 1617725808080,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si el tutorial está hablando de jerarquías, un grupo de nodos en particular, asegúrese que el paso del tutorial lo lleve a ese lugar en el Workspace. Esto agrega un elemento visual a la explicación y ayuda al usuario a familiarizarse con la estructura de datos involucrada.",
                    "updated": 1640114145589
                },
                {
                    "language": "RU",
                    "text": "Если в учебнике речь идет об иерархии, группе узлов или конкретном узле, убедитесь, что шаг учебника ведет вас к этому месту в рабочем пространстве. Это добавляет визуальный элемент к объяснению и помогает пользователю ознакомиться с соответствующими структурами данных.",
                    "updated": 1640271835217
                },
                {
                    "language": "TR",
                    "text": "Öğretici bir hiyerarşi, bir grup düğüm veya belirli bir düğümden bahsediyorsa, öğretici adımının sizi Çalışma Alanında (  Workspace ) o yere götürdüğünden emin olun. Bu, açıklamaya görsel bir öğe ekler ve kullanıcının ilgili veri yapılarını tanımasına yardımcı olur.",
                    "updated": 1645298507780
                },
                {
                    "language": "DE",
                    "text": "Wenn sich das Tutorial auf eine Hierarchie, eine Gruppe von Knoten oder einen bestimmten Knoten bezieht, stellen Sie sicher, dass der Schritt des Tutorials Sie zu dieser Stelle im Arbeitsbereich (Workspace) führt. Dies fügt der Erklärung ein visuelles Element hinzu und hilft dem Benutzer, sich mit den beteiligten Datenstrukturen vertraut zu machen.",
                    "updated": 1681513901545
                }
            ]
        },
        {
            "style": "List",
            "text": "Tutorials can affect the Workspace in many ways replicating actions the user may do. When you want the user to learn to do something, it's best to ask the user to do it, instead of having the tutorial do it for the user.",
            "updated": 1617733271488,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los tutoriales pueden afectar al Workspace de muchas maneras  replicando acciones que el usuario puede hacer. Cuando quiere que el usuario aprenda a hacer algo, lo mejor es pedirle al usuario que lo haga, en vez de que el tutorial lo haga por él.",
                    "updated": 1633440813684
                },
                {
                    "language": "RU",
                    "text": "Учебные пособия могут влиять на рабочее пространство различными способами, повторяя действия, которые может выполнять пользователь. Когда вы хотите, чтобы пользователь научился что-то делать, лучше попросить пользователя сделать это, вместо того, чтобы учебник делал это за пользователя.",
                    "updated": 1640271924959
                },
                {
                    "language": "TR",
                    "text": "Öğreticiler, kullanıcının yapabileceği eylemleri çoğaltarak Çalışma Alanını ( Workspace ) birçok yönden etkileyebilir. Kullanıcının bir şeyi yapmayı öğrenmesini istediğinizde, öğreticinin kullanıcı için yapmasını sağlamak yerine, kullanıcıdan yapmasını istemek en iyisidir.",
                    "updated": 1645298541312
                },
                {
                    "language": "DE",
                    "text": "Tutorials können den Arbeitsbereich (Workspace) in vielerlei Hinsicht beeinflussen, indem sie Aktionen des Benutzers nachahmen. Wenn Sie wollen, dass der Benutzer etwas lernt, ist es am besten, den Benutzer aufzufordern, es zu tun, anstatt es das Lernprogramm für den Benutzer tun zu lassen. ",
                    "updated": 1681514036095
                }
            ]
        },
        {
            "style": "List",
            "text": "On the other hand, the tutorial should take care of doing certain things that are not conducive to learning something relevant to the context of the tutorial. Performing these actions directly may help keep the user focused on what matters most.",
            "updated": 1617733297397,
            "translations": [
                {
                    "language": "ES",
                    "text": "Por otro lado, el tutorial debería cuidar de no hacer cosas que no lleven a aprender nada relevante del contexto del tutorial. Realizar estas acciones directamente puede ayudar a mantener al usuario concentrado en lo que más importa.",
                    "updated": 1640114167809
                },
                {
                    "language": "RU",
                    "text": "С другой стороны, учебник должен позаботиться о выполнении определенных действий, которые не способствуют изучению чего-то, относящегося к контексту учебника. Непосредственное выполнение этих действий может помочь пользователю сосредоточиться на главном.",
                    "updated": 1640271948497
                },
                {
                    "language": "TR",
                    "text": "Öte yandan, öğretici, öğreticinin bağlamıyla ilgili bir şeyler öğrenmeye elverişli olmayan belirli şeyleri yapmaya özen göstermelidir. Bu eylemleri doğrudan gerçekleştirmek, kullanıcının en önemli şeye odaklanmasına yardımcı olabilir.",
                    "updated": 1645298575607
                },
                {
                    "language": "DE",
                    "text": "Andererseits sollte das Lernprogramm sich darum kümmern, bestimmte Dinge zu tun, die dem Lernen von etwas, das für den Kontext des Lernprogramms relevant ist, nicht förderlich sind. Das direkte Ausführen dieser Aktionen kann dazu beitragen, dass sich der Benutzer auf das Wesentliche konzentriert.",
                    "updated": 1681514125129
                }
            ]
        },
        {
            "style": "List",
            "text": "In some cases, the actions users take may have certain effects. Showing users the outcome of their actions immediately after completing a task has a great educational value. For example, if the user is setting up a new Time Machine in a tutorial about the Charting Space, show users how the time machine appears in the charting space immediately after creating it. If users then set up a Timeline Chart that references a particular Data Mine, show users how the new Timeline Chart appears within the Time Machine, and let them verify that the expected layer managers are there. Don't be afraid to go back and forth... that is the whole point after all!",
            "updated": 1617905020985,
            "translations": [
                {
                    "language": "ES",
                    "text": "En algunos casos, las acciones que los usuarios realizan tienene efectos determinados. Mostrarles a los usuarios los resultados de sus acciones inmediatamente después de haber completado una tarea es de gran valor educativo. Por ejemplo, si el usuario está configurando una nueva Time Machine en un tutorial acerca de el Charting Space, mostrarle a los usuarios como la time machine aparece en el charting space inmediatamente después de crearla. Si los usuarios configuran una Timeline Chart que referencia a una particular Data Mine, mostrarles a los usuarios como la nueva Timeline Chart aparece dentro de la Time Machine, y permíteles verificar que los administradores de capas esperados están allí. no tengas miedo de ir hacia atrás y hacia adelante... Ese es el punto después de todo!",
                    "updated": 1640114293366
                },
                {
                    "language": "RU",
                    "text": "В некоторых случаях действия пользователей могут иметь определенные последствия. Демонстрация пользователям результатов их действий сразу после выполнения задания имеет большую образовательную ценность. Например, если пользователь настраивает новую машину времени Time Machine в учебном пособии о пространстве диаграмм Charting Space, покажите пользователям, как машина времени появляется в пространстве диаграмм сразу после ее создания. Если пользователи затем настраивают временную диаграмму Timeline Chart, которая ссылается на определенную источник данных Data Mine, покажите пользователям, как новая временная диаграмма появляется в Time Machine, и позвольте им убедиться, что ожидаемые менеджеры слоев находятся там. Не бойтесь ходить туда-сюда... в этом, в конце концов, и есть смысл!",
                    "updated": 1640272197087
                },
                {
                    "language": "TR",
                    "text": "Bazı durumlarda, kullanıcıların yaptığı eylemlerin belirli etkileri olabilir. Kullanıcılara, bir görevi tamamladıktan hemen sonra eylemlerinin sonucunu göstermek, büyük bir eğitim değerine sahiptir. Örneğin, kullanıcı Grafik Alanı ( Charting Space ) ile ilgili bir eğitimde yeni bir Zaman Makinesi ( Time Machine ) kuruyorsa, kullanıcılara zaman makinesinin oluşturulduktan hemen sonra grafik alanında nasıl göründüğünü gösterin. Kullanıcılar daha sonra belirli bir Veri Madeni'ne ( Data Mine ) referans veren bir Zaman Çizelgesi Grafiği ayarlarsa, kullanıcılara yeni Zaman Çizelgesi Grafiğinin ( Timeline Chart ) Zaman Makinesi içinde nasıl göründüğünü gösterin ve beklenen katman yöneticilerinin orada olduğunu doğrulamalarına izin verin. Bir ileri bir geri gitmekten korkmayın... işte bütün mesele bu!",
                    "updated": 1645299003749
                },
                {
                    "language": "DE",
                    "text": "In einigen Fällen können die Handlungen der Benutzer bestimmte Auswirkungen haben. Es hat einen großen pädagogischen Wert, den Benutzern das Ergebnis ihrer Aktionen unmittelbar nach Abschluss einer Aufgabe zu zeigen. Wenn der Benutzer beispielsweise in einem Tutorial über den Charting Space eine neue Zeitmaschine (Time Machine) einrichtet, zeigen Sie ihm, wie die Zeitmaschine unmittelbar nach ihrer Erstellung im Charting Space erscheint. Wenn der Benutzer dann ein Zeitachsendiagramm (Timeline Chart) einrichtet, das auf eine bestimmte Data Mine verweist, zeigen Sie ihm, wie das neue Zeitachsendiagramm (Timeline Chart) in der Zeitmaschine erscheint, und lassen Sie ihn überprüfen, ob die erwarteten Ebenenmanager vorhanden sind. Scheuen Sie sich nicht, hin und her zu gehen... das ist schließlich der Sinn der Sache!",
                    "updated": 1681514216230
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Tooltips",
            "updated": 1642954808337
        },
        {
            "style": "Title",
            "text": "Naming of Nodes",
            "updated": 1617731585276,
            "translations": [
                {
                    "language": "ES",
                    "text": "Naming of Nodes  (Nombrando los nodos)",
                    "updated": 1640109314526
                },
                {
                    "language": "RU",
                    "text": "Присвоение имен узлам",
                    "updated": 1640272370877
                },
                {
                    "language": "TR",
                    "text": "Düğümlerin Adlandırılması",
                    "updated": 1645299040627
                },
                {
                    "language": "DE",
                    "text": "Benennung von Knoten",
                    "updated": 1681514283318
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos is a complex system. Helping users develop good organizational habits is highly desirable. The more top-level users we may help form, the more powerful the project becomes.",
            "updated": 1617732614881,
            "translations": [
                {
                    "language": "ES",
                    "text": "Superalgos es un sistema complejo. Ayudar a los usuarios a desarrollar buenos hábitos organizativos es muy deseable. Cuantos más usuarios de alto nivel podamos ayudar a formar, más poderoso se vuelve el proyecto.",
                    "updated": 1640109341120
                },
                {
                    "language": "RU",
                    "text": "Superalgos - это сложная система. Очень желательно помочь пользователям выработать хорошие организационные навыки. Чем больше пользователей высшего уровня мы можем помочь сформировать, тем мощнее становится проект.",
                    "updated": 1640272438547
                },
                {
                    "language": "TR",
                    "text": "Superalgos karmaşık bir sistemdir. Kullanıcıların iyi organizasyon alışkanlıkları geliştirmelerine yardımcı olmak son derece arzu edilir. Ne kadar çok üst düzey kullanıcı oluşturmamıza yardımcı olabilirsek, proje o kadar güçlü olur.",
                    "updated": 1645299060135
                },
                {
                    "language": "DE",
                    "text": "Superalgos ist ein komplexes System. Es ist sehr wünschenswert, dass wir den Benutzern helfen, gute organisatorische Gewohnheiten zu entwickeln. Je mehr Top-Level-Nutzer wir bei der Bildung unterstützen können, desto leistungsfähiger wird das Projekt.",
                    "updated": 1681514294614
                }
            ]
        },
        {
            "style": "Text",
            "text": "When users create new data structures, it's good practice to have them name the relevant nodes. This is particularly important with nodes that pass on their names through references to other nodes.",
            "updated": 1617733435330,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando los usuarios crean nuevas estructuras de datos, es una buena práctica que nombren los nodos relevantes. Esto es particularmente importante con los nodos que transmiten sus nombres a través de referencias a otros nodos.",
                    "updated": 1640109366248
                },
                {
                    "language": "RU",
                    "text": "Когда пользователи создают новые структуры данных, хорошей практикой является присвоение имен соответствующим узлам. Это особенно важно для узлов, которые передают свои имена через ссылки на другие узлы.",
                    "updated": 1640272458955
                },
                {
                    "language": "TR",
                    "text": "Kullanıcılar yeni veri yapıları oluşturduğunda, ilgili düğümleri adlandırmalarını sağlamak iyi bir uygulamadır. Bu, adlarını diğer düğümlere referanslar yoluyla aktaran düğümler için özellikle önemlidir.",
                    "updated": 1645299078415
                },
                {
                    "language": "DE",
                    "text": "Wenn Benutzer neue Datenstrukturen erstellen, ist es eine gute Praxis, die entsprechenden Knoten zu benennen. Dies ist besonders wichtig bei Knoten, die ihre Namen durch Verweise auf andere Knoten weitergeben.",
                    "updated": 1681514310484
                }
            ]
        },
        {
            "style": "Note",
            "text": "Make sure your tutorial goes the extra mile and reminds users to name those kinds of nodes. Proposing a specific name is ideal. Remember that the user may not know what comes next or what the node is used for at the time of creation, so they may not know what a relevant name may be. But you do, so you may propose a name that is consistent with the tutorial's goal.",
            "updated": 1617731598259,
            "translations": [
                {
                    "language": "ES",
                    "text": "Asegúrese de que su tutorial vaya más allá y recuerde a los usuarios que nombren ese tipo de nodos. Proponer un nombre específico es ideal. Recuerde que es posible que el usuario no sepa qué viene a continuación o para qué se utiliza el nodo en el momento de la creación, por lo que es posible que no sepa cuál puede ser un nombre relevante. Pero lo hace, por lo que puede proponer un nombre que sea coherente con el objetivo del tutorial.",
                    "updated": 1640109408736
                },
                {
                    "language": "RU",
                    "text": "Убедитесь, что ваше руководство прилагает дополнительные усилия и напоминает пользователям о необходимости присвоить названия таким узлам. Идеальным вариантом является предложение конкретного названия. Помните, что пользователь может не знать, что будет дальше или для чего будет использоваться узел в момент его создания, поэтому он может не знать, какое название может быть уместным. Но вы знаете, поэтому вы можете предложить название, соответствующее цели учебника.",
                    "updated": 1640272686177
                },
                {
                    "language": "TR",
                    "text": "Not: Eğitiminizin ekstra yol kat ettiğinden ve kullanıcılara bu tür düğümleri adlandırmalarını hatırlattığından emin olun. Belirli bir isim önermek idealdir. Kullanıcının daha sonra ne olacağını veya oluşturma sırasında düğümün ne için kullanıldığını bilemeyebileceğini, dolayısıyla ilgili adın ne olabileceğini bilemeyebileceğini unutmayın. Ancak bunu yaparsınız, bu nedenle öğreticinin amacı ile tutarlı bir ad önerebilirsiniz.",
                    "updated": 1645299180600
                },
                {
                    "language": "DE",
                    "text": "Achten Sie darauf, dass Ihr Tutorium die Benutzer daran erinnert, diese Art von Knoten zu benennen. Ideal ist es, einen bestimmten Namen vorzuschlagen. Denken Sie daran, dass der Benutzer zum Zeitpunkt der Erstellung möglicherweise nicht weiß, was als Nächstes kommt oder wofür der Knoten verwendet wird, so dass er nicht weiß, was ein relevanter Name sein könnte. Aber Sie wissen es, also können Sie einen Namen vorschlagen, der mit dem Ziel des Tutorials übereinstimmt.",
                    "updated": 1681514325986
                }
            ]
        },
        {
            "style": "Title",
            "text": "Look & Feel",
            "updated": 1617722154194,
            "translations": [
                {
                    "language": "ES",
                    "text": "Look & Feel  (Mire y sienta)",
                    "updated": 1640109438059
                },
                {
                    "language": "RU",
                    "text": "Внешний вид и восприятие",
                    "updated": 1640272717527
                },
                {
                    "language": "TR",
                    "text": "Bak ve hisset",
                    "updated": 1645299203738
                },
                {
                    "language": "DE",
                    "text": "Aussehen und Gefühl",
                    "updated": 1681514368624
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": "There is a philosophical debate on whether beauty is objective or subjective. Some people think beauty is in the eyes of the beholder, while others believe that there are inherently beautiful things.",
            "updated": 1617733474625,
            "translations": [
                {
                    "language": "ES",
                    "text": "Existe un debate filosófico sobre si la belleza es objetiva o subjetiva. Algunas personas piensan que la belleza está en los ojos del espectador, mientras que otras creen que hay cosas inherentemente hermosas.",
                    "updated": 1640109463696
                },
                {
                    "language": "RU",
                    "text": "Существует философский спор о том, является ли красота объективной или субъективной. Некоторые люди считают, что красота находится в глазах смотрящего, в то время как другие полагают, что существуют изначально красивые вещи.",
                    "updated": 1640272741532
                },
                {
                    "language": "TR",
                    "text": "Güzelliğin nesnel mi yoksa öznel mi olduğu konusunda felsefi bir tartışma vardır. Bazı insanlar güzelliğin bakanın gözünde olduğunu düşünürken, diğerleri doğal olarak güzel şeylerin olduğuna inanır.",
                    "updated": 1645299217737
                },
                {
                    "language": "DE",
                    "text": "Es gibt eine philosophische Debatte darüber, ob Schönheit objektiv oder subjektiv ist. Manche meinen, Schönheit liege im Auge des Betrachters, während andere glauben, dass es von Natur aus schöne Dinge gibt.",
                    "updated": 1681514375876
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Whatever the case may be, we want the overall look & feel of tutorials to be consistent!",
            "updated": 1617733495986,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cualquiera que sea el caso, queremos que el aspecto general de los tutoriales sea coherente.",
                    "updated": 1640109487182
                },
                {
                    "language": "RU",
                    "text": "Как бы там ни было, мы хотим, чтобы общий вид и восприятие учебников были одинаковыми!",
                    "updated": 1640272778897
                },
                {
                    "language": "TR",
                    "text": "Durum ne olursa olsun, öğreticilerin genel görünümünün ve hissinin tutarlı olmasını istiyoruz!",
                    "updated": 1645299229467
                },
                {
                    "language": "DE",
                    "text": "Was auch immer der Fall sein mag, wir wollen, dass das Gesamtbild der Tutorials einheitlich ist!",
                    "updated": 1681514399092
                }
            ]
        },
        {
            "style": "Text",
            "text": "Here's a list of requirements that help tutorials be consistent in their look & feel:",
            "updated": 1617722868882,
            "translations": [
                {
                    "language": "ES",
                    "text": "Aquí hay una lista de requisitos que ayudan a que los tutoriales sean consistentes en su apariencia:",
                    "updated": 1640109538015
                },
                {
                    "language": "RU",
                    "text": "Вот список требований, которые помогают учебным пособиям быть единообразными в своем внешнем виде:",
                    "updated": 1640272834101
                },
                {
                    "language": "TR",
                    "text": "Eğiticilerin görünüm ve hislerinde tutarlı olmalarına yardımcı olacak gereksinimlerin bir listesi:",
                    "updated": 1645299248227
                },
                {
                    "language": "DE",
                    "text": "Hier finden Sie eine Liste von Anforderungen, die dazu beitragen, dass die Tutorials einheitlich aussehen und funktionieren:",
                    "updated": 1681514409558
                }
            ]
        },
        {
            "style": "List",
            "text": "Always use an icon to illustrate the step. Sometimes the appropriate icon is the one corresponding to the node the user is working with. Other times you may use icons figuratively, playing with alternate meanings of what the drawing may represent.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Utilice siempre un icono para ilustrar el paso. A veces, el icono apropiado es el correspondiente al nodo con el que está trabajando el usuario. En otras ocasiones, puede utilizar iconos en sentido figurado, jugando con significados alternativos de lo que puede representar el dibujo.",
                    "updated": 1640109510421
                },
                {
                    "language": "RU",
                    "text": "Всегда используйте иконку для иллюстрации шага. Иногда подходящим значком является тот, который соответствует узлу, с которым работает пользователь. В других случаях вы можете использовать значки образно, играя с альтернативными значениями того, что может представлять рисунок.",
                    "updated": 1640272884347
                },
                {
                    "language": "TR",
                    "text": "Adımı göstermek için her zaman bir simge kullanın. Bazen uygun simge, kullanıcının birlikte çalıştığı düğüme karşılık gelen simgedir. Diğer zamanlarda simgeleri mecazi olarak kullanabilir, çizimin neyi temsil edebileceğinin alternatif anlamlarıyla oynayabilirsiniz.",
                    "updated": 1645299302530
                },
                {
                    "language": "DE",
                    "text": "Verwenden Sie immer ein Symbol, um den Schritt zu veranschaulichen. Manchmal ist das passende Symbol dasjenige, das dem Knoten entspricht, mit dem der Benutzer gerade arbeitet. In anderen Fällen können Sie Symbole bildlich verwenden und mit alternativen Bedeutungen dessen spielen, was die Zeichnung darstellen könnte.",
                    "updated": 1681514421268
                }
            ]
        },
        {
            "style": "List",
            "text": "Avoid stud step pages. Steps with very little content seem empty and feel strange. You don't need to feel the space with gibberish or unnecessary information. Instead, try to use the space to provide context for the call for action. Explain why the user is asked to do this or that. Let the user know what may be expected from the action and so on.",
            "updated": 1617733584684,
            "translations": [
                {
                    "language": "ES",
                    "text": "Evite las páginas de pasos monumentales. Los pasos con muy poco contenido parecen vacíos y se sienten extraños. No necesita sentir el espacio con galimatías o información innecesaria. En su lugar, intente utilizar el espacio para proporcionar contexto para el llamado a la acción. Explique por qué se le pide al usuario que haga esto o aquello. Informe al usuario qué se puede esperar de la acción, etc.",
                    "updated": 1640109616502
                },
                {
                    "language": "RU",
                    "text": "Избегайте страниц с шагами небольшим содержанием, они кажутся пустыми и кажутся странными. Вам не нужно заполнять пространство тарабарщиной или ненужной информацией. Вместо этого постарайтесь использовать пространство для предоставления контекста призыва к действию. Объясните, почему пользователя просят сделать то или иное действие. Дайте пользователю понять, что можно ожидать от этого действия и так далее.",
                    "updated": 1640273694929
                },
                {
                    "language": "TR",
                    "text": "Çok az içeriğe sahip adımlar boş görünüyor ve garip hissettiriyor. Alanı anlamsız veya gereksiz bilgilerle hissetmenize gerek yok. Bunun yerine, eylem çağrısı için bağlam sağlamak için alanı kullanmayı deneyin. Kullanıcıdan neden bunu yapmasının istendiğini açıklayın. Kullanıcıya eylemden ne beklenebileceğini bildirin vb.",
                    "updated": 1645299442058
                },
                {
                    "language": "DE",
                    "text": "Vermeiden Sie Schritt-Seiten. Schritte mit sehr wenig Inhalt wirken leer und fremd. Sie brauchen den Platz nicht mit Kauderwelsch oder unnötigen Informationen zu füllen. Versuchen Sie stattdessen, den Platz zu nutzen, um den Kontext für die Aufforderung zum Handeln zu vermitteln. Erklären Sie, warum der Nutzer aufgefordert wird, dies oder jenes zu tun. Lassen Sie den Benutzer wissen, was er von der Aktion erwarten kann usw.",
                    "updated": 1681514448719
                }
            ]
        },
        {
            "style": "List",
            "text": "As a corollary of the above, the opposite case may be problematic too. That is, when the content barely fits the page and gets too close to the row of buttons fixed at the bottom of each step. The problem is that some browsers / OS combinations render styles slightly differently, and what may seem close to the buttons in one system may overlap the buttons in the next. Try to level at least one full empty line — preferably two.",
            "updated": 1617733668851,
            "translations": [
                {
                    "language": "ES",
                    "text": "Como corolario de lo anterior, el caso contrario también puede ser problemático. Es decir, cuando el contenido apenas cabe en la página y se acerca demasiado a la fila de botones fijada en la parte inferior de cada paso. El problema es que algunas combinaciones de navegadores / sistemas operativos representan los estilos de manera ligeramente diferente, y lo que puede parecer cercano a los botones de un sistema puede superponerse a los botones del siguiente. Intente nivelar al menos una línea vacía completa, preferiblemente dos.",
                    "updated": 1640109655881
                },
                {
                    "language": "RU",
                    "text": "Как следствие вышесказанного, обратный случай также может быть проблематичным. То есть, когда содержимое едва умещается на странице и слишком близко подходит к ряду кнопок, закрепленных внизу каждого шага. Проблема заключается в том, что некоторые комбинации браузер / оперционная система отображают стили немного по-разному, и то, что может показаться близко к кнопкам в одной системе, может перекрывать их в другой. Постарайтесь выровнять хотя бы одну полную пустую строку, а лучше две.",
                    "updated": 1640273786793
                },
                {
                    "language": "TR",
                    "text": "Yukarıdakilerin bir sonucu olarak, bunun tersi durum da sorunlu olabilir. Diğer bir deyişle, içerik sayfaya zar zor sığdığında ve her adımın altında sabitlenmiş düğmeler satırına çok yaklaştığında. Sorun, bazı tarayıcıların/işletim sistemi kombinasyonlarının stilleri biraz farklı oluşturmasıdır ve bir sistemdeki düğmelere yakın görünen şey, sonraki düğmelerle çakışabilir. En az bir dolu boş satırı düzleştirmeye çalışın - tercihen iki.",
                    "updated": 1645299487584
                },
                {
                    "language": "DE",
                    "text": "Als logische Folge des oben Gesagten kann auch der umgekehrte Fall problematisch sein. Nämlich dann, wenn der Inhalt kaum auf die Seite passt und zu nahe an die Reihe der Schaltflächen kommt, die am unteren Ende jeder Stufe angebracht sind. Das Problem ist, dass einige Browser/Betriebssystem-Kombinationen Stile leicht unterschiedlich darstellen, und was in einem System nahe an den Schaltflächen zu liegen scheint, kann in einem anderen System die Schaltflächen überlappen. Versuchen Sie, mindestens eine volle leere Zeile einzuplanen - vorzugsweise zwei.",
                    "updated": 1681514480718
                }
            ]
        },
        {
            "style": "List",
            "text": "Do not set two consecutive paragraphs with the same style. The only exception is for bullet lists. Even the Docs Text Style is not formated to look good as consecutive paragraphs in the context of a tutorial (there is no padding between paragraphs).",
            "updated": 1617723650896,
            "translations": [
                {
                    "language": "ES",
                    "text": "No establezca dos párrafos consecutivos con el mismo estilo. La única excepción son las listas de viñetas. Incluso el estilo de texto del documento( Docs Text Style) no está formateado para verse bien como párrafos consecutivos en el contexto de un tutorial (no hay relleno entre párrafos).",
                    "updated": 1640109712414
                },
                {
                    "language": "RU",
                    "text": "Не выделяйте два следующих друг за другом абзаца одним и тем же стилем. Единственное исключение - это списки. Даже стиль текста Docs не сформирован так, чтобы хорошо смотреться в качестве последовательных абзацев в контексте учебника (между абзацами нет прокладок).",
                    "updated": 1640273977383
                },
                {
                    "language": "TR",
                    "text": "Aynı stille iki ardışık paragraf ayarlamayın. Tek istisna madde işareti listeleri içindir. Dokümanlar Metin Stili ( Docs Text Style ) bile bir öğretici bağlamında ardışık paragraflar gibi iyi görünecek şekilde biçimlendirilmemiştir (paragraflar arasında dolgu yoktur).",
                    "updated": 1645299579260
                },
                {
                    "language": "DE",
                    "text": "Setzen Sie nicht zwei aufeinanderfolgende Absätze mit demselben Stil. Die einzige Ausnahme sind Aufzählungslisten. Selbst die Textvorlage Docs (Docs Text Style) ist nicht so formatiert, dass sie als aufeinanderfolgende Absätze im Rahmen eines Tutorials gut aussieht (es gibt keine Füllung zwischen den Absätzen).",
                    "updated": 1681514542181
                }
            ]
        },
        {
            "style": "List",
            "text": "Leave at least one line empty before the buttons at the bottom of the tutorial window. Otherwise, in other browsers, the content may overflow the window.",
            "updated": 1620646218773,
            "translations": [
                {
                    "language": "ES",
                    "text": "Deje al menos una línea vacía antes de los botones en la parte inferior de la ventana del tutorial. De lo contrario, en otros navegadores, el contenido puede desbordar la ventana.",
                    "updated": 1640109727420
                },
                {
                    "language": "RU",
                    "text": "Оставьте пустой хотя бы одну строку перед кнопками в нижней части окна учебника. В противном случае в других браузерах содержимое может выйти за пределы окна.",
                    "updated": 1640274010295
                },
                {
                    "language": "TR",
                    "text": "Eğitim penceresinin altındaki düğmelerden önce en az bir satır boş bırakın. Aksi takdirde diğer tarayıcılarda içerik pencereden taşabilir.",
                    "updated": 1645299608024
                },
                {
                    "language": "DE",
                    "text": "Lassen Sie mindestens eine Zeile vor den Schaltflächen am unteren Rand des Lehrgangsfensters frei. Andernfalls kann der Inhalt in anderen Browsern das Fenster überfüllen.",
                    "updated": 1681514561741
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Title Case",
            "updated": 1642954849746
        },
        {
            "style": "Block",
            "text": "Unique Identifiers",
            "updated": 1617905396529,
            "translations": [
                {
                    "language": "ES",
                    "text": "Unique Identifiers  ( Identificadores Unicos)",
                    "updated": 1640109784229
                },
                {
                    "language": "RU",
                    "text": "Уникальные идентификаторы",
                    "updated": 1640274101948
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Unique Identifiers",
            "translations": [
                {
                    "language": "TR",
                    "text": "Benzersiz Tanımlayıcılar",
                    "updated": 1645299629491
                }
            ]
        },
        {
            "style": "Important",
            "text": "Remember that the title of a tutorial step is also the unique identifier of the corresponding Docs Page. This means that the system does not allow for duplicate titles. Avoid at all costs naming pages after single words or short phrases. Let's leave those unique names for particular cases that may merit the use of such special phrases.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Recuerde que el título de un paso del tutorial es también el identificador único de la página de documentos correspondiente. Esto significa que el sistema no permite títulos duplicados. Evite a toda costa nombrar páginas después de palabras sueltas o frases cortas. Dejemos esos nombres únicos para casos particulares que pueden ameritar el uso de frases tan especiales.",
                    "updated": 1640109811000
                },
                {
                    "language": "RU",
                    "text": "Помните, что название шага учебника также является уникальным идентификатором соответствующей страницы Docs Page. Это означает, что система не допускает дублирования названий. Избегайте любой ценой называть страницы одним словом или короткой фразой. Давайте оставим эти уникальные имена для особых случаев, которые могут заслуживать использования таких специальных фраз.",
                    "updated": 1640274222418
                },
                {
                    "language": "TR",
                    "text": "Önemli: Bir eğitim adımının başlığının aynı zamanda ilgili Dokümanlar Sayfasının ( Docs Page ) benzersiz tanımlayıcısı olduğunu unutmayın. Bu, sistemin yinelenen başlıklara izin vermediği anlamına gelir. Her ne pahasına olursa olsun sayfaları tek kelime veya kısa kelime öbeklerinden sonra adlandırmaktan kaçının. Bu tür özel ifadelerin kullanılmasını hak edebilecek özel durumlar için bu benzersiz adları bırakalım.",
                    "updated": 1645299732662
                },
                {
                    "language": "DE",
                    "text": "Denken Sie daran, dass der Titel eines Anleitungsschritts auch der eindeutige Bezeichner der entsprechenden Docs-Seite (Docs Page) ist. Das bedeutet, dass das System keine doppelten Titel zulässt. Vermeiden Sie es auf jeden Fall, Seiten nach einzelnen Wörtern oder kurzen Sätzen zu benennen. Überlassen Sie diese eindeutigen Namen den besonderen Fällen, in denen die Verwendung solcher speziellen Ausdrücke sinnvoll ist.",
                    "updated": 1681514831111
                }
            ]
        },
        {
            "style": "Text",
            "text": "For the same reason, all titles should begin with the following fixed string of text:",
            "updated": 1617905464492,
            "translations": [
                {
                    "language": "ES",
                    "text": "Por la misma razón, todos los títulos deben comenzar con la siguiente cadena de texto fija:",
                    "updated": 1640109828737
                },
                {
                    "language": "RU",
                    "text": "По этой же причине все заголовки должны начинаться со следующей фиксированной строки текста:",
                    "updated": 1640274241889
                },
                {
                    "language": "TR",
                    "text": "Aynı nedenle, tüm başlıklar aşağıdaki sabit metin dizisiyle başlamalıdır:",
                    "updated": 1645299753514
                },
                {
                    "language": "DE",
                    "text": "Aus demselben Grund sollten alle Titel mit der folgenden festen Zeichenfolge beginnen:",
                    "updated": 1681514856520
                }
            ]
        },
        {
            "style": "Json",
            "text": "Tutorial Step - ",
            "updated": 1617905492001,
            "translations": [
                {
                    "language": "TR",
                    "text": "Eğitim Adımı - ( Tutorial Step - )",
                    "updated": 1645299781656
                }
            ]
        },
        {
            "style": "Text",
            "text": "The above helps reserve some phrases for contexts different than tutorials.",
            "updated": 1617905844332,
            "translations": [
                {
                    "language": "ES",
                    "text": "Lo anterior ayuda a reservar algunas frases para contextos diferentes a los tutoriales.",
                    "updated": 1640109842831
                },
                {
                    "language": "RU",
                    "text": "Вышеизложенное помогает зарезервировать некоторые фразы для контекстов, отличных от учебных пособий.",
                    "updated": 1640274262809
                },
                {
                    "language": "TR",
                    "text": "Yukarıdakiler, öğreticilerden farklı bağlamlar için bazı ifadelerin ayrılmasına yardımcı olur.",
                    "updated": 1645299808471
                },
                {
                    "language": "DE",
                    "text": "Die obigen Ausführungen helfen dabei, einige Sätze für andere Kontexte als Tutorien zu reservieren.",
                    "updated": 1681514878182
                }
            ]
        },
        {
            "style": "Success",
            "text": "Don't worry! Your titles will not look ugly in the tutorial, as the system filters the prefix and doesn't show it in the tutorial window!",
            "updated": 1617905922481,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡No te preocupes! ¡Tus títulos no se verán feos en el tutorial, ya que el sistema filtra el prefijo y no lo muestra en la ventana del tutorial!",
                    "updated": 1640109862813
                },
                {
                    "language": "RU",
                    "text": "Не волнуйтесь! Ваши заголовки не будут выглядеть некрасиво в учебнике, так как система фильтрует префикс и не показывает его в окне учебника!",
                    "updated": 1640274286892
                },
                {
                    "language": "TR",
                    "text": "İpucu: Endişelenme! Başlıklarınız öğreticide çirkin görünmeyecek, çünkü sistem öneki filtreler ve öğretici penceresinde göstermez!",
                    "updated": 1645299838708
                },
                {
                    "language": "DE",
                    "text": "Machen Sie sich keine Sorgen! Ihre Titel werden im Tutorial nicht hässlich aussehen, da das System das Präfix filtert und es im Tutorial-Fenster nicht anzeigt!",
                    "updated": 1681514974268
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Proper English",
            "updated": 1642954912526
        },
        {
            "style": "Title",
            "text": "The First Page",
            "translations": [
                {
                    "language": "TR",
                    "text": "İlk Sayfa",
                    "updated": 1645299865294
                },
                {
                    "language": "RU",
                    "text": "Первая страница",
                    "updated": 1647782229652
                },
                {
                    "language": "DE",
                    "text": "Die erste Seite",
                    "updated": 1681515020839
                }
            ]
        },
        {
            "style": "Text",
            "text": "The very first page of a tutorial is a page that briefly describes what the tutorial is about, using the Summary field. The page must have the same name as the tutorial and end with the word `Tutorial`, as the summary you enter will serve as a tooltip when the tutorial is mentioned across the Docs.",
            "updated": 1621877951283,
            "translations": [
                {
                    "language": "ES",
                    "text": "La primera página de un tutorial es una página que describe brevemente de qué trata el tutorial, utilizando el campo Resumen. La página debe tener el mismo nombre que el tutorial y terminar con la palabra `Tutorial`, ya que el resumen que ingrese servirá como información sobre herramientas cuando se menciona el tutorial en los Documentos.",
                    "updated": 1640114342532
                },
                {
                    "language": "RU",
                    "text": "Самая первая страница учебника - это страница, которая кратко описывает, о чем учебник, с помощью поля Summary. Страница должна иметь то же название, что и учебник, и заканчиваться словом 'Tutorial', поскольку введенное вами резюме будет служить подсказкой при упоминании учебника в Docs.",
                    "updated": 1640274677965
                },
                {
                    "language": "TR",
                    "text": "Bir öğreticinin ilk sayfası, Özet alanını kullanarak öğreticinin ne hakkında olduğunu kısaca açıklayan bir sayfadır. Sayfa, öğreticiyle aynı ada sahip olmalı ve \"Öğretici\" kelimesiyle bitmelidir, çünkü girdiğiniz özet, Dokümanlar'da eğiticiden bahsedildiğinde bir ipucu görevi görecektir.",
                    "updated": 1645299884193
                },
                {
                    "language": "DE",
                    "text": "Die allererste Seite eines Tutorials ist eine Seite, die kurz beschreibt, worum es in dem tutorial geht, indem sie das Feld \"Zusammenfassung\" verwendet. Die Seite muss den gleichen Namen wie das Tutorium haben und mit dem Wort \"Tutorium\" enden, da die von Ihnen eingegebene Zusammenfassung als Tooltip dient, wenn das Tutorium in den Docs erwähnt wird.",
                    "updated": 1681515255423
                }
            ]
        },
        {
            "style": "Callout",
            "text": "For example, the first page of the Welcome to Superalgos! tutorial is Welcome to Superalgos Tutorial.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Por ejemplo, la primera página del ¡Bienvenido a Superalgos! tutorial es Welcome to Superalgos Tutorial.",
                    "updated": 1640109973544
                },
                {
                    "language": "RU",
                    "text": "Например, первая страница учебника Welcome to Superalgos Tutorial - \"Welcome to Superalgos!\".",
                    "updated": 1640274893159
                },
                {
                    "language": "TR",
                    "text": "Örneğin, Superalgos'a Hoş Geldiniz! öğretici, Superalgos Eğitimine Hoş Geldiniz. ( Welcome to Superalgos Tutorial )",
                    "updated": 1645299923085
                },
                {
                    "language": "DE",
                    "text": "Die erste Seite des Tutorials Willkommen bei Superalgos! heißt zum Beispiel Willkommen beim Superalgos tutorial (Welcome to Superalgos Tutorial).",
                    "updated": 1681515645431
                }
            ]
        },
        {
            "style": "Text",
            "text": "The page should have an About This Tutorial heading stating what Workspace the tutorial is available in, and who the maintainer is, preferably with basic contact details (Github, Telegram, or Discord user name).",
            "updated": 1621875043974,
            "translations": [
                {
                    "language": "ES",
                    "text": "La página debe tener un Acerca de esto Tutorial encabezado indicando en que Workspace el tutorial está disponible y quién es el mantenedor, preferiblemente con detalles de contacto básicos (nombre de usuario de Github, Telegram o Discord).",
                    "updated": 1640110527097
                },
                {
                    "language": "RU",
                    "text": "На странице должен быть заголовок About This Tutorial, в котором указывается, в каком рабочем пространстве доступен учебник, и кто является его сопровождающим, желательно с основной контактной информацией (имя пользователя Github, Telegram или Discord).",
                    "updated": 1640274941128
                },
                {
                    "language": "TR",
                    "text": "Sayfada, öğreticinin ( Tutorial ) hangi Çalışma Alanında ( Workspace ) mevcut olduğunu ve bakıcının kim olduğunu belirten, tercihen temel iletişim ayrıntılarıyla (Github, Telegram veya Discord kullanıcı adı) bir Bu Eğitim Hakkında başlığı bulunmalıdır.",
                    "updated": 1645300017706
                },
                {
                    "language": "DE",
                    "text": "Die Seite sollte eine Überschrift \"Über dieses Tutorial\" haben, die angibt, in welchem Arbeitsbereich (Workspace) das Tutorial verfügbar ist und wer der Betreuer ist, vorzugsweise mit grundlegenden Kontaktdaten (Github-, Telegram- oder Discord-Nutzername).",
                    "updated": 1681515787911
                }
            ]
        },
        {
            "style": "Success",
            "text": "See the Welcome to Superalgos Tutorial page for an example.",
            "updated": 1621875007923,
            "translations": [
                {
                    "language": "ES",
                    "text": "Mirar la página del tutorial de bienvenida como ejemplo (Welcome to Superalgos Tutorial).",
                    "updated": 1640114413800
                },
                {
                    "language": "RU",
                    "text": "Пример смотрите на странице Welcome to Superalgos Tutorial.",
                    "updated": 1640274960693
                },
                {
                    "language": "TR",
                    "text": "İpucu: Örnek için Superalgos Eğitimine Hoş Geldiniz sayfasına bakın.",
                    "updated": 1645300044177
                },
                {
                    "language": "DE",
                    "text": "Auf der Seite Willkommen bei Superalgos Tutorial (Welcome to Superalgos Tutorial) finden Sie ein Beispiel.",
                    "updated": 1681515745397
                }
            ]
        },
        {
            "style": "Title",
            "text": "The First Few Steps",
            "translations": [
                {
                    "language": "ES",
                    "text": "The First Few Steps   (Los primeros pasos)",
                    "updated": 1640110548334
                },
                {
                    "language": "RU",
                    "text": "Первые несколько шагов",
                    "updated": 1640274973359
                },
                {
                    "language": "TR",
                    "text": "İlk Birkaç Adım",
                    "updated": 1645300093236
                },
                {
                    "language": "DE",
                    "text": "Die ersten Schritte",
                    "updated": 1681515728461
                }
            ]
        },
        {
            "style": "List",
            "text": "Tutorials should start with a welcome message, and a clear explanation of what the tutorial is about, including a brief description of what the user will do while following the tutorial, and what lessons will be learned. No need to compress everything into a single step... two and even three steps are fine.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Los tutoriales deben comenzar con un mensaje de bienvenida y una explicación clara de qué trata el tutorial, incluida una breve descripción de lo que hará el usuario mientras sigue el tutorial y qué lecciones aprenderá. No es necesario comprimir todo en un solo paso ... dos e incluso tres pasos están bien.",
                    "updated": 1640110413442
                },
                {
                    "language": "RU",
                    "text": "Учебники должны начинаться с приветствия и четкого объяснения того, о чем идет речь, включая краткое описание того, что пользователь будет делать, следуя учебнику, и какие уроки он извлечет. Не нужно сжимать все в один шаг... два и даже три шага вполне подойдут.",
                    "updated": 1640275011930
                },
                {
                    "language": "TR",
                    "text": "Öğreticiler bir hoş geldiniz mesajıyla ve kullanıcının öğreticiyi takip ederken ne yapacağına ve hangi derslerin öğrenileceğine ilişkin kısa bir açıklama dahil olmak üzere öğreticinin ne hakkında olduğuna dair net bir açıklama ile başlamalıdır. Her şeyi tek bir adıma sıkıştırmaya gerek yok... iki hatta üç adım yeterlidir.",
                    "updated": 1645300118943
                },
                {
                    "language": "DE",
                    "text": "Tutorials sollten mit einer Willkommensnachricht und einer klaren Erklärung beginnen, worum es in dem tutorial geht, einschließlich einer kurzen Beschreibung dessen, was der Benutzer tun wird, während er dem tutorial folgt, und welche Lektionen er lernen wird. Es ist nicht nötig, alles in einen einzigen Schritt zu packen... zwei oder sogar drei Schritte sind in Ordnung.",
                    "updated": 1681515843333
                }
            ]
        },
        {
            "style": "List",
            "text": "If the tutorial requires prior knowledge beyond the Getting Started Tutorials Native Workspace, devote a step to explaining what prior knowledge is required so that users may complete the relevant tutorials first.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si el tutorial requiere conocimientos previos más allá de los tutoriales en el Espacio de trabajo del complemento Getting Started, dedique un paso a explicar qué conocimientos previos se requieren para que los usuarios puedan completar primero los tutoriales relevantes.",
                    "updated": 1640110390869
                },
                {
                    "language": "RU",
                    "text": "Если учебник требует предварительных знаний, выходящих за рамки рабочего пространства плагина Getting Started Tutorials, посвятите отдельный шаг объяснению того, какие предварительные знания требуются, чтобы пользователи могли сначала пройти соответствующие учебники.",
                    "updated": 1647782272275
                },
                {
                    "language": "TR",
                    "text": "Öğretici, Başlarken Öğreticiler Eklentisi Çalışma Alanının ( Getting Started Tutorials Native Workspace ) ötesinde bir ön bilgi gerektiriyorsa, kullanıcıların önce ilgili öğreticileri tamamlayabilmesi için hangi ön bilgilerin gerekli olduğunu açıklamaya bir adım ayırın.",
                    "updated": 1645300183494
                },
                {
                    "language": "DE",
                    "text": "Wenn für das Tutorial Vorkenntnisse erforderlich sind, die über den Plugin-Arbeitsbereich der Einführungs-Tutorials (Getting Started Tutorials Native Workspace) hinausgehen, sollten Sie in einem eigenen Schritt erklären, welche Vorkenntnisse erforderlich sind, damit die Benutzer zunächst die entsprechenden Tutorials durcharbeiten können.",
                    "updated": 1681515882960
                }
            ],
            "updated": 1642955219046
        },
        {
            "style": "List",
            "text": "You should also take the time to explain what's featured in the Workspace. The idea is that users should get familiar with the workspace as soon as possible, to understand how it may differ from other workspaces they may have encountered earlier. You can mention which mines you will use, clarify if they are added as plugins or not, which trading systems, and so on. You may skip the mandatory hierarchies, like Network or Trading Engine.",
            "updated": 1620198644147,
            "translations": [
                {
                    "language": "ES",
                    "text": "También debe tomarse el tiempo para explicar lo que se presenta en el Workspace. La idea es que los usuarios se familiaricen con el espacio de trabajo lo antes posible para comprender en qué puede diferir de otros espacios de trabajo que hayan encontrado antes. Puede mencionar qué minas utilizará, aclarar si se agregan como complementos o no, qué sistemas de trading, etc. Puede omitir las jerarquías obligatorias, como Red oTrading Engine.",
                    "updated": 1640110371600
                },
                {
                    "language": "RU",
                    "text": "Вы также должны найти время, чтобы объяснить, что именно представлено в рабочем пространстве. Идея заключается в том, что пользователи должны как можно скорее ознакомиться с рабочим пространством, чтобы понять, чем оно может отличаться от других рабочих пространств, с которыми они могли сталкиваться ранее. Вы можете упомянуть, какие именно шахты вы будете использовать, уточнить, добавлены ли они в виде плагинов или нет, какие торговые системы и так далее. Вы можете пропустить обязательные иерархии, такие как Network или Trading Engine.",
                    "updated": 1640275278957
                },
                {
                    "language": "TR",
                    "text": "Ayrıca Çalışma Alanında ( Workspace ) nelerin öne çıktığını açıklamak için zaman ayırmalısınız. Buradaki fikir, kullanıcıların daha önce karşılaşmış olabilecekleri diğer çalışma alanlarından nasıl farklı olabileceğini anlamak için çalışma alanına mümkün olan en kısa sürede aşina olmaları gerektiğidir. Hangi madenleri kullanacağınızı belirtebilir, eklenti olarak eklenip eklenmediğini, hangi ticaret sistemlerini netleştirebilirsiniz. Ağ veya Ticaret Motoru ( Trading Engine ) gibi zorunlu hiyerarşileri atlayabilirsiniz.",
                    "updated": 1645300284575
                },
                {
                    "language": "DE",
                    "text": "Sie sollten sich auch die Zeit nehmen, um zu erklären, was der Arbeitsbereich (Workspace) bietet. Die Idee ist, dass sich die Nutzer so schnell wie möglich mit dem Arbeitsbereich vertraut machen sollten, um zu verstehen, inwiefern er sich von anderen Arbeitsbereichen unterscheidet, die sie vielleicht schon kennengelernt haben. Sie können erwähnen, welche Minen Sie verwenden werden, klären, ob sie als plugins hinzugefügt werden oder nicht, welche Handelssysteme usw. Sie können die obligatorischen Hierarchien, wie Netzwerk oder Handelsmaschine (Trading Engine), auslassen.",
                    "updated": 1681516035701
                }
            ]
        },
        {
            "style": "List",
            "text": "If you installed any markets, created custom charts, a particular setup of tasks in the Network hierarchy, or any specific data structure that is not present in the default market installation, make sure you explain what you did and why. It may be confusing for users to find things and not know how they got there.",
            "updated": 1620198654823,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si instaló mercados, creó gráficos personalizados, una configuración particular de tareas en la jerarquía de la red o cualquier estructura de datos específica que no está presente en la instalación de mercado predeterminada, asegúrese de explicar lo que hizo y por qué. Puede resultar confuso para los usuarios encontrar cosas y no saber cómo llegaron allí.",
                    "updated": 1640110306420
                },
                {
                    "language": "RU",
                    "text": "Если вы установили какие-либо рынки, создали пользовательские графики, определенную настройку задач в иерархии Network или какую-либо специфическую структуру данных, которая отсутствует в стандартной установке рынка, обязательно объясните, что вы сделали и почему. Это может сбить пользователей с толку, если они найдут что-то и не будут знать, как они туда попали.",
                    "updated": 1640275329441
                },
                {
                    "language": "TR",
                    "text": "Herhangi bir pazar kurduysanız, özel grafikler oluşturduysanız, Ağ hiyerarşisinde belirli bir görev kurulumu veya varsayılan pazar kurulumunda bulunmayan herhangi bir belirli veri yapısı varsa, ne yaptığınızı ve nedenini açıkladığınızdan emin olun. Kullanıcıların bir şeyler bulması ve oraya nasıl geldiklerini bilmemeleri kafa karıştırıcı olabilir.",
                    "updated": 1645300316716
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie Märkte installiert, benutzerdefinierte Diagramme erstellt, eine bestimmte Anordnung von Aufgaben in der Netzwerkhierarchie oder eine spezifische Datenstruktur erstellt haben, die in der Standardmarktinstallation nicht vorhanden ist, sollten Sie unbedingt erklären, was Sie getan haben und warum. Es kann für die Benutzer verwirrend sein, Dinge zu finden und nicht zu wissen, wie sie dorthin gekommen sind.",
                    "updated": 1681516049072
                }
            ]
        },
        {
            "style": "Title",
            "text": "The Last Few Steps",
            "translations": [
                {
                    "language": "ES",
                    "text": "The Last Few Steps (Los últimos pasos)",
                    "updated": 1640110568242
                },
                {
                    "language": "RU",
                    "text": "Последние несколько шагов",
                    "updated": 1640275341956
                },
                {
                    "language": "TR",
                    "text": "Son Birkaç Adım",
                    "updated": 1645300344937
                },
                {
                    "language": "DE",
                    "text": "Die letzten Schritte",
                    "updated": 1681516234584
                }
            ]
        },
        {
            "style": "List",
            "text": "If there are more tutorials in the series, make sure you leave users right by the next one, inviting them to keep going.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si hay más tutoriales en la serie, asegúrese de dejar a los usuarios justo al lado del siguiente, invitándolos a continuar.",
                    "updated": 1640110288956
                },
                {
                    "language": "RU",
                    "text": "Если в курсе есть еще несколько уроков, убедитесь, что вы оставляете пользователей прямо перед следующим уроком, приглашая их продолжить.",
                    "updated": 1640275438430
                },
                {
                    "language": "TR",
                    "text": "Seride daha fazla eğitim varsa, kullanıcıları bir sonraki derste bıraktığınızdan ve onları devam etmeye davet ettiğinizden emin olun.",
                    "updated": 1645300355290
                },
                {
                    "language": "DE",
                    "text": "Wenn es weitere tutorials in der Serie gibt, stellen Sie sicher, dass Sie die Nutzer direkt beim nächsten tutorial stehen lassen und sie einladen, weiterzumachen.",
                    "updated": 1681516328911
                }
            ]
        },
        {
            "style": "List",
            "text": "If the remaining tutorials in the series are not ready yet, then use the last few steps to describe what else will be covered in the series and ask users to stay tuned.",
            "updated": 1620198840899,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si los tutoriales restantes de la serie aún no están listos, utilice los últimos pasos para describir qué más se cubrirá en la serie y pida a los usuarios que estén atentos.",
                    "updated": 1640110270237
                },
                {
                    "language": "RU",
                    "text": "Если остальные уроки серии еще не готовы, используйте последние несколько шагов, чтобы описать, что еще будет рассмотрено в этих уроках, и попросите пользователей оставаться с нами.",
                    "updated": 1640275561407
                },
                {
                    "language": "TR",
                    "text": "Dizideki diğer öğreticiler henüz hazır değilse, dizide başka nelerin ele alınacağını açıklamak için son birkaç adımı kullanın ve kullanıcılardan bizi izlemeye devam etmelerini isteyin.",
                    "updated": 1645300367045
                },
                {
                    "language": "DE",
                    "text": "Wenn die verbleibenden Tutorials der Reihe noch nicht fertig sind, beschreiben Sie in den letzten Schritten, was in der Reihe noch behandelt wird, und bitten Sie die Benutzer, dranzubleiben.",
                    "updated": 1681516266477
                }
            ]
        },
        {
            "style": "Title",
            "text": "Wrapping Up",
            "translations": [
                {
                    "language": "ES",
                    "text": "Wrapping Up  (Terminando)",
                    "updated": 1640110248244
                },
                {
                    "language": "RU",
                    "text": "Подведение итогов",
                    "updated": 1640275578036
                },
                {
                    "language": "TR",
                    "text": "Toparlama",
                    "updated": 1645300444828
                },
                {
                    "language": "DE",
                    "text": "Einpacken",
                    "updated": 1681516350146
                }
            ]
        },
        {
            "style": "Text",
            "text": "When your tutorial is ready and has been reviewed by project maintainers, there a few things you need to take care of so that the workspace and tutorials are easily findable.",
            "updated": 1621875234349,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando su tutorial esté listo y haya sido revisado por los encargados del mantenimiento del proyecto, hay algunas cosas de las que debe ocuparse para poder encontrar fácilmente el espacio de trabajo y los tutoriales.",
                    "updated": 1640110222035
                },
                {
                    "language": "RU",
                    "text": "Когда ваш учебник готов и прошел проверку сопровождающими проекта, вам нужно позаботиться о нескольких вещах, чтобы рабочее пространство и учебники можно было легко найти.",
                    "updated": 1640275603184
                },
                {
                    "language": "TR",
                    "text": "Eğitiminiz hazır olduğunda ve proje sahipleri tarafından gözden geçirildiğinde, çalışma alanı ve öğreticilerin kolayca bulunabilmesi için dikkat etmeniz gereken birkaç şey vardır.",
                    "updated": 1645300454750
                },
                {
                    "language": "DE",
                    "text": "Wenn Ihr Lernprogramm fertig ist und von den Projektbetreuern geprüft wurde, müssen Sie einige Dinge beachten, damit der Arbeitsbereich und die Lernprogramme leicht zu finden sind.",
                    "updated": 1681516374676
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Create a Page for the Workspace",
            "translations": [
                {
                    "language": "ES",
                    "text": "Create a Page for the Workspace  (Crear una página para el espacio de trabajo)",
                    "updated": 1640110203651
                },
                {
                    "language": "RU",
                    "text": "Создайте страницу для рабочего пространства",
                    "updated": 1640275656941
                },
                {
                    "language": "TR",
                    "text": "Çalışma Alanı için Sayfa Oluşturun",
                    "updated": 1645300472563
                },
                {
                    "language": "DE",
                    "text": "Eine Seite für den Arbeitsbereich erstellen",
                    "updated": 1681516391062
                }
            ]
        },
        {
            "style": "Text",
            "text": "Every workspace must be documented, so make sure you create a page for the workspace in the `Community Workspaces` Topic.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada espacio de trabajo debe estar documentado, así que asegúrese de crear una página para el espacio de trabajo en el tema \"Espacios de trabajo comunitarios\".",
                    "updated": 1640110185150
                },
                {
                    "language": "RU",
                    "text": "Каждое рабочее пространство должно быть документировано, поэтому обязательно создайте для него страницу в теме 'Community Workspaces'.",
                    "updated": 1640275701507
                },
                {
                    "language": "TR",
                    "text": "Her çalışma alanı belgelenmelidir, bu nedenle 'Topluluk Çalışma Alanları' Konusunda çalışma alanı için bir sayfa oluşturduğunuzdan emin olun.",
                    "updated": 1645300487606
                },
                {
                    "language": "DE",
                    "text": "Jeder Arbeitsbereich muss dokumentiert werden, also stellen Sie sicher, dass Sie eine Seite für den Arbeitsbereich im Thema `Community Workspaces` erstellen.",
                    "updated": 1681516471573
                }
            ]
        },
        {
            "style": "Important",
            "text": "Please use a clear and descriptive name and follow the naming convention ending the name with `Native Workspace`. Feel free to consult what a good name may be with other contributors in the Docs Group.",
            "updated": 1621874212145,
            "translations": [
                {
                    "language": "ES",
                    "text": "Utilice un nombre claro y descriptivo y siga la convención de nomenclatura que termina el nombre con \"Espacio de trabajo del complemento\". No dude en consultar cuál puede ser un buen nombre con otros colaboradores del Grupo de Documentos.",
                    "updated": 1640110160309
                },
                {
                    "language": "RU",
                    "text": "Пожалуйста, используйте ясное и описательное название и следуйте соглашению о присвоении имен, заканчивая название словами 'Native Workspace'. Не стесняйтесь советоваться о том, каким может быть хорошее название, с другими участниками в группе Docs Group.",
                    "updated": 1640275791724
                },
                {
                    "language": "TR",
                    "text": "Önemli: Lütfen açık ve açıklayıcı bir ad kullanın ve adı \"Eklenti Çalışma Alanı\" ile biten adlandırma kuralına uyun. Dokümanlar Grubundaki ( Docs Group ) diğer katkıda bulunanlarla iyi bir ismin ne olabileceğini danışmaktan çekinmeyin.",
                    "updated": 1645300565401
                },
                {
                    "language": "DE",
                    "text": "Bitte verwenden Sie einen eindeutigen und beschreibenden Namen und halten Sie sich an die Namenskonvention, die den Namen mit \"Native Workspace\" beendet. Es steht Ihnen frei, sich mit anderen Mitwirkenden in der Docs-Gruppe (Docs Group) darüber zu beraten, was ein guter Name sein könnte.",
                    "updated": 1681516527689
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "List of Native Workspaces and Tutorials",
            "updated": 1621875320874,
            "translations": [
                {
                    "language": "RU",
                    "text": "Список рабочих пространств плагинов и учебников",
                    "updated": 1640275910654
                },
                {
                    "language": "TR",
                    "text": "Eklenti Çalışma Alanları ve Öğreticilerin Listesi",
                    "updated": 1645300619872
                },
                {
                    "language": "DE",
                    "text": "Liste der Native Workspaces und Tutorials",
                    "updated": 1681517459798
                }
            ]
        },
        {
            "style": "Text",
            "text": "Add the workspace and the tutorial to this list: List of Native Workspaces and Tutorials, so that they show up in the First Steps Tutorials book.",
            "updated": 1621875373640,
            "translations": [
                {
                    "language": "ES",
                    "text": "Agregue el espacio de trabajo y el tutorial a esta lista: List of Native Workspaces and Tutorials, para que aparezcan en el libro Tutoriales de primeros pasos.",
                    "updated": 1640110079022
                },
                {
                    "language": "RU",
                    "text": "Добавьте рабочее пространство и учебник в этот список: List of Native Workspaces and Tutorials, чтобы они отображались в книге First Steps Tutorials.",
                    "updated": 1640275953541
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanını ve öğreticiyi bu listeye ekleyin: Eklenti Çalışma Alanları ve Öğreticiler Listesi ( List of Native Workspaces and Tutorials ), böylece İlk Adımlar Öğreticiler kitabında ( First Steps Tutorials ) görünecekler.",
                    "updated": 1645300721010
                },
                {
                    "language": "DE",
                    "text": "Fügen Sie den Arbeitsbereich und das Lernprogramm zu dieser Liste hinzu: Liste der Plugin-Arbeitsbereiche und Tutorials (List of Native Workspaces and Tutorials), damit sie im Buch Erste Schritte Tutorials (First Steps Tutorials) angezeigt werden.",
                    "updated": 1681517574975
                }
            ]
        },
        {
            "style": "Success",
            "text": "Consult with project mantainers the spot the tutorial should take in the list.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Consulte con los encargados del mantenimiento del proyecto el lugar que debe ocupar el tutorial en la lista.",
                    "updated": 1640110104301
                },
                {
                    "language": "RU",
                    "text": "Посоветуйтесь с кураторами проекта, какое место в списке должно занять учебное пособие.",
                    "updated": 1640275976933
                },
                {
                    "language": "TR",
                    "text": "İpucu: Eğitimin listede alması gereken yeri proje yöneticilerine danışın.",
                    "updated": 1645300764431
                },
                {
                    "language": "DE",
                    "text": "Sprechen Sie mit den Projektverantwortlichen darüber, welchen Platz das Lernprogramm in der Liste einnehmen soll.",
                    "updated": 1681517602902
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "First Step Tutorials Book",
            "updated": 1621875396584,
            "translations": [
                {
                    "language": "RU",
                    "text": "Книга First Step Tutorials (\"Первые шаги в обучении\")",
                    "updated": 1640276136767
                },
                {
                    "language": "TR",
                    "text": "İlk Adım Öğreticiler Kitabı",
                    "updated": 1645300779127
                },
                {
                    "language": "DE",
                    "text": "First Step Tutorials Buch",
                    "updated": 1681517623018
                }
            ]
        },
        {
            "style": "Text",
            "text": "Add the tutorial as a chapter in the First Steps Tutorials book.",
            "updated": 1621875405546,
            "translations": [
                {
                    "language": "ES",
                    "text": "Agregue el tutorial como un capítulo en el First Steps Tutorials book.",
                    "updated": 1640110131511
                },
                {
                    "language": "RU",
                    "text": "Добавьте учебник в качестве главы в книгу First Steps Tutorials.",
                    "updated": 1640276028702
                },
                {
                    "language": "TR",
                    "text": "Öğreticiyi İlk Adımlar Öğreticiler kitabına ( First Steps Tutorials ) bir bölüm olarak ekleyin.",
                    "updated": 1645300812079
                },
                {
                    "language": "DE",
                    "text": "Fügen Sie das tutorial als Kapitel in das Buch First Steps Tutorials ein.",
                    "updated": 1681517667685
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}