{
    "topic": "Contributing to Superalgos",
    "pageNumber": 1,
    "type": "How to Contribute to Superalgos",
    "definition": {
        "text": "This topic covers the logistics and details of how to contribute different kinds of assets to the project, including a Trading System, a Data Mine, icons, documentation, translations, tutorials, and so on.",
        "updated": 1618323854276,
        "translations": [
            {
                "language": "ES",
                "text": "Este tema cubre la logística y los detalles de cómo contribuir con diferentes tipos de activos al proyecto, incluido un Trading System, un Data Mine, íconos, documentación, tranducciones, tutoriales, etcetera.",
                "updated": 1636726366195
            },
            {
                "language": "RU",
                "text": "Эта тема охватывает логистику и детали того, как вносить различные виды ресурсов в проект, включая Trading System, Data Mine, иконки, документацию, переводы, учебники и так далее.",
                "updated": 1640258487287
            },
            {
                "language": "TR",
                "text": "Özet: Bu konu, Ticaret Sistemi ( Trading System ), Veri Madeni ( Data Mine ), simgeler, belgeler, çeviriler, öğreticiler vb. dahil olmak üzere farklı türdeki varlıkların projeye nasıl katkıda bulunacağının lojistiğini ve ayrıntılarını kapsar.",
                "updated": 1645289547783
            },
            {
                "language": "DE",
                "text": "Dieses Thema befasst sich mit der Logistik und den Details, wie man verschiedene Arten von assets zum Projekt beisteuern kann, einschließlich eines Handelssystems (Trading System), einer Data Mine, Icons, Dokumentation, Übersetzungen, Tutorials und so weiter.",
                "updated": 1681493795397
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Scan the table of contents below to find the documentation about how to contribute the kind of asset you may have in mind.",
            "updated": 1617032405931,
            "translations": [
                {
                    "language": "ES",
                    "text": "Escanee la tabla de contenido a continuación para encontrar la documentación sobre cómo contribuir con el tipo de activo que pueda tener en mente.",
                    "updated": 1636726389032
                },
                {
                    "language": "RU",
                    "text": "Просмотрите приведенное ниже оглавление, чтобы найти документацию о том, как внести тот вид ценностей, который у вас на примете.",
                    "updated": 1640258583992
                },
                {
                    "language": "TR",
                    "text": "Aklınızdaki varlık türüne nasıl katkıda bulunacağınıza ilişkin belgeleri bulmak için aşağıdaki içindekiler tablosunu tarayın.",
                    "updated": 1645289599650
                },
                {
                    "language": "DE",
                    "text": "Durchsuchen Sie das nachstehende Inhaltsverzeichnis, um die Dokumentation zu finden, wie Sie die Art von Vermögenswerten, die Sie im Sinn haben, beitragen können.",
                    "updated": 1681493846266
                }
            ]
        },
        {
            "style": "Success",
            "text": "If there is no explanation about the type of asset you wish to contribute, please reach out to the team in the Superalgos Community Group!",
            "updated": 1617032427271,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si no hay una explicación sobre el tipo de activo que desea contribuir, comuníquese con el equipo en el Superalgos Community Group!",
                    "updated": 1636726430146
                },
                {
                    "language": "TR",
                    "text": "İpucu: Katkıda bulunmak istediğiniz varlığın türü hakkında herhangi bir açıklama yoksa, lütfen Superalgos Topluluk Grubundaki ( Community Group ) ekibe ulaşın!",
                    "updated": 1645289649757
                },
                {
                    "language": "DE",
                    "text": "Wenn es keine Erklärung für die Art des assets gibt, das Sie beitragen möchten, wenden Sie sich bitte an das Team in der Superalgos Community Group!",
                    "updated": 1681493878158
                }
            ]
        },
        {
            "style": "Text",
            "text": "For a general overview of what contributing to the Superalgos Project works, please check the following page on the website:",
            "updated": 1660465537443,
            "translations": [
                {
                    "language": "DE",
                    "text": "Einen allgemeinen Überblick darüber, wie ein Beitrag zum Superalgos-Projekt (Superalgos Project) funktioniert, finden Sie auf der folgenden Seite der Website:",
                    "updated": 1681493899809
                }
            ]
        },
        {
            "style": "Link",
            "text": "Contribute to Superalgos->superalgos.org/community-contribute.shtml",
            "updated": 1660465584835
        }
    ]
}