{
    "topic": "Contributing to Superalgos",
    "pageNumber": 4,
    "type": "How to Contribute to the Docs",
    "definition": {
        "text": "Helping with keeping the Docs up to date, improving the delivery of the information, expanding on explanations, or simply fixing typos and grammar mistakes makes for a better user experience and lowers entry barriers for new users.",
        "updated": 1613810324131,
        "translations": [
            {
                "language": "RU",
                "text": "Помогая поддерживать документацию в актуальном состоянии, улучшая доступность информации, добавляя пояснения или просто исправляя опечатки и грамматические ошибки, улучшается взаимодействие с пользователем и снижается входной барьер для новых пользователей.",
                "updated": 1637942357657
            },
            {
                "language": "DE",
                "text": "Die Hilfe bei der Aktualisierung der Dokumente, bei der Verbesserung der Informationsvermittlung, bei der Erweiterung von Erklärungen oder einfach bei der Korrektur von Tipp- und Grammatikfehlern trägt zu einer besseren Benutzererfahrung bei und senkt die Einstiegshürden für neue Benutzer.",
                "updated": 1702163471448
            },
            {
                "language": "TR",
                "text": "Özet: Dokümanları güncel tutmaya yardımcı olmak, bilgilerin dağıtımını iyileştirmek, açıklamaları genişletmek veya basitçe yazım hatalarını ve dil bilgisi hatalarını düzeltmek, daha iyi bir kullanıcı deneyimi sağlar ve yeni kullanıcılar için giriş engellerini azaltır.",
                "updated": 1645294391998
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Coordination",
            "updated": 1613819062207,
            "translations": [
                {
                    "language": "RU",
                    "text": "Согласование",
                    "updated": 1637942404826
                },
                {
                    "language": "DE",
                    "text": "Koordinierung",
                    "updated": 1702163486736
                },
                {
                    "language": "TR",
                    "text": "Koordinasyon",
                    "updated": 1645294407756
                }
            ]
        },
        {
            "style": "Text",
            "text": "Join the Docs Group to coordinate efforts with other contributors:",
            "updated": 1613819084738,
            "translations": [
                {
                    "language": "RU",
                    "text": "Присоединяйтесь к группе Docs Group, чтобы координировать усилия с другими участниками:",
                    "updated": 1637942446024
                },
                {
                    "language": "DE",
                    "text": "Treten Sie der Docs-Gruppe (Docs Group) bei, um Ihre Arbeit mit anderen Mitwirkenden zu koordinieren:",
                    "updated": 1702163533944
                },
                {
                    "language": "TR",
                    "text": "Çalışmaları diğer katkıda bulunanlarla koordine etmek için Dokümanlar Grubuna ( Docs Group ) katılın:",
                    "updated": 1645294435488
                }
            ]
        },
        {
            "style": "Link",
            "text": "Docs Group->t.me/superalgosdocs",
            "updated": 1615385427537
        },
        {
            "style": "Text",
            "text": "Please, introduce yourself and get up to speed with the group currently doing the work. The main coordination efforts involve planning the documentation of new functionality or discussing which sections of the Docs need a revision.",
            "updated": 1613819203043,
            "translations": [
                {
                    "language": "RU",
                    "text": "Пожалуйста, представьтесь и познакомьтесь с группой, которая в настоящее время выполняет работу. Основные усилия по координации включают планирование документации по новой функциональности или обсуждение того, какие разделы нуждаются в доработке.",
                    "updated": 1637942497193
                },
                {
                    "language": "DE",
                    "text": "Bitte stellen Sie sich vor und machen Sie sich mit der Gruppe vertraut, die derzeit die Arbeit erledigt. Die Hauptkoordinationsarbeit besteht in der Planung der Dokumentation neuer Funktionen oder in der Diskussion darüber, welche Abschnitte der Dokumentation überarbeitet werden müssen.",
                    "updated": 1642541356043
                },
                {
                    "language": "TR",
                    "text": "Lütfen kendinizi tanıtın ve şu anda işi yapan gruba ayak uydurun. Ana koordinasyon çabaları, yeni işlevlerin dokümantasyonunu planlamayı veya Dokümanların hangi bölümlerinin revizyona ihtiyacı olduğunu tartışmayı içerir.",
                    "updated": 1645294481132
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Contributions Reminder"
        },
        {
            "style": "Title",
            "text": "Logistics and Best Practice",
            "updated": 1613817330818,
            "translations": [
                {
                    "language": "RU",
                    "text": "Логистика и лучшие практики",
                    "updated": 1637942944760
                },
                {
                    "language": "DE",
                    "text": "Logistik und bewährte Verfahren",
                    "updated": 1702163709704
                },
                {
                    "language": "TR",
                    "text": "Lojistik ve En İyi Uygulama",
                    "updated": 1645294547860
                }
            ]
        },
        {
            "style": "Text",
            "text": "There may be several people contributing to the Docs at any point in time. To minimize the occurrence of conflicts at the time of merging your contributions into the Superalgos repository, the following practices are highly recommended.",
            "updated": 1613819314231,
            "translations": [
                {
                    "language": "RU",
                    "text": "В любой момент времени над документами могут работать несколько человек. Чтобы свести к минимуму возникновение конфликтов во время слияния ваших вкладов в репозиторий Superalgos, настоятельно рекомендуются следующие методы.",
                    "updated": 1637942969293
                },
                {
                    "language": "DE",
                    "text": "Es kann sein, dass mehrere Personen zu einem beliebigen Zeitpunkt an den Docs mitarbeiten. Um das Auftreten von Konflikten zum Zeitpunkt des Zusammenführens Ihrer Beiträge in das Superalgos-Repository zu minimieren, werden die folgenden Praktiken dringend empfohlen.",
                    "updated": 1702163780697
                },
                {
                    "language": "TR",
                    "text": "Dokümanlar'a herhangi bir zamanda katkıda bulunan birkaç kişi olabilir. Katkılarınızı Superalgos deposuna birleştirirken çakışmaların oluşmasını en aza indirmek için aşağıdaki uygulamalar şiddetle tavsiye edilir.",
                    "updated": 1645294558503
                }
            ]
        },
        {
            "style": "List",
            "text": "Update your app frequently so that you incorporate recent changes other users may have submitted. Use the app.update command for that as explained above.",
            "updated": 1642541786272,
            "translations": [
                {
                    "language": "RU",
                    "text": "Регулярно обновляйте свое приложение, чтобы включить в него последние изменения, представленные другими пользователями. Для этого используйте команду app.update, как описано выше.",
                    "updated": 1647781999600
                },
                {
                    "language": "DE",
                    "text": "Aktualisieren Sie Ihre Anwendung häufig, damit Sie die neuesten Änderungen, die andere Benutzer eingereicht haben, einbeziehen können. Verwenden Sie dazu den Befehl app.update, wie oben beschrieben.",
                    "updated": 1642541904627
                },
                {
                    "language": "TR",
                    "text": "Diğer kullanıcıların göndermiş olabileceği son değişiklikleri dahil etmek için uygulamanızı sık sık güncelleyin. Bunun için yukarıda açıklandığı gibi app.update komutunu kullanın.",
                    "updated": 1645294605320
                }
            ]
        },
        {
            "style": "List",
            "text": "Do not keep changes locally for too long. Split your work and submit your contributions every day.",
            "updated": 1613817561886,
            "translations": [
                {
                    "language": "RU",
                    "text": "Не храните изменения локально слишком долго. Разделите свою работу и отправляйте свои вклады каждый день.",
                    "updated": 1637943048901
                },
                {
                    "language": "DE",
                    "text": "Behalten Sie Änderungen nicht zu lange lokal. Teilen Sie Ihre Arbeit auf und reichen Sie Ihre Beiträge jeden Tag ein.",
                    "updated": 1702163825745
                },
                {
                    "language": "TR",
                    "text": "Değişiklikleri yerel olarak çok uzun süre saklamayın. Çalışmanızı bölün ve katkılarınızı her gün gönderin.",
                    "updated": 1645294617127
                }
            ]
        },
        {
            "style": "Text",
            "text": "When you run the App Contribute Command, a Pull Request is created at your fork. The Superalgos repo maintainers will look into your submission and determine if it may be merged as is, or if the work requires any adjustments.",
            "updated": 1613818674004,
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда вы запускаете команду App Contribute Command, на вашей вилке создается запрос на извлечение. Сопровождающие репозитория Superalgos изучат вашу заявку и определят, можно ли ее объединить как есть, или требует ли работа каких-либо корректировок.",
                    "updated": 1637943204172
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie den App Contribute-Befehl (Contribute Command) ausführen, wird ein Pull Request bei Ihrer Abspaltung erstellt. Die Betreuer des Superalgos-Projektarchivs werden Ihren Beitrag prüfen und entscheiden, ob er so wie er ist zusammengeführt werden kann, oder ob die Arbeit Anpassungen erfordert.",
                    "updated": 1702163847657
                },
                {
                    "language": "TR",
                    "text": "App Contribute Command Komutunu çalıştırdığınızda, çatalınızda bir Çekme İsteği oluşturulur. Superalgos depo sahipleri, gönderiminizi inceleyecek ve olduğu gibi birleştirilip birleştirilemeyeceğine veya işin herhangi bir ayarlama gerektirip gerektirmediğine karar verecektir.",
                    "updated": 1645294645976
                }
            ]
        },
        {
            "style": "List",
            "text": "Keep track of your contributions until they are merged.",
            "updated": 1613818739120,
            "translations": [
                {
                    "language": "RU",
                    "text": "Следите за своими вкладами, пока они не будут объединены.",
                    "updated": 1637943225091
                },
                {
                    "language": "DE",
                    "text": "Behalten Sie den Überblick über Ihre Beiträge, bis sie zusammengeführt werden.",
                    "updated": 1702163858601
                },
                {
                    "language": "TR",
                    "text": "Birleştirilene kadar katkılarınızı takip edin.",
                    "updated": 1645294663424
                }
            ]
        },
        {
            "style": "List",
            "text": "Stay responsive if there is any feedback or requests from maintainers.",
            "updated": 1613818758881,
            "translations": [
                {
                    "language": "RU",
                    "text": "Оставайтесь отзывчивыми, если есть какие-либо отзывы или запросы от сопровождающих.",
                    "updated": 1637943250510
                },
                {
                    "language": "DE",
                    "text": "Bleiben Sie erreichbar, wenn es Rückmeldungen oder Anfragen von den Betreuern gibt.",
                    "updated": 1702163889370
                },
                {
                    "language": "TR",
                    "text": "Bakımcılardan herhangi bir geri bildirim veya istek varsa yanıt vermeye devam edin.",
                    "updated": 1645294677070
                }
            ]
        },
        {
            "style": "List",
            "text": "Be attentive to emails you may get from GitHub.com",
            "updated": 1613819348463,
            "translations": [
                {
                    "language": "RU",
                    "text": "Будьте внимательны к электронным письмам, которые вы можете получать от GitHub.com",
                    "updated": 1637943273499
                },
                {
                    "language": "DE",
                    "text": "Achten Sie auf E-Mails, die Sie möglicherweise von GitHub.com erhalten",
                    "updated": 1642542132582
                },
                {
                    "language": "TR",
                    "text": "GitHub.com'dan alabileceğiniz e-postalara dikkat edin",
                    "updated": 1645294685462
                }
            ]
        },
        {
            "style": "Title",
            "text": "Learn All About the Docs and the Art of Documenting",
            "updated": 1642956868092,
            "translations": [
                {
                    "language": "TR",
                    "text": "Dokümanlar ve Dokümantasyon Sanatı Hakkında Her Şeyi Öğrenin",
                    "updated": 1645294719507
                },
                {
                    "language": "RU",
                    "text": "Узнайте все о документах и искусстве документирования",
                    "updated": 1647782019395
                },
                {
                    "language": "DE",
                    "text": "Erfahren Sie alles über die Docs und die Kunst des Dokumentierens",
                    "updated": 1702163906761
                }
            ]
        },
        {
            "style": "Text",
            "text": "You probably have an idea of how the Docs work from using the app and doing the first few tutorials. If you intend to contribute the occasional small fixes on existing pages, you probably know enough to start contributing!",
            "translations": [
                {
                    "language": "TR",
                    "text": "Muhtemelen uygulamayı kullanarak ve ilk birkaç öğreticiyi yaparak Dokümanların nasıl çalıştığına dair bir fikriniz vardır. Mevcut sayfalarda zaman zaman küçük düzeltmelere katkıda bulunmayı düşünüyorsanız, muhtemelen katkıda bulunmaya başlamak için yeterince şey biliyorsunuzdur!",
                    "updated": 1645294827113
                },
                {
                    "language": "RU",
                    "text": "Вы, вероятно, имеете представление о том, как функционирует Docs, благодаря использованию приложения и прохождению первых нескольких уроков. Если вы собираетесь вносить небольшие исправления в существующие страницы, вы, вероятно, знаете достаточно, чтобы начать вносить свой вклад!",
                    "updated": 1647782101485
                },
                {
                    "language": "DE",
                    "text": "Sie haben wahrscheinlich eine Vorstellung davon, wie die Docs funktionieren, weil Sie die App benutzen und die ersten paar Tutorials machen. Wenn Sie vorhaben, gelegentlich kleine Korrekturen an bestehenden Seiten vorzunehmen, wissen Sie wahrscheinlich genug, um einen Beitrag zu leisten!",
                    "updated": 1702163954447
                }
            ]
        },
        {
            "style": "Callout",
            "text": "However, if you wish to get involved in documenting new functionality, reorganizing topics, arranging books, and so on, you should definitely read The Docs Explained book. Pay special attention to the last chapter: The Art of Documenting.",
            "updated": 1642956969472,
            "translations": [
                {
                    "language": "TR",
                    "text": "Ancak yeni işlevlerin belgelenmesi, konuların yeniden düzenlenmesi, kitapların düzenlenmesi vb. işlere dahil olmak istiyorsanız Dokümantasyon Açıklamalı kitabını ( The Docs Explained ) mutlaka okumalısınız. Son bölüme özellikle dikkat edin: Dokümantasyon Sanatı.",
                    "updated": 1645295654831
                },
                {
                    "language": "RU",
                    "text": "Однако если вы хотите принять участие в документировании новой функциональности, реорганизации тем, упорядочивании книг и так далее, вам обязательно нужно прочитать книгу The Docs Explained. Обратите особое внимание на последнюю главу: The Art of Documenting.",
                    "updated": 1647782116998
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie sich jedoch mit der Dokumentation neuer Funktionen, der Neuorganisation von Themen, der Anordnung von Büchern usw. befassen möchten, sollten Sie unbedingt das Buch The Docs Explained lesen. Achten Sie besonders auf das letzte Kapitel: Die Kunst des Dokumentierens.",
                    "updated": 1702163968953
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}