{
    "topic": "Contributing to Superalgos",
    "pageNumber": "6",
    "type": "How to Contribute Tutorials",
    "definition": {
        "text": "Tutorials are the ultimate educational resource available in Superalgos, and they play a crucial role during the onboarding of new users. Contributing tutorials is a great way to help the project grow the user base and is highly appreciated!",
        "updated": 1617710488028,
        "translations": [
            {
                "language": "ES",
                "text": "Los tutoriales son la última fuente educativa disponible en Superalgos, y juegan un papel crucial durante la introducción de los usuarios nuevos. Contribuir con los tutoriales es un excelente modo de ayudar al proyecto para que su base de usuarios crezca y lo apreciamos muchísimo!",
                "updated": 1633370243631
            },
            {
                "language": "RU",
                "text": "Учебники являются основным образовательным ресурсом, доступным в Superalgos, и играют важную роль в процессе обучения новых пользователей. Вклад в создание учебников - это отличный способ помочь проекту расширить пользовательскую базу, и он высоко ценится!",
                "updated": 1640268509443
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This page discusses best practices to build and contribute Superalgos tutorials. It doesn't cover the actual mechanics of building tutorials. Instead, it focuses on what is desirable.",
            "updated": 1617732597782,
            "translations": [
                {
                    "language": "ES",
                    "text": "Esta página habla acerca de las mejores prácticas para construir y contribuir tutoriales de Superalgos. No cubre la mecánica actual de construir tutoriales. en lugar de eso está enfocado en lo que sería deseable.",
                    "updated": 1640113151245
                },
                {
                    "language": "RU",
                    "text": "На этой странице обсуждаются лучшие методы создания и предоставления учебников Superalgos. Здесь не рассматривается фактическая механика создания учебников. Вместо этого она сосредоточена на том, что желательно.",
                    "updated": 1640268528110
                }
            ]
        },
        {
            "style": "Title",
            "text": "The Quest for Quality",
            "updated": 1617710819169,
            "translations": [
                {
                    "language": "RU",
                    "text": "Стремление к качеству",
                    "updated": 1640268543507
                }
            ]
        },
        {
            "style": "Text",
            "text": "At Superalgos, we take pride in the quality of the product we are building. Documentation and tutorials are crucial parts of Superalgos.",
            "updated": 1617732636344,
            "translations": [
                {
                    "language": "ES",
                    "text": "En Superalgos, nosotros nos sentimos orgullosos de la calidad del producto que estamos construyendo. La documentación y los tutoriales son una parte crucial de Superalgos.",
                    "updated": 1640113065328
                },
                {
                    "language": "RU",
                    "text": "В Superalgos мы гордимся качеством создаваемого нами продукта. Документация и учебники - важнейшие составляющие Superalgos.",
                    "updated": 1640268561692
                }
            ]
        },
        {
            "style": "Text",
            "text": "That said, we understand that it takes time and effort to get to a quality product, thus iterating on early prototypes and implementing early-stage feedback is a good way to achieve the desired quality standards.",
            "updated": 1617732666027,
            "translations": [
                {
                    "language": "ES",
                    "text": "Dicho esto, nosotros entendemos que se requiere de tiempo y esfuerzo para obtener un producto de calidad por lo tanto, interactuar sobre los primeros prototipos e implementar la retroalimentación en las primeras etapas es una buena manera de lograr el objetivo deseado de los estándares de cualidad.",
                    "updated": 1640113076479
                },
                {
                    "language": "RU",
                    "text": "Тем не менее, мы понимаем, что для создания качественного продукта требуется время и усилия, поэтому повторение ранних прототипов и внедрение обратной связи на ранней стадии - хороший способ достичь желаемых стандартов качества.",
                    "updated": 1640268636448
                }
            ]
        },
        {
            "style": "Success",
            "text": "When you build a tutorial for Superalgos, you become the maintainer of the tutorial. It is your responsibility to keep the tutorial up to date with the system, and to implement the feedback users may share! Your tutorial must become the ultimate resource to learn the topics it covers. ",
            "updated": 1620645983606,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando construye un tutorial para Superalgos, se convierte en quien mantiene el tutorial. Es su responsabilidad, mantener el tutorial actualizado con el sistema, e implementar los comentarios que los usuarios pueden compartir! Su tutorial debe convertirse en la fuente fundamental para aprender el tópico con el cual está relacionado.",
                    "updated": 1640113096575
                },
                {
                    "language": "RU",
                    "text": "Когда вы создаете учебник для Superalgos, вы становитесь его сопровождающим. Это ваша ответственность - поддерживать учебник в актуальном состоянии и внедрять отзывы, которыми могут поделиться пользователи! Ваш учебник должен стать основным ресурсом для изучения тем, которые он охватывает.",
                    "updated": 1640268670183
                }
            ]
        },
        {
            "style": "Title",
            "text": "The Associated Workspace",
            "updated": 1617712309440,
            "translations": [
                {
                    "language": "RU",
                    "text": "Ассоциированное рабочее пространство",
                    "updated": 1640268703993
                }
            ]
        },
        {
            "style": "Text",
            "text": "To deliver the best possible experience, a tutorial must be featured in a specific Workspace, and the workspace must be custom-tailored to serve the tutorial. The workspace must be clean and feature the assets required for the learning experience to be optimal. It is best to keep the workspace clean, light, and stripped of unnecessary resources.",
            "updated": 1617732813825,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para ofrecer a mejor experiencia posible, un tutorial debe aparecer en un Workspace, específico y el workspace debe ser personalizado para servir al tutorial. El workspace debe ser limpio y segurar los elementos necesarios para que la experiencia de aprendizaje sea óptima- Es lo mejor mantener el workspace limpio, ligero, y despojado de recursos innecesarios.",
                    "updated": 1633365163709
                },
                {
                    "language": "RU",
                    "text": "Чтобы обеспечить наилучший опыт, учебное пособие должно быть размещено в определенном рабочем пространстве, а рабочее пространство должно быть настроено специально для этого учебного пособия. Рабочее пространство должно быть чистым и содержать активы, необходимые для оптимального обучения. Лучше всего, чтобы рабочее пространство было чистым, простым и лишенным ненужных ресурсов.",
                    "updated": 1640268750436
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Use the USDT/BTC Market in Binance.com",
            "updated": 1621871090187,
            "translations": [
                {
                    "language": "RU",
                    "text": "Используйте рынок USDT/BTC в Binance.com",
                    "updated": 1640268767774
                }
            ]
        },
        {
            "style": "Text",
            "text": "If your tutorial deals with data, it is best to use the same exchange, market, and date ranges already in use in the Getting Started Plugin Workspace tutorials. This way, users will already have the data and can go through the tutorial easier.",
            "updated": 1621871223112,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si el tutorial trata con datos, es lo mejor utilizar el mismo exchange, market, y rango de datoss, ya en uso en los tutoriales de Getting Started Plugin Workspace. De este modo, los usuarios ya tendrán los datos y pueden ir a través del tutorial con mayor facilidad.",
                    "updated": 1640113215381
                },
                {
                    "language": "RU",
                    "text": "Если ваш учебник посвящен данным, лучше всего использовать те же биржи, рынки и диапазоны дат, которые уже используются в учебниках Getting Started Plugin Workspace. Таким образом, пользователи уже будут иметь необходимые данные и смогут легче пройти обучение.",
                    "updated": 1640268844627
                }
            ]
        },
        {
            "style": "Note",
            "text": "If for whatever reason the tutorial must deal with other markets and/or exchanges to deliver the content, then go ahead and ignore the above.",
            "updated": 1621871324929,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si por cualquier razón el tutorial debiera tratar con otros mercados y/o exchanges para enviar el contenido, entonces siga adelante e ignore lo de aquí arriba.",
                    "updated": 1633365546892
                },
                {
                    "language": "RU",
                    "text": "Если по каким-либо причинам учебник должен иметь дело с другими рынками и/или биржами для доставки контента, тогда продолжайте и игнорируйте вышесказанное.",
                    "updated": 1640268870336
                }
            ]
        },
        {
            "style": "Success",
            "text": "Make sure you include a step allowing users to switch to BinanceUS, in case they need to, just like in the Welcome to Superalgos Tutorial.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Asegúrese de incluir un paso permitiendo a los usuarios enlazar con BinanceUS, en caso de que lo necesiten como en el caso del tutorial de Welcome to Superalgos.",
                    "updated": 1633365690047
                },
                {
                    "language": "RU",
                    "text": "Обязательно включите шаг, позволяющий пользователям перейти на BinanceUS в случае необходимости, как в учебном пособии Welcome to Superalgos.",
                    "updated": 1640268916224
                }
            ]
        },
        {
            "style": "Title",
            "text": "Tutorial Series & Planning",
            "updated": 1617712970783,
            "translations": [
                {
                    "language": "RU",
                    "text": "Серия уроков и планирование",
                    "updated": 1640268933652
                }
            ]
        },
        {
            "style": "Text",
            "text": "Some topics are broad, have ramifications, or require a nuanced analysis to be covered thoroughly. In such cases, planning for a series of tutorials is ideal.",
            "updated": 1617712578718,
            "translations": [
                {
                    "language": "ES",
                    "text": "Algunos tópicos son amplios, tienen ramificaciones, o requieren un análisis más profundo para ser cubiertos por completo. en estos casos, la planificación de una serie de tutoriales es lo ideal.",
                    "updated": 1640113411134
                },
                {
                    "language": "RU",
                    "text": "Некоторые темы обширны, имеют большое значение или требуют глубокого анализа. В таких случаях идеальным вариантом является планирование серии учебных пособий.",
                    "updated": 1640268959282
                }
            ]
        },
        {
            "style": "Text",
            "text": "Take, for example, the series of tutorials in the Trading System Design Tutorials Plugin Workspace:",
            "updated": 1617712745906,
            "translations": [
                {
                    "language": "ES",
                    "text": "Tome, por ejemplo, las series de tutoriales en el Trading System Design Tutorials Plugin Workspace:",
                    "updated": 1633365963577
                },
                {
                    "language": "RU",
                    "text": "Возьмем, к примеру, серию учебников в Trading System Design Tutorials Plugin Workspace:",
                    "updated": 1640269077954
                }
            ]
        },
        {
            "style": "List",
            "text": "The first tutorial in the series gives a broad introduction to the topic, mostly in conceptual terms. This allows users to see the big picture and learn how the concepts are structured and why they are structured the way they are.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El primer tutorial en la serie da una introducción amplia del tópico, mayormente en términos conceptuales. Esto permite a los usuarios ver la la idea completa y aprender acerca de cómo los conceptos han sido estructurados y porque están estructurados así.",
                    "updated": 1640113306197
                },
                {
                    "language": "RU",
                    "text": "Первый учебник в серии дает широкое введение в тему, в основном в концептуальных терминах. Это позволяет пользователям увидеть общую картину и узнать, как структурированы концепции и почему они структурированы именно так, как они структурированы.",
                    "updated": 1640269102327
                }
            ]
        },
        {
            "style": "List",
            "text": "The second tutorial in the series proposes an exercise that takes several more tutorials to develop and implement. That is, the tutorial sets the basis for what the series will cover.",
            "updated": 1617732839409,
            "translations": [
                {
                    "language": "ES",
                    "text": "El segundo tutorial en la serie propone un ejercicio que incluye varios tutoriales para desarrollar e implementar. Esto es, el tutorial sienta las bases de lo que la serie cubrirá.",
                    "updated": 1640111459663
                },
                {
                    "language": "RU",
                    "text": "Во втором учебнике серии предлагается упражнение, для разработки и реализации которого потребуется еще несколько учебников. Иными словами, этот учебник закладывает основу для того, о чем пойдет речь в последующих сериях.",
                    "updated": 1640269131610
                }
            ]
        },
        {
            "style": "List",
            "text": "The remaining tutorials in the series dissect the exercise proposed earlier and cover with a fine level of detail the implementation. At the same time, they cover all the context and many lateral topics.",
            "updated": 1617732881797,
            "translations": [
                {
                    "language": "ES",
                    "text": "El tutorial siguiente en la serie disecciona el ejercicio propuesto anteriormente y cubre con un nivel fino de detalles la implementación. Al mismo tiempo, ellos cubren todo el contexto y muchos temas laterales.",
                    "updated": 1640113344402
                },
                {
                    "language": "RU",
                    "text": "Остальные учебные пособия серии разбирают предложенное ранее упражнение и с мельчайшими подробностями описывают его реализацию. В то же время они охватывают весь контекст и многие сопутствующие темы.",
                    "updated": 1640269169974
                }
            ]
        },
        {
            "style": "Note",
            "text": "The whole series threads a common theme and develops it from the simplest to the most complex concepts, step by step. A tutorial series must be exhaustive and eventually, cover the whole topic. It must become the ultimate tool to learn about the subject matter!",
            "updated": 1617732933799,
            "translations": [
                {
                    "language": "ES",
                    "text": "Toda la serie enhebra un tema común y lo desarrolla desde lo más simple a  los conceptos más complejos, paso a paso. Una serie de tutoriales debe ser exhaustiva y ocasionalmente cubrir el tópico completo. Debe convertirse en la herramienta definitiva para aprender sobre el tema!",
                    "updated": 1640113505527
                },
                {
                    "language": "RU",
                    "text": "Вся серия посвящена общей теме и шаг за шагом развивает ее от самых простых до самых сложных концепций. Серия учебников должна быть исчерпывающей и в конечном итоге охватывать всю тему. Она должна стать основным инструментом для изучения предмета!",
                    "updated": 1640269193931
                }
            ]
        },
        {
            "style": "Success",
            "text": "Consult with project maintainers what would be good names for each tutorial in the series. Naming tutorials with clear and descriptive names is important.",
            "updated": 1621875606145,
            "translations": [
                {
                    "language": "ES",
                    "text": "Consulte a los que mantienen el proyecto (project maintainers) cual serían buenos nombres para cada tutorial de la serie. Nombrar tutoriales con nombres claros y descriptivos es importante.",
                    "updated": 1640111508245
                },
                {
                    "language": "RU",
                    "text": "Посоветуйтесь с сопровождающими проекта, какие имена будут хорошими для каждого учебника в серии. Важно давать учебным пособиям понятные и понятные названия.",
                    "updated": 1640269229492
                }
            ]
        },
        {
            "style": "Title",
            "text": "The Target Audience",
            "updated": 1617713465981,
            "translations": [
                {
                    "language": "RU",
                    "text": "Целевая аудитория",
                    "updated": 1640269245929
                }
            ]
        },
        {
            "style": "Text",
            "text": "People are different. We all have slightly different wirings in our heads, and we all learn differently. In that sense, building tutorials is a bit of a challenge. Some people like tutorials that go straight to the point and show them how to solve a very specific issue. Others prefer tutorials that get to the bone, explain every detail, and properly cover the context.",
            "updated": 1617733011186,
            "translations": [
                {
                    "language": "ES",
                    "text": "La gente es diferente. todos tenemos un cableado ligeramente diferente en nuestras cabezas, y todos aprendemos  distinto. En ese sentido, construir tutoriales tiene un poco de desafío. A alguna gente le gustan los tutoriales que van derecho al punto y muestran como resolver un tema bien específico. otros prefieren tutoriales que van al hueso, explican cada detalle y cubre adecuadamente el contenido.",
                    "updated": 1633367166012
                },
                {
                    "language": "RU",
                    "text": "Люди разные. У всех нас немного разные провода в голове, и все мы учимся по-разному. В этом смысле создание учебных пособий - непростая задача. Некоторым людям нравятся учебники, которые сразу переходят к делу и показывают, как решить очень конкретную проблему. Другие предпочитают учебные пособия, которые проникают в суть, объясняют каждую деталь и должным образом охватывают суть вопроса.",
                    "updated": 1640269326682
                }
            ]
        },
        {
            "style": "Text",
            "text": "At this early stage, we can't afford to duplicate efforts and build different tutorials for different kinds of learners. We have to choose the method that best serves the project.",
            "updated": 1617714108723,
            "translations": [
                {
                    "language": "ES",
                    "text": "Es en esta etapa temprana, que no podemos darnos el lujo de duplicar esfuerzos y construir tutoriales diferentes para distintas clases de aprendices. Tenemos que elegir el método que mejor sirva al proyecto.",
                    "updated": 1640113524529
                },
                {
                    "language": "RU",
                    "text": "На этом раннем этапе мы не можем позволить себе дублировать усилия и создавать разные учебники для разных типов учащихся. Мы должны выбрать тот метод, который лучше всего подходит для проекта.",
                    "updated": 1640269347480
                }
            ]
        },
        {
            "style": "Important",
            "text": "We choose to focus on building comprehensive tutorials that everyone can follow and that leave no one behind. We believe that a tutorial that goes slow, covering every detail, and taking the time to explain the nuance is the right approach at this stage. By building tutorials in a such manner, we guarantee that those who are willing to invest the time to learn the system have adequate material to quickly become power users.",
            "updated": 1621870335450,
            "translations": [
                {
                    "language": "ES",
                    "text": "Elegimos enfocarnos en construir tutoriales comprensibles que todos puedan seguir y que no deje a nadie atrás. Creemos que un tutorial que va lento, cubriendo cada detalle, y tomándose el tiempo de explicar los matices es el enfoque correcto en esta etapa. Al construir tutoriales de esta manera, garantizamos que aquellos que están dispuestos a invertir tiempo en aprender el sistema tengan el material adecuado para convertirse rápidamente en usuarios poderosos.",
                    "updated": 1640111615070
                },
                {
                    "language": "RU",
                    "text": "Мы решили сосредоточиться на создании всеобъемлющих учебников, которым может следовать каждый и которые никого не оставят позади. Мы считаем, что неторопливый учебник, охватывающий каждую деталь и уделяющий время объяснению всех нюансов, является правильным подходом на данном этапе. Создавая учебники таким образом, мы гарантируем, что те, кто готов потратить время на изучение системы, получат достаточно материала, чтобы быстро стать опытными пользователями.",
                    "updated": 1640269397281
                }
            ]
        },
        {
            "style": "Text",
            "text": "Such tutorials may be slightly annoying to fast-learners, or to people that just want a specific question answered. But such needs are already covered by the searchable knowledge base comprised in the Docs.",
            "updated": 1617714293925,
            "translations": [
                {
                    "language": "ES",
                    "text": "Estos tutoriales pueden resultar ligeramente molestos para los que aprenden rápido o para gente que solo busca respuesta a una pregunta específica. Pero esas necesidades ya son cubiertas en la base de conocimientos con capacidad de búsqueda  incluida en los Docs.",
                    "updated": 1633368103703
                },
                {
                    "language": "RU",
                    "text": "Такие руководства могут немного раздражать тех, кто быстро учится, или тех, кто просто хочет получить ответ на конкретный вопрос. Но такие потребности уже удовлетворены базой знаний с возможностью поиска, содержащейся во вкладке Docs.",
                    "updated": 1640269464902
                }
            ]
        },
        {
            "style": "Title",
            "text": "Communication Resources",
            "updated": 1617720397017,
            "translations": [
                {
                    "language": "RU",
                    "text": "Коммуникационные ресурсы",
                    "updated": 1640269483853
                }
            ]
        },
        {
            "style": "Text",
            "text": "Let's get into some of the specifics on building tutorials for Superalgos!",
            "updated": 1617720149756,
            "translations": [
                {
                    "language": "ES",
                    "text": "Analicemos algunos de los detalles sobre la construcción de los tutoriales para Superalgos!",
                    "updated": 1640113587890
                },
                {
                    "language": "RU",
                    "text": "Давайте разберемся в некоторых особенностях создания учебников для Superalgos!",
                    "updated": 1640269498860
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Superalgos tutorials have evolved through several months worth of feedback from early adopters. We feel we have found a sweet spot, and have started to develop a style in the way we use the space available in each tutorial step. The following are some notes that will help you build tutorials that match the format of existing tutorials.",
            "updated": 1617733117832,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los tutoriales de Superalgos han evolucionado a lo largo de varios meses valiosos feedbacks de los primeros usuarios. Sentimos que hemos encontrado un modo propio, y hemos comenzado a desarrollar un estilo en el modo en que utilizamos el espacio disponible en cada paso de un tutorial. A continuaciòn algunas notas que le ayudarán a construir tutoriales que combinen con el formato de los tutoriales existentes.",
                    "updated": 1640113597334
                },
                {
                    "language": "RU",
                    "text": "Учебники Superalgos развивались в течение нескольких месяцев на основе отзывов первых пользователей. Мы чувствуем, что нашли оптимальный вариант, и начали вырабатывать свой стиль в использовании свободного пространства на каждом этапе обучения. Ниже приведены некоторые замечания, которые помогут вам создать учебники, соответствующие формату существующих учебников.",
                    "updated": 1640269597893
                }
            ]
        },
        {
            "style": "Title",
            "text": "Use Precise Language",
            "updated": 1620645613169,
            "translations": [
                {
                    "language": "RU",
                    "text": "Используйте точные формулировки",
                    "updated": 1640269618503
                }
            ]
        },
        {
            "style": "Text",
            "text": "The ultimate goal of tutorials is to provide users with a hands-on learning experience covering topics in detail. In general terms, we know that a tutorial is good — or has reached a mature state — when users ask no questions about it in the Support Group.",
            "updated": 1620645730740,
            "translations": [
                {
                    "language": "ES",
                    "text": "La meta final de los tutoriales es proveer a los usuarios con una experiencia de aprendizaje práctica que cubra el tópico al detalle. En términos generales, sabemos que un tutorial es bueno — o que ha alcanzado su estado maduro — cuando los usuarios no hacen preguntas acerca de ellos en el Support Group.",
                    "updated": 1640111822806
                },
                {
                    "language": "RU",
                    "text": "Конечная цель учебников - предоставить пользователям возможность практического обучения с подробным изложением тем. В общем, мы знаем, что учебник хорош или достиг зрелого состояния, если пользователи не задают вопросов о нем в группе поддержки Support Group.",
                    "updated": 1640269682009
                }
            ]
        },
        {
            "style": "Text",
            "text": "Be precise and unequivocal with language. Read your writing over and over in search of phrases that may not be easily understood, or that may be interpreted in different ways. Improve the sentences to make them as clear as possible. Remember, the less clear your writing is, the more questions we have in the Support Group.",
            "updated": 1620645812565,
            "translations": [
                {
                    "language": "ES",
                    "text": "Sea preciso, exacto con el lenguaje. Lea lo que ha escrito una y otra vez en búsqueda de frases que pueden no ser entendidas fácilmente, o que puedan ser interpretadas de diferentes maneras. Mejore las oraciones para hacerlas lo más claras posibles. Recuerde, mientras menos clara sea su escritura, más preguntas  tendremos  nosotros en el Support Group.",
                    "updated": 1640113692593
                },
                {
                    "language": "RU",
                    "text": "Будьте точны и однозначны в формулировках. Перечитывайте свои письма снова и снова в поисках фраз, которые могут быть не совсем понятны, или которые могут быть истолкованы по-разному. Улучшите предложения, чтобы сделать их как можно более понятными. Помните, что чем менее понятно вы пишете, тем больше вопросов возникает в Support Group.",
                    "updated": 1640269764238
                }
            ]
        },
        {
            "style": "Success",
            "text": "Be prepared to iterate over and over until the tutorial stabilizes. That will happen when there are no more questions about the topic in the Support Group!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Esté preparado para interactuar una y otra vez hasta que el tutorial se estabilice. Eso sucederá cuando no haya más preguntas acerca del tópico en el Support Group!",
                    "updated": 1640113776665
                },
                {
                    "language": "RU",
                    "text": "Будьте готовы повторять итерации снова и снова, пока учебник не стабилизируется. Это произойдет, когда в группе поддержки больше не будет вопросов по этой теме!",
                    "updated": 1640269845667
                }
            ]
        },
        {
            "style": "Title",
            "text": "Consistent Use of Space and Styles",
            "translations": [
                {
                    "language": "RU",
                    "text": "Согласованное использование пространства и стилей",
                    "updated": 1640269881222
                }
            ]
        },
        {
            "style": "Text",
            "text": "Use the different sections on the page and the different paragraph styles for consistent purposes. This helps users get accustomed to a certain format so that they know what to expect from each section of the page. Consistency in the way the information is delivered makes tutorials more usable!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Use las diferentes secciones de la página y los distintos estilos de párrafos para popósitos concretos. Esto ayudará a los usuarios a acostumbrarse a cierto formato para qué sepan que esperar en cada sección de la página. La consistencia en el modo en que la información es enviada hace que los tutoriales sean más útiles!",
                    "updated": 1640113829127
                },
                {
                    "language": "RU",
                    "text": "Используйте различные разделы на странице и различные стили абзацев для последовательных целей. Это поможет пользователям привыкнуть к определенному формату, чтобы они знали, чего ожидать от каждого раздела страницы. Последовательность в подаче информации делает учебники более удобными для использования!",
                    "updated": 1640269901730
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "The Definition Box",
            "translations": [
                {
                    "language": "RU",
                    "text": "Блок определения",
                    "updated": 1640269922736
                }
            ]
        },
        {
            "style": "Text",
            "text": "The definition box is the space to the right of the icon, below the title. Use this space to introduce what the step is about, that is, to set up the story the step will tell, or to provide some basic context. ",
            "updated": 1617902992986,
            "translations": [
                {
                    "language": "ES",
                    "text": "El box de definición es el espacio a la derecha del ícono, debajo del título. Use este espacio para introducir acerca de qué es el paso, esto es, establecer la historia que el paso contará, o proveer algún contexto básico.",
                    "updated": 1640113873421
                },
                {
                    "language": "RU",
                    "text": "Блок определения - это пространство справа от значка, под заголовком. Используйте это место, чтобы пояснить, о чем идет речь в данном шаге, то есть, чтобы рассказать историю, которую будет рассказывать шаг, или обеспечить некоторый базовый контекст.",
                    "updated": 1640269988109
                }
            ]
        },
        {
            "style": "Note",
            "text": "To use the definition box correctly, explain the context in four to five lines. Avoid one or two lines or anything over five.",
            "updated": 1617903200520,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para usar la box de definición correctamente, explique el contexto en cuatro o cinco líneas. Evite una o dos líneas o sobrepasar las cinco.",
                    "updated": 1640113929610
                },
                {
                    "language": "RU",
                    "text": "Чтобы правильно использовать блок определений, объясните контекст в четырех-пяти строках. Избегайте одной-двух строк или чего-либо более пяти.",
                    "updated": 1640270017216
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "The Call For Action",
            "translations": [
                {
                    "language": "RU",
                    "text": "Призыв к действиям",
                    "updated": 1640270041186
                }
            ]
        },
        {
            "style": "Text",
            "text": "The most important section on any given step is the call for action, that is, the instruction that the user must follow to progress in the tutorial. Many times users redo tutorials or go back a few steps just to make sure they did everything right. ",
            "updated": 1617904108044,
            "translations": [
                {
                    "language": "ES",
                    "text": "La sección más importante de cualquier paso es el llamado a la acción, esto es, la instrucción que el usuario debe seguir para progresar en el tutorial. Muchas veces los usuarios rehacen los tutoriales o vuelven atrás un par de pasos para asegurarse que hicieron todo correctamente.",
                    "updated": 1640111708495
                },
                {
                    "language": "RU",
                    "text": "Самым важным разделом любого шага является призыв к действию, то есть инструкция, которой должен следовать пользователь, чтобы продвинуться в обучении. Часто пользователи повторяют уроки или возвращаются на несколько шагов назад, чтобы убедиться, что они все сделали правильно.",
                    "updated": 1640270123759
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Always use the callout style — the one applied to this paragraph — for the call for action! Similarly, try to avoid using this style for anything else. If the particular step doesn't have a call for action, then the step should not feature this style at all!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Siempre respete el estilo — el que está en este párrafo — para el llamado a la acción! Al igual, trate de evitar usar este estilo para ninguna otra cosa- Si un paso en particular no tiene llamado a la acción, entonces este estilo no debería estar para nada!",
                    "updated": 1640111715747
                },
                {
                    "language": "RU",
                    "text": "Для призыва к действию всегда используйте стиль callout - тот, который применен к этому абзацу! Аналогично, старайтесь не использовать этот стиль ни для чего другого. Если в конкретном шаге нет призыва к действию, то этот шаг вообще не должен быть оформлен в этом стиле!",
                    "updated": 1640270184122
                }
            ]
        },
        {
            "style": "Text",
            "text": "Each tutorial step should have a single call for action, that is, a single instruction that the user must carry out. This is the ideal case scenario. There may be exceptions, for example, when we ask the user to read a page in the Docs and do something else as the main instruction.",
            "updated": 1617904124728,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada paso del tutorial debería tener un solo llamado a la acción, esto es, una sola instrucciòn que el usuario debe llevar a cabo.  Puede haber excepciones, por ejemplo, cuando le solicitamos al usuario que lea una página en los docs y hacer algo más como la instrucción principal.",
                    "updated": 1633438088497
                },
                {
                    "language": "RU",
                    "text": "Каждый шаг учебника должен содержать один призыв к действию, то есть одну инструкцию, которую пользователь должен выполнить. Это идеальный сценарий. Могут быть исключения, например, когда мы просим пользователя прочитать страницу в Docs и сделать что-то еще в качестве основной инструкции.",
                    "updated": 1640270239442
                }
            ]
        },
        {
            "style": "Success",
            "text": "In general terms and when possible, try to avoid giving the user more than one task on the same step. Instead, if you expect the user to perform several sequential actions, try to split the process into more than one step — as many as it takes.",
            "updated": 1617904133804,
            "translations": [
                {
                    "language": "ES",
                    "text": "En términos generales y cuando es posible, intente evitar darle al usuario más de una tarea en el mismo paso. En vez de eso, si espera que el usuario haga varias acciones secuencialmente, intente repartir el proceso en más de un paso — tantos como sean necesarios.",
                    "updated": 1633438316138
                },
                {
                    "language": "RU",
                    "text": "В общих чертах и по возможности старайтесь не давать пользователю более одной задачи на одном шаге. Вместо этого, если вы ожидаете, что пользователь выполнит несколько последовательных действий, постарайтесь разбить процесс на несколько шагов - столько, сколько потребуется.",
                    "updated": 1640270322688
                }
            ]
        },
        {
            "style": "Text",
            "text": "In some cases, you may need the user to take a very simple action so that the main call for action may be delivered. In such cases, you may use the definition box to tell the user how to get ready to execute the call for action delivered later in the page.",
            "translations": [
                {
                    "language": "ES",
                    "text": "En algunos casos, puede necesitar que el usuario haga una acción muy simple para que el principal llamado a la acción pueda realizarse. En esos casos, puede utilizar la definition box para decirle al usuario como estar listo para ejecutar el llamado a la acción, que será entregado más adelante en la ´página.",
                    "updated": 1640113942422
                },
                {
                    "language": "RU",
                    "text": "В некоторых случаях вам может понадобиться, чтобы пользователь совершил очень простое действие, чтобы можно было выполнить основной призыв к действию. В таких случаях вы можете использовать блок определения, чтобы сообщить пользователю, как подготовиться к выполнению призыва к действию, представленного далее на странице.",
                    "updated": 1640270375251
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Alternating Colors",
            "updated": 1617906135945,
            "translations": [
                {
                    "language": "ES",
                    "text": "Alternating Colors  ( Alternando colores)",
                    "updated": 1640111782340
                },
                {
                    "language": "RU",
                    "text": "Чередование цветов",
                    "updated": 1640270393606
            
                }
            ]
        },
        {
            "style": "Text",
            "text": "Colorful tutorial steps look great, while a white pages full of text feel too much like non-interactive documentation. Makes sure you break the monotony with the four different styles of boxes:",
            "updated": 1617906625458,
            "translations": [
                {
                    "language": "ES",
                    "text": "Pasos de tutoriales coloridos se ven muy bien, mientras que las páginas blancas llenas de texto se sienten como documentación muy poco interactiva. Asegúrese de romper la monotonía  con los cuatro estilos diferentes de boxes.",
                    "updated": 1633438835567
                },
                {
                    "language": "RU",
                    "text": "Красочные шаги учебника выглядят великолепно, в то время как белые страницы, заполненные текстом, слишком похожи на неинтерактивную документацию. Разнообразить однообразное оформление можно с помощью четырех различных стилей коробок:",
                    "updated": 1640270463123
                }
            ]
        },
        {
            "style": "Success",
            "text": "This is great for additional tips.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Esto es genial para tips adicionales.",
                    "updated": 1633438870414
                },
                {
                    "language": "RU",
                    "text": "Это отличный вариант для дополнительных советов.",
                    "updated": 1640270551869
                }
            ]
        },
        {
            "style": "Note",
            "text": "Use this every once in a while to break up otherwise large sections of plain text.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Use este cada tanto para romper secciones grandes de puro texto.",
                    "updated": 1633439032601
                },
                {
                    "language": "RU",
                    "text": "Используйте это время от времени, чтобы разбить большие участки обычного текста.",
                    "updated": 1640271438229
                }
            ]
        },
        {
            "style": "Important",
            "text": "Leave this box for the truly important stuff. Things you don't want users to overlook or forget.",
            "updated": 1617906591147,
            "translations": [
                {
                    "language": "ES",
                    "text": "Deje esta box para cosas verdaderamente importantes. Cosas que no quiere que los usuarios se pasen por alto o se olviden.",
                    "updated": 1633439143351
                },
                {
                    "language": "RU",
                    "text": "Оставьте это поле для действительно важных вещей. Для тех вещей, которые вы не хотите, чтобы пользователи упустили из виду или забыли.",
                    "updated": 1640271496452
                }
            ]
        },
        {
            "style": "Warning",
            "text": "And this one, save it for real warnings. Things that may represent a threat or risk.",
            "updated": 1617906578635,
            "translations": [
                {
                    "language": "ES",
                    "text": "Y esta otra, guárdela para advertencias reales. Cosas que pueden representar una amenaza o un riesgo.",
                    "updated": 1633439239739
                },
                {
                    "language": "RU",
                    "text": "А вот это оставьте для настоящих предупреждений. О том, что может представлять угрозу или риск.",
                    "updated": 1640271534088
                }
            ]
        },
        {
            "style": "Title",
            "text": "Use of Docs Pages",
            "translations": [
                {
                    "language": "RU",
                    "text": "Использование страниц",
                    "updated": 1640271575560
                }
            ]
        },
        {
            "style": "Text",
            "text": "When you need the user to learn about a specific concept to get the proper context on the subject, do not replicate in the tutorial information that exists in the Docs. Duplicating information is not a good idea, as it makes it harder to maintain the Docs and tutorials.",
            "updated": 1617730695174,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando necesite que el usuario aprenda un concepto específico para obtener un contexto adecuado del tema, no repita en el tutorial la información que ya existe en los Docs. Duplicar la información no es una buena idea, ya que hace más difícil mantener los Docs y los tutoriales.",
                    "updated": 1640114025286
                },
                {
                    "language": "RU",
                    "text": "Когда вам нужно, чтобы пользователь узнал о конкретной концепции, чтобы получить правильный контекст по теме, не дублируйте в учебнике информацию, которая существует в Docs. Дублирование информации - не лучшая идея, так как это усложняет поддержку документации и учебников.",
                    "updated": 1640271624404
                }
            ]
        },
        {
            "style": "Success",
            "text": "Asking the user to read a page or a section of a page in the Docs is the correct approach. This has the added benefit of making the user aware that the Docs cover the topic too.",
            "updated": 1617724009821,
            "translations": [
                {
                    "language": "ES",
                    "text": "Pedirle al usuario leer una página o una parte de la página en los Docs es el acercamiento adecuado. Esto tiene el beneficio adicional de hacer que el usuario se de cuenta de que los Docs también cubren el tópico.",
                    "updated": 1640114018246
                },
                {
                    "language": "RU",
                    "text": "Правильным подходом будет попросить пользователя прочитать страницу или раздел страницы в документации. Это дает дополнительное преимущество - пользователь узнает, что в документации также рассматривается эта тема.",
                    "updated": 1640271660066
                }
            ]
        },
        {
            "style": "Important",
            "text": "If you find that the relevant page in the Docs is outdated, doesn't cover the topic with the appropriate depth, or maybe even doesn't exist, helping create, complete, and/or improve the delivery of the information in the Docs is just as valuable as building the tutorial! Long format explanations do not fit well in tutorials. They do fit well in the Docs!",
            "updated": 1617733203373,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si encuentra que la página relevante de los Docs está desactualizada, no cubre el tópico con la profundidad apropiada, o puede que no exista, ayudar a crearla, completar, y/o mejorar el envio de la información en los Docs es tan valioso como construir el tutorial! Explicaciones en formato largo no encajan bien con los tutoriales. Ellas van bien en los Docs!",
                    "updated": 1633440056942
                },
                {
                    "language": "RU",
                    "text": "Если вы обнаружили, что соответствующая страница в документации устарела, не охватывает тему с должной глубиной или, возможно, даже не существует, помощь в создании, дополнении и/или улучшении предоставления информации в документации будет не менее ценной, чем создание учебника! Длинные формы объяснений не очень подходят для учебников. Зато они хорошо подходят в документации!",
                    "updated": 1640271718287
                }
            ]
        },
        {
            "style": "Title",
            "text": "Interactivity",
            "updated": 1617724494717,
            "translations": [
                {
                    "language": "RU",
                    "text": "Интерактивность",
                    "updated": 1640271731763
                }
            ]
        },
        {
            "style": "Text",
            "text": "The whole point of tutorials — and the main difference with the Docs as learning material — is that they offer the opportunity for hands-on learning. Tutorials are interactive while the Docs are less so!",
            "updated": 1617730782624,
            "translations": [
                {
                    "language": "ES",
                    "text": "El punto de los tutoriales — y la diferencia principal con los Docs como material de aprendizaje — es que ellos ofrecen la oportunidad  para el aprendizaje práctico Los tutoriales son interactivos mientras que los Docs no tanto!",
                    "updated": 1633440286430
                },
                {
                    "language": "RU",
                    "text": "Суть учебников - и главное отличие от документов как учебного материала - в том, что они предоставляют возможность практического обучения. Учебники интерактивны, в то время как документы менее интерактивны!",
                    "updated": 1640271759540
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Make sure you use this quality to the fullest, but also try to maintain a certain balance!",
            "updated": 1617725782977,
            "translations": [
                {
                    "language": "ES",
                    "text": "Asegúrese de usar esta cualidad al máximo, pero también intente mantener un cierto balance!",
                    "updated": 1640114093816
                },
                {
                    "language": "RU",
                    "text": "Убедитесь, что вы используете это качество в полной мере, но при этом старайтесь соблюдать определенный баланс!",
                    "updated": 1640271797532
                }
            ]
        },
        {
            "style": "List",
            "text": "If the tutorial is talking about a hierarchy, a group of nodes, or a particular node, make sure that the tutorial step takes you to that place in the Workspace. This adds a visual element to the explanation and helps the user get familiar with the data structures involved.",
            "updated": 1617725808080,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si el tutorial está hablando de jerarquías, un grupo de nodos en particular, asegúrese que el paso del tutorial lo lleve a ese lugar en el Workspace. Esto agrega un elemento visual a la explicación y ayuda al usuario a familiarizarse con la estructura de datos involucrada.",
                    "updated": 1640114145589
                },
                {
                    "language": "RU",
                    "text": "Если в учебнике речь идет об иерархии, группе узлов или конкретном узле, убедитесь, что шаг учебника ведет вас к этому месту в рабочем пространстве. Это добавляет визуальный элемент к объяснению и помогает пользователю ознакомиться с соответствующими структурами данных.",
                    "updated": 1640271835217
                }
            ]
        },
        {
            "style": "List",
            "text": "Tutorials can affect the Workspace in many ways replicating actions the user may do. When you want the user to learn to do something, it's best to ask the user to do it, instead of having the tutorial do it for the user.",
            "updated": 1617733271488,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los tutoriales pueden afectar al Workspace de muchas maneras  replicando acciones que el usuario puede hacer. Cuando quiere que el usuario aprenda a hacer algo, lo mejor es pedirle al usuario que lo haga, en vez de que el tutorial lo haga por él.",
                    "updated": 1633440813684
                },
                {
                    "language": "RU",
                    "text": "Учебные пособия могут влиять на рабочее пространство различными способами, повторяя действия, которые может выполнять пользователь. Когда вы хотите, чтобы пользователь научился что-то делать, лучше попросить пользователя сделать это, вместо того, чтобы учебник делал это за пользователя.",
                    "updated": 1640271924959
                }
            ]
        },
        {
            "style": "List",
            "text": "On the other hand, the tutorial should take care of doing certain things that are not conducive to learning something relevant to the context of the tutorial. Performing these actions directly may help keep the user focused on what matters most.",
            "updated": 1617733297397,
            "translations": [
                {
                    "language": "ES",
                    "text": "Por otro lado, el tutorial debería cuidar de no hacer cosas que no lleven a aprender nada relevante del contexto del tutorial. Realizar estas acciones directamente puede ayudar a mantener al usuario concentrado en lo que más importa.",
                    "updated": 1640114167809
                },
                {
                    "language": "RU",
                    "text": "С другой стороны, учебник должен позаботиться о выполнении определенных действий, которые не способствуют изучению чего-то, относящегося к контексту учебника. Непосредственное выполнение этих действий может помочь пользователю сосредоточиться на главном.",
                    "updated": 1640271948497
                }
            ]
        },
        {
            "style": "List",
            "text": "In some cases, the actions users take may have certain effects. Showing users the outcome of their actions immediately after completing a task has a great educational value. For example, if the user is setting up a new Time Machine in a tutorial about the Charting Space, show users how the time machine appears in the charting space immediately after creating it. If users then set up a Timeline Chart that references a particular Data Mine, show users how the new Timeline Chart appears within the Time Machine, and let them verify that the expected layer managers are there. Don't be afraid to go back and forth... that is the whole point after all!",
            "updated": 1617905020985,
            "translations": [
                {
                    "language": "ES",
                    "text": "En algunos casos, las acciones que los usuarios realizan tienene efectos determinados. Mostrarles a los usuarios los resultados de sus acciones inmediatamente después de haber completado una tarea es de gran valor educativo. Por ejemplo, si el usuario está configurando una nueva Time Machine en un tutorial acerca de el Charting Space, mostrarle a los usuarios como la time machine aparece en el charting space inmediatamente después de crearla. Si los usuarios configuran una Timeline Chart que referencia a una particular Data Mine, mostrarles a los usuarios como la nueva Timeline Chart aparece dentro de la Time Machine, y permíteles verificar que los administradores de capas esperados están allí. no tengas miedo de ir hacia atrás y hacia adelante... Ese es el punto después de todo!",
                    "updated": 1640114293366
                },
                {
                    "language": "RU",
                    "text": "В некоторых случаях действия пользователей могут иметь определенные последствия. Демонстрация пользователям результатов их действий сразу после выполнения задания имеет большую образовательную ценность. Например, если пользователь настраивает новую машину времени Time Machine в учебном пособии о пространстве диаграмм Charting Space, покажите пользователям, как машина времени появляется в пространстве диаграмм сразу после ее создания. Если пользователи затем настраивают временную диаграмму Timeline Chart, которая ссылается на определенную источник данных Data Mine, покажите пользователям, как новая временная диаграмма появляется в Time Machine, и позвольте им убедиться, что ожидаемые менеджеры слоев находятся там. Не бойтесь ходить туда-сюда... в этом, в конце концов, и есть смысл!",
                    "updated": 1640272197087
                }
            ]
        },
        {
            "style": "Title",
            "text": "Tooltips",
            "updated": 1617731886888,
            "translations": [
                {
                    "language": "RU",
                    "text": "Всплывающие подсказки",
                    "updated": 1640272216207
                }
            ]
        },
        {
            "style": "Text",
            "text": "The system recognizes the name of all entities that have a Docs Page when the name of the entity is written in title case. When that happens, the system automatically creates a tooltip for the phrase. This is a valuable resource, as it provides context that you don't need to explain.",
            "updated": 1617731953773,
            "translations": [
                {
                    "language": "ES",
                    "text": "El sistema reconoce el nombre de todas las entidades que tienen una página de documentos cuando el nombre de la entidad se escribe en mayúsculas y minúsculas. Cuando eso sucede, el sistema crea automáticamente una información sobre herramientas para la frase. Este es un recurso valioso, ya que proporciona un contexto que no necesita explicar.",
                    "updated": 1640109235581
                },
                {
                    "language": "RU",
                    "text": "Система распознает имена всех объектов, у которых есть страница документов Docs Page, когда имя объекта написано в регистре заголовка. Когда это происходит, система автоматически создает всплывающую подсказку для фразы. Это ценный ресурс, поскольку он предоставляет контекст, который вам не нужно объяснять.",
                    "updated": 1640272283985
                }
            ]
        },
        {
            "style": "Text",
            "text": "Make sure you use this resource wisely, as too many tooltips on a single tutorial page may be overwhelming, and probably irrelevant.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Asegúrese de utilizar este recurso con prudencia, ya que demasiada información sobre herramientas en una sola página de tutorial puede resultar abrumadora y probablemente irrelevante.",
                    "updated": 1640109266196
                },
                {
                    "language": "RU",
                    "text": "Используйте этот ресурс с умом, поскольку слишком большое количество подсказок на одной странице учебника может быть чрезмерным и, возможно, неактуальным.",
                    "updated": 1640272314967
                }
            ]
        },
        {
            "style": "Success",
            "text": "When you believe the tooltip is relevant, then write the name of the entity in title case. If the tooltip is not relevant, then write the name of the entity in lower case.",
            "updated": 1617733407351,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando crea que la información sobre herramientas es relevante, escriba el nombre de la entidad en mayúsculas y minúsculas. Si la información sobre herramientas no es relevante, escriba el nombre de la entidad en minúsculas.",
                    "updated": 1640109287587
                },
                {
                    "language": "RU",
                    "text": "Если вы считаете, что подсказка уместна, напишите название сущности в заглавном регистре. Если подсказка не имеет значения, напишите название сущности в нижнем регистре.",
                    "updated": 1640272351376
                }
            ]
        },
        {
            "style": "Title",
            "text": "Naming of Nodes",
            "updated": 1617731585276,
            "translations": [
                {
                    "language": "ES",
                    "text": "Naming of Nodes  (Nombrando los nodos)",
                    "updated": 1640109314526
                },
                {
                    "language": "RU",
                    "text": "Присвоение имен узлам",
                    "updated": 1640272370877
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos is a complex system. Helping users develop good organizational habits is highly desirable. The more top-level users we may help form, the more powerful the project becomes.",
            "updated": 1617732614881,
            "translations": [
                {
                    "language": "ES",
                    "text": "Superalgos es un sistema complejo. Ayudar a los usuarios a desarrollar buenos hábitos organizativos es muy deseable. Cuantos más usuarios de alto nivel podamos ayudar a formar, más poderoso se vuelve el proyecto.",
                    "updated": 1640109341120
                },
                {
                    "language": "RU",
                    "text": "Superalgos - это сложная система. Очень желательно помочь пользователям выработать хорошие организационные навыки. Чем больше пользователей высшего уровня мы можем помочь сформировать, тем мощнее становится проект.",
                    "updated": 1640272438547
                }
            ]
        },
        {
            "style": "Text",
            "text": "When users create new data structures, it's good practice to have them name the relevant nodes. This is particularly important with nodes that pass on their names through references to other nodes.",
            "updated": 1617733435330,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando los usuarios crean nuevas estructuras de datos, es una buena práctica que nombren los nodos relevantes. Esto es particularmente importante con los nodos que transmiten sus nombres a través de referencias a otros nodos.",
                    "updated": 1640109366248
                },
                {
                    "language": "RU",
                    "text": "Когда пользователи создают новые структуры данных, хорошей практикой является присвоение имен соответствующим узлам. Это особенно важно для узлов, которые передают свои имена через ссылки на другие узлы.",
                    "updated": 1640272458955
                }
            ]
        },
        {
            "style": "Note",
            "text": "Make sure your tutorial goes the extra mile and reminds users to name those kinds of nodes. Proposing a specific name is ideal. Remember that the user may not know what comes next or what the node is used for at the time of creation, so they may not know what a relevant name may be. But you do, so you may propose a name that is consistent with the tutorial's goal.",
            "updated": 1617731598259,
            "translations": [
                {
                    "language": "ES",
                    "text": "Asegúrese de que su tutorial vaya más allá y recuerde a los usuarios que nombren ese tipo de nodos. Proponer un nombre específico es ideal. Recuerde que es posible que el usuario no sepa qué viene a continuación o para qué se utiliza el nodo en el momento de la creación, por lo que es posible que no sepa cuál puede ser un nombre relevante. Pero lo hace, por lo que puede proponer un nombre que sea coherente con el objetivo del tutorial.",
                    "updated": 1640109408736
                },
                {
                    "language": "RU",
                    "text": "Убедитесь, что ваше руководство прилагает дополнительные усилия и напоминает пользователям о необходимости присвоить названия таким узлам. Идеальным вариантом является предложение конкретного названия. Помните, что пользователь может не знать, что будет дальше или для чего будет использоваться узел в момент его создания, поэтому он может не знать, какое название может быть уместным. Но вы знаете, поэтому вы можете предложить название, соответствующее цели учебника.",
                    "updated": 1640272686177
                }
            ]
        },
        {
            "style": "Title",
            "text": "Look & Feel",
            "updated": 1617722154194,
            "translations": [
                {
                    "language": "ES",
                    "text": "Look & Feel  (Mire y sienta)",
                    "updated": 1640109438059
                },
                {
                    "language": "RU",
                    "text": "Внешний вид и восприятие",
                    "updated": 1640272717527
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": "There is a philosophical debate on whether beauty is objective or subjective. Some people think beauty is in the eyes of the beholder, while others believe that there are inherently beautiful things.",
            "updated": 1617733474625,
            "translations": [
                {
                    "language": "ES",
                    "text": "Existe un debate filosófico sobre si la belleza es objetiva o subjetiva. Algunas personas piensan que la belleza está en los ojos del espectador, mientras que otras creen que hay cosas inherentemente hermosas.",
                    "updated": 1640109463696
                },
                {
                    "language": "RU",
                    "text": "Существует философский спор о том, является ли красота объективной или субъективной. Некоторые люди считают, что красота находится в глазах смотрящего, в то время как другие полагают, что существуют изначально красивые вещи.",
                    "updated": 1640272741532
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Whatever the case may be, we want the overall look & feel of tutorials to be consistent!",
            "updated": 1617733495986,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cualquiera que sea el caso, queremos que el aspecto general de los tutoriales sea coherente.",
                    "updated": 1640109487182
                },
                {
                    "language": "RU",
                    "text": "Как бы там ни было, мы хотим, чтобы общий вид и восприятие учебников были одинаковыми!",
                    "updated": 1640272778897
                }
            ]
        },
        {
            "style": "Text",
            "text": "Here's a list of requirements that help tutorials be consistent in their look & feel:",
            "updated": 1617722868882,
            "translations": [
                {
                    "language": "ES",
                    "text": "Aquí hay una lista de requisitos que ayudan a que los tutoriales sean consistentes en su apariencia:",
                    "updated": 1640109538015
                },
                {
                    "language": "RU",
                    "text": "Вот список требований, которые помогают учебным пособиям быть единообразными в своем внешнем виде:",
                    "updated": 1640272834101
                }
            ]
        },
        {
            "style": "List",
            "text": "Always use an icon to illustrate the step. Sometimes the appropriate icon is the one corresponding to the node the user is working with. Other times you may use icons figuratively, playing with alternate meanings of what the drawing may represent.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Utilice siempre un icono para ilustrar el paso. A veces, el icono apropiado es el correspondiente al nodo con el que está trabajando el usuario. En otras ocasiones, puede utilizar iconos en sentido figurado, jugando con significados alternativos de lo que puede representar el dibujo.",
                    "updated": 1640109510421
                },
                {
                    "language": "RU",
                    "text": "Всегда используйте иконку для иллюстрации шага. Иногда подходящим значком является тот, который соответствует узлу, с которым работает пользователь. В других случаях вы можете использовать значки образно, играя с альтернативными значениями того, что может представлять рисунок.",
                    "updated": 1640272884347
                }
            ]
        },
        {
            "style": "List",
            "text": "Avoid stud step pages. Steps with very little content seem empty and feel strange. You don't need to feel the space with gibberish or unnecessary information. Instead, try to use the space to provide context for the call for action. Explain why the user is asked to do this or that. Let the user know what may be expected from the action and so on.",
            "updated": 1617733584684,
            "translations": [
                {
                    "language": "ES",
                    "text": "Evite las páginas de pasos monumentales. Los pasos con muy poco contenido parecen vacíos y se sienten extraños. No necesita sentir el espacio con galimatías o información innecesaria. En su lugar, intente utilizar el espacio para proporcionar contexto para el llamado a la acción. Explique por qué se le pide al usuario que haga esto o aquello. Informe al usuario qué se puede esperar de la acción, etc.",
                    "updated": 1640109616502
                },
                {
                    "language": "RU",
                    "text": "Избегайте страниц с шагами небольшим содержанием, они кажутся пустыми и кажутся странными. Вам не нужно заполнять пространство тарабарщиной или ненужной информацией. Вместо этого постарайтесь использовать пространство для предоставления контекста призыва к действию. Объясните, почему пользователя просят сделать то или иное действие. Дайте пользователю понять, что можно ожидать от этого действия и так далее.",
                    "updated": 1640273694929
                }
            ]
        },
        {
            "style": "List",
            "text": "As a corollary of the above, the opposite case may be problematic too. That is, when the content barely fits the page and gets too close to the row of buttons fixed at the bottom of each step. The problem is that some browsers / OS combinations render styles slightly differently, and what may seem close to the buttons in one system may overlap the buttons in the next. Try to level at least one full empty line — preferably two.",
            "updated": 1617733668851,
            "translations": [
                {
                    "language": "ES",
                    "text": "Como corolario de lo anterior, el caso contrario también puede ser problemático. Es decir, cuando el contenido apenas cabe en la página y se acerca demasiado a la fila de botones fijada en la parte inferior de cada paso. El problema es que algunas combinaciones de navegadores / sistemas operativos representan los estilos de manera ligeramente diferente, y lo que puede parecer cercano a los botones de un sistema puede superponerse a los botones del siguiente. Intente nivelar al menos una línea vacía completa, preferiblemente dos.",
                    "updated": 1640109655881
                },
                {
                    "language": "RU",
                    "text": "Как следствие вышесказанного, обратный случай также может быть проблематичным. То есть, когда содержимое едва умещается на странице и слишком близко подходит к ряду кнопок, закрепленных внизу каждого шага. Проблема заключается в том, что некоторые комбинации браузер / оперционная система отображают стили немного по-разному, и то, что может показаться близко к кнопкам в одной системе, может перекрывать их в другой. Постарайтесь выровнять хотя бы одну полную пустую строку, а лучше две.",
                    "updated": 1640273786793
                }
            ]
        },
        {
            "style": "List",
            "text": "Do not set two consecutive paragraphs with the same style. The only exception is for bullet lists. Even the Docs Text Style is not formated to look good as consecutive paragraphs in the context of a tutorial (there is no padding between paragraphs).",
            "updated": 1617723650896,
            "translations": [
                {
                    "language": "ES",
                    "text": "No establezca dos párrafos consecutivos con el mismo estilo. La única excepción son las listas de viñetas. Incluso el estilo de texto del documento( Docs Text Style) no está formateado para verse bien como párrafos consecutivos en el contexto de un tutorial (no hay relleno entre párrafos).",
                    "updated": 1640109712414
                },
                {
                    "language": "RU",
                    "text": "Не выделяйте два следующих друг за другом абзаца одним и тем же стилем. Единственное исключение - это списки. Даже стиль текста Docs не сформирован так, чтобы хорошо смотреться в качестве последовательных абзацев в контексте учебника (между абзацами нет прокладок).",
                    "updated": 1640273977383
                }
            ]
        },
        {
            "style": "List",
            "text": "Leave at least one line empty before the buttons at the bottom of the tutorial window. Otherwise, in other browsers, the content may overflow the window.",
            "updated": 1620646218773,
            "translations": [
                {
                    "language": "ES",
                    "text": "Deje al menos una línea vacía antes de los botones en la parte inferior de la ventana del tutorial. De lo contrario, en otros navegadores, el contenido puede desbordar la ventana.",
                    "updated": 1640109727420
                },
                {
                    "language": "RU",
                    "text": "Оставьте пустой хотя бы одну строку перед кнопками в нижней части окна учебника. В противном случае в других браузерах содержимое может выйти за пределы окна.",
                    "updated": 1640274010295
                }
            ]
        },
        {
            "style": "Title",
            "text": "Titles",
            "translations": [
                {
                    "language": "RU",
                    "text": "Заголовки",
                    "updated": 1640274028937
                }
            ]
        },
        {
            "style": "Text",
            "text": "Always use proper title case for titles. But, what exactly is proper title case? Let's agree to the standard propose in this blog post:",
            "updated": 1617902503383,
            "translations": [
                {
                    "language": "ES",
                    "text": "Utilice siempre mayúsculas y minúsculas adecuadas para los títulos. Pero, ¿qué es exactamente el caso de título adecuado? Aceptemos la propuesta estándar en esta publicación de blog:",
                    "updated": 1640109742566
                },
                {
                    "language": "RU",
                    "text": "Всегда используйте правильный регистр заголовков. Но что именно является правильным регистром заголовка? Давайте договоримся о стандартном варианте, предложенном в этой статье блога:",
                    "updated": 1640274069802
                }
            ]
        },
        {
            "style": "Link",
            "text": "Capitalization of titles 101->www.grammarcheck.net/capitalization-in-titles-101/",
            "updated": 1617902444077
        },
        {
            "style": "Success",
            "text": "Titles look best when they span a single line. Use two-line titles only if strictly necessary!",
            "updated": 1617902549247,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los títulos se ven mejor cuando ocupan una sola línea. ¡Utilice títulos de dos líneas solo si es estrictamente necesario!",
                    "updated": 1640109761257
                },
                {
                    "language": "RU",
                    "text": "Заголовки лучше всего смотрятся, когда они занимают одну строку. Используйте двустрочные заголовки только в случае крайней необходимости!",
                    "updated": 1640274087733
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Unique Identifiers",
            "updated": 1617905396529,
            "translations": [
                {
                    "language": "ES",
                    "text": "Unique Identifiers  ( Identificadores Unicos)",
                    "updated": 1640109784229
                },
                {
                    "language": "RU",
                    "text": "Уникальные идентификаторы",
                    "updated": 1640274101948
                }
            ]
        },
        {
            "style": "Important",
            "text": "Remember that the title of a tutorial step is also the unique identifier of the corresponding Docs Page. This means that the system does not allow for duplicate titles. Avoid at all costs naming pages after single words or short phrases. Let's leave those unique names for particular cases that may merit the use of such special phrases.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Recuerde que el título de un paso del tutorial es también el identificador único de la página de documentos correspondiente. Esto significa que el sistema no permite títulos duplicados. Evite a toda costa nombrar páginas después de palabras sueltas o frases cortas. Dejemos esos nombres únicos para casos particulares que pueden ameritar el uso de frases tan especiales.",
                    "updated": 1640109811000
                },
                {
                    "language": "RU",
                    "text": "Помните, что название шага учебника также является уникальным идентификатором соответствующей страницы Docs Page. Это означает, что система не допускает дублирования названий. Избегайте любой ценой называть страницы одним словом или короткой фразой. Давайте оставим эти уникальные имена для особых случаев, которые могут заслуживать использования таких специальных фраз.",
                    "updated": 1640274222418
                }
            ]
        },
        {
            "style": "Text",
            "text": "For the same reason, all titles should begin with the following fixed string of text:",
            "updated": 1617905464492,
            "translations": [
                {
                    "language": "ES",
                    "text": "Por la misma razón, todos los títulos deben comenzar con la siguiente cadena de texto fija:",
                    "updated": 1640109828737
                },
                {
                    "language": "RU",
                    "text": "По этой же причине все заголовки должны начинаться со следующей фиксированной строки текста:",
                    "updated": 1640274241889
                }
            ]
        },
        {
            "style": "Json",
            "text": "Tutorial Step - ",
            "updated": 1617905492001
        },
        {
            "style": "Text",
            "text": "The above helps reserve some phrases for contexts different than tutorials.",
            "updated": 1617905844332,
            "translations": [
                {
                    "language": "ES",
                    "text": "Lo anterior ayuda a reservar algunas frases para contextos diferentes a los tutoriales.",
                    "updated": 1640109842831
                },
                {
                    "language": "RU",
                    "text": "Вышеизложенное помогает зарезервировать некоторые фразы для контекстов, отличных от учебных пособий.",
                    "updated": 1640274262809
                }
            ]
        },
        {
            "style": "Success",
            "text": "Don't worry! Your titles will not look ugly in the tutorial, as the system filters the prefix and doesn't show it in the tutorial window!",
            "updated": 1617905922481,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡No te preocupes! ¡Tus títulos no se verán feos en el tutorial, ya que el sistema filtra el prefijo y no lo muestra en la ventana del tutorial!",
                    "updated": 1640109862813
                },
                {
                    "language": "RU",
                    "text": "Не волнуйтесь! Ваши заголовки не будут выглядеть некрасиво в учебнике, так как система фильтрует префикс и не показывает его в окне учебника!",
                    "updated": 1640274286892
                }
            ]
        },
        {
            "style": "Title",
            "text": "Proper English",
            "updated": 1617733994160,
            "translations": [
                {
                    "language": "RU",
                    "text": "Правильный английский",
                    "updated": 1640274300910
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are at least two reasons why it's desirable to have spell and grammar-checked tutorials:",
            "updated": 1617734204593,
            "translations": [
                {
                    "language": "ES",
                    "text": "Hay al menos dos razones por las que es deseable contar con tutoriales con revisión ortográfica y gramatical:",
                    "updated": 1640109910214
                },
                {
                    "language": "RU",
                    "text": "Есть как минимум две причины, по которым желательно иметь учебники с проверкой орфографии и грамматики:",
                    "updated": 1640274316991
                }
            ]
        },
        {
            "style": "List",
            "text": "Proper language speaks to the quality of the product.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El lenguaje adecuado habla de la calidad del producto.",
                    "updated": 1640109891642
                },
                {
                    "language": "RU",
                    "text": "Грамотное изложение говорит о качестве продукта.",
                    "updated": 1640274377484
                }
            ]
        },
        {
            "style": "List",
            "text": "Users who don't speak English may be using online translators, which perform well only when they have a proper source.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Los usuarios que no hablan inglés pueden estar usando traductores en línea, que funcionan bien solo cuando tienen una fuente adecuada.",
                    "updated": 1640109880071
                },
                {
                    "language": "RU",
                    "text": "Пользователи, не владеющие английским языком, могут использовать онлайн-переводчики, которые хорошо работают только при правильном исходном тексте.",
                    "updated": 1640274534629
                }
            ]
        },
        {
            "style": "Important",
            "text": "Always use a grammar and spell-checker to make sure your tutorial is as correct as it may be!",
            "updated": 1617734220351,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Utilice siempre un corrector gramatical y ortográfico para asegurarse de que su tutorial sea lo más correcto posible!",
                    "updated": 1640109928532
                },
                {
                    "language": "RU",
                    "text": "Всегда используйте грамматику и средство проверки правописания, чтобы убедиться, что ваше руководство настолько правильное, насколько это возможно!",
                    "updated": 1640274556531
                }
            ]
        },
        {
            "style": "Title",
            "text": "The First Page",
            "updated": 1621874343005,
            "translations": [
                {
                    "language": "RU",
                    "text": "Первая страница",
                    "updated": 1640274568878
                }
            ]
        },
        {
            "style": "Text",
            "text": "The very first page of a tutorial is a page that briefly describes what the tutorial is about, using the Summary field. The page must have the same name as the tutorial and end with the word `Tutorial`, as the summary you enter will serve as a tooltip when the tutorial is mentioned across the Docs.",
            "updated": 1621877951283,
            "translations": [
                {
                    "language": "ES",
                    "text": "La primera página de un tutorial es una página que describe brevemente de qué trata el tutorial, utilizando el campo Resumen. La página debe tener el mismo nombre que el tutorial y terminar con la palabra `Tutorial`, ya que el resumen que ingrese servirá como información sobre herramientas cuando se menciona el tutorial en los Documentos.",
                    "updated": 1640114342532
                },
                {
                    "language": "RU",
                    "text": "Самая первая страница учебника - это страница, которая кратко описывает, о чем учебник, с помощью поля Summary. Страница должна иметь то же название, что и учебник, и заканчиваться словом 'Tutorial', поскольку введенное вами резюме будет служить подсказкой при упоминании учебника в Docs.",
                    "updated": 1640274677965
                }
            ]
        },
        {
            "style": "Callout",
            "text": "For example, the first page of the Welcome to Superalgos! tutorial is Welcome to Superalgos Tutorial.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Por ejemplo, la primera página del ¡Bienvenido a Superalgos! tutorial es Welcome to Superalgos Tutorial.",
                    "updated": 1640109973544
                },
                {
                    "language": "RU",
                    "text": "Например, первая страница учебника Welcome to Superalgos Tutorial - \"Welcome to Superalgos!\".",
                    "updated": 1640274893159
                }
            ]
        },
        {
            "style": "Text",
            "text": "The page should have an About This Tutorial heading stating what Workspace the tutorial is available in, and who the maintainer is, preferably with basic contact details (Github, Telegram, or Discord user name).",
            "updated": 1621875043974,
            "translations": [
                {
                    "language": "ES",
                    "text": "La página debe tener un Acerca de esto Tutorial encabezado indicando en que Workspace el tutorial está disponible y quién es el mantenedor, preferiblemente con detalles de contacto básicos (nombre de usuario de Github, Telegram o Discord).",
                    "updated": 1640110527097
                },
                {
                    "language": "RU",
                    "text": "На странице должен быть заголовок About This Tutorial, в котором указывается, в каком рабочем пространстве доступен учебник, и кто является его сопровождающим, желательно с основной контактной информацией (имя пользователя Github, Telegram или Discord).",
                    "updated": 1640274941128
                }
            ]
        },
        {
            "style": "Success",
            "text": "See the Welcome to Superalgos Tutorial page for an example.",
            "updated": 1621875007923,
            "translations": [
                {
                    "language": "ES",
                    "text": "Mirar la página del tutorial de bienvenida como ejemplo (Welcome to Superalgos Tutorial).",
                    "updated": 1640114413800
                },
                {
                    "language": "RU",
                    "text": "Пример смотрите на странице Welcome to Superalgos Tutorial.",
                    "updated": 1640274960693
                }
            ]
        },
        {
            "style": "Title",
            "text": "The First Few Steps",
            "translations": [
                {
                    "language": "ES",
                    "text": "The First Few Steps   (Los primeros pasos)",
                    "updated": 1640110548334
                },
                {
                    "language": "RU",
                    "text": "Первые несколько шагов",
                    "updated": 1640274973359
                }
            ]
        },
        {
            "style": "List",
            "text": "Tutorials should start with a welcome message, and a clear explanation of what the tutorial is about, including a brief description of what the user will do while following the tutorial, and what lessons will be learned. No need to compress everything into a single step... two and even three steps are fine.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Los tutoriales deben comenzar con un mensaje de bienvenida y una explicación clara de qué trata el tutorial, incluida una breve descripción de lo que hará el usuario mientras sigue el tutorial y qué lecciones aprenderá. No es necesario comprimir todo en un solo paso ... dos e incluso tres pasos están bien.",
                    "updated": 1640110413442
                },
                {
                    "language": "RU",
                    "text": "Учебники должны начинаться с приветствия и четкого объяснения того, о чем идет речь, включая краткое описание того, что пользователь будет делать, следуя учебнику, и какие уроки он извлечет. Не нужно сжимать все в один шаг... два и даже три шага вполне подойдут.",
                    "updated": 1640275011930
                }
            ]
        },
        {
            "style": "List",
            "text": "If the tutorial requires prior knowledge beyond the tutorials in the Getting Started Plugin Workspace, devote a step to explaining what prior knowledge is required so that users may complete the relevant tutorials first.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si el tutorial requiere conocimientos previos más allá de los tutoriales en el Espacio de trabajo del complemento Getting Started, dedique un paso a explicar qué conocimientos previos se requieren para que los usuarios puedan completar primero los tutoriales relevantes.",
                    "updated": 1640110390869
                },
                {
                    "language": "RU",
                    "text": "Если учебник требует предварительных знаний, выходящих за рамки учебников Getting Started Plugin Workspace, посвятите отдельный шаг объяснению того, какие предварительные знания требуются, чтобы пользователи могли сначала пройти соответствующие учебники.",
                    "updated": 1640275151211
                }
            ]
        },
        {
            "style": "List",
            "text": "You should also take the time to explain what's featured in the Workspace. The idea is that users should get familiar with the workspace as soon as possible, to understand how it may differ from other workspaces they may have encountered earlier. You can mention which mines you will use, clarify if they are added as plugins or not, which trading systems, and so on. You may skip the mandatory hierarchies, like Network or Trading Engine.",
            "updated": 1620198644147,
            "translations": [
                {
                    "language": "ES",
                    "text": "También debe tomarse el tiempo para explicar lo que se presenta en el Workspace. La idea es que los usuarios se familiaricen con el espacio de trabajo lo antes posible para comprender en qué puede diferir de otros espacios de trabajo que hayan encontrado antes. Puede mencionar qué minas utilizará, aclarar si se agregan como complementos o no, qué sistemas de trading, etc. Puede omitir las jerarquías obligatorias, como Red oTrading Engine.",
                    "updated": 1640110371600
                },
                {
                    "language": "RU",
                    "text": "Вы также должны найти время, чтобы объяснить, что именно представлено в рабочем пространстве. Идея заключается в том, что пользователи должны как можно скорее ознакомиться с рабочим пространством, чтобы понять, чем оно может отличаться от других рабочих пространств, с которыми они могли сталкиваться ранее. Вы можете упомянуть, какие именно шахты вы будете использовать, уточнить, добавлены ли они в виде плагинов или нет, какие торговые системы и так далее. Вы можете пропустить обязательные иерархии, такие как Network или Trading Engine.",
                    "updated": 1640275278957
                }
            ]
        },
        {
            "style": "List",
            "text": "If you installed any markets, created custom charts, a particular setup of tasks in the Network hierarchy, or any specific data structure that is not present in the default market installation, make sure you explain what you did and why. It may be confusing for users to find things and not know how they got there.",
            "updated": 1620198654823,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si instaló mercados, creó gráficos personalizados, una configuración particular de tareas en la jerarquía de la red o cualquier estructura de datos específica que no está presente en la instalación de mercado predeterminada, asegúrese de explicar lo que hizo y por qué. Puede resultar confuso para los usuarios encontrar cosas y no saber cómo llegaron allí.",
                    "updated": 1640110306420
                },
                {
                    "language": "RU",
                    "text": "Если вы установили какие-либо рынки, создали пользовательские графики, определенную настройку задач в иерархии Network или какую-либо специфическую структуру данных, которая отсутствует в стандартной установке рынка, обязательно объясните, что вы сделали и почему. Это может сбить пользователей с толку, если они найдут что-то и не будут знать, как они туда попали.",
                    "updated": 1640275329441
                }
            ]
        },
        {
            "style": "Title",
            "text": "The Last Few Steps",
            "translations": [
                {
                    "language": "ES",
                    "text": "The Last Few Steps (Los últimos pasos)",
                    "updated": 1640110568242
                },
                {
                    "language": "RU",
                    "text": "Последние несколько шагов",
                    "updated": 1640275341956
                }
            ]
        },
        {
            "style": "List",
            "text": "If there are more tutorials in the series, make sure you leave users right by the next one, inviting them to keep going.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si hay más tutoriales en la serie, asegúrese de dejar a los usuarios justo al lado del siguiente, invitándolos a continuar.",
                    "updated": 1640110288956
                },
                {
                    "language": "RU",
                    "text": "Если в курсе есть еще несколько уроков, убедитесь, что вы оставляете пользователей прямо перед следующим уроком, приглашая их продолжить.",
                    "updated": 1640275438430
                }
            ]
        },
        {
            "style": "List",
            "text": "If the remaining tutorials in the series are not ready yet, then use the last few steps to describe what else will be covered in the series and ask users to stay tuned.",
            "updated": 1620198840899,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si los tutoriales restantes de la serie aún no están listos, utilice los últimos pasos para describir qué más se cubrirá en la serie y pida a los usuarios que estén atentos.",
                    "updated": 1640110270237
                },
                {
                    "language": "RU",
                    "text": "Если остальные уроки серии еще не готовы, используйте последние несколько шагов, чтобы описать, что еще будет рассмотрено в этих уроках, и попросите пользователей оставаться с нами.",
                    "updated": 1640275561407
                }
            ]
        },
        {
            "style": "Title",
            "text": "Wrapping Up",
            "translations": [
                {
                    "language": "ES",
                    "text": "Wrapping Up  (Terminando)",
                    "updated": 1640110248244
                },
                {
                    "language": "RU",
                    "text": "Подведение итогов",
                    "updated": 1640275578036
                }
            ]
        },
        {
            "style": "Text",
            "text": "When your tutorial is ready and has been reviewed by project maintainers, there a few things you need to take care of so that the workspace and tutorials are easily findable.",
            "updated": 1621875234349,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando su tutorial esté listo y haya sido revisado por los encargados del mantenimiento del proyecto, hay algunas cosas de las que debe ocuparse para poder encontrar fácilmente el espacio de trabajo y los tutoriales.",
                    "updated": 1640110222035
                },
                {
                    "language": "RU",
                    "text": "Когда ваш учебник готов и прошел проверку сопровождающими проекта, вам нужно позаботиться о нескольких вещах, чтобы рабочее пространство и учебники можно было легко найти.",
                    "updated": 1640275603184
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Create a Page for the Workspace",
            "translations": [
                {
                    "language": "ES",
                    "text": "Create a Page for the Workspace  (Crear una página para el espacio de trabajo)",
                    "updated": 1640110203651
                },
                {
                    "language": "RU",
                    "text": "Создайте страницу для рабочего пространства",
                    "updated": 1640275656941
                }
            ]
        },
        {
            "style": "Text",
            "text": "Every workspace must be documented, so make sure you create a page for the workspace in the `Community Workspaces` Topic.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada espacio de trabajo debe estar documentado, así que asegúrese de crear una página para el espacio de trabajo en el tema \"Espacios de trabajo comunitarios\".",
                    "updated": 1640110185150
                },
                {
                    "language": "RU",
                    "text": "Каждое рабочее пространство должно быть документировано, поэтому обязательно создайте для него страницу в теме 'Community Workspaces'.",
                    "updated": 1640275701507
                }
            ]
        },
        {
            "style": "Important",
            "text": "Please use a clear and descriptive name and follow the naming convention ending the name with `Plugin Workspace`. Feel free to consult what a good name may be with other contributors in the Docs Group.",
            "updated": 1621874212145,
            "translations": [
                {
                    "language": "ES",
                    "text": "Utilice un nombre claro y descriptivo y siga la convención de nomenclatura que termina el nombre con \"Espacio de trabajo del complemento\". No dude en consultar cuál puede ser un buen nombre con otros colaboradores del Grupo de Documentos.",
                    "updated": 1640110160309
                },
                {
                    "language": "RU",
                    "text": "Пожалуйста, используйте ясное и описательное название и следуйте соглашению о присвоении имен, заканчивая название словами 'Plugin Workspace'. Не стесняйтесь советоваться о том, каким может быть хорошее название, с другими участниками в группе Docs Group.",
                    "updated": 1640275791724
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "List of Plugin Workspaces and Tutorials",
            "updated": 1621875320874,
            "translations": [
                {
                    "language": "RU",
                    "text": "Список рабочих пространств плагинов и учебников",
                    "updated": 1640275910654
                }
            ]
        },
        {
            "style": "Text",
            "text": "Add the workspace and the tutorial to this list: List of Plugin Workspaces and Tutorials, so that they show up in the First Steps Tutorials book.",
            "updated": 1621875373640,
            "translations": [
                {
                    "language": "ES",
                    "text": "Agregue el espacio de trabajo y el tutorial a esta lista: List of Plugin Workspaces and Tutorials, para que aparezcan en el libro Tutoriales de primeros pasos.",
                    "updated": 1640110079022
                },
                {
                    "language": "RU",
                    "text": "Добавьте рабочее пространство и учебник в этот список: List of Plugin Workspaces and Tutorials, чтобы они отображались в книге First Steps Tutorials.",
                    "updated": 1640275953541
                }
            ]
        },
        {
            "style": "Success",
            "text": "Consult with project mantainers the spot the tutorial should take in the list.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Consulte con los encargados del mantenimiento del proyecto el lugar que debe ocupar el tutorial en la lista.",
                    "updated": 1640110104301
                },
                {
                    "language": "RU",
                    "text": "Посоветуйтесь с кураторами проекта, какое место в списке должно занять учебное пособие.",
                    "updated": 1640275976933
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "First Step Tutorials Book",
            "updated": 1621875396584,
            "translations": [
                {
                    "language": "RU",
                    "text": "Книга First Step Tutorials (\"Первые шаги в обучении\")",
                    "updated": 1640276136767
                }
            ]
        },
        {
            "style": "Text",
            "text": "Add the tutorial as a chapter in the First Steps Tutorials book.",
            "updated": 1621875405546,
            "translations": [
                {
                    "language": "ES",
                    "text": "Agregue el tutorial como un capítulo en el First Steps Tutorials book.",
                    "updated": 1640110131511
                },
                {
                    "language": "RU",
                    "text": "Добавьте учебник в качестве главы в книгу First Steps Tutorials.",
                    "updated": 1640276028702
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}