{
    "type": "Data Mine Products",
    "definition": {
        "text": "Data mine products are references established with data mines to facilitate establishing data product references with multiple products in the given data mine.",
        "translations": [
            {
                "language": "ES",
                "text": "Data mine products son referencias establecidas con minas de datos para facilitar el establecimiento de referencias de productos de datos con múltiples productos en la mina de datos dada.",
                "updated": 1624413245579
            },
            {
                "language": "RU",
                "text": "Data Mine Products - это ссылки, установленные с помощью хранилищ данных, для облегчения установления ссылок на продукты данных с несколькими продуктами в данном хранилище данных.",
                "updated": 1638730619082
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The node may be used as an organizational device, simply to arrange bot products. However, the smart use of the node involves automating the deployment of multiple data products.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел можно использовать как организационное устройство, просто для размещения продуктов ботов. Однако разумное использование узла предполагает автоматизацию развертывания нескольких продуктов данных.",
                    "updated": 1638730436753
                }
            ]
        },
        {
            "style": "Text",
            "text": "The use of the data mine products node is optional, as data products may also exist outside of data mine products nodes.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Использование узла продуктов исследования данных является необязательным, поскольку продукты данных также могут существовать вне узлов продуктов исследования данных.",
                    "updated": 1638730456254
                }
            ]
        }
    ]
}