{
    "type": "Weight Votes",
    "definition": {
        "text": "Weight Votes are a type of vote within the Voting Program used to confer Weight to different types of nodes in the multiple Project Definition Hierarchies. The Weight that Asset, Feature, Position, and Pool nodes get from Weight Votes cast by the Community determines the Token Rewards available as incentives for those nodes. The term Weight Votes is a generalization describing any or all of the types of weight vote nodes, namely Pool Weight Vote, Position Weight Vote, Feature Weight Vote, and Asset Weight Vote.",
        "updated": 1630498313646,
        "translations": [
            {
                "language": "RU",
                "text": "Weight Votes - это тип голосования в программе голосования Voting Program, используемый для присвоения веса Weight различным типам узлов в нескольких иерархиях Project Definition Hierarchies. Вес, который получают узлы Asset, Feature, Position и Pool от голосов Weight Votes, поданных сообществом, определяет награды в виде токенов Token Rewards, доступные в качестве стимулов для этих узлов. Термин Weight Votes является обобщением, описывающим любой или все типы узлов голосования по весу, а именно голосование по весу пула, голосование по весу позиции, голосование по весу характеристик и голосование по весу ресурсов.",
                "updated": 1638621005020
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1630345048703
        },
        {
            "style": "Important",
            "text": "The Weight Power you drive into Weight Votes nodes is significant, as it is a measure of how much you wish to incentivize the referenced node. Nodes in Project Definition Hierarchies get Token Rewards proportional to the Weight Power they get from all Weight Votes they receive!",
            "updated": 1630355171054
        },
        {
            "style": "Success",
            "text": "You may want to learn more about Token Rewards and Voting Power Flow! The page explains how Token Rewards are allocated to each node in the Project Definition Hierarchies depending on the Weight they get from Weight Votes.",
            "updated": 1630498497344
        }
    ]
}