{
    "topic": "Productivity Tools",
    "pageNumber": "3",
    "type": "Shares",
    "definition": {
        "text": "The share feature works almost the same as the back up feature, but discarding personal information like exchange keys.",
        "updated": 1611490590355
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The share feature works almost the same as the back up feature, with the sole difference that shares do not store personal information, like exchange API keys.",
            "updated": 1611490600062
        },
        {
            "style": "Text",
            "text": "On that note, we will not analyze this feature further, other than reminding the user that it is recommended to develop the habit to only share shares and not backups, to avoid the potential accidental dissemination of exchange keys."
        },
        {
            "style": "Callout",
            "text": "On a different note, it is also critical to bring one more issue to your attention regarding sharing work and—what’s more more important— using other people’s work."
        },
        {
            "style": "Text",
            "text": "You may have noticed that the system accepts JavaScript code in a multitude of input forms such as configurations, conditions, formulas and more. At this point, there is no restriction to the code that may be used. This is a design feature, as we wish advanced users to be able to use their programing skills to make the most out of the system."
        },
        {
            "style": "Text",
            "text": "However, this also means that using workspaces or any other data structure coming from untrusted sources is not free of risks. On the contrary, it may be a high-risk choice, as it is possible to introduce malicious code that may, for example, attempt to steal people’s API keys."
        },
        {
            "style": "Warning",
            "text": "Beware of using shared data structures from untrusted sources as they may contain malicious code that could, for example, steal your exchange keys.",
            "updated": 1611490613530
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}