{
    "topic": "TS LF Trading Bot Warnings",
    "pageNumber": "15",
    "type": "TS LF Trading Bot Warning - Order Status Not Sync With Exchange",
    "definition": {
        "text": "For some reason, the trading bot could not verify the status of the order at the exchange. As a consequence, the accounting and other actions related to the order were suspended until the communication with the exchange is reestablished.",
        "updated": 1611922128136,
        "translations": [
            {
                "language": "RU",
                "text": "По какой-то причине торговый бот не смог проверить статус ордера на бирже. Как следствие, учет и другие действия, связанные с ордером, были приостановлены до восстановления связи с биржей.",
                "updated": 1645631692280
            },
            {
                "language": "TR",
                "text": "Özet: Herhangi bir nedenle, ticaret botu borsadaki emrin durumunu doğrulayamadı. Sonuç olarak, borsa ile iletişim yeniden kurulana kadar siparişle ilgili muhasebe ve diğer işlemler askıya alındı.",
                "updated": 1647350818688
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "This is not an error and may be normal behavior. The trading bot created this warning to let you know that this happened so that you may keep track of all the details of the trade should you need to. This page provides information that should help you understand the context of the warning.",
            "updated": 1611922148396,
            "translations": [
                {
                    "language": "RU",
                    "text": "Это не является ошибкой и может быть нормальным поведением. Торговый бот создал это предупреждение, чтобы сообщить вам, что это произошло, чтобы вы могли отследить все детали сделки, если вам это понадобится. На этой странице представлена информация, которая должна помочь вам понять контекст предупреждения.",
                    "updated": 1645631697110
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bu bir hata değildir ve normal davranış olabilir. Ticaret botu bu uyarıyı, bunun gerçekleştiğini size bildirmek için oluşturdu, böylece ihtiyacınız olduğunda alım satımın tüm ayrıntılarını takip edebilirsiniz. Bu sayfa, uyarının içeriğini anlamanıza yardımcı olacak bilgiler sağlar..",
                    "updated": 1647350828890
                }
            ]
        },
        {
            "style": "Warning",
            "text": "Order Status Not Sync With Exchange",
            "translations": [
                {
                    "language": "RU",
                    "text": "Статус ордера не синхронизируется с биржей",
                    "updated": 1645631710973
                },
                {
                    "language": "TR",
                    "text": "Uyarı: Emir Durumu Exchange ile Eşitlenmiyor",
                    "updated": 1647350887366
                }
            ]
        },
        {
            "style": "Title",
            "text": "Context Info",
            "translations": [
                {
                    "language": "RU",
                    "text": "Контекстная информация",
                    "updated": 1645631715774
                },
                {
                    "language": "TR",
                    "text": "İçerik Bilgisi",
                    "updated": 1647352243461
                }
            ]
        },
        {
            "style": "Text",
            "text": "Find below the values of variables relevant to the warning at the time the warning was created. They may prove of use to understand what happened.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Ниже приведены значения переменных, относящихся к предупреждению на момент его создания. Они могут оказаться полезными для понимания того, что произошло.",
                    "updated": 1645631720148
                },
                {
                    "language": "TR",
                    "text": "Uyarının oluşturulduğu anda uyarıyla ilgili değişkenlerin değerlerini aşağıda bulun. Neler olduğunu anlamak için faydalı olabilirler.",
                    "updated": 1647352253300
                }
            ]
        },
        {
            "style": "Placeholder",
            "text": "contextInfo"
        },
        {
            "style": "Title",
            "text": "Learn More",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узнать больше",
                    "updated": 1645631727770
                },
                {
                    "language": "TR",
                    "text": "Daha Fazlasını Öğrenin",
                    "updated": 1647352261418
                }
            ]
        },
        {
            "style": "Text",
            "text": "To learn more about this topic, please read the following page:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы узнать больше об этой теме, прочтите следующую страницу:",
                    "updated": 1645631733178
                },
                {
                    "language": "TR",
                    "text": "Bu konu hakkında daha fazla bilgi edinmek için lütfen aşağıdaki sayfayı okuyun:",
                    "updated": 1647352270466
                }
            ]
        },
        {
            "style": "List",
            "text": "Checking Exchange Events",
            "updated": 1611921970650,
            "translations": [
                {
                    "language": "TR",
                    "text": "Exchange Etkinliklerini Kontrol Etme ( Checking Exchange Events )",
                    "updated": 1647352302856
                }
            ]
        },
        {
            "style": "List",
            "text": "Syncing With the Exchange",
            "translations": [
                {
                    "language": "TR",
                    "text": "Exchange ile Senkronizasyon ( Syncing With the Exchange )",
                    "updated": 1647352324418
                }
            ]
        }
    ]
}