{
    "type": "Foundations Project",
    "definition": {
        "text": "The Foundations Project hierarchy governs the assets that relate to Superalgos. In its current state, it serves the purpose of spawning hierarchies.",
        "translations": [
            {
                "language": "RU",
                "text": "Иерархия Foundations Project управляет ресурсами, относящимися к Superalgos. В своем нынешнем состоянии он служит для создания иерархий.",
                "updated": 1638276594051
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Superalgos is a multi-project platform meaning that other crypto-projects may be integrated. It is in this context that project-specific hierarchies exist.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Superalgos - это многопроектная платформа, что означает, что другие криптопроекты могут быть интегрированы. Именно в этом контексте существуют иерархии для конкретных проектов.",
                    "updated": 1638276710567
                }
            ]
        },
        {
            "style": "Text",
            "text": "A crypto-project integration means that Superalgos users will able to connect to blockchain nodes from within Superalgos, exposing the blockchain data to the rest of the Superalgos infrastructure. Users will be able to mine the node's data, build indicators, use them from within trading systems, and visualize blockchain information on the charts&mdash;among other things.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Интеграция криптопроекта означает, что пользователи Superalgos смогут подключаться к узлам блокчейна изнутри Superalgos, предоставляя данные блокчейна остальной части инфраструктуры Superalgos. Пользователи смогут добывать данные узла, создавать индикаторы, использовать их из торговых систем, и визуализировать информацию о блокчейне на диаграммах.",
                    "updated": 1638337972321
                }
            ]
        }
    ]
}