{
    "type": "Task Server App Reference",
    "definition": {
        "text": "This node stores a reference to the Task Server App node allowing its parent Task to access the Signing Account of the current user's task server.  ",
        "updated": 1642820724358,
        "translations": [
            {
                "language": "RU",
                "text": "Этот узел хранит ссылку на узел Task Server App, позволяющий его родительской задаче получить доступ к учетной записи подписи сервера задач текущего пользователя.",
                "updated": 1645183442185
            },
            {
                "language": "TR",
                "text": "Bu düğüm, üst görevdeki (Task) geçerli kullanıcının görev sunucusunun, İmzalama Hesabına (Signing Account) erişmesine izin veren Görev Sunucusu Uygulaması (Task Server App) düğümüne bir referans depolar.",
                "updated": 1666689514950
            },
            {
                "language": "DE",
                "text": "Dieser Knoten speichert einen Verweis auf den Knoten Task Server App, der es dem übergeordneten Task ermöglicht, auf das Signing Account des Taskservers des aktuellen Benutzers zuzugreifen. ",
                "updated": 1704581547114
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "By having access to the User's signing account, the current task will now be able to access the Superalgos peer to peer network.",
            "updated": 1642820815167,
            "translations": [
                {
                    "language": "RU",
                    "text": "Получив доступ к учетной записи пользователя, текущая задача теперь сможет получить доступ к одноранговой сети Superalgos.",
                    "updated": 1645183452744
                },
                {
                    "language": "TR",
                    "text": "Kullanıcının imzalama hesabına erişim sağlayarak, mevcut görev artık Superalgos eşler arası ağa erişebilecek.",
                    "updated": 1666689551602
                },
                {
                    "language": "DE",
                    "text": "Durch den Zugriff auf das Benutzerkonto kann die aktuelle Aufgabe nun auf das Superalgos Peer-to-Peer-Netzwerk zugreifen.",
                    "updated": 1704578435012
                }
            ]
        }
    ]
}