{
    "type": "Trading Mine",
    "definition": {
        "text": "A trading mine is a hierarchy that contains definitions of trading bots and their plotters. These definitions make up the actual programs of such bots&mdash;the source code.",
        "translations": [
            {
                "language": "ES",
                "text": "Un trading mine es una jerarquía que contiene definiciones de trading bots y sus conspiradores. Estas definiciones constituyen los programas reales de dichos bots: el código fuente.",
                "updated": 1628906153772
            },
            {
                "language": "RU",
                "text": "Trading Mine - это иерархия, которая содержит определения торговых ботов и их плоттеры. Эти определения составляют фактические программы таких ботов - исходный код.",
                "updated": 1638338598326
            },
            {
                "language": "EL",
                "text": "Ένα εξορυκτήριο συναλλαγών είναι μια ιεραρχία που περιέχει ορισμούς των ρομπότ συναλλαγών και των σχεδιογράφων τους. Αυτοί οι ορισμοί αποτελούν τα πραγματικά προγράμματα τέτοιων ρομπότ - τον πηγαίο κώδικα.",
                "updated": 1641828114919
            },
            {
                "language": "DE",
                "text": "Eine Trading Mine ist eine Hierarchie, die Definitionen von Trading Bots und deren Plotter enthält. Diese Definitionen bilden die eigentlichen Programme solcher Bots - den Quellcode.",
                "updated": 1641762683041
            },
            {
                "language": "TR",
                "text": "Ticaret madeni, ticaret botlarının ve çizicilerinin tanımlarını içeren bir hiyerarşidir. Bu tanımlar, bu tür botların gerçek programlarını, yani kaynak kodunu oluşturur.",
                "updated": 1651949101369
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Although Superalgos is starting out with a single trading bot, the system is prepared to feature as many trading bots as developers are willing to create. As such, a trading mine is a catalog of trading bots.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Хотя Superalgos начинает с одного торгового бота, система готова включать в себя столько торговых ботов, сколько разработчики готовы создать. Таким образом, Trading Mine представляет собой каталог торговых ботов.",
                    "updated": 1638338508685
                },
                {
                    "language": "EL",
                    "text": "Αν και το Superalgos ξεκινά με ένα μόνο ρομπότ συναλλαγών, το σύστημα είναι έτοιμο να διαθέτει τόσα ρομπότ συναλλαγών όσα είναι πρόθυμοι να δημιουργήσουν οι προγραμματιστές. Ως εκ τούτου, ένα εξορυκτήριο συναλλαγών είναι ένας κατάλογος ρομπότ συναλλαγών.",
                    "updated": 1641828159193
                },
                {
                    "language": "DE",
                    "text": "Obwohl Superalgos mit einem einzigen Trading Bot startet, ist das System darauf vorbereitet, so viele Trading Bots zu enthalten, wie Entwickler bereit sind zu erstellen. Eine Trading Mine ist also ein Katalog von Trading Bots.",
                    "updated": 1641762799037
                },
                {
                    "language": "TR",
                    "text": "Superalgos tek bir ticaret botu ile başlasa da, sistem geliştiricilerin yaratmaya istekli olduğu kadar çok ticaret botu içerecek şekilde hazırlanmıştır. Bu nedenle, bir ticaret madeni bir ticaret botları kataloğudur.",
                    "updated": 1651949164355
                }
            ]
        },
        {
            "style": "Text",
            "text": "Notice that, in the context of Superalgos, a trading bot has nothing to do with the trading logic. Think of trading logic as the business rules which—in Superalgos—are defined in trading systems. Anyone may build a Trading System, meaning that creating trading systems and the trading strategies within does not require coding.",
            "updated": 1609861342619,
            "translations": [
                {
                    "language": "RU",
                    "text": "Обратите внимание, что в контексте Superalgos торговый бот не имеет ничего общего с торговой логикой. Думайте о торговой логике как о бизнес-правилах, которые - в Superalgos - определены в торговых системах. Любой может создать торговую систему, а это означает, что создание торговых систем и торговых стратегий внутри нее не требует программирования.",
                    "updated": 1638338537661
                },
                {
                    "language": "EL",
                    "text": "Παρατηρήστε ότι, στο πλαίσιο του Superalgos, ένα bot συναλλαγών δεν έχει καμία σχέση με τη λογική των συναλλαγών. Σκεφτείτε τη λογική των συναλλαγών ως τους επιχειρηματικούς κανόνες που —στο Superalgos— ορίζονται στα συστήματα συναλλαγών. Οποιοσδήποτε μπορεί να δημιουργήσει ένα Trading System (Σύστημα Συναλλαγών), που σημαίνει ότι η δημιουργία συστημάτων συναλλαγών και των στρατηγικών των συναλλαγών εντός, δεν απαιτεί κωδικοποίηση",
                    "updated": 1641828249128
                },
                {
                    "language": "DE",
                    "text": "Beachten Sie, dass im Kontext von Superalgos ein Trading-Bot nichts mit der Handelslogik zu tun hat. Stellen Sie sich die Handelslogik als die Geschäftsregeln vor, die in Superalgos in Trading Systems definiert sind. Jeder kann ein Trading-System erstellen, was bedeutet, dass die Erstellung von Trading-Systemen und den darin enthaltenen Trading-Strategien keine Kodierung erfordert.",
                    "updated": 1641762809287
                },
                {
                    "language": "TR",
                    "text": "Superalgos bağlamında, bir ticaret botunun ticaret mantığıyla hiçbir ilgisi olmadığına dikkat edin. Ticaret mantığını, Superalgos'ta ticaret sistemlerinde tanımlanan iş kuralları olarak düşünün. Herkes bir Ticaret Sistemi ( Trading System ) kurabilir, yani ticaret sistemleri ve içindeki ticaret stratejileri oluşturmak kodlama gerektirmez.",
                    "updated": 1651949231362
                }
            ]
        },
        {
            "style": "Text",
            "text": "Trading mines work similarly to data mines in the sense that they provide the same kind of tools to structure the definitions of bots, including process definitions, product definitions, and plotters.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Trading Mine работает аналогично Data Mine в том смысле, что они предоставляют те же инструменты для структурирования определений ботов, включая определения процессов, определения продуктов и плоттеры.",
                    "updated": 1638338689173
                },
                {
                    "language": "EL",
                    "text": "Τα Trading mines (εξορυκτήρια Συναλλαγών) λειτουργούν παρόμοια με τα εξορυκτήρια δεδομένων με την έννοια ότι παρέχουν το ίδιο είδος εργαλείων για τη δομή των ορισμών των ρομπότ, συμπεριλαμβανομένων των ορισμών διαδικασίας, των ορισμών προϊόντων και των σχεδιογράφων.",
                    "updated": 1641828289276
                },
                {
                    "language": "DE",
                    "text": "Trading Mines funktionieren ähnlich wie Data Mines in dem Sinne, dass sie die gleiche Art von Werkzeugen zur Strukturierung der Definitionen von Bots bereitstellen, einschließlich Prozessdefinitionen, Produktdefinitionen und Plotter.",
                    "updated": 1641762819358
                },
                {
                    "language": "TR",
                    "text": "Ticaret madenleri, süreç tanımları, ürün tanımları ve çiziciler dahil olmak üzere bot tanımlarını yapılandırmak için aynı tür araçları sağladıkları anlamında veri madenlerine benzer şekilde çalışır.",
                    "updated": 1651949279990
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Trading Mine Configuration",
            "updated": 1609861240385,
            "translations": [
                {
                    "language": "RU",
                    "text": "Настройка Trading Mine",
                    "updated": 1638338789550
                },
                {
                    "language": "DE",
                    "text": "Trading Mine Konfiguration",
                    "updated": 1641762839499
                },
                {
                    "language": "TR",
                    "text": "Ticaret Madeni Yapılandırması",
                    "updated": 1651949295995
                }
            ]
        }
    ]
}