{
    "type": "Tokens Awarded",
    "definition": {
        "text": "The Tokens Awarded node represents the number of tokens you get in reward for your contributions. The node is present on many of the Governance Programs.",
        "updated": 1630436769778,
        "translations": [
            {
                "language": "ES",
                "text": "El nodo de tokens otorgados representa la cantidad de tokens que obtiene como recompensa por sus contribuciones. El nodo está presente en muchos de los Governance Programs.",
                "updated": 1637848415668
            },
            {
                "language": "RU",
                "text": "Узел Tokens Awarded представляет собой количество токенов, которые вы получаете в качестве вознаграждения за свой вклад. Узел присутствует во многих программах управления.",
                "updated": 1639126916482
            },
            {
                "language": "TR",
                "text": "Kazanılan Tokenler düğümü, katkılarınız karşılığında ödül olarak aldığınız token sayısını temsil eder. Bu düğüm birçok Yönetim Programında ( Governance Programs ) mevcuttur.",
                "updated": 1671810254677
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624726389898
        },
        {
            "style": "Text",
            "text": "The information on how many tokens the particular program has awarded you is displayed as a notice below the node, along with other relevant information that depends on the context, like the number of people that helped you get them, or the number of claims computed, etc.",
            "updated": 1630095366072,
            "translations": [
                {
                    "language": "ES",
                    "text": "La información sobre cuántos tokens le ha otorgado el programa en particular se muestra como un aviso debajo del nodo, junto con otra información relevante que depende del contexto, como la cantidad de personas que lo ayudaron a obtenerlos o la cantidad de reclamos calculados, etc.",
                    "updated": 1637848456975
                },
                {
                    "language": "RU",
                    "text": "Информация о том, сколько токенов присудила вам конкретная программа, отображается в виде уведомления под узлом вместе с другой соответствующей информацией, которая зависит от контекста, например, количество людей, которые помогли вам их получить, или количество вычисленных требований, и т. д.",
                    "updated": 1639126958566
                },
                {
                    "language": "TR",
                    "text": "Belirli bir programın size kaç token verdiğine ilişkin bilgiler, bunları almanıza yardımcı olan kişi sayısı veya hesaplanan talep sayısı gibi duruma göre değişen diğer ilgili bilgilerle birlikte düğümün altında bir bildirim olarak görüntülenir.",
                    "updated": 1671810351941
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Calculations",
            "updated": 1630324592451,
            "translations": [
                {
                    "language": "RU",
                    "text": "Расчеты",
                    "updated": 1639126974031
                },
                {
                    "language": "TR",
                    "text": "Hesaplamalar (Calculations)",
                    "updated": 1671810394597
                }
            ]
        },
        {
            "style": "Note",
            "text": "Each program calculates Tokens Awarded in a particular way. Follow the links below to learn the details about each program.",
            "updated": 1630324671871,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada prgrama calcula Tokens Awarded de un modo particular.Siga los enlaces a continuación para conocer los detalles de cada programa.",
                    "updated": 1637848524992
                },
                {
                    "language": "RU",
                    "text": "Каждая программа подсчитывает полученные токены Tokens Awarded определенным образом. Перейдите по ссылкам ниже, чтобы узнать подробности о каждой программе.",
                    "updated": 1639127019179
                },
                {
                    "language": "TR",
                    "text": "Her program Kazanılan Tokenleri belirli bir şekilde hesaplar. Her programla ilgili ayrıntıları öğrenmek için aşağıdaki bağlantıları takip edin.",
                    "updated": 1671810478344
                }
            ]
        },
        {
            "style": "List",
            "text": "In the Airdrop Program.",
            "updated": 1630324552707,
            "translations": [
                {
                    "language": "ES",
                    "text": "En el Airdrop Program.",
                    "updated": 1637848536168
                },
                {
                    "language": "RU",
                    "text": "В программе Airdrop Program.",
                    "updated": 1639127049718
                },
                {
                    "language": "TR",
                    "text": "Airdrop Programında ( Airdrop Program ).",
                    "updated": 1671810548534
                }
            ]
        },
        {
            "style": "List",
            "text": "In the Github Program.",
            "updated": 1630324714648,
            "translations": [
                {
                    "language": "ES",
                    "text": "En el  Github Program.",
                    "updated": 1637848540889
                },
                {
                    "language": "RU",
                    "text": "В программе Github Program.",
                    "updated": 1639127060031
                },
                {
                    "language": "TR",
                    "text": "Github Programında ( Github Program ).",
                    "updated": 1671810596731
                }
            ]
        },
        {
            "style": "List",
            "text": "The Community Building Programs node page explains how Tokens Awarded is calculated for the referral, support, and mentorship programs.",
            "updated": 1630324749961,
            "translations": [
                {
                    "language": "ES",
                    "text": "La página de los nodos de Community Building Programs  explica como el Tokens Awarded es calculado para los programas de referido, soporte y mentoria.",
                    "updated": 1637848710841
                },
                {
                    "language": "RU",
                    "text": "На странице узла Community Building Programs объясняется, как рассчитываются полученные токены Tokens Awarded для программ Referral Program, Support Program и Mentorship Program.",
                    "updated": 1639127211509
                },
                {
                    "language": "TR",
                    "text": "Topluluk Oluşturma Programları ( Community Building Programs ) düğüm sayfası, yönlendirme, destek ve mentorluk programları için Verilen Tokenlerin nasıl hesaplandığını açıklamaktadır.",
                    "updated": 1671810733221
                }
            ]
        },
        {
            "style": "List",
            "text": "The How Claims are Resolved page explains how tokens are awarded in the Claims Program.",
            "translations": [
                {
                    "language": "ES",
                    "text": "La página How Claims are Resolved ( Cómo se resuelven las solicitudes ) explica como los tokens son recompensados en el Claims Program.",
                    "updated": 1637848835630
                },
                {
                    "language": "RU",
                    "text": "На странице How Claims are Resolved объясняется, как награждаются жетоны в программе Claims Program.",
                    "updated": 1639127305353
                },
                {
                    "language": "TR",
                    "text": "Talepler Nasıl Çözülümlenir ( How Claims are Resolved ) sayfası, Talep Programındaki ( Claims Program ) Tokenlerin nasıl verildiği açıklanmaktadır.",
                    "updated": 1671811082293
                }
            ]
        },
        {
            "style": "List",
            "text": "In the Staking Program.",
            "translations": [
                {
                    "language": "ES",
                    "text": "En el Staking Program.",
                    "updated": 1637848846372
                },
                {
                    "language": "RU",
                    "text": "В программе Staking Program.",
                    "updated": 1639127320062
                },
                {
                    "language": "TR",
                    "text": "Staking Programında ( Staking Program ).",
                    "updated": 1671811162610
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Block",
            "text": "Configuration"
        }
    ]
}