{
    "type": "Technical term overview",
    "definition": {
        "text": "This article was created to show you which terms you should not translate because they are a fixed term. An example is the word Node. Created and maintained by gitforkgit.",
        "updated": 1638052921801,
        "translations": [
            {
                "language": "DE",
                "text": "Dieser Artikel wurde erstellt, um Ihnen zu zeigen, welche Begriffe Sie nicht übersetzen sollten, weil sie ein fester Begriff sind. Ein Beispiel ist das Wort Node. Erstellt und gepflegt von gitforkgit",
                "updated": 1698614312184
            },
            {
                "language": "RU",
                "text": "Эта статья была создана для того, чтобы показать вам, какие термины не следует переводить, потому что они являются фиксированным термином. Примером может служить слово Node. Создана и поддерживается gitforkgit.",
                "updated": 1645079902152
            },
            {
                "language": "TR",
                "text": "Bu makale, sabit bir terim oldukları için hangi terimleri çevirmemeniz gerektiğini göstermek için oluşturulmuştur. Örnek olarak Node kelimesi verilebilir. gitforkgit tarafından oluşturulmuş ve sürdürülmüştür.",
                "updated": 1654390445465
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "One of our goals is to make Superalgos available for everyone for free and open source forever. For this, translations are extremely important and essential. However, there are some technical terms that should not be translated. Because otherwise it could be difficult when describing problems to others, start contributing, understanding superalgos...",
            "updated": 1638052177612,
            "translations": [
                {
                    "language": "RU",
                    "text": "Одна из наших целей - сделать Superalgos доступным для всех бесплатно и с открытым исходным кодом навсегда. Для этого переводы чрезвычайно важны и необходимы. Однако есть некоторые технические термины, которые не следует переводить. Потому что иначе могут возникнуть трудности при описании проблем другим людям, при внесении вклада, при изучении Superalgos...",
                    "updated": 1645079949133
                },
                {
                    "language": "TR",
                    "text": "Hedeflerimizden biri Superalgos'u sonsuza kadar ücretsiz ve açık kaynak olarak herkesin kullanımına sunmaktır. Bunun için çeviriler son derece önemli ve gereklidir. Ancak, çevrilmemesi gereken bazı teknik terimler vardır.Aksi takdirde sorunları başkalarına anlatırken, katkıda bulunmaya başlarken, Superalgos'u anlamak zor olabilir...",
                    "updated": 1656946338649,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Eines unserer Ziele ist es, Superalgos für jeden kostenlos und quelloffen für immer verfügbar zu machen. Hierfür sind Übersetzungen extrem wichtig und unerlässlich. Allerdings gibt es einige Fachbegriffe, die nicht übersetzt werden sollten. Denn sonst könnte es schwierig werden, anderen Probleme zu beschreiben, einen Beitrag zu leisten, Superalgos zu verstehen...",
                    "updated": 1698614334847
                }
            ]
        },
        {
            "style": "Text",
            "text": "\"Below here is a table in which the terms are listed. Here the translators can orient themselves and each Superalgos user add terms of which he thinks that they should not be translated. If you translate articles please look here from time to time to see which terms you should leave as they are in the original. Translations in brackets behind the terms themselves are of course legitimate and welcome by readers of the articles.",
            "updated": 1638052195441,
            "translations": [
                {
                    "language": "RU",
                    "text": "Ниже приведена таблица, в которой перечислены термины. Здесь переводчики могут сориентироваться, а каждый пользователь Superalgos добавить термины, которые, по его мнению, не следует переводить. Если вы переводите статьи, пожалуйста, заглядывайте сюда время от времени, чтобы узнать, какие термины следует оставить в оригинале. Переводы в скобках за самими терминами, конечно, законны и приветствуются читателями статей.",
                    "updated": 1645079994853
                },
                {
                    "language": "TR",
                    "text": "\"Aşağıda terimlerin listelendiği bir tablo yer almaktadır. Burada çevirmenler kendilerini yönlendirebilir ve her Superalgos kullanıcısı çevrilmemesi gerektiğini düşündüğü terimleri ekleyebilir. Eğer makaleleri çeviriyorsanız, hangi terimleri orijinalinde olduğu gibi bırakmanız gerektiğini görmek için lütfen zaman zaman buraya bakın. Terimlerin arkasındaki parantez içindeki çeviriler elbette meşrudur ve makalelerin okuyucuları tarafından memnuniyetle karşılanır.",
                    "updated": 1654390457320,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "\"Hier unten ist eine Tabelle, in der die Begriffe aufgelistet sind. Hier können sich die Übersetzer orientieren und jeder Superalgos-Nutzer kann Begriffe hinzufügen, von denen er meint, dass sie nicht übersetzt werden sollten. Wenn Sie Artikel übersetzen, schauen Sie bitte von Zeit zu Zeit hier nach, welche Begriffe Sie so lassen sollten, wie sie im Original stehen. Übersetzungen in Klammern hinter den Begriffen selbst sind natürlich legitim und von den Lesern der Artikel willkommen.",
                    "updated": 1698614360984
                }
            ]
        },
        {
            "style": "Success",
            "text": "Feel free to add Terms in the table!",
            "updated": 1638052209974,
            "translations": [
                {
                    "language": "RU",
                    "text": "Не стесняйтесь добавлять термины в таблицу!",
                    "updated": 1645080010792
                },
                {
                    "language": "TR",
                    "text": "Tabloya Terimler eklemekten çekinmeyin!",
                    "updated": 1654390463600,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Fügen Sie gerne Begriffe in die Tabelle ein!",
                    "updated": 1698614380007
                }
            ]
        },
        {
            "style": "Note",
            "text": "Terms that should remain original in the translations of articles:",
            "updated": 1638052228369,
            "translations": [
                {
                    "language": "RU",
                    "text": "Термины, которые должны оставаться оригинальными в переводах статей:",
                    "updated": 1645080021108
                },
                {
                    "language": "TR",
                    "text": "Makale çevirilerinde orijinal kalması gereken terimler:",
                    "updated": 1654390469791,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Begriffe, die in den Übersetzungen von Artikeln im Original bleiben sollten:",
                    "updated": 1698614422864
                }
            ]
        },
        {
            "style": "Table",
            "text": "|Workspace Terms|Node Terms|Other Technical Terms|Workspace Terms translation|Node Terms translation|Other Technical Terms translation|\n|Pin/Unpin|Node|add terms here|add Term translation here|add Term translation here|add Term translation here|\n|add terms here|Parent Node|add terms here|add Term translation here|add Term translation here|add Term translation here|\n|add terms here|Child Node|add terms here|add Term translation here|add Term translation here|add Term translation here|\n|add terms here|add terms here|add terms here|add Term translation here|add Term translation here|add Term translation here|",
            "updated": 1638052333924
        },
        {
            "style": "List",
            "text": "Workspace terms -> all Technical Terms related to the Workspace",
            "updated": 1638487168731,
            "translations": [
                {
                    "language": "RU",
                    "text": "Термины рабочего пространства (\"Workspace terms\") -> все технические термины, относящиеся к рабочему пространству",
                    "updated": 1645080067297
                },
                {
                    "language": "TR",
                    "text": "Çalışma Alanı terimleri -> Çalışma Alanıyla ilgili tüm Teknik Terimler",
                    "updated": 1654390475627,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Begriffe des Arbeitsbereichs (Workspace) -> alle technischen Begriffe im Zusammenhang mit dem Arbeitsbereich (Workspace)",
                    "updated": 1698614514229
                }
            ]
        },
        {
            "style": "List",
            "text": "node Terms ->  all Technical Terms related to Nodes ",
            "translations": [
                {
                    "language": "RU",
                    "text": "термины узлов (\"node Terms\") -> все технические термины, связанные с узлами",
                    "updated": 1645080079638
                },
                {
                    "language": "TR",
                    "text": "Düğüm Terimleri -> Düğümlerle ilgili tüm Teknik Terimler",
                    "updated": 1654390483239,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Knotenbegriffe -> alle Fachbegriffe zum Thema Knoten",
                    "updated": 1698614523854
                }
            ]
        },
        {
            "style": "List",
            "text": "Other Technical Terms ->  all Technical Terms that dont fit the other categories",
            "translations": [
                {
                    "language": "RU",
                    "text": "Другие технические термины -> все технические термины, которые не входят в другие категории",
                    "updated": 1645080102946
                },
                {
                    "language": "TR",
                    "text": "Diğer Teknik Terimler -> diğer kategorilere uymayan tüm Teknik Terimler",
                    "updated": 1654390489615,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Sonstige Fachbegriffe -> alle Fachbegriffe, die nicht in die anderen Kategorien passen",
                    "updated": 1698614531968
                }
            ]
        },
        {
            "style": "Note",
            "text": "In the columns with translation as their header you can add the translation into your language, if your language is selected in the footer, otherwise the translations would be globally in the table what isn`t the Goal.",
            "updated": 1638486873653,
            "translations": [
                {
                    "language": "RU",
                    "text": "В колонках с переводом в качестве заголовка вы можете добавить перевод на ваш язык, если ваш язык выбран в нижнем колонтитуле, иначе переводы будут глобально в таблице, что не является целью.",
                    "updated": 1645080165756
                },
                {
                    "language": "TR",
                    "text": "Üstbilgisi çeviri olan sütunlarda, diliniz altbilgide seçiliyse çeviriyi kendi dilinize ekleyebilirsiniz, aksi takdirde çeviriler Hedef olmayan tabloda küresel olarak yer alır.",
                    "updated": 1654390495521,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "In den Spalten mit der Übersetzung als Kopfzeile können Sie die Übersetzung in Ihre Sprache hinzufügen, wenn Ihre Sprache in der Fußzeile ausgewählt ist, ansonsten würden die Übersetzungen global in der Tabelle erscheinen, was nicht das Ziel ist.",
                    "updated": 1698614543384
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}