{
    "type": "Execution Environment",
    "definition": {
        "text": "When a TensorFlow.js program is executed, the specific configuration is called the execution environment. The Execution Environment is comprised of a single global backend as well as a set of flags that control fine-grained features of TensorFlow.js.",
        "updated": 1613060399329,
        "translations": [
            {
                "language": "RU",
                "text": "Когда программа TensorFlow.js выполняется, конкретная конфигурация называется средой выполнения. Среда выполнения состоит из одного глобального бэкенда, а также набора флагов, которые управляют тонкими функциями TensorFlow.js.",
                "updated": 1645247804549
            },
            {
                "language": "TR",
                "text": "Bir TensorFlow.js programı yürütüldüğünde, belirli yapılandırmaya yürütme ortamı denir. Yürütme Ortamı, tek bir global arka ucun yanı sıra TensorFlow.js'nin ince taneli özelliklerini kontrol eden bir dizi bayraktan oluşur.",
                "updated": 1654397100984
            },
            {
                "language": "DE",
                "text": "Wenn ein TensorFlow.js Programm ausgeführt wird, wird die spezifische Konfiguration als Ausführungsumgebung bezeichnet. Die Ausführungsumgebung besteht aus einem einzigen globalen Backend sowie einer Reihe von Flags, die feinkörnige Eigenschaften von TensorFlow.js steuern.",
                "updated": 1707239488565
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645247810001
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397108633,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1707239496944
                }
            ]
        }
    ]
}