{
    "type": "Mentorship Program",
    "definition": {
        "text": "Becoming proficient enough with Superalgos to the point in which you may produce valuable contributions may be a lengthy process. The mentorship program incentivizes deep collaboration, apprenticeship,  and the formation of Contributors.",
        "updated": 1630232204309,
        "translations": [
            {
                "language": "ES",
                "text": "Llegar a ser lo suficientemente competente con Superalgos hasta el punto en que pueda producir contribuciones valiosas puede ser un proceso largo. El programa de mentores incentiva la colaboración profunda, el aprendizaje y la formación de Colaboradores.",
                "updated": 1637848935693
            },
            {
                "language": "RU",
                "text": "Стать достаточно опытным в работе с Superalgos до такой степени, чтобы вы могли внести ценный вклад, может быть длительным процессом. Программа наставничества стимулирует глубокое сотрудничество, обучение и формирование участников.",
                "updated": 1638985712720
            },
            {
                "language": "TR",
                "text": "Değerli katkılar üretebileceğiniz noktaya kadar Superalgos'ta yeterince yetkin olmak uzun bir süreç olabilir. Mentorluk programı, derin işbirliğini, çıraklığı ve Katkıda Bulunanların oluşumunu teşvik eder.",
                "updated": 1645100440566
            },
            {
                "language": "DE",
                "text": "Es kann ein langwieriger Prozess sein, sich mit Superalgos so weit vertraut zu machen, dass Sie wertvolle Beiträge leisten können. Das Mentorenprogramm bietet Anreize für eine intensive Zusammenarbeit, die Ausbildung und die Bildung von Beitragenden.",
                "updated": 1707857688356
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624727362222
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Featuring Tokens Bonus",
            "updated": 1630232231414
        },
        {
            "style": "Text",
            "text": "With this program, you may earn Superalgos SA Tokens for every user you mentor, and also for the users they mentor!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Con este programa, puede ganar Superalgos SA Tokens por cada usuario que mentoree, ¡y también por los usuarios a los que ellos mentoreen!",
                    "updated": 1637849011950
                },
                {
                    "language": "RU",
                    "text": "С помощью этой программы вы можете зарабатывать токены Superalgos SA Token за каждого пользователя, которого вы наставляете, а также за пользователей, которых они наставляют!",
                    "updated": 1638985744682
                },
                {
                    "language": "TR",
                    "text": "Bu programla, mentorluk yaptığınız her kullanıcı ve ayrıca onların mentorluk yaptıkları kullanıcılar için Superalgos SA Tokenları kazanabilirsiniz!",
                    "updated": 1645100467479
                },
                {
                    "language": "DE",
                    "text": "Mit diesem Programm können Sie Superalgos SA Token für jeden Benutzer verdienen, den Sie betreuen, und auch für die Benutzer, die sie betreuen!",
                    "updated": 1707857705115
                }
            ]
        },
        {
            "style": "Callout",
            "text": "To participate, you must spawn the Mentorship Program and declare your mentors. To do that, add a User Mentor node and use it to establish a reference to the User Profile of the person that mentored you. If you have more than one mentor, add more User Mentor nodes!",
            "updated": 1630232305651,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para participar, debe desplegar el  Mentorship Program ( programa de mentoría) y declarar sus mentores. Para hacer esto, agregue el nodo del User Mentor yuselo para establecer una referencia al User Profile de la persona que le ha mentoreado. Si tiene más de un mentor, agregue más nodos de User Mentor!",
                    "updated": 1637849198793
                },
                {
                    "language": "RU",
                    "text": "Для участия вы должны запустить программу наставничества Mentorship Program и объявить своих наставников. Для этого добавьте узел User Mentor и используйте его, чтобы установить ссылку на профиль пользователя человека, который вас наставлял. Если у вас более одного наставника, добавьте больше узлов User Mentor!",
                    "updated": 1638985805015
                },
                {
                    "language": "TR",
                    "text": "Katılmak için Mentorluk Programını oluşturmalı ve mentorlarınızı beyan etmelisiniz. Bunu yapmak için bir Kullanıcı Mentoru (User Mentor) düğümü ekleyin ve bunu size akıl hocalığı yapan kişinin Kullanıcı Profiline referans oluşturmak için kullanın. Birden fazla mentorunuz varsa, daha fazla User Mentor düğümü ekleyin!",
                    "updated": 1645100511560
                },
                {
                    "language": "DE",
                    "text": "Um teilzunehmen, müssen Sie das Mentorenprogramm ins Leben rufen und Ihre Mentoren benennen. Fügen Sie dazu einen Benutzer-Mentor-Knoten (User Mentor node) hinzu und verwenden Sie ihn, um einen Verweis auf das Benutzerprofil (User Profile) der Person einzurichten, die Sie betreut hat. Wenn Sie mehr als einen Mentor haben, fügen Sie weitere Benutzer-Mentor-Knoten (User Mentor nodes) hinzu!",
                    "updated": 1707857777427
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos is meant to grow into a massive global collaboration. To do that, the project needs an ever-growing group of Contributors!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Superalgos está destinado a convertirse en una colaboración global masiva. ¡Para hacer eso, el proyecto necesita un grupo cada vez mayor de Colaboradores!",
                    "updated": 1637849221755
                },
                {
                    "language": "RU",
                    "text": "Superalgos призван превратиться в крупномасштабное глобальное сотрудничество. Для этого проекту нужна постоянно растущая группа авторов!",
                    "updated": 1638985832260
                },
                {
                    "language": "TR",
                    "text": "Superalgos'un büyük bir küresel işbirliğine dönüşmesi amaçlanıyor. Bunu yapmak için projenin sürekli büyüyen bir \"Katkıda Bulunanlar Grubuna\" ihtiyacı var!",
                    "updated": 1645100537787
                },
                {
                    "language": "DE",
                    "text": "Superalgos soll zu einer massiven globalen Zusammenarbeit heranwachsen. Um das zu erreichen, braucht das Projekt eine ständig wachsende Gruppe von Mitwirkenden!",
                    "updated": 1707857786975
                }
            ]
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Community Building Programs"
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1638985856893
                },
                {
                    "language": "TR",
                    "text": "Yapılandırma",
                    "updated": 1645100547874
                },
                {
                    "language": "DE",
                    "text": "Konfiguration",
                    "updated": 1707857794902
                }
            ]
        }
    ]
}