{
    "type": "Artificial Neural Network",
    "definition": {
        "text": "An ANN is based on a collection of connected units or nodes called artificial neurons, which loosely model the neurons in a biological brain. Each connection, like the synapses in a biological brain, can transmit a signal to other neurons. An artificial neuron that receives a signal then processes it and can signal neurons connected to it.",
        "updated": 1613198337105,
        "translations": [
            {
                "language": "RU",
                "text": "Искуственные нейронные сети основаны на наборе cоединенных блоков или узлов, называемых искуственными нейронами, которые свободно моделируют нейроны в биологическом мозге. Каждое соедининие, подобно синапсам в биологическом мозге, может передавать сигнал другим нейронам. Искуственный нейрон, который получает сизгнал, обрабатывает его и может передавать сигналы нейронам, подключенным к нему.\n",
                "updated": 1636749291371
            },
            {
                "language": "TR",
                "text": "ANN, biyolojik bir beyindeki nöronları gevşek bir şekilde modelleyen, yapay nöronlar adı verilen bağlantılı birimler veya düğümler koleksiyonudur. Her bağlantı, biyolojik bir beyindeki sinapslar gibi, diğer nöronlara bir sinyal iletebilir. Bir sinyali alan yapay bir nöron daha sonra onu işler ve kendisine bağlı nöronlara sinyal gönderebilir.",
                "updated": 1639221396544
            },
            {
                "language": "DE",
                "text": "Ein ANN basiert auf einer Sammlung miteinander verbundener Einheiten oder Knoten, die als künstliche Neuronen bezeichnet werden und die Neuronen in einem biologischen Gehirn locker nachbilden. Jede Verbindung kann, wie die Synapsen im biologischen Gehirn, ein Signal an andere Neuronen weiterleiten. Ein künstliches Neuron, das ein Signal empfängt, verarbeitet es und kann den mit ihm verbundenen Neuronen Signale geben.",
                "updated": 1705959380358
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The \"signal\" at a connection is a real number, and the output of each neuron is computed by some non-linear function of the sum of its inputs. The connections are called edges. Neurons and edges typically have a weight that adjusts as learning proceeds. The weight increases or decreases the strength of the signal at a connection. Neurons may have a threshold such that a signal is sent only if the aggregate signal crosses that threshold. Typically, neurons are aggregated into layers. Different layers may perform different transformations on their inputs. Signals travel from the first layer (the input layer), to the last layer (the output layer), possibly after traversing the layers multiple times.",
            "updated": 1613198350617,
            "translations": [
                {
                    "language": "RU",
                    "text": "\"Сигнал\" на соединении - это вещественное число, а выход каждого нейрона вычисляется некоторой нелинейной функцией от суммы его входов. Соединения называются ребрами. Нейроны и ребра обычно имеют вес, который изменяется по мере обучения. Вес увеличивает или уменьшает силу сигнала на соединении. Нейроны могут иметь порог, при котором сигнал посылается только в том случае, если суммарный сигнал пересекает этот порог. Как правило, нейроны объединяются в слои. Разные слои могут выполнять различные преобразования на своих входах. Сигналы проходят от первого слоя (входной слой) до последнего слоя (выходной слой), возможно, после многократного прохождения слоев.",
                    "updated": 1645195433762
                },
                {
                    "language": "TR",
                    "text": "Bir bağlantıdaki \"sinyal\" gerçek bir sayıdır ve her nöronun çıktısı, girdilerinin toplamının doğrusal olmayan bir fonksiyonu ile hesaplanır. Bağlantılar kenar olarak adlandırılır. Nöronlar ve kenarlar tipik olarak öğrenme ilerledikçe ayarlanan bir ağırlığa sahiptir. Ağırlık, bir bağlantıdaki sinyalin gücünü artırır veya azaltır. Nöronların bir eşiği olabilir, öyle ki bir sinyal yalnızca toplam sinyal bu eşiği geçerse gönderilir. Tipik olarak, nöronlar katmanlar halinde toplanır. Farklı katmanlar girdileri üzerinde farklı dönüşümler gerçekleştirebilir. Sinyaller ilk katmandan (giriş katmanı) son katmana (çıkış katmanı), muhtemelen katmanları birden fazla kez geçtikten sonra gider.",
                    "updated": 1654396646118,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Das \"Signal\" an einer Verbindung ist eine reelle Zahl, und die Ausgabe jedes Neurons wird durch eine nichtlineare Funktion der Summe seiner Eingaben berechnet. Die Verbindungen werden als Kanten bezeichnet. Neuronen und Kanten haben in der Regel ein Gewicht, das sich im Laufe des Lernprozesses anpasst. Die Gewichtung erhöht oder verringert die Stärke des Signals an einer Verbindung. Neuronen können einen Schwellenwert haben, so dass ein Signal nur gesendet wird, wenn das Gesamtsignal diesen Schwellenwert überschreitet. Normalerweise werden Neuronen in Schichten zusammengefasst. Verschiedene Schichten können unterschiedliche Transformationen an ihren Eingängen vornehmen. Die Signale wandern von der ersten Schicht (der Eingabeschicht) zur letzten Schicht (der Ausgabeschicht), möglicherweise nachdem sie die Schichten mehrfach durchlaufen haben.",
                    "updated": 1705959434085
                }
            ]
        }
    ]
}