{
    "type": "Outgoing Signal Reference",
    "definition": {
        "text": "The Outgoing Signal Reference node stores a reference to a signal definition held under the User's Profile in order to be sent across the Superalgos peer to peer network.",
        "updated": 1643399854093,
        "translations": [
            {
                "language": "RU",
                "text": "Узел Outgoing Signal Reference хранит ссылку на определение сигнала, хранящееся в профиле пользователя, для отправки по одноранговой сети Superalgos.",
                "updated": 1645253113579
            },
            {
                "language": "TR",
                "text": "Giden Sinyal Referansı düğümü, Superalgos eşler arası ağ üzerinden gönderilmek üzere Kullanıcı Profili altında tutulan bir sinyal tanımına bir referans depolar.",
                "updated": 1654397853031
            },
            {
                "language": "DE",
                "text": "Der Knoten \"Ausgehende Signalreferenz\" speichert einen Verweis auf eine im Benutzerprofil gespeicherte Signaldefinition, die über das Superalgos-Peer-to-Peer-Netzwerk gesendet werden soll. ",
                "updated": 1705011815935
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "the Signal’s Reference node to the matching Signals node under the Social Trading Bot of the Provider.",
            "updated": 1643405264982,
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел Signal Reference на соответствующий узел Signals в Social Trading Bot провайдера.",
                    "updated": 1645253182867
                },
                {
                    "language": "TR",
                    "text": "Sinyalin Referans düğümünü, Sağlayıcının Sosyal Ticaret Botu altındaki eşleşen Sinyaller düğümüne bağlayın.",
                    "updated": 1654397859376,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Vom Signal-Referenzknotens auf den entsprechenden Signalknoten unter dem Social Trading Bot des Anbieters.",
                    "updated": 1705009991604
                }
            ]
        },
        {
            "style": "Text",
            "text": "Each of the locations to which signals can be attached to send or receive signals has a matching Signals nodes available under the Social Trading Bots.",
            "updated": 1644030748959,
            "translations": [
                {
                    "language": "RU",
                    "text": "Каждое из мест, к которым могут быть присоединены сигналы для отправки или получения сигналов, имеет соответствующие узлы Signals, доступные в разделе Social Trading Bots.",
                    "updated": 1645253199719
                },
                {
                    "language": "TR",
                    "text": "Sinyal göndermek veya almak için sinyallerin eklenebileceği konumların her biri, Sosyal Ticaret Botları altında eşleşen bir Sinyal düğümüne sahiptir.",
                    "updated": 1654397866725,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Jeder der Orte, an die Signale angehängt werden können, um Signale zu senden oder zu empfangen, hat einen passenden Signalknoten, der unter den Social Trading Bots verfügbar ist.",
                    "updated": 1705010004409
                }
            ]
        }
    ]
}