{
    "review": "Superalgos Project Review",
    "pageNumber": 41,
    "type": "Superalgos Review - Very Interesting Open Source Project",
    "definition": {
        "text": "An interesting and promising project with novel ways to collaborate and motivate.",
        "updated": 1642174038123,
        "translations": [
            {
                "language": "TR",
                "text": "İşbirliği ve motivasyon için yeni yollar sunan ilginç ve umut verici bir proje.",
                "updated": 1670922179131
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I found this project via GitHub and my first impression is that it is very interesting and promising.",
            "updated": 1642173671160,
            "translations": [
                {
                    "language": "TR",
                    "text": "Bu projeyi GitHub üzerinden buldum ve ilk izlenimim çok ilginç ve umut verici olduğu yönünde.",
                    "updated": 1670922202497
                }
            ]
        },
        {
            "style": "Text",
            "text": "Managing not only the codebase, but also all the assets (Data Mines, Trading Algorithms, etc.) via git on GitHub so that all contributions are just commits and then designing an interface to make it possible to contribute in a user friendly way is something I have never seen before.",
            "updated": 1642173717907,
            "translations": [
                {
                    "language": "TR",
                    "text": "Sadece kod tabanını değil, aynı zamanda tüm varlıkları (Veri Madenleri ( Mines ), Ticaret ( Trading ) Algoritmaları, vb.) GitHub'daki git aracılığıyla yönetmek, böylece tüm katkıların sadece taahhütler olması ve ardından kullanıcı dostu bir şekilde katkıda bulunmayı mümkün kılmak için bir arayüz tasarlamak daha önce hiç görmediğim bir şey. ",
                    "updated": 1670922487850
                }
            ]
        },
        {
            "style": "Text",
            "text": "To incentivice contributions via SA Tokens is a really novel way to motivate people to contribute to open source that I also have never seen before.",
            "updated": 1642173898947,
            "translations": [
                {
                    "language": "TR",
                    "text": "SA Tokenları aracılığıyla katkıları teşvik etmek, insanları açık kaynağa katkıda bulunmaya motive etmek için daha önce hiç görmediğim gerçekten yeni bir yol.",
                    "updated": 1670922508570
                }
            ]
        },
        {
            "style": "Text",
            "text": "Although the UI is sometimes clunky and laggy, and bugs definitely exist, I think that Superalgos has a promising future!",
            "translations": [
                {
                    "language": "TR",
                    "text": "Kullanıcı arayüzü bazen yavaş ve gecikmeli olsa da ve hatalar kesinlikle mevcut olsa da, Superalgos'un umut verici bir geleceği olduğunu düşünüyorum!",
                    "updated": 1670922553976
                }
            ]
        },
        {
            "style": "Text",
            "text": "eyerust"
        }
    ]
}