{
    "review": "Superalgos Project Review",
    "pageNumber": 3,
    "type": "Superalgos Review - Harrell Initial Review",
    "definition": {
        "text": "Amazing platform that will definitely surpass all the proprietary bots in the future.  A true testiment to the power of the open source community.",
        "updated": 1615948612321,
        "translations": [
            {
                "language": "RU",
                "text": "Удивительная платформа, которая в будущем, безусловно, превзойдет все проприетарные боты. Настоящее подтверждение могущества сообщества с открытым исходным кодом.",
                "updated": 1640408987876
            },
            {
                "language": "TR",
                "text": "Gelecekte kesinlikle tüm tescilli botları geride bırakacak inanılmaz bir platform. Açık kaynak topluluğunun gücünün gerçek bir kanıtı.",
                "updated": 1669190600820
            },
            {
                "language": "DE",
                "text": "Erstaunliche Plattform, die in Zukunft definitiv alle proprietären Bots übertreffen wird. Ein wahrer Beweis für die Kraft der Open-Source-Community.",
                "updated": 1685388700087
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Wow I am very impressed with the scope of this project! I have seen so many trading bot platforms that are more like scams than actual tools. Whether it be from outragious subscriptions prices to completely hidden trading logic. Superalgos is a breath of fresh air. I am a hobbist programmer and even with my limited experience I can see the massive amount of work that has gone into this platform already. I firmly believe that the relationship we have with the tools we use should not be blind consumerism. The community drive behind this project is a wonderful example of what can be accomplished with open source. I am excited to have found it and am looking forward to continuing to learn and improve it.",
            "updated": 1615948666225,
            "translations": [
                {
                    "language": "RU",
                    "text": "Я очень впечатлен масштабами этого проекта! Я видел так много торговых бот-платформ, которые больше похожи на мошенничество, чем на реальные инструменты. Будь то возмутительные цены на подписку или полностью скрытая торговая логика. Superalgos - это глоток свежего воздуха. Я хоббист-программист, и даже с моим ограниченным опытом я могу видеть огромное количество работы, которая была проделана в этой платформе. Я твердо верю, что наши отношения с инструментами, которые мы используем, не должны быть слепым потребительством. Движение сообщества за этим проектом - прекрасный пример того, чего можно достичь с открытым исходным кодом. Я рад, что нашел его, и с удовольствием продолжу изучать и совершенствовать его.",
                    "updated": 1640409080100
                },
                {
                    "language": "TR",
                    "text": "Vay canına, bu projenin kapsamından çok etkilendim! Gerçek araçlardan çok dolandırıcılığa benzeyen pek çok ticaret botu platformu gördüm. Abartılı abonelik fiyatlarından tamamen gizli ticaret mantığına kadar. Superalgos temiz bir nefes. Ben hobici bir programcıyım ve sınırlı deneyimimle bile bu platforma giren büyük miktarda işi şimdiden görebiliyorum. Kullandığımız araçlarla kurduğumuz ilişkinin kör bir tüketicilik olmaması gerektiğine inanıyorum. Bu projenin arkasındaki topluluk dürtüsü, açık kaynakla neler başarılabileceğinin harika bir örneği. Bunu bulduğum için heyecanlıyım ve öğrenmeye ve geliştirmeye devam etmeyi dört gözle bekliyorum.",
                    "updated": 1669190698191
                },
                {
                    "language": "DE",
                    "text": "Wow, ich bin sehr beeindruckt von dem Umfang dieses Projekts! Ich habe so viele Trading-Bot-Plattformen gesehen, die mehr Betrug als tatsächliche Werkzeuge sind. Sei es von unverschämten Abonnementpreise zu völlig versteckten Handelslogik. Superalgos ist ein Hauch von frischer Luft. Ich bin ein Hobby-Programmierer und selbst mit meiner begrenzten Erfahrung kann ich die enorme Menge an Arbeit erkennen, die bereits in diese Plattform geflossen ist. Ich bin der festen Überzeugung, dass die Beziehung, die wir zu den Werkzeugen haben, die wir benutzen, kein blindes Konsumverhalten sein sollte. Der Antrieb der Gemeinschaft hinter diesem Projekt ist ein wunderbares Beispiel dafür, was mit Open Source erreicht werden kann. Ich bin begeistert, dass ich es gefunden habe und freue mich darauf, weiter zu lernen und es zu verbessern.",
                    "updated": 1685388713791
                }
            ]
        },
        {
            "style": "Text",
            "text": "I was overwhelmed at first with Superalgos. Just the sheer size of the system is a lot to wrap your head around at first. However, the tutorials where an excellent method to break things down and learn bit by bit. Also having the documentation directly accessible in the user interface is such a time saver and lowers the learning barrier as well. ",
            "updated": 1615948794237,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сначала я был ошеломлен системой Superalgos. Из-за огромного размера системы поначалу приходится ломать голову. Однако учебные пособия - отличный способ разложить все по полочкам и учиться понемногу. Кроме того, наличие документации непосредственно в пользовательском интерфейсе позволяет экономить время и снижает барьер в обучении.",
                    "updated": 1640409139177
                },
                {
                    "language": "TR",
                    "text": "Superalgos beni ilk başta çok şaşırttı. Sadece sistemin büyüklüğü bile ilk başta kafanızı sarmanız için çok fazla. Ancak, eğitimler işleri parçalara ayırmak ve yavaş yavaş öğrenmek için mükemmel bir yöntem. Ayrıca belgelere kullanıcı arayüzünden doğrudan erişilebiliyor olması zaman kazandırıyor ve öğrenme engelini de azaltıyor.",
                    "updated": 1669190799111
                },
                {
                    "language": "DE",
                    "text": "Am Anfang war ich von Superalgos überwältigt. Allein die schiere Größe des Systems ist eine Menge, um den Kopf zu wickeln auf den ersten. Die Tutorials waren jedoch eine hervorragende Methode, um die Dinge aufzuschlüsseln und Stück für Stück zu lernen. Auch die Tatsache, dass die Dokumentation direkt über die Benutzeroberfläche zugänglich ist, spart viel Zeit und senkt die Lernschwelle.",
                    "updated": 1685388740176
                }
            ]
        },
        {
            "style": "Text",
            "text": "However, this project still has some work to do with making the barrier to entry a little more managable for less technical users. Having some experience with github and node.js made the techincal side of setting up straightforward for myself, but I can only imagine how daunting it would be to try and take on trading concepts and techincal concepts all at once.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Однако в этом проекте еще есть над чем поработать, чтобы сделать барьер для входа немного более управляемым для менее технических пользователей. Имея некоторый опыт работы с GitHub и node.js, я могу себе представить, насколько сложной была бы попытка взять на себя одновременно торговые и технические концепции.",
                    "updated": 1640409339944
                },
                {
                    "language": "TR",
                    "text": "Bununla birlikte, bu projenin giriş engelini daha az teknik kullanıcılar için biraz daha yönetilebilir hale getirmek için hala yapılması gereken bazı işler var. Github ve node.js ile biraz deneyim sahibi olmak, kurulumun teknik yönünü kendim için basit hale getirdi, ancak ticaret kavramlarını ve teknik kavramları aynı anda ele almanın ne kadar göz korkutucu olacağını hayal edebiliyorum.",
                    "updated": 1669190839282
                },
                {
                    "language": "DE",
                    "text": "Allerdings hat dieses Projekt noch einiges an Arbeit vor sich, um die Einstiegshürde für weniger technikaffine Nutzer ein wenig handhabbarer zu machen. Da ich einige Erfahrung mit github und node.js habe, war die technische Seite der Einrichtung für mich einfach, aber ich kann mir nur vorstellen, wie entmutigend es sein würde, zu versuchen, Handelskonzepte und technische Konzepte auf einmal zu übernehmen.",
                    "updated": 1685388796223
                }
            ]
        },
        {
            "style": "Text",
            "text": "I appreciate the focus on visual scripting and seperation from hard code in the design space. It has made trying to learn the concepts of trading much easier without having to try and code at the same time. I am very new to the relm of crypto trading and have had to give myself a crash course into trading concepts and ideas to help suppliment the material I am learning in tutorials. It would be helpful for new traders like myself to have some more resources for basic trading concepts more easily accessible within the first few moments on the platform. It has taken me a hot minute to figure out what is in the documentation/tutorials and what I need to research more on my own.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Я ценю акцент на визуальном скриптинге и отделении от жесткого кода в пространстве проектирования. Это значительно облегчает изучение концепций торговли без необходимости одновременно пытаться кодировать. Я совсем новичок в сфере торговли криптовалютами, и мне пришлось пройти ускоренный курс обучения торговым концепциям и идеям, чтобы дополнить материал, который я изучаю в учебниках. Для таких новичков, как я, было бы полезно иметь больше ресурсов для основных торговых концепций, которые были бы легко доступны в течение первых нескольких минут работы на платформе. Мне потребовалась горячая минута, чтобы понять, что есть в документации/учебниках, а что мне нужно изучить самостоятельно.",
                    "updated": 1640409277574
                },
                {
                    "language": "TR",
                    "text": "Görsel komut dosyasına odaklanmayı ve tasarım alanındaki sabit koddan ayrılmayı takdir ediyorum. Aynı anda kod yazmaya çalışmak zorunda kalmadan ticaret kavramlarını öğrenmeye çalışmayı çok daha kolay hale getirdi. Kripto ticareti konusunda çok yeniyim ve eğitimlerde öğrendiğim materyali desteklemeye yardımcı olmak için kendime ticaret kavramları ve fikirleri konusunda hızlandırılmış bir kurs vermek zorunda kaldım. Benim gibi yeni yatırımcıların, platformdaki ilk birkaç dakika içinde temel ticaret kavramları için daha kolay erişilebilir bazı kaynaklara sahip olması yararlı olacaktır. Belgelerde/eğitimlerde neler olduğunu ve kendi başıma neleri daha fazla araştırmam gerektiğini bulmak çok zamanımı aldı.",
                    "updated": 1669190893539
                },
                {
                    "language": "DE",
                    "text": "Ich schätze den Fokus auf visuelle Skripte und die Trennung von hartem Code im Designbereich. Es hat den Versuch, die Konzepte des Handels zu lernen viel einfacher gemacht, ohne zu versuchen, und Code zur gleichen Zeit. Ich bin sehr neu im Bereich des Krypto-Handels und musste mir selbst einen Crash-Kurs in Handelskonzepten und -ideen geben, um das Material, das ich in Tutorials lerne, zu ergänzen. Es wäre hilfreich für neue Händler wie mich, wenn sie mehr Ressourcen für grundlegende Handelskonzepte hätten, die in den ersten Momenten auf der Plattform leichter zugänglich wären. Ich habe eine heiße Minute gebraucht, um herauszufinden, was in der Dokumentation/den Tutorials steht und was ich noch selbst recherchieren muss.",
                    "updated": 1685388822970
                }
            ]
        },
        {
            "style": "Text",
            "text": "Overall, Superalgos is the best crypto trading project I have come across by far. There is no comparison. The amount of control and extensiblity of the project is absolutely magical. As the project grows and hardens I can only imagine how powerful and accessible it will be for the whole world.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В целом, Superalgos - это лучший проект по торговле криптовалютами, с которым я сталкивался. Нет никакого сравнения. Объем контроля и расширяемость проекта просто волшебны. По мере роста и укрепления проекта я могу только представить, насколько мощным и доступным он станет для всего мира.",
                    "updated": 1640409307982
                },
                {
                    "language": "TR",
                    "text": "Genel olarak, Superalgos şimdiye kadar karşılaştığım en iyi kripto ticaret projesi. Hiçbir karşılaştırma yok. Projenin kontrol miktarı ve kapsamı kesinlikle büyülü. Proje büyüdükçe ve sertleştikçe, tüm dünya için ne kadar güçlü ve erişilebilir olacağını hayal edebiliyorum.",
                    "updated": 1669190931196
                },
                {
                    "language": "DE",
                    "text": "Insgesamt ist Superalgos das mit Abstand beste Krypto-Handelsprojekt, das mir begegnet ist. Es gibt keinen Vergleich. Das Ausmaß der Kontrolle und der Umfang des Projekts ist absolut magisch. Wenn das Projekt wächst und sich verfestigt, kann ich mir nur vorstellen, wie mächtig und zugänglich es für die ganze Welt sein wird.",
                    "updated": 1685389222807
                }
            ]
        },
        {
            "style": "Text",
            "text": "Brenden Harrell"
        },
        {
            "style": "Text",
            "text": "harrellbm"
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}