{
    "review": "Superalgos Project Review",
    "pageNumber": 1,
    "type": "Superalgos Review - Leave Your Feedback!",
    "definition": {
        "text": "This is the place where you may leave your feedback and impressions about the project, for others to find and read.",
        "updated": 1610961496602,
        "translations": [
            {
                "language": "RU",
                "text": "Здесь вы можете оставить свои отзывы и впечатления о проекте, чтобы другие могли их найти и прочитать.",
                "updated": 1638553648223
            },
            {
                "language": "TR",
                "text": "Burası, başkalarının bulması ve okuması için proje hakkındaki geri bildirimlerinizi ve izlenimlerinizi bırakabileceğiniz yerdir.",
                "updated": 1654419683323
            },
            {
                "language": "DE",
                "text": "Hier können Sie Ihr Feedback und Ihre Eindrücke über das Projekt hinterlassen, damit andere es finden und lesen können.",
                "updated": 1685387499363
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "After you create your own review page as part of this collection, you will be able to edit it over time, and add more info as your experience evolves with the system. So, don't worry is right now you can just write your first impressions. You will allways be able to come back and extend your page.",
            "updated": 1610701884353,
            "translations": [
                {
                    "language": "RU",
                    "text": "После того, как вы создадите свою собственную страницу отзыва как часть этой коллекции, вы сможете со временем редактировать ее и добавлять дополнительную информацию по мере развития вашего опыта работы с системой. Так что не волнуйтесь, прямо сейчас вы можете просто написать свои первые впечатления. Вы всегда сможете вернуться и дополнить свою страницу.",
                    "updated": 1638554113545
                },
                {
                    "language": "TR",
                    "text": "Bu koleksiyonun bir parçası olarak kendi inceleme sayfanızı oluşturduktan sonra, zaman içinde düzenleyebilecek ve sistemle ilgili deneyiminiz geliştikçe daha fazla bilgi ekleyebileceksiniz. Yani, endişelenmeyin şu anda sadece ilk izlenimlerinizi yazabilirsiniz. Her zaman geri gelebilecek ve sayfanızı genişletebileceksiniz.",
                    "updated": 1654419690477,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Nachdem Sie Ihre eigene Bewertungsseite als Teil dieser Sammlung erstellt haben, können Sie sie im Laufe der Zeit bearbeiten und weitere Informationen hinzufügen, je nachdem, wie sich Ihre Erfahrungen mit dem System entwickeln. Machen Sie sich also keine Sorgen, im Moment können Sie nur Ihre ersten Eindrücke schreiben. Sie können immer wieder zurückkommen und Ihre Seite erweitern.",
                    "updated": 1685387516140
                }
            ]
        },
        {
            "style": "Title",
            "text": "How to add your own Review",
            "updated": 1610702480960,
            "translations": [
                {
                    "language": "RU",
                    "text": " Как добавить свой собственный отзыв",
                    "updated": 1638554011559
                },
                {
                    "language": "TR",
                    "text": "Kendi İncelemenizi nasıl eklersiniz",
                    "updated": 1654419698195,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Wie Sie Ihre eigene Rezension hinzufügen",
                    "updated": 1685387536213
                }
            ]
        },
        {
            "style": "Text",
            "text": "In order to add your own review page of the Superalgos Project, copy and paste the following code at the search bar:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы добавить свою собственную страницу обзора проекта Superalgos Project, скопируйте и вставьте следующий код в строку поиска:",
                    "updated": 1638554154090
                },
                {
                    "language": "TR",
                    "text": "Superalgos Projesi ile ilgili kendi inceleme sayfanızı eklemek için aşağıdaki kodu kopyalayıp arama çubuğuna yapıştırın:",
                    "updated": 1654419705824,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Um Ihre eigene Bewertungsseite des Superalgos-Projekts hinzuzufügen, kopieren Sie den folgenden Code und fügen Sie ihn in die Suchleiste ein:",
                    "updated": 1685387544235
                }
            ]
        },
        {
            "style": "Json",
            "text": "docs.add Review to Superalgos: Superalgos Project Review->Superalgos Review - YOUR REVIEW TITLE",
            "updated": 1610702550459,
            "translations": [
                {
                    "language": "RU",
                    "text": "docs.add Review to Superalgos: Superalgos Project Review->Superalgos Review - ЗАГОЛОВОК ОТЗЫВА",
                    "updated": 1638554224915
                }
            ]
        },
        {
            "style": "List",
            "text": "YOUR REVIEW TITLE: Replace this placeholder text for a short title for your Review Page.",
            "translations": [
                {
                    "language": "RU",
                    "text": "YOUR REVIEW TITLE: Замените этот замещающий текст коротким заголовком для своей страницы обзора.",
                    "updated": 1638554248518
                },
                {
                    "language": "TR",
                    "text": "İNCELEME BAŞLIĞINIZ: İnceleme Sayfanızın kısa başlığı için bu yer tutucu metni değiştirin.",
                    "updated": 1654419713503,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Important",
            "text": "You need to sign your Review Page. At the en of the text, type your Github.com username. This needs to be present in order for the Review to be added to the next release of Superalgos.",
            "updated": 1610702866522,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вам необходимо подписать свою страницу отзыва Review Page . В поле \"en\" текста введите свое имя пользователя Github.com. Это необходимо для добавления обзора в следующий выпуск Superalgos.",
                    "updated": 1638554375962
                },
                {
                    "language": "TR",
                    "text": "İnceleme Sayfanızı imzalamanız gerekmektedir. Metnin en başına Github.com kullanıcı adınızı yazın. İncelemenin Superalgos'un bir sonraki sürümüne eklenebilmesi için bunun mevcut olması gerekir.",
                    "updated": 1654419720434,
                    "style": "Important"
                },
                {
                    "language": "DE",
                    "text": "Sie müssen Ihre Review-Seite signieren. Geben Sie am Ende des Textes Ihren Github.com-Benutzernamen ein. Dieser muss vorhanden sein, damit die Rezension zur nächsten Version von Superalgos hinzugefügt werden kann.",
                    "updated": 1685387557939
                }
            ]
        },
        {
            "style": "Text",
            "text": "Your review will be merged into the main repository once you send it as a contribution. For that you need to execute:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Ваш отзыв будет добавлен в основной репозиторий после того, как вы отправите его в качестве вклада. Для этого необходимо выполнить:",
                    "updated": 1638554403365
                },
                {
                    "language": "TR",
                    "text": "İncelemeniz, katkı olarak gönderdiğinizde ana depoyla birleştirilecektir. Bunun için yürütmeniz gerekir:",
                    "updated": 1654419729029,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Ihre Rezension wird in das Haupt-Repository aufgenommen, sobald Sie sie als Beitrag einsenden. Dazu müssen Sie den Vorgang ausführen:",
                    "updated": 1685387567172
                }
            ]
        },
        {
            "style": "Json",
            "text": "docs.save"
        },
        {
            "style": "Json",
            "text": "app.contribute"
        }
    ]
}