{
    "review": "Superalgos Project Review",
    "pageNumber": 4,
    "type": "Superalgos Review - A 1 Month Review (novice)",
    "definition": {
        "text": "This is an update review after one month of working with and learning Superalgos\n",
        "updated": 1616179126953,
        "translations": [
            {
                "language": "RU",
                "text": "Это обновленный обзор после одного месяца работы и изучения Superalgos",
                "updated": 1640409384564
            },
            {
                "language": "TR",
                "text": "Bu, Superalgos ile bir ay çalıştıktan ve öğrendikten sonra yapılan bir güncelleme incelemesidir",
                "updated": 1669191067954
            },
            {
                "language": "DE",
                "text": "Dies ist ein aktueller Bericht nach einem Monat Arbeit mit und Lernen von Superalgos",
                "updated": 1685390039487
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I have been using Superalgos for about a month now. Prior to Superalgos, my trading knowledge and experience was limited. Admittedly, the initial learning curve was a bit overwhelming. I’m fairly new to the whole programming world, my recent introduction to raspberry pi’s is how I stumbled across Superalgos on GitHub. Ive had some fun with the getting started strategy, and have tweaked it here and there to achieve different results with success. At this point I probably have over 100 hours working through tutorials, no joke. Ive had to take what I’m learning through the tutorials, and investigate further on exchange sites / trading strategy sites, and am starting to develop a more clear understanding. I haven’t had any success with the other strategies yet. I seem to have little issues here and there with references sometimes not appearing and having to manually go through and apply them. But Ive also had some hardware issues that have held me back I think. My MacBook doesn’t love the charting during backtesting and trading, its slow and glitchy. Ive had some success running the server on my pi and gui on my Macbook. I may try my pc eventually. All in all, most of my issues are user error. Overall, I think Superalgos is a fantastic program, and community, and Im incredibly stoked to be a part of it and hope to make some valuable contributions one day!",
            "updated": 1616180208859,
            "translations": [
                {
                    "language": "RU",
                    "text": "Я использую Superalgos уже около месяца. До Superalgos мои знания и опыт торговли были ограничены. Признаться, первоначальная кривая обучения была немного подавляющей. Я еще совсем новичок в мире программирования, недавно я познакомился с raspberry pi, поэтому я наткнулся на Superalgos на GitHub. Я немного поиграл со стратегией \"Начало работы\", подправил ее тут и там, чтобы добиться различных результатов и добиться успеха. На данный момент у меня, вероятно, более 100 часов работы с учебниками, без шуток. Мне пришлось взять то, что я узнал из учебников, и исследовать дальше на сайтах бирж / сайтах торговых стратегий, и я начинаю развивать более четкое понимание. Я еще не добился успеха с другими стратегиями. У меня возникают небольшие проблемы то тут, то там: ссылки иногда не появляются, и приходится вручную перебирать и применять их. Но у меня также были некоторые проблемы с оборудованием, которые, как мне кажется, задерживали меня. Моему MacBook не нравится построение графиков во время бэктестинга и торговли, он медленный и глючный. Я добился некоторого успеха, запустив сервер на моем Pi и gui на моем Macbook. В конце концов, я могу попробовать на своем ПК. В целом, большинство моих проблем - это ошибка пользователя. В целом, я думаю, что Superalgos - это фантастическая программа и сообщество, и я невероятно рад быть его частью и надеюсь однажды внести ценный вклад!",
                    "updated": 1640409599444
                },
                {
                    "language": "TR",
                    "text": "Superalgos'u yaklaşık bir aydır kullanıyorum. Superalgos'tan önce ticaret bilgim ve deneyimim sınırlıydı. Kuşkusuz, ilk öğrenme eğrisi biraz eziciydi. Tüm programlama dünyasında oldukça yeniyim, raspberry pi'lerle yeni tanışmam GitHub'da Superalgos'a rastlamamı sağladı. Başlangıç stratejisi ile biraz eğlendim ve başarılı bir şekilde farklı sonuçlar elde etmek için burada ve orada değiştirdim. Bu noktada muhtemelen 100 saatten fazla öğreticiler üzerinde çalıştım, şaka değil. Eğitimler aracılığıyla öğrendiklerimi almak ve borsa sitelerinde / ticaret stratejisi sitelerinde daha fazla araştırma yapmak zorunda kaldım ve daha net bir anlayış geliştirmeye başladım. Diğer stratejilerde henüz bir başarı elde edemedim. Burada ve orada referansların bazen görünmemesi ve bunları manuel olarak gözden geçirip uygulamak zorunda kalmamla ilgili küçük sorunlar yaşıyorum gibi görünüyor. Ama sanırım beni engelleyen bazı donanım sorunları da yaşadım. MacBook'um geri test ve ticaret sırasında grafiği sevmiyor, yavaş ve hatalı. Sunucuyu pi'mde ve gui'yi Macbook'umda çalıştırmada bazı başarılar elde ettim. Sonunda bilgisayarımı deneyebilirim. Sonuç olarak, sorunlarımın çoğu kullanıcı hatası. Genel olarak, Superalgos'un harika bir program ve topluluk olduğunu düşünüyorum ve bunun bir parçası olduğum için inanılmaz derecede heyecanlıyım ve bir gün bazı değerli katkılarda bulunmayı umuyorum!",
                    "updated": 1669191044298
                },
                {
                    "language": "DE",
                    "text": "Ich benutze Superalgos jetzt seit etwa einem Monat. Vor Superalgos war mein Wissen und meine Erfahrung im Handel begrenzt. Zugegeben, die anfängliche Lernkurve war ein bisschen überwältigend. Ich bin ein ziemlicher Neuling in der Welt des Programmierens und bin durch meine kürzliche Einführung in die Raspberry Pi's auf Superalgos und auf GitHub gestoßen. Ich hatte etwas Spaß mit der Einstiegsstrategie und habe sie hier und da optimiert, um verschiedene Ergebnisse mit Erfolg zu erzielen. Zu diesem Zeitpunkt verbrachte ich wahrscheinlich über 100 Stunden Arbeit mit Tutorials, kein Witz. Ich lernte mit den Tutorials, erkundigte mich auf Exchange-Websites / Handelsstrategie Websites und begann immer mehr zu verstehen. Mit den anderen Strategien hatte ich bisher noch keinen Erfolg. Ich scheine hier und da kleine Probleme mit Verweisen zu haben, die manchmal nicht angezeigt werden, und ich muss manuell durchgehen und sie anwenden. Aber Ive hatte auch einige Hardware-Probleme, die mich zurückgehalten haben, ich denke. Mein MacBook liebt nicht die Charting während Backtesting und Handel, langsam und störungsfrei laufen. Ive hatte einige Erfolg läuft der Server auf meinem Pi und gui auf meinem Macbook. Alles in allem, die meisten meiner Probleme sind Benutzerfehler. Insgesamt denke ich, dass Superalgos ein fantastisches Programm und eine fantastische Community ist, und ich bin unglaublich begeistert, ein Teil davon zu sein, und hoffe, dass ich eines Tages einige wertvolle Beiträge leisten kann!",
                    "updated": 1685390051201
                }
            ]
        },
        {
            "style": "Text",
            "text": "GitHub:ndd91"
        }
    ]
}