{
    "review": "Superalgos Project Review",
    "pageNumber": 16,
    "type": "Superalgos Review - 111's Review",
    "definition": {
        "text": "Write a summary for this review page.",
        "translations": [
            {
                "language": "TR",
                "text": "Bu inceleme sayfası için bir özet yazın.",
                "updated": 1669309594555
            },
            {
                "language": "DE",
                "text": "Schreiben Sie eine Zusammenfassung für diese Rezensionsseite.",
                "updated": 1686340287262
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "It has extremely cool and intuitive GUI. However, there is a severe lack of tooltips in the main dashboard. Newcomers have to either second guess the meaning of the symbols, or go back to the tutorial/console just to double check if they remember the functionalities of each buttons correctly.",
            "updated": 1622213049425,
            "translations": [
                {
                    "language": "RU",
                    "text": "У него чрезвычайно удобный и интуитивно понятный графический интерфейс. Тем не менее, на главной приборной панели очень не хватает всплывающих подсказок. Новичкам приходится либо догадываться о значении символов, либо возвращаться к учебнику/консоли, чтобы проверить, правильно ли они запомнили функциональность каждой кнопки.",
                    "updated": 1640413556172
                },
                {
                    "language": "TR",
                    "text": "Son derece havalı ve sezgisel bir GUI'ye sahip. Ancak, ana gösterge panelinde ciddi bir araç ipucu eksikliği var. Yeni gelenler ya sembollerin anlamını ikinci kez tahmin etmek ya da her düğmenin işlevlerini doğru hatırlayıp hatırlamadıklarını iki kez kontrol etmek için öğreticiye / konsola geri dönmek zorundadır",
                    "updated": 1669309624320
                },
                {
                    "language": "DE",
                    "text": "Es hat eine extrem coole und intuitive GUI. Es gibt jedoch einen großen Mangel an Tooltips im Haupt-Dashboard. Neulinge müssen entweder die Bedeutung der Symbole erraten oder zum Tutorial/zur Konsole zurückkehren, um zu überprüfen, ob sie sich an die Funktionen der einzelnen Schaltflächen richtig erinnern.",
                    "updated": 1686341011848
                }
            ]
        },
        {
            "style": "Text",
            "text": "The in-app documentation seems to be hosted together with the application itself, which unfortuantely does not allow users to use the <- and -> buttons in our native chrome browser to go back to the previous and next documentation page. Although there is an alternative back and next button provided, it is still quite clunky to use as of Beta 9.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Документация внутри приложения, похоже, размещена вместе с самим приложением, что, к сожалению, не позволяет пользователям использовать кнопки <- и -> в нашем родном браузере chrome для возврата к предыдущей и следующей странице документации. Хотя существует альтернативная кнопка \"Назад\" и \"Далее\", она все еще довольно неудобна в использовании по сравнению с Beta 9.",
                    "updated": 1640413621245
                },
                {
                    "language": "TR",
                    "text": "Uygulama içi dokümantasyon, uygulamanın kendisi ile birlikte barındırılıyor gibi görünüyor ve bu, ne yazık ki kullanıcıların önceki ve sonraki dokümantasyon sayfasına geri dönmek için yerel chorme tarayıcımızdaki <- ve -> düğmelerini kullanmasına izin vermiyor. Sağlanan alternatif bir geri ve ileri düğmesi olmasına rağmen, Beta 9'dan itibaren kullanımı hala oldukça kullanışsızdır.",
                    "updated": 1669309702104
                },
                {
                    "language": "DE",
                    "text": "Die In-App-Dokumentation scheint zusammen mit der Anwendung selbst gehostet zu werden, was es den Nutzern leider nicht ermöglicht, die <- und ->-Schaltflächen in unserem nativen Chrome-Browser zu verwenden, um zur vorherigen und nächsten Dokumentationsseite zurückzukehren. Zwar gibt es eine alternative Schaltfläche \"Zurück\" und \"Weiter\", doch ist sie in der Beta 9 noch immer recht umständlich zu bedienen.",
                    "updated": 1686341099584
                }
            ]
        },
        {
            "style": "Text",
            "text": "That being said, it seems to show great potential and I look forward to designing trading bots with this tool.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Тем не менее, он обладает большим потенциалом, и я с нетерпением жду возможности разработать торговых ботов с помощью этого инструмента.",
                    "updated": 1640413662345
                },
                {
                    "language": "TR",
                    "text": "Bununla birlikte, büyük bir potansiyel gösteriyor gibi görünüyor ve bu araçla ticaret botları tasarlamayı dört gözle bekliyorum.",
                    "updated": 1669309731963
                },
                {
                    "language": "DE",
                    "text": "Abgesehen davon scheint es ein großes Potenzial zu haben, und ich freue mich darauf, mit diesem Tool Handelsroboter zu entwickeln.",
                    "updated": 1686341113990
                }
            ]
        }
    ]
}