{
    "review": "Superalgos Project Review",
    "pageNumber": 26,
    "type": "Superalgos Review - A vast system without borders",
    "definition": {
        "text": "Superalgos review by eNut - No borders, all the power for your crypto",
        "updated": 1633367241439,
        "translations": [
            {
                "language": "RU",
                "text": "Обзор Superalgos от eNut - никаких границ, вся мощь для вашей криптовалюты",
                "updated": 1640414762865
            },
            {
                "language": "DE",
                "text": "Superalgos Bewertung von eNut - Keine Grenzen, alle Macht für Ihre Kryptowährung",
                "updated": 1686343508518
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Superalgos is a vast system to control you assets in a way that only you alone have the keys to you crypto. The visualization of the code makes it more readable and certainly more understandable. This vast piece software base might just be what everybody needs to take control of your assets and learn how to use them.",
            "updated": 1633367092118,
            "translations": [
                {
                    "language": "RU",
                    "text": "Superalgos - это огромная система контроля над вашими активами таким образом, что только у вас есть ключи к вашим криптовалютам. Визуализация кода делает его более читабельным и, безусловно, более понятным. Эта обширная программная база может оказаться тем, что нужно каждому, чтобы взять под контроль свои активы и научиться их использовать.",
                    "updated": 1640414793691
                },
                {
                    "language": "DE",
                    "text": "Superalgos ist ein umfangreiches System, um Ihr Vermögen so zu kontrollieren, dass nur Sie allein die Schlüssel zu Ihrer Kryptowährung besitzen. Die Visualisierung des Codes macht ihn besser lesbar und sicherlich verständlicher. Dieses riesige Stück Software-Basis könnte genau das sein, was jeder braucht, um die Kontrolle über Ihr Vermögen zu übernehmen und zu lernen, wie man es nutzt.",
                    "updated": 1686343520572
                }
            ]
        },
        {
            "style": "Text",
            "text": "Fair warning, for non coders it might be a lot to take in, a steep learning curve. The upside: you are only limited by your own imagination.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Предупреждаем, что для тех, кто не программирует, это может оказаться непосильной задачей, придется многому учиться. Положительная сторона: вы ограничены только собственным воображением.",
                    "updated": 1640414814136
                },
                {
                    "language": "DE",
                    "text": "Ich muss Sie warnen: Für Nicht-Programmierer könnte es eine Menge zu verarbeiten sein, eine steile Lernkurve. Der Vorteil: Sie sind nur durch Ihre eigene Fantasie begrenzt.",
                    "updated": 1686343655307
                }
            ]
        },
        {
            "style": "Text",
            "text": "Like the toturial mentions: your not litarally bending time and space, but it does feel like it.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Как сказано в учебнике: вы не можете буквально искривить время и пространство, но это похоже на это.",
                    "updated": 1640414898238
                },
                {
                    "language": "DE",
                    "text": "Wie bereits erwähnt: Sie verbiegen Zeit und Raum nicht wörtlich, aber es fühlt sich so an.",
                    "updated": 1686343663247
                }
            ]
        },
        {
            "style": "Callout",
            "text": "So I, like everyone should, take a plunge and dive right into:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Поэтому я, как и все, должен сделать шаг вперед и погрузиться с головой:",
                    "updated": 1640414920166
                },
                {
                    "language": "DE",
                    "text": "Also habe ich, wie es jeder tun sollte, den Sprung gewagt und bin direkt hineingestürzt:",
                    "updated": 1686343672534
                }
            ]
        },
        {
            "style": "List",
            "text": "Assets under your control, no permissions needed.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Активы под вашим контролем, никаких разрешений не требуется.",
                    "updated": 1640414951830
                },
                {
                    "language": "DE",
                    "text": "Vermögenswerte unter Ihrer Kontrolle, keine Genehmigungen erforderlich.",
                    "updated": 1686343681678
                }
            ]
        },
        {
            "style": "List",
            "text": "A vast system, only limited by what you can think of.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Огромная система, ограниченная только тем, что вы можете придумать.",
                    "updated": 1640414974946
                },
                {
                    "language": "DE",
                    "text": "Ein riesiges System, das nur durch das begrenzt wird, was man sich vorstellen kann.",
                    "updated": 1686343692233
                }
            ]
        },
        {
            "style": "List",
            "text": "An active community with people who know what they are talking about.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Активное общение с людьми, которые знают, о чем говорят.",
                    "updated": 1640415001457
                },
                {
                    "language": "DE",
                    "text": "Eine aktive Gemeinschaft mit Menschen, die wissen, wovon sie reden.",
                    "updated": 1686343700398
                }
            ]
        },
        {
            "style": "List",
            "text": "The future",
            "translations": [
                {
                    "language": "RU",
                    "text": "Будущее",
                    "updated": 1640415009466
                },
                {
                    "language": "DE",
                    "text": "Die Zukunft",
                    "updated": 1686343707783
                }
            ]
        },
        {
            "style": "Text",
            "text": "I'll try to update this in the future, to let you know how the dive is coming along.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Я постараюсь обновлять эту тему в будущем, чтобы вы знали, как продвигается погружение.",
                    "updated": 1640415024522
                },
                {
                    "language": "DE",
                    "text": "Ich werde versuchen, dies in Zukunft zu aktualisieren, um euch zu informieren, wie es mit dem Tauchgang weitergeht.",
                    "updated": 1686343716534
                }
            ]
        },
        {
            "style": "Text",
            "text": "eNut"
        }
    ]
}