{
    "review": "Superalgos Project Review",
    "pageNumber": 18,
    "type": "Superalgos Review - Superalgos overwhelmes me! (Awesome)",
    "definition": {
        "text": "I am hooked by this awesome project!",
        "updated": 1622380449884,
        "translations": [
            {
                "language": "RU",
                "text": "Меня зацепил этот потрясающий проект!",
                "updated": 1640413746767
            },
            {
                "language": "TR",
                "text": "Bu harika projeye bayıldım!",
                "updated": 1669310016444
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "**Right** click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to end edit mode. Then you can use docs.save to save your changes and app.contribute to send it to the main repository.",
            "updated": 1622380414603,
            "translations": [
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için **sağ** tıklayın ve Düzenle'yi tıklayın. Yeni paragraflar yazmak için ENTER. Düzenleme modunu sonlandırmak için ESC. Ardından docs.save, değişikliklerinizi kaydetmek ve app.contributeana depoya göndermek için kullanabilirsiniz.",
                    "updated": 1669310036459
                },
                {
                    "language": "DE",
                    "text": "**Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu beenden. Dann können Sie docs.save verwenden, um Ihre Änderungen zu speichern und app.contribute , um sie an das Haupt-Repository zu senden.",
                    "updated": 1686341372647
                }
            ]
        },
        {
            "style": "Text",
            "text": "I am absolutely overwhelmed. What an awesome project. I have just scratched the surface, got a grasp of the ideas behind, and will definetely take the tour to master it.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Я совершенно ошарашен. Какой потрясающий проект. Я только поцарапал поверхность, уловил идеи, лежащие в основе, и обязательно возьму тур, чтобы освоить его.",
                    "updated": 1640413818345
                },
                {
                    "language": "TR",
                    "text": "Kesinlikle çok etkilendim, ne harika bir proje. Sadece yüzeysel olarak inceledim, arkasındaki fikirleri kavradım ve kesinlikle ustalaşmak için tura katılacağım.",
                    "updated": 1669310124753
                },
                {
                    "language": "DE",
                    "text": "Ich bin absolut überwältigt. Was für ein großartiges Projekt. Ich habe gerade mal an der Oberfläche gekratzt, habe ein Gefühl für die Ideen dahinter bekommen und werde definitiv die Tour machen, um es zu meistern.",
                    "updated": 1686341782948
                }
            ]
        },
        {
            "style": "Text",
            "text": "So my first review is very short just to keep the flow. ",
            "translations": [
                {
                    "language": "RU",
                    "text": "Поэтому мой первый обзор очень короткий, просто чтобы не сбиться с пути.",
                    "updated": 1640413854103
                },
                {
                    "language": "TR",
                    "text": "Bu yüzden ilk incelemem sadece akışı sürdürmek için çok kısa olacak.",
                    "updated": 1669310254213
                },
                {
                    "language": "DE",
                    "text": "Meine erste Rezension ist also sehr kurz, um den Fluss zu halten.",
                    "updated": 1686341791717
                }
            ]
        },
        {
            "style": "Text",
            "text": "I'll come back later with a more detailed review.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Я вернусь позже с более подробным отзывом.",
                    "updated": 1640413893912
                },
                {
                    "language": "TR",
                    "text": "Daha detaylı bir inceleme ile daha sonra tekrar geleceğim.",
                    "updated": 1669310268802
                },
                {
                    "language": "DE",
                    "text": "Ich werde später mit einer ausführlicheren Rezension zurückkommen.",
                    "updated": 1686341799898
                }
            ]
        },
        {
            "style": "Text",
            "text": "RalfWeiss"
        }
    ]
}