{
    "review": "Superalgos Project Review",
    "pageNumber": 24,
    "type": "Superalgos Review - Unmatched Awesome Project",
    "definition": {
        "text": "For a group of trader friends to come together and decide to endeavour on an automatic trading project, and then achieve the beta 11 version of this project, is pretty cool. \nAnd taking into account the unprecedented nature of this project, bordering on revolutionary, as well as the planned future functionalities and other significant project goals, I can only shake my head in absolute WONDER.\nAlso, I was only starting out on my journey with trading bots, barely gone through my 20 or 50 tabs I had open, and somehow I stumbled across SuperAlgos. I was immediately captured by your project. Nothing else got my attention this strongly.\n\nAlso thanks, because it saved me time going through those 50 other tabs!\nI immediately went and got a Raspberry Pi 4 B, after thinking about getting one for almost 10 years.\n\nAnyway, my words cannot do justice to your amazing project.\nAnd I havent even scratched the surface yet.\n\nLooking forward to mastering your platform and your future functionalities & project milestones.\nIntegration with Ethereum nodes? Holy cow.\n\nPlease just make sure you continue to honor the right to financial privacy, financial sovereignty, anonimity, individual privacy, etc. As much as your platform/project is able to.\nWe cannot and should not allow the SEC and similar \"authorities\" to interfere with projects like these.\nPlease make sure your platform is/will be 100% resistant against questionable centralised power structures...\n\nThanks\nJerome\nhttps://github.com/romeox7",
        "updated": 1630775798821,
        "translations": [
            {
                "language": "RU",
                "text": "Для группы друзей-трейдеров собраться вместе и решить заняться проектом автоматической торговли, а затем достичь бета-версии 11 этого проекта - это очень круто. \nА если учесть беспрецедентный характер этого проекта, граничащий с революционным, а также планируемые будущие функциональные возможности и другие значимые цели проекта, я могу только покачать головой в абсолютном изумлении.\nКроме того, я только начинал свой путь с торговыми ботами, едва просмотрел 20 или 50 открытых вкладок, и как-то наткнулся на SuperAlgos. Я был немедленно захвачен вашим проектом. Ничто другое не привлекло мое внимание так сильно.\n\nТакже спасибо, потому что это сэкономило мне время на просмотре тех 50 других вкладок!\nЯ сразу же пошел и купил Raspberry Pi 4 B, после того как думал о его приобретении почти 10 лет.\n\nВ любом случае, мои слова не могут передать справедливость вашего удивительного проекта.\nА я еще даже не поцарапал поверхность.\n\nС нетерпением жду освоения вашей платформы и ваших будущих функциональных возможностей и этапов проекта.\nИнтеграция с нодами Ethereum? Святая корова.\n\nПожалуйста, просто убедитесь, что вы продолжаете соблюдать право на финансовую конфиденциальность, финансовый суверенитет, анонимность, индивидуальную конфиденциальность и т.д. Настолько, насколько это возможно для вашей платформы/проекта.\nМы не можем и не должны позволять SEC и подобным \"органам\" вмешиваться в такие проекты.\nПожалуйста, убедитесь, что ваша платформа на 100% противостоит сомнительным централизованным структурам власти...\nThanks\nJerome\nhttps://github.com/romeox7",
                "updated": 1640414623691
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode. Then you can use docs.save to save your changes and app.contribute to send it to the main repository."
        }
    ]
}