{
    "review": "Superalgos Project Review",
    "pageNumber": 50,
    "type": "Superalgos Review - My First Impression",
    "definition": {
        "text": "Write a summary for this review page."
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Love for the first sight? Not necessarly :)",
            "updated": 1674687103853
        },
        {
            "style": "Title",
            "text": ""
        },
        {
            "style": "Text",
            "text": "I've read some reviews about Superalgos before I opened it, and knew, that it has a step learning curve so I haven't expected that will be easy and straightforward and gues what... it is NOT at all, absolutely :D",
            "updated": 1674687872509
        },
        {
            "style": "Text",
            "text": "It is hard to get the idea at the beginning but from my perspective, the way how you navigate through the Design Space doesn't make this task easier. Fortunately I forgot about it after some time."
        },
        {
            "style": "Text",
            "text": "What I don't still get used to is this \"pop up\" menu, displayed after the hover any element. It is really annoying when there are few elements close to each other and when I want to display menu of the specific one, I have to conduct mousre pointer over the free places, around other elements just to get the interesting one. And when by accident I display menu of other element, I have to move mouse outside this big circle to make it disappear and try again. I hope that I just do not know everything about navigating or maybe I also need more time."
        },
        {
            "style": "Text",
            "text": "I cannot say much more right know about usability because I'm still at the beginning of this adventure but what I know for sure that it has tons of features and I know that I will find here what I'm looking for:)",
            "updated": 1674688565381
        },
        {
            "style": "Text",
            "text": "BTW - Tutorials are great!!"
        },
        {
            "style": "Text",
            "text": "splywaczyk"
        }
    ]
}