{
    "review": "Superalgos Project Review",
    "pageNumber": 39,
    "type": "Superalgos Review - A beginners perspective",
    "definition": {
        "text": "Superalgos is definitely a great platform and loads of fun. Even if you come from other patforms, there is quite a bit to master. For a new user, the ammount of features demands you to spend quite some quality time with the platform - in the end, you are planning to trade your hard earned cash. \nThe tutorials are very well written, the documentation is vast and the ammount of shared experertize is amazing. It is by far the most collaborative effort I see in the trading space.",
        "updated": 1640509936321,
        "translations": [
            {
                "language": "TR",
                "text": "Superalgos kesinlikle harika bir platform ve çok eğlenceli. Diğer platformlardan gelseniz bile, ustalaşmanız gereken çok şey var. Yeni bir kullanıcı için, özelliklerin miktarı platformla oldukça kaliteli zaman geçirmenizi gerektirir - sonunda, zor kazandığınız parayla ticaret yapmayı planlıyorsunuz. Eğitimler çok iyi yazılmış, dokümantasyon kapsamlı ve paylaşılan deneyim miktarı inanılmaz. Ticaret alanında gördüğüm açık ara en işbirlikçi çaba.",
                "updated": 1670695474638
            },
            {
                "language": "DE",
                "text": "Superalgos ist definitiv eine tolle Plattform, die viel Spaß macht. Selbst wenn man von anderen Plattformen kommt, gibt es einiges zu meistern. Für einen neuen Benutzer erfordert die Menge an Funktionen, dass man einige Zeit mit der Plattform verbringt - schließlich will man ja sein hart verdientes Geld handeln. Die Tutorials sind sehr gut geschrieben, die Dokumentation ist umfangreich und die Menge an gemeinsam genutzter Erfahrung ist erstaunlich. Es ist bei weitem die kollaborative Anstrengung, die ich im Handelsbereich sehe.",
                "updated": 1687641060702
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode. Then you can use docs.save to save your changes and app.contribute to send it to the main repository.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle'ye tıklayın . Yeni paragraflar yazmak için ENTER. Düzenleme modundan çıkmak için ESC. docs.saveArdından , değişikliklerinizi kaydetmek ve app.contributeana depoya göndermek için kullanabilirsiniz .",
                    "updated": 1670695420222
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen. Dann können Sie docs.save verwenden, um Ihre Änderungen zu speichern und app.contribute, um sie an das Haupt-Repository zu senden.",
                    "updated": 1687641075391
                }
            ]
        }
    ]
}