{
    "review": "Superalgos Project Review",
    "pageNumber": 24,
    "type": "Superalgos Review - Unmatched Awesome Project",
    "definition": {
        "text": "For a group of trader friends to come together and decide to endeavour on an automatic trading project, and then achieve the beta 11 version of this project, is pretty cool. \nAnd taking into account the unprecedented nature of this project, bordering on revolutionary, as well as the planned future functionalities and other significant project goals, I can only shake my head in absolute WONDER.\nAlso, I was only starting out on my journey with trading bots, barely gone through my 20 or 50 tabs I had open, and somehow I stumbled across SuperAlgos. I was immediately captured by your project. Nothing else got my attention this strongly.\n\nAlso thanks, because it saved me time going through those 50 other tabs!\nI immediately went and got a Raspberry Pi 4 B, after thinking about getting one for almost 10 years.\n\nAnyway, my words cannot do justice to your amazing project.\nAnd I havent even scratched the surface yet.\n\nLooking forward to mastering your platform and your future functionalities & project milestones.\nIntegration with Ethereum nodes? Holy cow.\n\nPlease just make sure you continue to honor the right to financial privacy, financial sovereignty, anonimity, individual privacy, etc. As much as your platform/project is able to.\nWe cannot and should not allow the SEC and similar \"authorities\" to interfere with projects like these.\nPlease make sure your platform is/will be 100% resistant against questionable centralised power structures...\n\nThanks\nJerome\nhttps://github.com/romeox7",
        "updated": 1630775798821,
        "translations": [
            {
                "language": "RU",
                "text": "Для группы друзей-трейдеров собраться вместе и решить заняться проектом автоматической торговли, а затем достичь бета-версии 11 этого проекта - это очень круто. \nА если учесть беспрецедентный характер этого проекта, граничащий с революционным, а также планируемые будущие функциональные возможности и другие значимые цели проекта, я могу только покачать головой в абсолютном изумлении.\nКроме того, я только начинал свой путь с торговыми ботами, едва просмотрел 20 или 50 открытых вкладок, и как-то наткнулся на SuperAlgos. Я был немедленно захвачен вашим проектом. Ничто другое не привлекло мое внимание так сильно.\n\nТакже спасибо, потому что это сэкономило мне время на просмотре тех 50 других вкладок!\nЯ сразу же пошел и купил Raspberry Pi 4 B, после того как думал о его приобретении почти 10 лет.\n\nВ любом случае, мои слова не могут передать справедливость вашего удивительного проекта.\nА я еще даже не поцарапал поверхность.\n\nС нетерпением жду освоения вашей платформы и ваших будущих функциональных возможностей и этапов проекта.\nИнтеграция с нодами Ethereum? Святая корова.\n\nПожалуйста, просто убедитесь, что вы продолжаете соблюдать право на финансовую конфиденциальность, финансовый суверенитет, анонимность, индивидуальную конфиденциальность и т.д. Настолько, насколько это возможно для вашей платформы/проекта.\nМы не можем и не должны позволять SEC и подобным \"органам\" вмешиваться в такие проекты.\nПожалуйста, убедитесь, что ваша платформа на 100% противостоит сомнительным централизованным структурам власти...\nThanks\nJerome\nhttps://github.com/romeox7",
                "updated": 1640414623691
            },
            {
                "language": "TR",
                "text": "Bir grup tüccar arkadaşın bir araya gelerek otomatik bir ticaret projesi üzerinde çalışmaya karar vermesi ve ardından bu projenin beta 11'e ulaşması oldukça şaşırtıcı. \nBu projenin devrim niteliğindeki eşi benzeri görülmemiş doğasının yanı sıra gelecekte planlanan işlevleri ve diğer önemli proje hedeflerini düşündüğümde, sadece mutlak ŞAŞKINLIK içinde başımı sallayabilirim.\nAyrıca, ticaret botlarıyla yolculuğuma yeni başlamıştım, açtığım 20 veya 50 sekmeyi zar zor geçtim ve bir şekilde SuperAlgos'a rastladım. Projeniz beni hemen yakaladı. Başka hiçbir şey dikkatimi bu kadar güçlü çekmedi.\n\nAyrıca teşekkürler, çünkü diğer 50 sekmeden geçerken bana zaman kazandırdı!\nHemen dışarı çıktım ve neredeyse 10 yıldır almayı düşündüğüm Raspberry Pi 4 B'yi satın aldım.\n\nHer neyse, kelimelerim muhteşem projenizin hakkını veremez.\nVe henüz yüzeyi bile kazımadım.\n\nPlatformunuzda ve gelecekteki işlevlerinizde ve proje kilometre taşlarınızda ustalaşmayı dört gözle bekliyorum.\nEthereum düğümleriyle entegrasyon mu? Vay anasını.\n\nLütfen finansal gizlilik, finansal egemenlik, anonimlik, bireysel gizlilik vb. haklara saygı duymaya devam ettiğinizden emin olun. Platformunuzun/projenizin yapabildiği kadar.\nSEC ve benzeri \"otoritelerin\" bu gibi projelere müdahale etmesine izin veremeyiz ve vermemeliyiz.\nTeşekkürler\n Jerome \nhttps://github.com/romeox7",
                "updated": 1670875580354
            },
            {
                "language": "DE",
                "text": "\nDass sich eine Gruppe von Trader-Freunden zusammenfindet und beschließt, ein automatisches Handelsprojekt in Angriff zu nehmen, und dann die Beta-11-Version dieses Projekts erreicht, ist ziemlich cool. Und in Anbetracht des beispiellosen Charakters dieses Projekts, der an eine Revolution grenzt, sowie der geplanten zukünftigen Funktionalitäten und anderen bedeutenden Projektzielen, kann ich nur den Kopf schütteln vor lauter WUNDER. Auch ich stand erst am Anfang meiner Reise mit Handelsrobotern, war kaum durch meine 20 oder 50 geöffneten Tabs gegangen und stolperte irgendwie über SuperAlgos. Ich war sofort von Ihrem Projekt gefangen. Nichts anderes hat meine Aufmerksamkeit so stark erregt. Auch danke, weil es mir Zeit erspart hat, diese 50 anderen Registerkarten durchzugehen! Ich bin sofort losgezogen und habe mir einen Raspberry Pi 4 B zugelegt, nachdem ich fast 10 Jahre lang darüber nachgedacht hatte, einen zu kaufen. Wie auch immer, meine Worte können Ihrem erstaunlichen Projekt nicht gerecht werden. Und ich habe noch nicht einmal an der Oberfläche gekratzt. Ich freue mich darauf, Ihre Plattform und Ihre zukünftigen Funktionalitäten und Projektmeilensteine zu meistern. Integration mit Ethereum-Knoten? Heilige Kuh. Bitte stellen Sie sicher, dass Sie weiterhin das Recht auf finanzielle Privatsphäre, finanzielle Souveränität, Anonymität, individuelle Privatsphäre, etc. respektieren. Soviel wie Ihre Plattform/Ihr Projekt dazu in der Lage ist. Wir können und sollten nicht zulassen, dass die SEC und ähnliche \"Behörden\" sich in Projekte wie diese einmischen. Bitte stellen Sie sicher, dass Ihre Plattform 100% resistent gegen fragwürdige zentralisierte Machtstrukturen ist/wird... Danke Jerome https://github.com/romeox7",
                "updated": 1686342808494
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode. Then you can use docs.save to save your changes and app.contribute to send it to the main repository.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle deyin. Yeni paragraflar yazmak için ENTER tuşuna basın. Düzenleme modundan çıkmak için ESC. Daha sonra değişikliklerinizi kaydetmek için docs.save ve ana depoya göndermek için app.contrib kullanabilirsiniz.",
                    "updated": 1670875482882
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen. Dann können Sie docs.save verwenden, um Ihre Änderungen zu speichern und app.contribute, um sie an das Haupt-Repository zu senden.",
                    "updated": 1686342821350
                }
            ]
        }
    ]
}