{
    "type": "Record Definition",
    "definition": {
        "text": "The record definition is where indicators define how many properties, what properties and in which order those properties will be made available in each record."
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Bots store data in the form of arrays of records, in a minimized plain text file and the standard JSON format, although not as objects with named properties, but as arrays."
        },
        {
            "style": "Text",
            "text": "The choice of plain text for storage of large volumes of information has benefits in terms of not requiring any sophisticated technology to store and serve the data (i.e.: no database is required)."
        },
        {
            "style": "Text",
            "text": "Best practice indicates that there needs to be a balance between the amount of data that is stored and calculations that may be performed at runtime."
        },
        {
            "style": "Text",
            "text": "Storing objects with named properties in the JSON format would be inappropriate as labels would repeat over and over, creating a ridiculous amount of unnecessary information. However, storing arrays in the JSON standard facilitates the handling of files in the context of JavaScript and Node.JS."
        },
        {
            "style": "Block",
            "text": "Record Properties"
        },
        {
            "style": "Title",
            "text": "What are the Record Properties used for?"
        },
        {
            "style": "Text",
            "text": "In general this is the mechanism to define what information is going to be available to the consumers of data of this product. "
        },
        {
            "style": "Text",
            "text": "When properties don't have a Formula, they define the format of the file that stores this data on disk. These record properties defines, the data type (string, number, etc), and in which order the data is saved. At the file there are no headers, just the data, because the header information is available here, for any process writing or reading the data from disk."
        },
        {
            "style": "Text",
            "text": "The formulas nodes there are used to expand the record definition adding fields that are not actually going to be saved on disk, to minimize space used, and they are going to be calculated at runtime. This allows processes that consume this data to have ell the fields available at runtime even though some were not actually saved on disk."
        }
    ]
}