{
    "tutorial": "Beyond the Basics",
    "pageNumber": 9,
    "type": "Tutorial Step - Now the Current Branch",
    "definition": {
        "text": "If everything went well, you must have got a confirmation that the Contributions Branch was changed! Awesome!",
        "icon": {
            "name": "github",
            "project": "Foundations"
        },
        "updated": 1616873181582,
        "translations": [
            {
                "language": "IT",
                "text": "Se tutto è andato bene, dovresti aver ricevuto una conferma che la Contributions Branch è cambiata! Fantastico!",
                "updated": 1619633713475,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si todo salió bien, ¡debes haber recibido una confirmación de que se cambió la Rama de Contribuciones! ¡Increíble!",
                "updated": 1628122632849,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wenn alles gut gegangen ist, müssen Sie eine Bestätigung erhalten haben, dass der Beitragszweig geändert wurde! Großartig!",
                "updated": 1634821709445
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Next in line is switching the Current Branch, but we need to run some checks first!",
            "updated": 1618154759190,
            "translations": [
                {
                    "language": "IT",
                    "text": "La prossima cosa da fare è cambiare la Current Branch, ma dobbiamo prima controllare un paio di cose!",
                    "updated": 1619633736968,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El siguiente en la línea es cambiar la rama actual, ¡pero primero debemos ejecutar algunas comprobaciones!",
                    "updated": 1628122656402,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Als nächstes steht der Wechsel des aktuellen Zweigs an, aber vorher müssen wir noch einige Prüfungen durchführen!",
                    "updated": 1634821735341
                }
            ]
        },
        {
            "style": "Note",
            "text": "When you switch branches, the app will run a series of Git commands that will download the software from the Develop branch of your fork! The current software will be replaced on your disk! For that reason, you will need to close the app after switching. But let's discuss a couple more things before you proceed!",
            "updated": 1636912890459,
            "translations": [
                {
                    "language": "IT",
                    "text": "Quando cambi branch, l'app esegue una serie di comandi Git che scaricano il software dal branch Plugins-Docs del tuo fork! Il software corrente viene quindi rimpiazzato su disco. Per questo motivo, dovrai chiudere l'app dopo aver cambiato. Ma prima di continuare vediamo un altro paio di cose!",
                    "updated": 1619634001960,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Cuando cambias de rama, la app ejecuta una serie de comandos de Git que descargan el software de la rama plugins-docs de tu fork. ¡El software actual será reemplazado en tu disco!Deberás cerrar la app después de cambiar. ¡Veamos unas cosas antes de continuar!",
                    "updated": 1628123112818,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie den Zweig wechseln, wird die Anwendung eine Reihe von Git-Befehlen ausführen, die die Software aus dem plugins-docs-Zweig Ihres Forks herunterladen! Die aktuelle Software wird auf Ihrer Festplatte ersetzt! Aus diesem Grund müssen Sie die Anwendung nach dem Wechsel schließen. Aber lassen Sie uns noch ein paar Dinge besprechen, bevor Sie fortfahren!",
                    "updated": 1634821752941
                }
            ]
        }
    ]
}