{
    "tutorial": "Beyond the Basics",
    "pageNumber": 22,
    "type": "Tutorial Step - Translation for Mere Mortals",
    "definition": {
        "text": "If you are not a developer or are not familiar with Git or GitHub, the previous paragraphs may have sounded like gibberish, I know!",
        "icon": {
            "name": "github",
            "project": "Foundations"
        },
        "updated": 1688055080656,
        "translations": [
            {
                "language": "IT",
                "text": "Se non sei uno sviluppatore o non conosci bene Git, probabilmente gli ultimi step ti sono sembrati un caos! Immagino!",
                "updated": 1619637224858,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si no eres desarrollador o no está familiarizado con Git o GitHub, ¡el paso anterior probablemente sonó como un galimatías! ",
                "updated": 1628192126203,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wenn Sie kein Entwickler sind oder sich mit Git oder GitHub nicht auskennen, hat sich der vorherige Schritt wahrscheinlich wie Kauderwelsch angehört! Ich weiß!",
                "updated": 1635150468856
            },
            {
                "language": "RU",
                "text": "Если вы не являетесь разработчиком или не знакомы с Git или GitHub, предыдущий шаг, вероятно, звучит как тарабарщина! Я знаю!",
                "updated": 1640162229929
            },
            {
                "language": "TR",
                "text": "Bir geliştirici değilseniz veya Git veya GitHub'a aşina değilseniz, önceki adım muhtemelen anlamsız geldi! Biliyorum!",
                "updated": 1640628612883
            },
            {
                "language": "ID",
                "text": "Jika kamu bukan pengembang atau tidak familiar dengan Git atau Github, langkah sebelumnya mungkin terdengar seperti omong kosong! Saya tahu!",
                "updated": 1668949104045
            },
            {
                "language": "NL",
                "text": "Als je geen ontwikkelaar bent of niet bekend bent met Git of GitHub, klonk de vorige stap waarschijnlijk als wartaal! Ik weet!",
                "updated": 1669749195943
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Git is an open-source version control system designed to handle collaboration. It's an industry standard.",
            "updated": 1610794687324,
            "translations": [
                {
                    "language": "IT",
                    "text": "Git è un controllo di versione open-source che ha lo scopo di gestire le collaborazioni. È lo standard industriale.",
                    "updated": 1619637277451,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Git es un sistema de control de versiones de código abierto diseñado para manejar la colaboración. Es un estándar de la industria.",
                    "updated": 1628192185824,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Git ist ein Open-Source-Versionskontrollsystem, das für die Zusammenarbeit entwickelt wurde. Es ist ein Industriestandard.",
                    "updated": 1635150475794
                },
                {
                    "language": "RU",
                    "text": "Git - это система контроля версий с открытым исходным кодом, предназначенная для совместной работы. Это промышленный стандарт.",
                    "updated": 1640162267159
                },
                {
                    "language": "TR",
                    "text": "Git, işbirliğini yönetmek için tasarlanmış açık kaynaklı bir sürüm kontrol sistemidir. Bu bir endüstri standardıdır.",
                    "updated": 1640628667802
                },
                {
                    "language": "ID",
                    "text": "Git merupakan sistem kontrol versi sumber terbuka yang dirancang untuk menangani kolaborasi. Ini adalah standar industri.",
                    "updated": 1668949159609
                },
                {
                    "language": "NL",
                    "text": "Git is een open-source versiebeheersysteem dat is ontworpen om samenwerking te beheren. Het is een industriestandaard.",
                    "updated": 1669749228541
                }
            ]
        },
        {
            "style": "Success",
            "text": "The previous step details the techinical steps required for the collaboration to work, meeting some basic norms so that your work doesn't mess up other people's work!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il passo precedente elenca gli steo tenici necessari per far regolare la collaborazione, seguendo alcune regole base così da non interferire con il lavoro di altre persone!",
                    "updated": 1619637356441,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "El paso anterior detalla los pasos técnicos necesarios para que la colaboración funcione, cumpliendo algunas normas básicas para que tu trabajo no estropee el trabajo de otras personas.",
                    "updated": 1628192217780,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": " Im vorherigen Schritt wurden die technischen Schritte beschrieben, die für eine funktionierende Zusammenarbeit erforderlich sind, und es wurden einige grundlegende Normen eingehalten, damit Ihre Arbeit nicht die Arbeit anderer Leute durcheinanderbringt!",
                    "updated": 1635150483066
                },
                {
                    "language": "RU",
                    "text": "В предыдущем шаге подробно описаны технические шаги, необходимые для совместной работы, соблюдение некоторых основных норм, чтобы ваша работа не испортила работу других людей!",
                    "updated": 1640162289947
                },
                {
                    "language": "TR",
                    "text": "Bir önceki adım, işbirliğinin çalışması için gerekli teknik adımların ayrıntılarını verir, bazı temel normları karşılar, böylece çalışmanız diğer insanların işlerini bozmaz!",
                    "updated": 1640628702616
                },
                {
                    "language": "ID",
                    "text": "Step sebelumnya lebih detail ke teknikal step yang dibutuhkan untuk kolaborasi dalam bekerja, bertemu dengan norma basis sehingga pekerjaanmu tidak berantakan dengan pekerjaan orang lain!",
                    "updated": 1668949166170
                },
                {
                    "language": "NL",
                    "text": "De vorige stap beschrijft de technische stappen die nodig zijn om de samenwerking te laten werken, waarbij aan enkele basisnormen wordt voldaan, zodat uw werk het werk van anderen niet in de war brengt!",
                    "updated": 1669749250732
                }
            ]
        },
        {
            "style": "Note",
            "text": "If you do understand Git, you are always free to decide what contribution workflow is best for you!",
            "updated": 1688040644502,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se conosci Git, puoi scegliere quale workflow seguire!",
                    "updated": 1619637378349,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Si comprendes Git, ¡siempre puedes decidir qué flujo de trabajo es mejor para ti!",
                    "updated": 1628192249959,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": " Wenn Sie sich mit Git auskennen, steht es Ihnen jederzeit frei zu entscheiden, welcher Arbeitsablauf für Sie am besten geeignet ist!",
                    "updated": 1635150489801
                },
                {
                    "language": "RU",
                    "text": "Если вы понимаете Git, вы всегда можете решить, какой способ работы лучше для вас!",
                    "updated": 1640162323336
                },
                {
                    "language": "TR",
                    "text": "Git'i anladıysanız, sizin için en iyi iş akışının hangisi olduğuna karar vermekte her zaman özgürsünüz!",
                    "updated": 1640628735839
                },
                {
                    "language": "ID",
                    "text": "JIka kamu memahami Git, kamu akan selalu bebas memutuskan alur kerja apa yang terbaik untukmu!",
                    "updated": 1668949176608
                },
                {
                    "language": "NL",
                    "text": "Als je Git goed begrijpt, ben je altijd vrij om te beslissen welke workflow voor jou het beste is!",
                    "updated": 1669749272252
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}