{
    "tutorial": "Beyond the Basics",
    "pageNumber": 4,
    "type": "Tutorial Step - Free For Everyone?",
    "definition": {
        "text": "Superalgos is a Community project! We make the software available to everyone free-of-charge, but we do ask for something in return... your help!",
        "updated": 1610713937383,
        "icon": {
            "name": "help",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Superalgos è un progetto basato sulla Community! Rendiamo il software disponibile a tutti gratuitamente, ma chiediamo qualcosa in cambio...il tuo aiuto!",
                "updated": 1619631895640,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Superalgos es un proyecto comunitario! Ponemos el software a disposición de todos de forma gratuita, pero pedimos algo a cambio ... ¡Tu ayuda!",
                "updated": 1628114247399,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Superalgos ist ein Community-Projekt! Wir stellen die Software für jeden kostenlos zur Verfügung, aber wir bitten um eine Gegenleistung... Ihre Hilfe!",
                "updated": 1634819982808
            },
            {
                "language": "TR",
                "text": "Superalgos bir Topluluk projesidir! Yazılımı ücretsiz olarak herkesin kullanımına sunuyoruz, ancak karşılığında bir şey istiyoruz... Yardımınız!",
                "updated": 1669616835486
            },
            {
                "language": "RU",
                "text": "Superalgos - это проект сообщества! Мы предоставляем программное обеспечение всем желающим бесплатно, но мы просим кое-что взамен... вашу помощь!",
                "updated": 1640154468349
            },
            {
                "language": "ID",
                "text": "Superalgos adalah Proyek Community! Kami membuat software secara gratis untuk semua orang, Tetapi kami meminta imbal balik yaitu... bantuanmu!",
                "updated": 1667872273134
            },
            {
                "language": "NL",
                "text": "Superalgos is een Community project! We stellen de software gratis ter beschikking aan iedereen, maar we vragen er wel iets voor terug... jouw hulp!",
                "updated": 1669573323197
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "How can Superalgos be free? What's the catch? We get those questions often! This is the short story...",
            "updated": 1610967035192,
            "translations": [
                {
                    "language": "IT",
                    "text": "Come fa Superalgos ad essere gratis? Dove sta il trucco? Ecco la storia...",
                    "updated": 1619631920615,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¿Cómo puede ser gratuito Superalgos? ¿Cuál es el truco? ¡Recibimos esas preguntas a menudo! ",
                    "updated": 1628114531768,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wie kann Superalgos kostenlos sein? Wo ist der Haken? Diese Fragen bekommen wir oft gestellt! Dies ist die kurze Geschichte...",
                    "updated": 1634819991250
                },
                {
                    "language": "TR",
                    "text": "Superalgos nasıl özgür olabilir? Amaç ne? Bu soruları sık sık alıyoruz! Kısa bir hikaye bu...",
                    "updated": 1639861692766
                },
                {
                    "language": "RU",
                    "text": "Как Superalgos может быть бесплатным? В чем подвох? Мы часто получаем эти вопросы! Вот краткая история...",
                    "updated": 1640154503032
                },
                {
                    "language": "ID",
                    "text": "Bagaimana bisa Superalgos ini gratis? Apa yang dicari? Kami sering mendengar pertanyaan itu! Ini cerita singkatnya...",
                    "updated": 1667872284867
                },
                {
                    "language": "NL",
                    "text": "Hoe kan Superalgos vrij zijn? Wat is het addertje onder het gras? Die vragen krijgen we vaak! Dit is het korte verhaal...",
                    "updated": 1669573340787
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Superalgos started with a group of friends joining forces to automate their Bitcoin trading!",
            "updated": 1691083098295,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos è iniziato con un gruppo di amici che hanno unito le forze per automatizzare il loro trading di crypto!",
                    "updated": 1619631952862,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Superalgos comenzó con un grupo de amigos que unieron fuerzas para automatizar crypto trading!",
                    "updated": 1628114508545,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Superalgos begann mit einer Gruppe von Freunden, die sich zusammentaten, um ihren Kryptohandel zu automatisieren!",
                    "updated": 1634820005138
                },
                {
                    "language": "TR",
                    "text": "Superalgos, kripto ticaretini otomatikleştirmek için bir grup arkadaşın güçlerini birleştirmesiyle başladı!",
                    "updated": 1639861707759
                },
                {
                    "language": "RU",
                    "text": "Компания Superalgos началась с того, что группа друзей объединила усилия для автоматизации торговли криптовалютами!",
                    "updated": 1640154520613
                },
                {
                    "language": "ID",
                    "text": "Superalgos bermulai dari pertemanan grup yang ingin mengotomatisasi trading crypto mereka!",
                    "updated": 1667872297699
                },
                {
                    "language": "NL",
                    "text": "Superalgos begon met een groep vrienden die hun krachten bundelden om hun cryptohandel te automatiseren!",
                    "updated": 1669573353723
                }
            ]
        },
        {
            "style": "Text",
            "text": "The friends soon realized that to compete with top market players a huge software infrastructure was required. The system needed to be on par or better than commercial and proprietary software available to firms. Such requirements could not be fulfilled by a small team —at least not in a reasonable timeframe.",
            "updated": 1616871844068,
            "translations": [
                {
                    "language": "IT",
                    "text": "Gli amici presto realizzarono che per competere con i top del mercato era necessaria una notevole infrastruttura software, che fosse al pari o migliore dei software proprietari usati dalle aziende. Un lavoro simile non poteva essere portato a termine da un piccolo team, almeno non in un intervallo di tempo ragionevole.",
                    "updated": 1619632081107,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Para competir con los jugadores top del mercado se necesitaba una enorme infraestructura de software. El sistema tenía que estar a la par o mejor que el software comercial y propietario disponible para las empresas. Un equipo pequeño no podría cumplir con estos requisitos, al menos no en un plazo razonable. ",
                    "updated": 1628116653688,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die Freunde erkannten bald, dass eine riesige Software-Infrastruktur erforderlich war, um mit den Top-Marktteilnehmern konkurrieren zu können. Das System musste gleichwertig oder besser sein als kommerzielle und proprietäre Software, die den Unternehmen zur Verfügung steht. Solche Anforderungen konnten von einem kleinen Team nicht erfüllt werden - zumindest nicht in einem vernünftigen Zeitrahmen.",
                    "updated": 1634820012134
                },
                {
                    "language": "TR",
                    "text": "Arkadaşlar kısa sürede en iyi piyasa oyuncularıyla rekabet edebilmek için büyük bir yazılım altyapısının gerekli olduğunu anladılar. Sistemin, firmalar için mevcut olan ticari ve tescilli yazılımlardan daha iyi veya eşit olması gerekiyordu. Bu tür gereksinimler küçük bir ekip tarafından -en azından makul bir zaman diliminde- yerine getirilemezdi.",
                    "updated": 1639861734929
                },
                {
                    "language": "RU",
                    "text": "Вскоре друзья поняли, что для того, чтобы конкурировать с ведущими игроками рынка, необходима огромная инфраструктура программного обеспечения. Система должна была быть на уровне или даже лучше, чем коммерческое и собственное программное обеспечение, доступное компаниям. Такие требования не могли быть выполнены небольшой командой - по крайней мере, в короткие сроки.",
                    "updated": 1640154577018
                },
                {
                    "language": "ID",
                    "text": "Lalu mereka ternyata menyadari bahwa untuk memenangkan top pemain di pasar perlu adanya struktur software yang memadai. Sistem ini harus sama atau lebih baik dari software komersil atau hak milik yang ada. Dengan syarat inilah tidak bisa digapai dari team kecil saja setidaknya di timeframe yang masuk akal.",
                    "updated": 1667872312519
                },
                {
                    "language": "NL",
                    "text": "De vrienden realiseerden zich al snel dat om te concurreren met topspelers op de markt, een enorme software-infrastructuur nodig was. Het systeem moest vergelijkbaar of beter zijn dan commerciële en eigen software die beschikbaar is voor bedrijven. Dergelijke vereisten konden niet worden vervuld door een klein team, althans niet binnen een redelijk tijdsbestek.",
                    "updated": 1669573407399
                }
            ]
        }
    ]
}