{
    "tutorial": "Beyond the Basics",
    "pageNumber": 20,
    "type": "Tutorial Step - Don't Forget to Save!",
    "definition": {
        "text": "Before you get to a novel-length kind of write-up, make sure you save the page every once in a while! No need to risk your prose!",
        "icon": {
            "name": "under-construction",
            "project": "Foundations"
        },
        "updated": 1610736735029,
        "translations": [
            {
                "language": "IT",
                "text": "Prima di lanciarti in una scrittura sfrenata, assicurati di salvare la pagina una volta ogni tanto! Non rischiare il tuo romanzo!",
                "updated": 1619636603159,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Antes de escribir un artículo de tamaño novedoso, ¡asegúrate de guardar la página de vez en cuando! ¡No hay necesidad de arriesgar tu prosa!",
                "updated": 1628190493254,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Bevor Sie einen romanartigen Text verfassen, sollten Sie die Seite ab und zu speichern! Kein Grund, Ihre Prosa zu riskieren!",
                "updated": 1635150216506
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Each paragraph you write is stored at the level of the browser session as soon as you exit Edit mode. However, to save the page on disk and avoid losing work on an eventual browser crash, run this command:",
            "updated": 1610822788853,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ogni paragrafo che scrivi è salvato a livello della sessione del browser appena esci dalla modalità Edit. Per salvare la pagina su disco ed evitare di perdere il lavoro in caso il browser crashasse, usa questo comando:",
                    "updated": 1619636674917,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Cada párrafo que escribes se almacena en el nivel de la sesión del navegador tan pronto como sale del modo de edición. Sin embargo, para guardar la página en el disco y evitar perder el trabajo en un eventual bloqueo del navegador, ejecute este comando:",
                    "updated": 1628190531998,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Jeder Absatz, den Sie schreiben, wird auf der Ebene der Browser-Sitzung gespeichert, sobald Sie den Bearbeitungsmodus verlassen. Um die Seite jedoch auf der Festplatte zu speichern und zu vermeiden, dass die Arbeit bei einem eventuellen Browserabsturz verloren geht, führen Sie diesen Befehl im Such- und Befehlsfeld oben in den Docs aus:",
                    "updated": 1635150273083
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "docs.save"
        },
        {
            "style": "Success",
            "text": "If for any reason you lose sight of the page, run the docs.reindex command and search for the title you gave it while adding it! You may also use the BACK button on the footer of the page!",
            "updated": 1610983878542,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se per qualche ragione perdi di vista la pagina, lancia il comando docs.reindex e cercala col titolo che le hai dato aggiungendola! Puoi anche usare il pulsante BACK sul footer della pagina!",
                    "updated": 1619636726170,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Si por alguna razón pierdes de vista la página, ejecuta el comando docs.reindex y busca el título que le diste al agregarlo. ¡También puedes usar el botón BACK en el pie de página!",
                    "updated": 1628191460990,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Sollten Sie die Seite aus irgendeinem Grund aus den Augen verlieren, führen Sie den Befehl docs.reindex aus und suchen Sie nach dem Titel, den Sie ihr beim Hinzufügen gegeben haben! Sie können auch die Schaltfläche BACK in der Fußzeile der Seite verwenden!",
                    "updated": 1635150232008
                }
            ]
        }
    ]
}