{
    "tutorial": "Beyond the Basics",
    "pageNumber": 5,
    "type": "Tutorial Step - A Brilliant Idea",
    "definition": {
        "text": "Superalgos is free for everyone because we want your help! We want the best minds in the space to help us build the ultimate trading automation platform!",
        "icon": {
            "name": "Nodes\\nodes-highlights",
            "project": "Foundations"
        },
        "updated": 1610719931963,
        "translations": [
            {
                "language": "IT",
                "text": "Superalgos è gratis per tutti, perchè vogliamo il tuo aiuto! Vogliamo le menti migliori e più volenterose per aiutarci a costruire la piattaforma di trading automatizzato definitiva!",
                "updated": 1619632162177,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Superalgos es gratis para todos porque queremos tu ayuda! ¡Queremos que las mejores mentes nos ayuden a construir la plataforma de automatización trading definitiva!",
                "updated": 1628116911425,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Superalgos ist für jeden kostenlos, weil wir Ihre Hilfe wollen! Wir möchten, dass die besten Köpfe in diesem Bereich uns helfen, die ultimative Handelsautomatisierungsplattform zu bauen!",
                "updated": 1634820114946
            },
            {
                "language": "TR",
                "text": "Superalgos herkes için ücretsizdir çünkü yardımınızı istiyoruz! En üst düzey ticaret otomasyon platformunu oluşturmamıza yardımcı olacak en iyi beyinleri istiyoruz!",
                "updated": 1639862797572
            },
            {
                "language": "RU",
                "text": "Superalgos бесплатен для всех, потому что мы хотим вашей помощи! Мы хотим, чтобы лучшие умы в этой области помогли нам создать совершенную платформу для автоматизации торговли!",
                "updated": 1640154671767
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Your first contribution is your feedback!",
            "updated": 1610715230137,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il tuo primo contributo è il tuo feedback!",
                    "updated": 1619632177630,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Tu primera contribución es tu feedback!",
                    "updated": 1628116797218,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Ihr erster Beitrag ist Ihr Feedback!",
                    "updated": 1634820120530
                },
                {
                    "language": "TR",
                    "text": "İlk katkınız geri bildiriminizdir!",
                    "updated": 1639862814128
                },
                {
                    "language": "RU",
                    "text": "Ваш первый вклад - это ваш отзыв!",
                    "updated": 1640154684405
                }
            ]
        },
        {
            "style": "Text",
            "text": "You've likely spent hours discovering Superalgos. We want to have your first impression, fresh from the recent experience! And we want your initial feedback to be the first of many contributions to the project.",
            "updated": 1611594469593,
            "translations": [
                {
                    "language": "IT",
                    "text": "Probabilmente ormai hai investito ore scoprendo Superalgos. Vorremmo sapere la tua prima impressione, fresca di un'esperienza recente! E vogliamo che il tuo feedback sia il primo di molti contributi al progetto.",
                    "updated": 1619632239016,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": " ¡Queremos tener tu primera impresión, fresca de la experiencia reciente! Y queremos que sus comentarios iniciales sean la primera de muchas contribuciones al proyecto.",
                    "updated": 1628117475146,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie haben wahrscheinlich Stunden damit verbracht, Superalgos zu entdecken. Wir möchten Ihren ersten Eindruck haben, frisch aus der jüngsten Erfahrung! Und wir möchten, dass Ihr erstes Feedback der erste von vielen Beiträgen zu diesem Projekt ist.",
                    "updated": 1634820126153
                },
                {
                    "language": "TR",
                    "text": "Muhtemelen Superalgos'u keşfetmek için saatler harcadınız. Superalgos hakkında ilk izleniminizi almak istiyoruz! Ve ilk geri bildiriminizin projeye yapacağınız birçok katkının ilki olmasını istiyoruz.",
                    "updated": 1639862913082
                },
                {
                    "language": "RU",
                    "text": "Скорее всего, вы потратили часы на то, чтобы открыть для себя Superalgos. Мы хотим получить ваше первое впечатление, свежее от недавнего опыта! И мы хотим, чтобы ваш первый отзыв стал первым из многих вкладов в проект.",
                    "updated": 1640154707766
                }
            ]
        },
        {
            "style": "Success",
            "text": "You don't need to be a star programmer or professional trader to contribute. Every user is expected to give back! I'll tell you how!",
            "updated": 1610822419407,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non devi essere un super-programmatore o un trader professionista per contribuire. Ci si aspetta che ogni utente dia un contributo! Ti dico come!",
                    "updated": 1619632343742,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "No necesitas ser un programador estrella o un trader profesional para contribuir. ¡Se espera que cada usuario retribuya! ¡Te diré cómo!",
                    "updated": 1628118458317,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Sie müssen kein Starprogrammierer oder professioneller Händler sein, um einen Beitrag zu leisten. Von jedem Nutzer wird erwartet, dass er etwas zurückgibt! Ich sage Ihnen wie!",
                    "updated": 1634820132090
                },
                {
                    "language": "TR",
                    "text": "Katkıda bulunmak için yıldız programcı veya profesyonel tüccar olmanıza gerek yok. Her kullanıcı katkı sunabilir! Sana nasıl olduğunu söyleyeceğim!",
                    "updated": 1639862964818
                },
                {
                    "language": "RU",
                    "text": "Вам не нужно быть выдающимся программистом или профессиональным трейдером, чтобы внести свой вклад. От каждого пользователя ожидается отдача! Я расскажу вам как!",
                    "updated": 1640154733997
                }
            ]
        }
    ]
}