{
    "tutorial": "Beyond the Basics",
    "pageNumber": 2,
    "type": "Tutorial - The Advanced Stuff!",
    "definition": {
        "text": "You're still around, now with the first two tutorials under your belt! You're family already! Welcome to the Community!",
        "updated": 1616757706219,
        "icon": {
            "name": "Tutorial\\tutorial",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Ci sei ancora? Ormai, con due tutorial completati sul tuo curriculum, sei di famiglia! Benvenuto nella Community!",
                "updated": 1619631145148,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Todavía estás aquí, ahora con los dos primeros tutoriales en el bolsillo! ¡Ya eres familia! Bienvenido a la Community!",
                "updated": 1675448973927,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Du bist immer noch da, jetzt mit den ersten beiden Tutorials unter deinem Gürtel! Du gehörst schon zur Familie! Willkommen in der Community!",
                "updated": 1634819545877
            },
            {
                "language": "TR",
                "text": "İlk iki eğitim sonrasında hala buralardasınız! Bu yüzden artık aileden olduğunu farzediyorum! Topluluğa hoş geldin!",
                "updated": 1639859287265
            },
            {
                "language": "RU",
                "text": "Вы все еще здесь, теперь у вас за плечами первые два урока! Вы уже член семьи! Добро пожаловать в Community!",
                "updated": 1645269583740
            },
            {
                "language": "ID",
                "text": "Kamu masih disekitar sini ternyata, sekarang dengan dua tutorial yang telah kamu lakukan!, kamu sudah termasuk keluarga dan Selamat Datang di Komunitas ini!",
                "updated": 1667870143073
            },
            {
                "language": "NL",
                "text": "Je bent er nog steeds, nu met de eerste twee zelfstudies onder de knie! Ben je al familie! Welkom bij de Community!",
                "updated": 1669572962749
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "In this tutorial, you will learn to keep your system up to date, use the built-in command line, switch branches, and a few more tricks that will make your life easier!",
            "updated": 1616871630234,
            "translations": [
                {
                    "language": "IT",
                    "text": "In questo tutorial imparerai come tenere aggiornato il sistema, usare la sua command-line, cambiare branches e altri trucchi utili!",
                    "updated": 1619631204346,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "En este tutorial, aprenderás a mantener tu sistema actualizado, utilizar la línea de comandos incorporada, cambiar de rama y algunos trucos más que le facilitarán la vida.",
                    "updated": 1628112392254,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "In diesem Tutorial lernst du, dein System auf dem neuesten Stand zu halten, die eingebaute Kommandozeile zu benutzen, Zweige zu wechseln und ein paar weitere Tricks, die dir das Leben leichter machen werden!",
                    "updated": 1634819554314
                },
                {
                    "language": "TR",
                    "text": "Bu öğreticide, sisteminizi güncel tutmayı, yerleşik komut satırını kullanmayı, dalları değiştirmeyi ve hayatınızı kolaylaştıracak birkaç püf noktası daha öğreneceksiniz!",
                    "updated": 1639859317105
                },
                {
                    "language": "RU",
                    "text": "В этом учебнике вы научитесь поддерживать систему в актуальном состоянии, использовать встроенную командную строку, переключать ветви и еще нескольким приемам, которые облегчат вам жизнь!",
                    "updated": 1640154232069
                },
                {
                    "language": "ID",
                    "text": "Dalam tutorial ini kamu akan belajar untuk selalu up to date dengan system yang ada, menggunakan command/perintah bawaan, mengganti branches, dan beberapa trik untuk mempermudah hidupmu!",
                    "updated": 1667870960513
                },
                {
                    "language": "NL",
                    "text": "In deze zelfstudie leer je je systeem up-to-date te houden, de ingebouwde opdrachtregel te gebruiken, van branch te wisselen en nog een paar trucjes die je leven gemakkelijker zullen maken!",
                    "updated": 1669572996293
                }
            ]
        },
        {
            "style": "Warning",
            "text": "This tutorial covers features relevant to users of the Installation for Contributors and Developers. If you're using the Packaged or Docker versions, many of the features described hereinafter will not work for you! That said, please do continue as you will also learn how to use the Docs!",
            "updated": 1687888974476,
            "translations": [
                {
                    "language": "IT",
                    "text": "Le skill che imparerai ti permetteranno anche di iniziare a contribuire al progetto! Ricorda, questo è un progetto basato sulla community... Ci si aspetta che ognuno di noi faccia quel che può per aiutare e migliorare il software!",
                    "updated": 1619631313456,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Este tutorial cubre características relevantes para los usuarios de la Instalación para Colaboradores y Desarrolladores. Si está utilizando las versiones empaquetadas o Docker, muchas de las características descritas a continuación no funcionarán para ti. Dicho esto, por favor continúa, ya que también aprenderás a utilizar los Documentos.",
                    "updated": 1675449045352,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Die Fähigkeiten, die Sie erlernen werden, werden es Ihnen auch ermöglichen, einen Beitrag zum Projekt zu leisten! Denken Sie daran, dass dies ein Community-Projekt ist... Es wird von uns allen erwartet, dass wir etwas zurückgeben und helfen, die Software zu verbessern!",
                    "updated": 1634819569822
                },
                {
                    "language": "TR",
                    "text": "Bu öğretici, Katkıda Bulunanlar ve Geliştiriciler için Yükleme kullanıcılarıyla ilgili özellikleri kapsar. Paketlenmiş veya Docker sürümlerini kullanıyorsanız, bundan sonra açıklanan özelliklerin çoğu işinize yaramayacaktır! Bununla birlikte, Dokümanları nasıl kullanacağınızı da öğreneceğiniz için lütfen devam edin!",
                    "updated": 1669616612681
                },
                {
                    "language": "RU",
                    "text": "Навыки, которые вы приобретете, также позволят вам начать вносить свой вклад в проект! Помните, это проект сообщества... Мы все должны внести свой вклад и помочь улучшить программное обеспечение!",
                    "updated": 1640154256163
                },
                {
                    "language": "ID",
                    "text": "Fitur yang tercakup dalam Tutorial ini sangat relevan dengan user yang ingin menginstall untuk Kontribusi dan Pengembangan. Jika kamu menggunakan versi Packaged dan Docker, banyak fitur yang tidak berfungsi untuk Kamu!, Maka dari itu tolong lanjutkan saja tutorialnya sekaligus untuk mempelajari cara menggunakan Docs!",
                    "updated": 1667897784356
                },
                {
                    "language": "NL",
                    "text": "Deze zelfstudie behandelt functies die relevant zijn voor gebruikers van de installatie, voor mensen die bijdragen en ontwikkelaars. Als u de Packaged- of Docker-versie gebruikt, zullen veel van de hierna beschreven functies niet voor u werken! Dat gezegd hebbende, ga alsjeblieft door, want je zult ook leren hoe je de Docs moet gebruiken!",
                    "updated": 1669573071158
                }
            ]
        },
        {
            "style": "Link",
            "text": "By the way, contributing to the project earns you Superalgos (SA) tokens! Click to learn more!->superalgos.org/token-overview.shtml",
            "updated": 1617035100951,
            "translations": [
                {
                    "language": "DE",
                    "text": "Übrigens, wenn Du zum Projekt beiträgst, erhältst Du Superalgos (SA) Token! Klicke, um mehr zu erfahren!->superalgos.org/token-overview.shtml",
                    "updated": 1634819622423
                },
                {
                    "language": "TR",
                    "text": "Bu arada, projeye katkıda bulunmak size Superalgos (SA) jetonları kazandırıyor! Daha fazlasını öğrenmek için tıklayın!->superalgos.org/token-overview.shtml",
                    "updated": 1654393892890,
                    "style": "Link"
                },
                {
                    "language": "ID",
                    "text": "Ngomong-ngomong, berkontribusi ke project akan mendapatkan token  Superalgos (SA), Klik untuk mempelajari lebih lanjut!->superalgos.org/token-overview.shtml",
                    "updated": 1667870927197
                },
                {
                    "language": "NL",
                    "text": "Trouwens, door bij te dragen aan het project verdien je Superalgos (SA) tokens! Klik om er meer over te leren!->superalgos.org/token-overview.shtml",
                    "updated": 1669573107218
                },
                {
                    "language": "ES",
                    "text": "Por cierto, contribuir al proyecto te permite ganar tokens de Superalgos (SA). Haz clic para saber más->https://superalgos.org/token-overview.shtml",
                    "updated": 1675452122572
                }
            ]
        }
    ]
}