{
    "tutorial": "Beyond the Basics",
    "pageNumber": 17,
    "type": "Tutorial Step - Breaking Up The Command",
    "definition": {
        "text": "Before you get on with writing your awesome review, let me parse the command so that you understand what you just did!",
        "icon": {
            "name": "copy-path",
            "project": "Foundations"
        },
        "updated": 1616875920510,
        "translations": [
            {
                "language": "IT",
                "text": "Prima che tu scriva la tua fantastica recensione, analizziamo il comando in dettaglio per capire cosa hai fatto esattamente!",
                "updated": 1619635779531,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Antes de que empieces a escribir tu increíble reseña, déjame analizar el comando para que entiendas lo que acabas de hacer.",
                "updated": 1628187556269,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Bevor Sie mit dem Schreiben Ihrer tollen Rezension weitermachen, lassen Sie mich den Befehl zerlegen, damit Sie verstehen, was Sie gerade getan haben!",
                "updated": 1635148901086
            },
            {
                "language": "RU",
                "text": "Прежде чем вы приступите к написанию своего потрясающего обзора, позвольте мне описать эту команду, чтобы вы поняли, что вы только что сделали!",
                "updated": 1640160619289
            },
            {
                "language": "TR",
                "text": "Müthiş incelemenizi yazmaya başlamadan önce, ne yaptığınızı anlamanız için komutu incelememe izin verin!",
                "updated": 1640609570442
            },
            {
                "language": "ID",
                "text": "Sebelum kamu menulis review yang keren, Biarkan aku menjelaskan perintah yang ada sehingga kamu mengerti apa yang baru saja kamu lakukan!",
                "updated": 1668848278685
            },
            {
                "language": "NL",
                "text": "Voordat je verder gaat met het schrijven van je geweldige recensie, wil ik de opdracht ontleden zodat je begrijpt wat je net hebt gedaan!",
                "updated": 1669747486411
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "docs.add: root syntax of the Docs Add Command.",
            "updated": 1622026675056,
            "translations": [
                {
                    "language": "IT",
                    "text": "docs.add: la base sintattica del comando Docs Add.",
                    "updated": 1619635805443,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "docs.add: sintaxis raíz del Docs Add Command.",
                    "updated": 1628187573188,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "docs.add: root syntax des Docs Add Command.",
                    "updated": 1635148919397
                },
                {
                    "language": "RU",
                    "text": "docs.add: корневой синтаксис команды добавления документов (Docs Add Command).",
                    "updated": 1640159775339
                },
                {
                    "language": "TR",
                    "text": "docs.add: Docs Add Command kök sözdizimi.",
                    "updated": 1640609613550
                },
                {
                    "language": "ID",
                    "text": "docs.add: root syntax dari Docs Add Command.",
                    "updated": 1668848329662
                },
                {
                    "language": "NL",
                    "text": "docs.add: root syntax van het Docs Add Command.",
                    "updated": 1669747521482
                }
            ]
        },
        {
            "style": "List",
            "text": "Review: the Docs Page Category of the page.",
            "updated": 1622026680654,
            "translations": [
                {
                    "language": "IT",
                    "text": "Review: la categoria della pagina docs",
                    "updated": 1619635830345,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Review: El Docs Page Category de la página.",
                    "updated": 1628187593354,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Review: die Docs Page Category der Seite.",
                    "updated": 1635148950148
                },
                {
                    "language": "RU",
                    "text": "Review: категория страницы документов (Docs Page Category).",
                    "updated": 1640159864526
                },
                {
                    "language": "TR",
                    "text": "Review: Sayfanın kategorisi. ( Docs Page Category )",
                    "updated": 1640609711999
                },
                {
                    "language": "ID",
                    "text": "Review: Docs Page Category dari halaman.",
                    "updated": 1668848341996
                },
                {
                    "language": "NL",
                    "text": "Review: de Docs Page Category van de pagina.",
                    "updated": 1669747549903
                }
            ]
        },
        {
            "style": "List",
            "text": "to: a coloquial connector to improve readability.",
            "updated": 1622026685974,
            "translations": [
                {
                    "language": "IT",
                    "text": "to: particella linguistica per aumentare la leggibilità",
                    "updated": 1619635894308,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "to: Un conector coloquial para mejorar la legibilidad.",
                    "updated": 1628187623878,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "to: ein umgangssprachlicher Konnektor, um die Lesbarkeit zu verbessern.",
                    "updated": 1635148965566
                },
                {
                    "language": "RU",
                    "text": "to: колокальный соединитель для улучшения читабельности.",
                    "updated": 1640159893159
                },
                {
                    "language": "TR",
                    "text": "to: okunabilirliği artırmak için bir konuşma dili bağlayıcısı.",
                    "updated": 1640609736194
                },
                {
                    "language": "ID",
                    "text": "to: Bahasa sehari-hari untuk menyatukan dan improvisasi pembacaan.",
                    "updated": 1668848357897
                },
                {
                    "language": "NL",
                    "text": "to: een informele connector om de leesbaarheid te verbeteren.",
                    "updated": 1669747570610
                }
            ]
        },
        {
            "style": "List",
            "text": "Foundations: the Project to which the page is added.",
            "updated": 1636913558286,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos: il progetto a cui verrà aggiunta la pagina",
                    "updated": 1619635908258,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Superalgos: das Projekt, zu dem die Seite hinzugefügt wird.",
                    "updated": 1635148976136
                },
                {
                    "language": "RU",
                    "text": "Foundations: проект, в который добавляется страница.",
                    "updated": 1640159909273
                },
                {
                    "language": "TR",
                    "text": "Foundations:Vakıflar: Sayfanın eklendiği proje ( Project )",
                    "updated": 1640609759564
                },
                {
                    "language": "ID",
                    "text": "Foundations: Project dimana halaman itu ditambahkan.",
                    "updated": 1668848373007
                },
                {
                    "language": "NL",
                    "text": "Foundations: het Project waaraan de pagina is toegevoegd.",
                    "updated": 1669747625706
                },
                {
                    "language": "ES",
                    "text": "Foundations: el Proyecto al que se añade la página.",
                    "updated": 1675452596781
                }
            ]
        },
        {
            "style": "List",
            "text": "Superalgos Project Review: the name of the collection of pages the review belongs to.",
            "updated": 1622026700473,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos Project Review: il nome della raccolta di pagine a cui la recensione appartiene",
                    "updated": 1619635928719,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Superalgos Project Review: El nombre de la colección de páginas a la que pertenece la reseña.",
                    "updated": 1628187652957,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Superalgos Project Review: der Name der Seitensammlung, zu der die Review gehört.",
                    "updated": 1635148984696
                },
                {
                    "language": "RU",
                    "text": "Superalgos Project Review: название коллекции страниц, к которой относится обзор.",
                    "updated": 1640160379654
                },
                {
                    "language": "TR",
                    "text": "Superalgos Project Review: Superalgos Proje İncelemesi: İncelemenin ait olduğu sayfa koleksiyonunun adı.",
                    "updated": 1640609778188
                },
                {
                    "language": "ID",
                    "text": "Superalgos Project Review: nama dari kumpulan halaman tempat review tersebut berada.",
                    "updated": 1668848385662
                },
                {
                    "language": "NL",
                    "text": "Superalgos Project Review: de naam van de verzameling pagina's waartoe de recensie behoort.",
                    "updated": 1669747596255
                }
            ]
        },
        {
            "style": "List",
            "text": "->: a separator used in commands that require two user-defined parameters (in this case, the name of the collection of pages, and the name of the page).",
            "updated": 1622026705612,
            "translations": [
                {
                    "language": "IT",
                    "text": "->: separatore usato nei comandi che richiedono due parametri definiti dall'utente (in questo caso, il nome della collezione di pagine e il nome della pagina)",
                    "updated": 1619635980025,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "->: Separador utilizado en comandos que requieren dos parámetros definidos por el usuario (el nombre de la colección de páginas y el nombre de la página).",
                    "updated": 1628188066628,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "->: ein Trennzeichen, das in Befehlen verwendet wird, die zwei benutzerdefinierte Parameter erfordern (in diesem Fall den Namen der Seitensammlung und den Namen der Seite).",
                    "updated": 1635148994252
                },
                {
                    "language": "RU",
                    "text": "->: разделитель, используемый в командах, требующих два определяемых пользователем параметра (в данном случае название коллекции страниц и название страницы).",
                    "updated": 1640160413029
                },
                {
                    "language": "TR",
                    "text": "->: ->: iki kullanıcı tanımlı parametre gerektiren komutlarda kullanılan bir ayırıcı (bu durumda, sayfa koleksiyonunun adı ve sayfanın adı).",
                    "updated": 1640609803436
                },
                {
                    "language": "ID",
                    "text": "->: pemisah yang digunakan dalam perintah yang memerlukan dua parameter yang ditentukan pengguna (dalam hal ini, nama kumpulan halaman, dan nama halaman).",
                    "updated": 1668848396875
                },
                {
                    "language": "NL",
                    "text": "->: een scheidingsteken dat wordt gebruikt in opdrachten die twee door de gebruiker gedefinieerde parameters vereisen (in dit geval de naam van de verzameling pagina's en de naam van de pagina).",
                    "updated": 1669747618058
                }
            ]
        },
        {
            "style": "List",
            "text": "Superalgos Review - Your Review Title: this is the Docs Page Name; we repeat Superalgos Review in the page name to lower the odds of duplicate names",
            "updated": 1622026771878,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos Review - Your Review Title: il nome della pagina nei Docs. Ripetiamo Superalgos Review nel nome per evitare il più possibile nomi duplicati.",
                    "updated": 1619636023226,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Superalgos Review - Your Review Title: Es el Docs Page Name; repetimos Superalgos Review en el nombre de la página para reducir las probabilidades de nombres duplicados.",
                    "updated": 1628188140031,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Superalgos Review - Your Review Title: dies ist der Docs Page Name; wir wiederholen Superalgos Review im Seitennamen, um die Wahrscheinlichkeit doppelter Namen zu verringern",
                    "updated": 1635149022701
                },
                {
                    "language": "RU",
                    "text": "Superalgos Review - Your Review Title: это название страницы (Docs Page Name); мы повторяем Superalgos Review в названии страницы, чтобы снизить вероятность дублирования названий.",
                    "updated": 1640160523658
                },
                {
                    "language": "TR",
                    "text": "Superalgos Review - Your Review Title: Superalgos İncelemesi - İnceleme Başlığınız: bu, Dokümanlar Sayfa Adıdır; Yinelenen adların olasılığını azaltmak için sayfa adında Superalgos İncelemesini tekrarlıyoruz",
                    "updated": 1640609834844
                },
                {
                    "language": "ID",
                    "text": "Superalgos Review - Your Review Title: inilah Docs Page Name: kami ulangi Superalgos Review di nama halaman untuk menurunkan kemungkinan nama duplikat",
                    "updated": 1668848410468
                },
                {
                    "language": "NL",
                    "text": "Superalgos Review - Your Review Title: dit is de naam van de Docs Page Name; we herhalen Superalgos Review in de paginanaam om de kans op dubbele namen te verkleinen",
                    "updated": 1669747687986
                }
            ]
        }
    ]
}