{
    "tutorial": "Beyond the Basics",
    "pageNumber": 25,
    "type": "Tutorial Step - Set Up the Token!",
    "definition": {
        "text": "After you hit the Generate Token button, you'll get your precious token! Copy it before you leave the page! You won't see it again!",
        "icon": {
            "name": "github-api",
            "project": "Foundations"
        },
        "updated": 1687972420009,
        "translations": [
            {
                "language": "IT",
                "text": "Dopo aver premuto il tasto Generate Token, otterrai il tuo token! Non lasciare la pagina perchè non lo vedrai mai più!",
                "updated": 1619638408223,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Después de presionar el botón <i>Generate Token</i>, ¡obtendrás tu precioso token! ¡No salgas de la página, ya que no la volverás a ver!",
                "updated": 1675454353910,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Nachdem Sie auf die Schaltfläche \"Token generieren\" geklickt haben, erhalten Sie Ihren wertvollen Token! Verlassen Sie die Seite nicht, denn Sie werden ihn nie wieder sehen!",
                "updated": 1635151146569
            },
            {
                "language": "TR",
                "text": "Belirteci Oluştur (Generate Token) düğmesine bastıktan sonra değerli kodunuzu alacaksınız! Sayfayı bir daha görmeyeceğiniz için şu anda lütfen terk etmeyin! (Bu arada kodunuzu ve secret key'inizi bir yere not alarak saklamanız tavsiye edilir)",
                "updated": 1640001539935
            },
            {
                "language": "RU",
                "text": "После нажатия кнопки Generate Token вы получите свой драгоценный токен! Не покидайте страницу, так как вы больше никогда его не увидите!",
                "updated": 1640162993353
            },
            {
                "language": "ID",
                "text": "Setelah kamu menekan tombol Generate Token, kamu akan mendapatkan token berhargamu! Jangan tinggalkan halaman tersebut karena tidak akan melihatnya lagi!",
                "updated": 1668950334903
            },
            {
                "language": "NL",
                "text": "Nadat je op de Generate Token-knop hebt gedrukt, krijg je je kostbare token! Verlaat de pagina niet, want je zult hem nooit meer zien!",
                "updated": 1669749629549
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "In the Contributions Panel, expand the Github Credentials tab, enter your Github username (not your email!) on the first field, paste the token on the second field, and hit Save. ",
            "translations": [
                {
                    "language": "IT",
                    "text": "Copia il token, apri la config del nodo Githup API, e incollalo tra le virgolette del token parameter. Riempi il parametro user con il tuo utente GitHub.com (non la mail)!",
                    "updated": 1619638498454,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Copia el token, abre la configuración del nodo Github API, y pégalo entre las comillas dobles del parámetro del token. Completa el parámetro de nombre de usuario con tu usuario de GitHub.com, no con tu correo electrónico.",
                    "updated": 1675454381887,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Kopieren Sie das Token, öffnen Sie die Github-API Knotenkonfiguration und fügen Sie es zwischen den Anführungszeichen des Token-Parameters ein. Füllen Sie den Parameter username mit Ihrem GitHub.com-Benutzer aus, nicht mit Ihrer E-Mail!",
                    "updated": 1635151154637
                },
                {
                    "language": "TR",
                    "text": "Belirteci kopyalayın, Github API düğüm yapılandırmasını açın ve \"Token\" parametresinin karşısındaki çift tırnak işaretleri arasına yapıştırın. Username parametresinin karşışındaki çift tırnak işareti arasına da github.com'daki kullanıcı adınızı yazın.(e-posta adresinizi değil)",
                    "updated": 1640001502701
                },
                {
                    "language": "RU",
                    "text": "Скопируйте токен, откройте конфигурацию узла Github API и вставьте его между двойными кавычками параметра token. Заполните параметр username своим именем пользователя GitHub.com, а не электронной почтой!",
                    "updated": 1640163035110
                },
                {
                    "language": "ID",
                    "text": "Salin token tersebut, buka Github API konfigurasi node, dan tempelkan diantara dua tanda kurung dalam token parameter. Isi parameter username dengan nama pengguna Github.com kamu, bukan email kamu!",
                    "updated": 1668950341905
                },
                {
                    "language": "NL",
                    "text": "Kopieer het token, open de configuratie van het Github API knooppunt en plak het tussen de dubbele aanhalingstekens van de token parameter. Vul de username parameter in met uw GitHub.com-gebruiker, niet met uw e-mailadres!",
                    "updated": 1669749676494
                }
            ],
            "updated": 1688041316691
        },
        {
            "style": "Note",
            "text": "Superalgos stores the token in a JSON file in the My-Secrets folder. The token is used to authenticate with GitHub.com's API to create the Pull Request. It is never sent or stored anywhere else.",
            "updated": 1687972521470,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos salva il token nel file workspace, come la tua Exchange Account Key. Il token viene usato per autenticarti con l'API di GitHub.com e creare la Pull Request. Non è mai inviato nè salvato altrove.",
                    "updated": 1619638547007,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Superalgos almacena el token en el archivo del workspace al igual que tu Exchange Account Key. El token se utiliza para autenticar con GitHub.com's API para crear el Pull Request. Nunca se envía ni se almacena en ningún otro lugar.",
                    "updated": 1628195820811,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Superalgos speichert das Token in der Workspace-Datei, genau wie Ihren Exchange Account Key. Das Token wird zur Authentifizierung mit der API von GitHub.com verwendet, um den Pull Request zu erstellen. Es wird niemals an eine andere Stelle gesendet oder gespeichert.",
                    "updated": 1635151165009
                },
                {
                    "language": "TR",
                    "text": "Superalgos, belirteci tıpkı Exchange Hesap Anahtarınız ( Exchange Account Key ) gibi çalışma alanı dosyasında saklar. Belirteç, Çekme İsteği oluşturmak için GitHub.com'un API'si ile kimlik doğrulaması yapmak için kullanılır. Asla başka bir yere gönderilmez veya saklanmaz.",
                    "updated": 1640001610620
                },
                {
                    "language": "RU",
                    "text": "Superalgos хранит токен в файле рабочего пространства, как и ключ учетной записи Exchange Account Key. Токен используется для аутентификации с API GitHub.com для создания Pull Request. Он никогда не отправляется и не хранится где-либо еще.",
                    "updated": 1640163090881
                },
                {
                    "language": "ID",
                    "text": "Superalgos menyimpan token pada file workflow, seperti Exchange Account Key kamu. token ini digunakan untuk memberikan autentikasi dengan API Github.com untuk membuat Pull Request. Itu tidak pernah dikirim atau disimpan pada tempat lain.",
                    "updated": 1668950350964
                },
                {
                    "language": "NL",
                    "text": "Superalgos slaat het token op in het werkruimtebestand, net als uw Exchange Account Key. Het token wordt gebruikt om te verifiëren met de API van GitHub.com om het Pull Request te maken. Het wordt nooit ergens anders verzonden of opgeslagen.",
                    "updated": 1669749725393
                }
            ]
        }
    ]
}