{
    "tutorial": "Beyond the Basics",
    "pageNumber": 23,
    "type": "Tutorial Step - GitHub.com Authentication",
    "definition": {
        "text": "For the app.contribute command to work, you need to authenticate at two different levels. We'll deal with GiHub.com first!",
        "icon": {
            "name": "github-api",
            "project": "Foundations"
        },
        "updated": 1610799914806,
        "translations": [
            {
                "language": "IT",
                "text": "Perchè il comando app.contribute funzioni, dovrai autenticarti a due livelli differenti. Concentriamoci prima su GitHub.com!",
                "updated": 1619641609528,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Para el app.contribute comando para que funcione, debe autenticarse en dos niveles diferentes. ¡Primero trataremos con GiHub.com!",
                "updated": 1628194149826,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Damit der Befehl app.contribute funktioniert, müssen Sie sich auf zwei verschiedenen Ebenen authentifizieren. Wir befassen uns zuerst mit GiHub.com!",
                "updated": 1635150651730
            },
            {
                "language": "RU",
                "text": "Чтобы команда app.contribute работала, вам необходимо пройти аутентификацию на двух разных уровнях. Сначала мы разберемся с GiHub.com!",
                "updated": 1640162342611
            },
            {
                "language": "TR",
                "text": "app.contribute komutunun çalışması için iki farklı düzeyde kimlik doğrulaması yapmanız gerekir. Önce GiHub.com ile ilgileneceğiz!",
                "updated": 1640629205391
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You need to authenticate at GitHub.com for the Client to create the Pull Request on your behalf. To do that, you will create a Personal Access Token on GitHub.com:",
            "updated": 1610827192524,
            "translations": [
                {
                    "language": "IT",
                    "text": "Devi autenticarti su GitHub.com perchè il Client possa creare la Pull Request a tuo nome. Per fare ciò, devi creare un Personal Access Token su GitHub.com:",
                    "updated": 1619641662760,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Necesitas autenticarte en GitHub.com para el Client para crear el Pull Request en tu nombre. Para hacer eso, crearás un Personal Access Token en GitHub.com:",
                    "updated": 1628194254004,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie müssen sich bei GitHub.com registrieren und authentifizieren, damit der Client den Pull Request in Ihrem Namen erstellen kann. Dazu erstellen Sie ein persönliches Zugriffstoken auf GitHub.com:",
                    "updated": 1635150710714
                },
                {
                    "language": "RU",
                    "text": "Вам необходимо пройти аутентификацию на GitHub.com, чтобы клиент (Client) мог создать Pull Request от вашего имени. Для этого вы создадите личный токен доступа (Personal Access Token) на GitHub.com:",
                    "updated": 1640162394295
                },
                {
                    "language": "TR",
                    "text": "İstemcinin sizin adınıza Çekme İsteği oluşturması için GitHub.com'da kimlik doğrulaması yapmanız gerekir. Bunu yapmak için GitHub.com'da bir Kişisel Erişim Simgesi (PPersonal Access Token) oluşturacaksınız:",
                    "updated": 1640629257214
                }
            ]
        },
        {
            "style": "Link",
            "text": "Create a GitHub.com Personal Access Token->github.com/settings/tokens/new",
            "updated": 1610959147665,
            "translations": [
                {
                    "language": "DE",
                    "text": "Persönlichen GitHub.com-Zugangs-Token erstellen->github.com/settings/tokens/new",
                    "updated": 1635150765768
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Click the link and follow the instructions! Make sure you give the token the repo and workflow scopes. Check the clip on the next step for clarity...",
            "updated": 1622028428181,
            "translations": [
                {
                    "language": "IT",
                    "text": "Clicca il link e segui le istruzioni sotto! Guarda il video al prossimo step per più dettagli...",
                    "updated": 1619641789005,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Haz clic en el enlace y sigue las instrucciones. Asegúrate de darle al token el repositorio y los alcances del flujo de trabajo. Mira el clip en el siguiente paso para mayor claridad…",
                    "updated": 1628194375782,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf den Link und folgen Sie den Anweisungen! Vergewissern Sie sich, dass Sie dem Token die Bereiche Repo und Workflow zuweisen. Schauen Sie sich den Clip im nächsten Schritt an, um Klarheit zu schaffen...",
                    "updated": 1635150718901
                },
                {
                    "language": "RU",
                    "text": "Нажмите на ссылку и следуйте инструкциям! Убедитесь, что вы передали токену полномочия на репозиторий и область применения. Посмотрите ролик на следующем шаге для наглядности...",
                    "updated": 1640162608903
                },
                {
                    "language": "TR",
                    "text": "Bağlantıya tıklayın ve talimatları izleyin! Oluşturduğunuz anahtarda depo (Repo) ve iş akışı alanları (Workflow Scopes) için izin  verdiğinizden emin olun. Netlik için bir sonraki adımdaki klibi kontrol edin...",
                    "updated": 1640629471975
                }
            ]
        },
        {
            "style": "Text",
            "text": "I suggest you name the token after Superalgos so that you may recognize it later on, and make sure you check the repo checkbox to define the scope of the token.",
            "updated": 1610812554380,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ti consiglio di chiamare il tuo token come Superalgos per poterlo riconoscere in seguito. Assicurati di mettere il flag sulla repo checkbox per definire lo scope del token.",
                    "updated": 1619641853159,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Sugiero que lo nombres  \"Superalgos\" para referencia futura, asegúrate de marcar la casilla de verificación del repositorio para definir el alcance del token.",
                    "updated": 1628195225900,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Ich schlage vor, dass Sie das Token nach Superalgos benennen, damit Sie es später wiedererkennen können, und stellen Sie sicher, dass Sie die Repo-Checkbox aktivieren, um den Geltungsbereich des Tokens zu definieren.",
                    "updated": 1635150726375
                },
                {
                    "language": "RU",
                    "text": "Я предлагаю вам назвать токен именем Superalgos, чтобы вы могли узнать его позже, и убедитесь, что вы отметили флажок repo, чтобы определить область применения токена.",
                    "updated": 1640162593892
                },
                {
                    "language": "TR",
                    "text": "Anahtarı daha sonra tanıyabilmeniz için Superalgos'diye adlandırmanızı ve belirtecin kapsamını tanımlamak için repo onay kutusunu işaretlediğinizden emin olmanızı öneririm.",
                    "updated": 1640629528203
                }
            ]
        }
    ]
}