{
    "tutorial": "Beyond the Basics",
    "pageNumber": 25,
    "type": "Tutorial Step - Set Up the Token!",
    "definition": {
        "text": "After you hit the Generate Token button, you'll get your precious token! Don't leave the page as you won't ever see it again!",
        "icon": {
            "name": "github-api",
            "project": "Foundations"
        },
        "updated": 1610815737032,
        "translations": [
            {
                "language": "IT",
                "text": "Dopo aver premuto il tasto Generate Token, otterrai il tuo token! Non lasciare la pagina perchè non lo vedrai mai più!",
                "updated": 1619638408223,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Después de presionar el botón  Generate Token, ¡obtendrás tu precioso token! ¡No salgas de la página, ya que no la volverás a ver!",
                "updated": 1628195367890,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Nachdem Sie auf die Schaltfläche \"Token generieren\" geklickt haben, erhalten Sie Ihren wertvollen Token! Verlassen Sie die Seite nicht, denn Sie werden ihn nie wieder sehen!",
                "updated": 1635151146569
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Copy the token, open the Github API node config, and paste it between the double quotes of the token parameter. Fill in the username parameter with your GitHub.com user, not your email!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Copia il token, apri la config del nodo Githup API, e incollalo tra le virgolette del token parameter. Riempi il parametro user con il tuo utente GitHub.com (non la mail)!",
                    "updated": 1619638498454,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Copia el token, abre la configuración del nodo Github API, y péguelo entre las comillas dobles del parámetro del token. Complete el parámetro de nombre de usuario con tu usuario de GitHub.com, no con tu correo electrónico.",
                    "updated": 1628195465628,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Kopieren Sie das Token, öffnen Sie die Github-API Knotenkonfiguration und fügen Sie es zwischen den Anführungszeichen des Token-Parameters ein. Füllen Sie den Parameter username mit Ihrem GitHub.com-Benutzer aus, nicht mit Ihrer E-Mail!",
                    "updated": 1635151154637
                }
            ]
        },
        {
            "style": "Note",
            "text": "Superalgos stores the token in the workspace file, just like your Exchange Account Key. The token is used to autheticate with GitHub.com's API to create the Pull Request. It is never sent or stored anywhere else.",
            "updated": 1610817098653,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos salva il token nel file workspace, come la tua Exchange Account Key. Il token viene usato per autenticarti con l'API di GitHub.com e creare la Pull Request. Non è mai inviato nè salvato altrove.",
                    "updated": 1619638547007,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Superalgos almacena el token en el archivo del workspace al igual que tu Exchange Account Key. El token se utiliza para autenticar con GitHub.com's API para crear el Pull Request. Nunca se envía ni se almacena en ningún otro lugar.",
                    "updated": 1628195820811,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Superalgos speichert das Token in der Workspace-Datei, genau wie Ihren Exchange Account Key. Das Token wird zur Authentifizierung mit der API von GitHub.com verwendet, um den Pull Request zu erstellen. Es wird niemals an eine andere Stelle gesendet oder gespeichert.",
                    "updated": 1635151165009
                }
            ]
        }
    ]
}