{
    "tutorial": "Beyond the Basics",
    "pageNumber": 23,
    "type": "Tutorial Step - GitHub.com Authentication",
    "definition": {
        "text": "For the Contributions Panel to work, you need to enter the credentials to authenticate with GiHub.com first!",
        "updated": 1687965036004,
        "icon": {
            "name": "github-api",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Perchè il comando app.contribute funzioni, dovrai autenticarti a due livelli differenti. Concentriamoci prima su GitHub.com!",
                "updated": 1619641609528,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Para que el app.contribute comando funcione, debes autenticarte en dos niveles diferentes. ¡Primero trataremos con GiHub.com!",
                "updated": 1675454184901,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Damit der Befehl app.contribute funktioniert, müssen Sie sich auf zwei verschiedenen Ebenen authentifizieren. Wir befassen uns zuerst mit GiHub.com!",
                "updated": 1635150651730
            },
            {
                "language": "RU",
                "text": "Чтобы команда app.contribute работала, вам необходимо пройти аутентификацию на двух разных уровнях. Сначала мы разберемся с GiHub.com!",
                "updated": 1640162342611
            },
            {
                "language": "TR",
                "text": "app.contribute komutunun çalışması için iki farklı düzeyde kimlik doğrulaması yapmanız gerekir. Önce GiHub.com ile ilgileneceğiz!",
                "updated": 1640629205391
            },
            {
                "language": "ID",
                "text": "Untuk menjalankan perintah app.contribute , kamu harus memberikan autentikasi ke beberapa level berbeda. Kita akan berurusan dengan Github.com terlebih dulu!",
                "updated": 1668949514138
            },
            {
                "language": "NL",
                "text": "Om de opdracht app.contribute te laten werken, moet u zich op twee verschillende niveaus authenticeren. We zullen GiHub.com eerst behandelen!",
                "updated": 1669749347515
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You need to authenticate at GitHub.com so that the Client may create the Pull Request in the upstream Superalgos repositories on your behalf. To do that, you will use the Github Personal Access Token you created while installing the platform or create a new one if you lost it!",
            "updated": 1688041087920,
            "translations": [
                {
                    "language": "IT",
                    "text": "Devi autenticarti su GitHub.com perchè il Client possa creare la Pull Request a tuo nome. Per fare ciò, devi creare un Personal Access Token su GitHub.com:",
                    "updated": 1619641662760,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Necesitas autenticarte en GitHub.com para que el Cliente cree el Pull Request en tu nombre. Para ello, utilizarás el Token de Acceso Personal a Github que creaste al instalar la plataforma o crearás uno nuevo si lo perdiste.",
                    "updated": 1675454209716,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie müssen sich bei GitHub.com registrieren und authentifizieren, damit der Client den Pull Request in Ihrem Namen erstellen kann. Dazu erstellen Sie ein persönliches Zugriffstoken auf GitHub.com:",
                    "updated": 1635150710714
                },
                {
                    "language": "RU",
                    "text": "Вам необходимо авторизоваться на GitHub.com, чтобы клиент создал Pull Request от вашего имени. Для этого вы будете использовать токен Github Personal Access Token, который вы создали при установке платформы, или создадите новый, если вы его потеряли!",
                    "updated": 1661379970457
                },
                {
                    "language": "TR",
                    "text": "İstemcinin sizin adınıza Çekme İsteği oluşturması için GitHub.com'da kimlik doğrulaması yapmanız gerekir. Bunu yapmak için GitHub.com'da bir Kişisel Erişim Simgesi (PPersonal Access Token) oluşturacaksınız:",
                    "updated": 1640629257214
                },
                {
                    "language": "ID",
                    "text": "Kamu harus memberikan autentikasi ke Github.com untuk Client untuk membuat Pull Request atas kehendakmu. Untuk melakukan itu, kamu harus menggunakan Github Personal Access Token yang kamu buat saat menginstall platform ini atau membuat baru jika kamu lupa!",
                    "updated": 1668949520986
                },
                {
                    "language": "NL",
                    "text": "U moet zich authenticeren op GitHub.com zodat de Client namens u het Pull Request kan maken. Om dat te doen, gebruikt u het Github Personal Access Token dat u hebt gemaakt tijdens het installeren van het platform of maakt u een nieuwe aan als u deze bent kwijtgeraakt!",
                    "updated": 1669749389116
                }
            ]
        },
        {
            "style": "Link",
            "text": "Create a GitHub.com Personal Access Token->github.com/settings/tokens/new",
            "updated": 1610959147665,
            "translations": [
                {
                    "language": "DE",
                    "text": "Persönlichen GitHub.com-Zugangs-Token erstellen->github.com/settings/tokens/new",
                    "updated": 1635150765768
                },
                {
                    "language": "TR",
                    "text": "GitHub.com Kişisel Erişim Belirteci oluşturma->github.com/settings/tokens/new",
                    "updated": 1654393922965,
                    "style": "Link"
                },
                {
                    "language": "ID",
                    "text": "Membuat Github Personal Access Token->github.com/settings/tokens/new",
                    "updated": 1668949530671
                },
                {
                    "language": "NL",
                    "text": "Maak een persoonlijk toegangstoken voor GitHub.com->github.com/settings/tokens/new",
                    "updated": 1669749405931
                },
                {
                    "language": "ES",
                    "text": "Crea un Personal Access Token en GitHub.com->github.com/settings/tokens/new",
                    "updated": 1675454237212
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Make sure you give the token the repo and workflow scopes. Check the clip on the next step!",
            "updated": 1649178220483,
            "translations": [
                {
                    "language": "IT",
                    "text": "Clicca il link e segui le istruzioni sotto! Guarda il video al prossimo step per più dettagli...",
                    "updated": 1619641789005,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Asegúrate de dar al token los ámbitos de repo y workflow. ¡Comprueba el clip en el siguiente paso!",
                    "updated": 1675454271912,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf den Link und folgen Sie den Anweisungen! Vergewissern Sie sich, dass Sie dem Token die Bereiche Repo und Workflow zuweisen. Schauen Sie sich den Clip im nächsten Schritt an, um Klarheit zu schaffen...",
                    "updated": 1635150718901
                },
                {
                    "language": "RU",
                    "text": "Убедитесь, что вы предоставили токен. Посмотрите ролик на следующем шаге!",
                    "updated": 1661380013858
                },
                {
                    "language": "TR",
                    "text": "Bağlantıya tıklayın ve talimatları izleyin! Oluşturduğunuz anahtarda depo (Repo) ve iş akışı alanları (Workflow Scopes) için izin  verdiğinizden emin olun. Netlik için bir sonraki adımdaki klibi kontrol edin...",
                    "updated": 1640629471975
                },
                {
                    "language": "ID",
                    "text": "Perhatikan bahwa kamu meberikan token cakupan repo dan workflow. Periksa klip di langkah selanjutnya!",
                    "updated": 1668949538372
                },
                {
                    "language": "NL",
                    "text": "Zorg ervoor dat u het token de repo- en workflow rechten geeft. Bekijk de video bij de volgende stap!",
                    "updated": 1669749453554
                }
            ]
        },
        {
            "style": "Text",
            "text": "I suggest you name the token after Superalgos so that you may recognize it later on!",
            "updated": 1649178264501,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ti consiglio di chiamare il tuo token come Superalgos per poterlo riconoscere in seguito. Assicurati di mettere il flag sulla repo checkbox per definire lo scope del token.",
                    "updated": 1619641853159,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Te sugiero que le pongas el nombre de Superalgos para que lo reconozcas más adelante. ",
                    "updated": 1675454293847,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Ich schlage vor, dass Sie das Token nach Superalgos benennen, damit Sie es später wiedererkennen können, und stellen Sie sicher, dass Sie die Repo-Checkbox aktivieren, um den Geltungsbereich des Tokens zu definieren.",
                    "updated": 1635150726375
                },
                {
                    "language": "RU",
                    "text": "Я предлагаю вам назвать токен именем Superalgos, чтобы вы могли узнать его позже!",
                    "updated": 1661380050573
                },
                {
                    "language": "TR",
                    "text": "Anahtarı daha sonra tanıyabilmeniz için Superalgos'diye adlandırmanızı ve belirtecin kapsamını tanımlamak için repo onay kutusunu işaretlediğinizden emin olmanızı öneririm.",
                    "updated": 1640629528203
                },
                {
                    "language": "ID",
                    "text": "Aku saranku kamu memberikan nama token Superalgos yang bisa kamu kenali selanjutnya!",
                    "updated": 1668949545386
                },
                {
                    "language": "NL",
                    "text": "Ik stel voor dat u het token naar Superalgos vernoemt, zodat u het later kunt herkennen!",
                    "updated": 1669749469363
                }
            ]
        }
    ]
}