{
    "tutorial": "Beyond the Basics",
    "pageNumber": 13,
    "type": "Tutorial Step - Welcome Back!",
    "definition": {
        "text": "If you followed my instructions to the letter, you should now be running the software in the Develop branch! Awesome!",
        "icon": {
            "name": "hits",
            "project": "Foundations"
        },
        "updated": 1636913180861,
        "translations": [
            {
                "language": "IT",
                "text": "Se hai seguito le mie istruzioni, ora il tuo software sta girando sulla branch plugins-docs! Fantastico!",
                "updated": 1619634969342,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si has seguido mis instrucciones al pie de la letra, ahora deberías estar ejecutando el software en la rama de desarrollo. ¡Espléndido!",
                "updated": 1675451665067,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wenn Sie meine Anweisungen genau befolgt haben, sollten Sie jetzt die Software im branch(Zweig) develop ausführen! Großartig!",
                "updated": 1638831614967
            },
            {
                "language": "RU",
                "text": "Если вы следовали моим инструкциям до конца, то теперь вы должны запустить программу в ветке Develop! Потрясающе!",
                "updated": 1640158775235
            },
            {
                "language": "TR",
                "text": "Talimatlarıma harfi harfine uyduysanız, yazılımı Geliştirme ( Develop ) şubesinde çalıştırıyor olmalısınız! Mükemmel!",
                "updated": 1640554184937
            },
            {
                "language": "ID",
                "text": "Jika kamu mengikuti intruksi saya dengan benar, seharusnya kamu telah menjalankan software di branch Develop! Luar Biasa!",
                "updated": 1668786730579
            },
            {
                "language": "NL",
                "text": "Als je mijn instructies tot op de letter hebt gevolgd, zou je nu de software moeten draaien in de Develop branch! Geweldig!",
                "updated": 1669746964157
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The software you are currently running is the version of Superalgos that was at the Develop branch the second you switched branches! This is good, as you now know you have the latest version of the software!",
            "updated": 1636913978584,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il software corrente è la versione di Superalgos che si trovava nel branch plugins-docs il giorno che hai fatto il fork del progetto! Questo perchè cambiando branch scarichi il software dal tuo fork e non dalla repo originale.",
                    "updated": 1619635036896,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El software que estás ejecutando actualmente es la versión de Superalgos que estaba en la rama de Desarrollo en el momento en que cambiaste de rama. Esto es bueno, ya que ahora sabes que tienes la última versión del software.",
                    "updated": 1675451687889,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die Software, die Sie gerade ausführen, ist die Version von Superalgos, die sich im develop branch befand, als Sie das Projekt geforkt haben! Das liegt daran, dass der Prozess des Wechselns der branches die Software von Ihrem Fork herunterlädt und nicht vom Upstream-Repository.  ",
                    "updated": 1638831659018
                },
                {
                    "language": "RU",
                    "text": "Программное обеспечение, которое вы сейчас используете, - это версия Superalgos, которая была в ветке Develop в тот момент, когда вы переключили ветку! Это хорошо, так как теперь вы знаете, что у вас самая последняя версия программного обеспечения!",
                    "updated": 1640158884107
                },
                {
                    "language": "TR",
                    "text": "Şu anda çalıştırmakta olduğunuz yazılım, şube değiştirdiğiniz anda Develop şubesinde bulunan Superalgos'un sürümüdür! Bu iyi, çünkü artık yazılımın en son sürümüne sahip olduğunuzu biliyorsunuz!",
                    "updated": 1640554149760
                },
                {
                    "language": "ID",
                    "text": "Software yang kamu jalankan sekarang berada di versi terkini Superalgos yang ada di Develop branch setelah kamu mengubah branch! Itu baik, seperti yang kamu ketahui sekarang kamu memiliki software versi terbaru!",
                    "updated": 1668786740430
                },
                {
                    "language": "NL",
                    "text": "De software die u momenteel gebruikt, is de versie van Superalgos die in de Develop branch stond op het moment dat u van branch wisselde! Dit is goed, want je weet nu dat je de nieuwste versie van de software hebt!",
                    "updated": 1669747001468
                }
            ]
        },
        {
            "style": "Success",
            "text": "This is particularly important because you are about to contribute to the project. You should always work on the latest version so that the changes you make include the latest changes produced by other contributors!",
            "updated": 1636914060165,
            "translations": [
                {
                    "language": "IT",
                    "text": "Devi fare l'update così da eseguire l'ultima versione! È importante soprattutto se vuoi contribuire al progetto. Lavora sempre sull'ultima versione, così che i cambiamenti che fai includano le ultime modifiche degli altri utenti!",
                    "updated": 1619635122521,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Esto es especialmente importante porque estás a punto de contribuir al proyecto. Deberías trabajar siempre con la última versión para que los cambios que hagas incluyan los últimos cambios realizados por otros colaboradores.",
                    "updated": 1675451726807,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Sie müssen aktualisieren, damit Sie die neueste Version verwenden! Dies ist besonders wichtig, wenn Sie beabsichtigen, zu dem Projekt beizutragen. Sie sollten immer an der neuesten Version arbeiten, damit die Änderungen, die Sie vornehmen, die neuesten Änderungen anderer Mitwirkender enthalten!",
                    "updated": 1638831732431
                },
                {
                    "language": "RU",
                    "text": "Это особенно важно, поскольку вы собираетесь внести свой вклад в проект. Вы всегда должны работать над последней версией, чтобы изменения, которые вы вносите, включали последние изменения, сделанные другими участниками!",
                    "updated": 1640158906139
                },
                {
                    "language": "TR",
                    "text": "Bu özellikle önemlidir çünkü projeye katkıda bulunmak üzeresiniz. Yaptığınız değişikliklerin diğer katkıda bulunanlar tarafından üretilen en son değişiklikleri içermesi için her zaman en son sürüm üzerinde çalışmalısınız!",
                    "updated": 1640554077493
                },
                {
                    "language": "ID",
                    "text": "Secara khusus hal ini sangat penting karena kamu akan berkontribusi ke proyek. Kamu harus selalu bekerja dengan versi terkini sehingga perubahan yang kamu lakukan masuk ke perubahan terkini dari kontributor lainnya!",
                    "updated": 1668786751495
                },
                {
                    "language": "NL",
                    "text": "Dit is vooral belangrijk omdat u op het punt staat bij te dragen aan het project. U moet altijd aan de nieuwste versie werken, zodat de wijzigingen die u aanbrengt ook de laatste wijzigingen bevatten die door andere bijdragers zijn gemaakt!",
                    "updated": 1669747016485
                }
            ]
        }
    ]
}