{
    "tutorial": "Beyond the Basics",
    "pageNumber": 12,
    "type": "Tutorial Step - Let's Switch Already!",
    "definition": {
        "text": "Now that everything's clear, let's do the switch and get ready for what comes next!",
        "updated": 1617019411568,
        "icon": {
            "name": "Docs\\docs-success-style",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Ora che è tutto chiaro, cambiamo branch e prepariamoci per i prossimi step!",
                "updated": 1619634720704,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Ahora que todo está claro, ¡hagamos el cambio y prepárete para lo que viene a continuación!",
                "updated": 1628127987969,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Jetzt, wo alles klar ist, können wir den Wechsel vornehmen und uns auf das vorbereiten, was als nächstes kommt!",
                "updated": 1635147821432
            },
            {
                "language": "RU",
                "text": "Теперь, когда все ясно, давайте сделаем переключение и подготовимся к тому, что будет дальше!",
                "updated": 1640158571387
            },
            {
                "language": "TR",
                "text": "Artık her şeyi hallettiğimize göre, geçiş yapalım ve bundan sonra olacaklara hazırlanalım!",
                "updated": 1640419466455
            },
            {
                "language": "ID",
                "text": "Sekarang semuanya sudah jelas, Ayo ubah dan bersiaplah dengan yang terjadi selanjutnya!",
                "updated": 1668786105221
            },
            {
                "language": "NL",
                "text": "Nu alles duidelijk is, gaan we overstappen en ons voorbereiden op wat komen gaat!",
                "updated": 1669746788158
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "Go back to the footer and select Develop as your Current Branch.",
            "updated": 1636913147028,
            "translations": [
                {
                    "language": "IT",
                    "text": "Torna al footer e seleziona Plugins-Docs come tuo Current Branch.",
                    "updated": 1619634755120,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Vuelve al pie de página y selecciona Develop como rama actual.",
                    "updated": 1675451605603,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Scrollen Sie in den Docs runter bis zur Fußzeile und wählen Sie develop als Ihren aktuellen Zweig. ",
                    "updated": 1638832398965
                },
                {
                    "language": "RU",
                    "text": "Вернитесь в нижний колонтитул и выберите Develop в качестве текущей ветки (Current Branch).",
                    "updated": 1640158641234
                },
                {
                    "language": "TR",
                    "text": "Bu syafanın en altına gidin ve Current Branch dalını \"Develop\" olarak değiştirin.",
                    "updated": 1640419547094
                },
                {
                    "language": "ID",
                    "text": "Kembali ke footer dan pilih Develop sebagai Current Branch.",
                    "updated": 1668786129103
                },
                {
                    "language": "NL",
                    "text": "Ga terug naar de voettekst en selecteer Develop als uw huidige branch.",
                    "updated": 1669746831849
                }
            ]
        },
        {
            "style": "List",
            "text": "You will get a page explaining what is being done. Then you will get another page telling you of the outcome explaining you must restart the app.",
            "updated": 1617036253283,
            "translations": [
                {
                    "language": "IT",
                    "text": "Una pagina ti informerà di cosa succede, poi un'altra ti notificherà del fatto che devi riavviare l'app.",
                    "updated": 1619634793423,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Obtendrás una página que explica lo que se está haciendo. Luego, aparecerá otra página que te informará del resultado y te explicará que debes reiniciar la aplicación.",
                    "updated": 1628128508302,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Sie erhalten eine Seite, auf der erklärt wird, was gemacht wird. Dann erhalten Sie eine weitere Seite, die Sie über das Ergebnis informiert und Ihnen erklärt, dass Sie die Anwendung neu starten müssen.",
                    "updated": 1635147885655
                },
                {
                    "language": "RU",
                    "text": "Вы получите страницу с описанием того, что происходит. Затем вы получите еще одну страницу с информацией о результате, на которой будет сказано, что вы должны перезапустить приложение.",
                    "updated": 1640158696037
                },
                {
                    "language": "TR",
                    "text": "Ne yapıldığını açıklayan bir sayfa göreceksiniz. Ardından, uygulamayı yeniden başlatmanız gerektiğini bildiren başka bir sayfa daha göreceksiniz..",
                    "updated": 1640419607946
                },
                {
                    "language": "ID",
                    "text": "Kamu akan mendapati halaman yang menjelaskan bahwa telah berhasil. Lalu kamu akan mendapatkan halaman berikutnya yang memberitahumu untuk mengulang aplikasi.",
                    "updated": 1668786139036
                },
                {
                    "language": "NL",
                    "text": "U krijgt een pagina waarop wordt uitgelegd wat er wordt gedaan. Vervolgens krijgt u een andere pagina met de uitkomst waarin wordt uitgelegd dat u de app opnieuw moet opstarten.",
                    "updated": 1669746848709
                }
            ]
        },
        {
            "style": "List",
            "text": "Do close the app and restart it (browser & console).",
            "updated": 1617036149007,
            "translations": [
                {
                    "language": "IT",
                    "text": "Chiudi l'app e riavviala (browser e console).",
                    "updated": 1619634842849,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Cierra la aplicación y reiníciela (navegador y consola).",
                    "updated": 1628128700479,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Schließen Sie die Anwendung und starten Sie sie neu (Browser und Konsole).",
                    "updated": 1635147913233
                },
                {
                    "language": "RU",
                    "text": "Закройте приложение и перезапустите его (браузер и консоль).",
                    "updated": 1640158714923
                },
                {
                    "language": "TR",
                    "text": "Uygulamayı kapatın ve yeniden başlatın (tarayıcıda ve konsolda).",
                    "updated": 1640419636012
                },
                {
                    "language": "ID",
                    "text": "Tutup aplikasi dan jalankan kembali (browser & konsol).",
                    "updated": 1668786155121
                },
                {
                    "language": "NL",
                    "text": "Sluit de app en start deze opnieuw (browser & console).",
                    "updated": 1669746860717
                }
            ]
        },
        {
            "style": "List",
            "text": "Find the Beyond the Basics Tutorial in the bottom-right corner of the workspace and select \"Resume\" on the menu! If \"Resume\" doesn't work, find the \"Welcome Back!\" step under the Branches Topic and click \"Play\" on the menu!",
            "updated": 1622389621077,
            "translations": [
                {
                    "language": "IT",
                    "text": "Cerca il Beyond the Basics Tutorial nell'angolo in basso a destra del Workspace e premi Resume! Se non funziona, cerca lo step \"Welcome Back!\" sotto il Branches Topic e premi Play sul menù!",
                    "updated": 1619634936378,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Encuentra el Beyond the Basics Tutorial en la esquina inferior derecha del Workspace y selecciona \"Resume\" en el menú. Si \"Resume\" No funciona, encuentra el \"Welcome Back!\" bajo el Branches Topic y haz clic en \"Play\" en el menú.",
                    "updated": 1628128938546,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Suchen Sie das Beyond the Basics Tutorial in der unteren rechten Ecke des Arbeitsbereichs und wählen Sie \"Resume\" im Menü! Wenn \"Fortsetzen\" nicht funktioniert, suchen Sie den Schritt \"Welcome Back!\" unter dem Thema Zweige und klicken Sie im Menü auf \"Abspielen\"!",
                    "updated": 1635147950486
                },
                {
                    "language": "RU",
                    "text": "Найдите учебник Beyond the Basics в правом нижнем углу рабочего пространства и выберите \"Resume\" в меню! Если \"Resume\" не работает, найдите шаг \"Welcome Back!\" в разделе Branches Topic и нажмите \"Play\" в меню!",
                    "updated": 1640158754087
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanının sağ alt köşesinde Beyond The Basics Tutorial Eğitimini bulun ve menüden Resune'u (Devam Et) seçin! Resum (Devam Et) çalışmıyorsa, \"Welcome Back!\" Butonunu bulun. Branches Konusu'nun altına girin ve menüden \"Oynat\"a tıklayın!",
                    "updated": 1640424871004
                },
                {
                    "language": "ID",
                    "text": "Temukan Beyond the Basics Tutorial di bagian bawah kanan workspace dan pilih \"Resume\" di menu! Jika \"Resume\" tidak bekerja, Temukan step \"Welcome Back!\" dibawah Branches Topic dan klik \"Play\" di menu!",
                    "updated": 1668786164761
                },
                {
                    "language": "NL",
                    "text": "Zoek de Beyond the Basics Tutorial in de rechterbenedenhoek van de werkruimte en selecteer \"Resume\" in het menu! Als \"Resume\" niet werkt, zoek dan de \"Welcome Back!\" stap onder het Branches-onderwerp en klik op \"Play\" in het menu!",
                    "updated": 1669746914765
                }
            ]
        },
        {
            "style": "List",
            "text": "You may need to run nodeSetup if the app doesn't load properly after the switch."
        }
    ]
}