{
    "tutorial": "Beyond the Basics",
    "pageNumber": 27,
    "type": "Tutorial Step - Contributable files?",
    "definition": {
        "text": "Most files within the Superalgos folder are subject to be modified and contributed to the project, including code, images, docs, etc.",
        "icon": {
            "name": "Data\\dataset",
            "project": "Foundations"
        },
        "updated": 1688040906136,
        "translations": [
            {
                "language": "IT",
                "text": "La maggior parte dei file nella cartella Superalgos possono essere modificati per contribuire al progetto! Questo include codici, immagini, docs, ecc.",
                "updated": 1619637453095,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡La mayoría de los archivos dentro de la carpeta Superalgos están sujetos a ser modificados y contribuidos al proyecto! Eso incluye código, imágenes, documentación, etc.",
                "updated": 1628192328992,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Die meisten Dateien im Superalgos-Ordner können geändert und zum Projekt beigetragen werden! Das schließt Code, Bilder, Dokumentation usw. ein.",
                "updated": 1635150547303
            },
            {
                "language": "RU",
                "text": "Большинство файлов в папке Superalgos могут быть изменены и внесены в проект! Это включает в себя код, изображения, документацию и т.д.",
                "updated": 1640163201716
            },
            {
                "language": "TR",
                "text": "Superalgos klasöründeki çoğu dosya değiştirilmeye ve projeye katkıda bulunmaya tabidir! Buna kod, resimler, belgeler vb. de dahildir.",
                "updated": 1640628796387
            },
            {
                "language": "ID",
                "text": "Hampir semua file dalam folder Superalgos merupakan subyek untuk dimodifikasi dan dikontribusikan ke proyek! temasuk juga kode, gambar, dokuemtasi, dll.",
                "updated": 1668996035688
            },
            {
                "language": "NL",
                "text": "De meeste bestanden in de map Superalgos kunnen worden gewijzigd en worden toegevoegd aan het project! Dat omvat code, afbeeldingen, documentatie, enz.",
                "updated": 1669750025584
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "These folders are exempt from being contributed: My-Workspaces, My-Data-Storage, and My-Log-Files, within the Platform folder.",
            "updated": 1636914532594,
            "translations": [
                {
                    "language": "IT",
                    "text": "Queste cartelle non prevedono condivisione: My-Workspaces, Data-Storage, e Log-Files.",
                    "updated": 1619637492839,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Estas carpetas están exentas de contribución: My-Workspaces, My-Data-Storage y My-Log-Files, dentro de la carpeta Platform.",
                    "updated": 1675454504667,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Diese Ordner sind von der Mitwirkung ausgenommen: My-Workspaces, Data-Storage, und Log-Files.",
                    "updated": 1635150581717
                },
                {
                    "language": "RU",
                    "text": "Эти папки не участвуют во вкладе: My-Workspaces, My-Data-Storage и My-Log-Files в папке Platform.",
                    "updated": 1640163321875
                },
                {
                    "language": "TR",
                    "text": "Şu klasörler bu durumdan muaftır: Platform klasörü içindeki My-Workspaces, My-Data-Storage ve My-log-File. ",
                    "updated": 1640628968160
                },
                {
                    "language": "ID",
                    "text": "Folder-folder ini dikecualikan dari kontribusi: My-Workspaces, My-Data-Storage, dan My-Log-Files, dalam folder Platform.",
                    "updated": 1668996043301
                },
                {
                    "language": "NL",
                    "text": "Deze mappen hoeven niet te worden bijgedragen: My-Workspaces, My-Data-Storage en My-Log-Files, binnen de map Platform.",
                    "updated": 1669750045272
                }
            ]
        },
        {
            "style": "Warning",
            "text": "Do not use the Superalgos folder to store personal stuff! Whatever you include in the Superalgos folder (save for the noted exempted folders) is likely to be committed to your fork on GitHub.com, and included in a Pull Request, both publicly accessible — once you hit the Contribute button! Nothing ever gets uploaded otherwise.",
            "updated": 1688040981191,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non usare la cartella Superalgos per salvare file privati o che non sono parte del software! Qualsiasi cosa includi nelle cartelle, ad eccezione di quelle elencate sopra, viene eventualmente inviato al tuo fork su GitHub.com e incluso in una Pull Request, diventando visibile al pubblico!",
                    "updated": 1619637607807,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "¡No uses la carpeta de Superalgos para almacenar cosas personales o archivos que no deben ser parte del software de Superalgos! Lo que incluyas en la carpeta de Superalgos (excepto las carpetas exentas indicadas) está sujeto a enviarse a tu fork en GitHub.com e incluirse en una solicitud de extracción, ¡ambos de acceso público!",
                    "updated": 1675454526336,
                    "style": "Important"
                },
                {
                    "language": "DE",
                    "text": "Wichtig! Verwenden Sie den Superalgos-Ordner nicht, um persönliche Dinge oder Dateien zu speichern, die nicht Teil der Superalgos-Software sein sollen! Alles, was Sie in den Superalgos-Ordner einfügen (mit Ausnahme der erwähnten, ausgenommenen Ordner), wird als Änderung übertragen, an Ihren Fork auf GitHub.com gesendet und in einen Pull Request aufgenommen, beides öffentlich zugänglich!",
                    "updated": 1635150572557
                },
                {
                    "language": "RU",
                    "text": "Не используйте папку Superalgos для хранения личных данных или файлов, которые не являются частью программного обеспечения Superalgos! Все, что вы включите в папку Superalgos (за исключением папок, исключенных из правил), будет зафиксировано как изменение, отправлено в ваш форк на GitHub.com и включено в Pull Request, оба публично доступные!",
                    "updated": 1640163406044
                },
                {
                    "language": "TR",
                    "text": "Superalgos klasörünü, Superalgos yazılımının parçası olması amaçlanmayan kişisel şeyleri veya dosyaları depolamak için kullanmayın! Superalgos klasörüne eklediğiniz her şey (belirtilen muaf tutulan klasörler için kaydedin) bir değişiklik olarak taahhüt edilmeye tabidir, GitHub.com'daki çatalınıza gönderilir ve her ikisi de herkesin erişebileceği bir Çekme İsteğine dahil edilir!",
                    "updated": 1640629051301
                },
                {
                    "language": "ID",
                    "text": "Jangankan gunakan folder Superalgos untuk menyimpan file pribadi yang tidak seharusnya bagian dari software Superalgos! Apapun yang kamu masukkan kedalam folder Superalgos (simpan untuk folder yang dikecualikan yang dicatat) jika diinginkan untuk menjadi perubahan, maka akan terkirim ke fork kamu di GIthub.com, dan disertakan dalam Pull Request, keduanya dapat diakses secara publik!",
                    "updated": 1668996049837
                },
                {
                    "language": "NL",
                    "text": "Gebruik de Superalgos-map niet om persoonlijke dingen of bestanden op te slaan die niet bedoeld zijn als onderdeel van de Superalgos-software! Alles wat u in de Superalgos-map opneemt (behalve de vermelde vrijgestelde mappen) kan als wijziging worden vastgelegd, naar uw fork op GitHub.com worden verzonden en worden opgenomen in een Pull Request, welke beide openbaar toegankelijk zijn!",
                    "updated": 1669750082770
                }
            ]
        }
    ]
}