{
    "tutorial": "Beyond the Basics",
    "pageNumber": 19,
    "type": "Tutorial Step - Don't Forget to Sign!",
    "definition": {
        "text": "These comments about your first impressions on Superalgos are your first contribution, and for that we thank you!",
        "updated": 1610735268141,
        "icon": {
            "name": "Bullet\\bullet-warning",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Questa recensione è il tuo primo contributo, e ti ringraziamo molto per questo!",
                "updated": 1619636353818,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Estos comentarios sobre tus primeras impresiones en Superalgos son tu primer aporte, ¡y por eso te agradecemos!",
                "updated": 1628190090733,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Diese Kommentare über Ihre ersten Eindrücke von Superalgos sind Ihr erster Beitrag, und dafür danken wir Ihnen!",
                "updated": 1635149257044
            },
            {
                "language": "RU",
                "text": "Эти комментарии о ваших первых впечатлениях о Superalgos - ваш первый вклад, и за это мы вас поблагодарим!",
                "updated": 1640161730955
            },
            {
                "language": "TR",
                "text": "Superalgos'taki ilk izlenimlerinizle ilgili bu yorumlar sizin ilk katkınızdır ve bunun için size teşekkür ederiz!",
                "updated": 1640610855166
            },
            {
                "language": "ID",
                "text": "Dokumentasi tentang impresi pertamamu terhadap Superalgos adalah kontribusi pertamamu, dan untuk itu kami berterima kasih!",
                "updated": 1668928956479
            },
            {
                "language": "NL",
                "text": "Deze opmerkingen over uw eerste indrukken op Superalgos zijn uw eerste bijdrage, en daarvoor danken wij u!",
                "updated": 1669747847361
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Important",
            "text": "For your review to be merged in the Superalgos repository, you must sign it with your GitHub.com user name in the last paragraph of the page! This is important so that you may later find the page using the search! As you progress with Superalgos, you may always come back and edit it.",
            "updated": 1610734914493,
            "translations": [
                {
                    "language": "IT",
                    "text": "Perchè la tua recensione sia inclusa nella repo di Superalgos, devi autenticarti con il tuo user name GitHub.com nell'ultimo paragrafo della pagina! È importante così che tu possa poi trovarla usando la barra di ricerca! Man mano che prosegui in Superalgos, puoi sempre tornare indietro e modificarla.",
                    "updated": 1619636467512,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "Para que tu reseña se combine en el repositorio de Superalgos, debes firmarla con tu nombre de usuario de GitHub.com en el último párrafo de la página. ¡Esto es importante para que luego puedas encontrar la página usando la búsqueda! Siempre puedes volver y editarlo.",
                    "updated": 1628190305617,
                    "style": "Important"
                },
                {
                    "language": "DE",
                    "text": "Damit Ihr Beitrag in das Superalgos-Repository aufgenommen werden kann, müssen Sie ihn im letzten Absatz der Seite mit Ihrem GitHub.com-Benutzernamen signieren! Dies ist wichtig, damit Sie die Seite später über die Suche finden können! Wenn Sie mit Superalgos Fortschritte machen, können Sie jederzeit zurückkommen und die Seite bearbeiten.",
                    "updated": 1635149266576
                },
                {
                    "language": "RU",
                    "text": "Чтобы ваш обзор был объединен в репозиторий Superalgos, вы должны подписать его своим именем пользователя GitHub.com в последнем абзаце страницы! Это важно для того, чтобы впоследствии вы могли найти страницу с помощью поиска! По мере освоения Superalgos вы всегда сможете вернуться и отредактировать ее.",
                    "updated": 1640161758370
                },
                {
                    "language": "TR",
                    "text": "İncelemenizin Superalgos deposunda birleştirilmesi için sayfanın son paragrafında GitHub.com kullanıcı adınızla imzalamanız gerekir! Bu, daha sonra aramayı kullanarak sayfayı bulabilmeniz için önemlidir! Superalgos ile ilerledikçe, her zaman geri gelip düzenleyebilirsiniz.",
                    "updated": 1640610982807
                },
                {
                    "language": "ID",
                    "text": "Untuk ulasanmu agar masuk ke repository Superalgos, kamu harus masuk dengan GitHub.com dengan nama pengguna di paragraf terakhir halaman! Hal ini penting agar nantinya kamu dapat menemukan kembali halaman menggunakan pencarian! Saat kamu berproses dengan Superalgos, kamu akan kembali dan mengedit itu.",
                    "updated": 1668928963544
                },
                {
                    "language": "NL",
                    "text": "Om uw recensie te laten samenvoegen in de Superalgos repository, moet u deze ondertekenen met uw GitHub.com-gebruikersnaam in de laatste alinea van de pagina! Dit is belangrijk, zodat u de pagina later kunt vinden met de zoekfunctie! Naarmate je verder komt met Superalgos, kun je altijd terugkomen om het te bewerken.",
                    "updated": 1669747897992
                }
            ]
        },
        {
            "style": "Note",
            "text": "Contributions earn you Superalgos SA Tokens and are subject to the terms of the Apache Licence 2.0. In short, Contributors provide an express grant of copyright/patent rights.",
            "updated": 1675461643131,
            "translations": [
                {
                    "language": "IT",
                    "text": "I contributi sono soggetti ai termini della <a href=\\\"https://github.com/Superalgos/Superalgos/blob/master/LICENSE\\\" target=\\\"_blank\\\" style=\\\"color:blue;\\\">Apache Licence 2.0</a>. In breve, chi contribuisce concede esplicitamente diritti di copyright/brevetto.",
                    "updated": 1619636533564,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Las contribuciones te permiten ganar Tokens de Superalgos SA y están sujetas a los términos de la Licencia Apache 2.0. En resumen, los colaboradores otorgan expresamente derechos de autor/patente.",
                    "updated": 1675461703143,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Beiträge bringen Ihnen <a href=\\\"https://superalgos.org/token-overview.shtml\\\" target=\\\"_blank\\\" style=\\\"color:blue;\\\">Superalgos SA Tokens</a> ein und unterliegen den Bedingungen der <a href=\\\"https://github.com/Superalgos/Superalgos/blob/master/LICENSE\\\" target=\\\"_blank\\\" style=\\\"color:blue;\\\">Apache Licence 2.0</a>. Kurz gesagt, die Mitwirkenden gewähren ausdrücklich das Urheberrecht/Patentrecht.",
                    "updated": 1635150086827
                },
                {
                    "language": "RU",
                    "text": "Вклад приносит вам токены Superalgos SA Tokens и регулируется условиями лицензии Apache Licence 2.0. Короче говоря, вкладчики предоставляют прямые авторские/патентные права.",
                    "updated": 1640161875463
                },
                {
                    "language": "TR",
                    "text": "Katkılar size Superalgos SA Tokenleri kazandırır ve Apache Lisansı 2.0'ın koşullarına tabidir. Kısacası, Katkıda Bulunanlar, telif hakkı/patent haklarının açık bir şekilde devretmiş olurlar.",
                    "updated": 1640611462549
                },
                {
                    "language": "ID",
                    "text": "Kontribusi mendapatkanmu token Superalgos SA dan sesuai dengan peraturan dari Apache Licence 2.0. Secara singkat, Kontributor membawa hak cipta/hak paten yang tegas.",
                    "updated": 1668929450272
                },
                {
                    "language": "NL",
                    "text": "Met bijdragen verdiend u Superalgos <a href='http://localhost:34248/%22https://superalgos.org/token-overview.shtml/%22'>SA Tokens</a> en zijn onderworpen aan de voorwaarden van de <a href='http://localhost:34248/%22https://github.com/Superalgos/Superalgos/blob/master/LICENSE/%22'>Apache Licence 2.0.</a> Kortom, bijdragers verlenen uitdrukkelijk auteursrecht-/octrooirechten.",
                    "updated": 1669748097417
                }
            ]
        }
    ]
}