{
    "tutorial": "Beyond the Basics",
    "pageNumber": 26,
    "type": "Tutorial Step - A Note On Keys and Tokens!",
    "definition": {
        "text": "Let me make a quick pause to point out something important regarding the safety of your keys and tokens...",
        "icon": {
            "name": "Exchange\\exchange-account-key",
            "project": "Foundations"
        },
        "updated": 1610818135402,
        "translations": [
            {
                "language": "IT",
                "text": "Prima di proseguire, devo parlarti di punti importanti che riguardano la sicurezza delle tue chiavi e dei tuoi token...",
                "updated": 1619641318317,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Permíteme hacer una breve pausa para señalar algo importante con respecto a la seguridad de tus keys y tokens...",
                "updated": 1628196629922,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Lassen Sie mich eine kurze Pause einlegen, um auf etwas Wichtiges hinzuweisen, was die Sicherheit Ihrer Schlüssel und Token betrifft...",
                "updated": 1635151451291
            },
            {
                "language": "TR",
                "text": "Anahtarlarınızın ve belirteçlerinizin güvenliğiyle ilgili önemli bir şeye dikkat çekmek için kısa bir ara vermeme izin verin...",
                "updated": 1640001687641
            },
            {
                "language": "RU",
                "text": "Позвольте мне сделать небольшую паузу, чтобы отметить кое-что важное в отношении безопасности ваших ключей и токенов...",
                "updated": 1640163119058
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Important",
            "text": "Superalgos stores the workspace file that contains your keys and tokens in the JSON format—unencrypted. In this state, this crucial information is as safe as your computer may be.",
            "updated": 1610906633022,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos salva il file workspace che contiene chiavi e tokens in formato JSON, quindi NON CRIPTATO. In questo stato, queste importanti informazioni sono tanto sicure quanto lo è il tuo computer.",
                    "updated": 1619641491336,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "Superalgos almacena el archivo del espacio de trabajo que contiene tus claves y tokens en formato JSON, sin cifrar. En este estado, esta información crucial es tan segura como lo sea tu computadora.",
                    "updated": 1628196749419,
                    "style": "Important"
                },
                {
                    "language": "DE",
                    "text": "Superalgos speichert die Workspace-Datei, die Ihre Schlüssel und Token enthält, im JSON-Format - unverschlüsselt. In diesem Zustand sind diese wichtigen Informationen so sicher wie Ihr Computer selbst.",
                    "updated": 1635151459148
                },
                {
                    "language": "TR",
                    "text": "Superalgos, anahtarlarınızı ve belirteçlerinizi içeren çalışma alanı dosyasını JSON biçiminde (şifrelenmemiş) saklar. Bu durumda, bu önemli bilgiler bilgisayarınız ne kadar güvenli ise o kadar güvenlidir.",
                    "updated": 1640001729081
                },
                {
                    "language": "RU",
                    "text": "Superalgos хранит файл рабочего пространства, содержащий ваши ключи и токены, в формате JSON в незашифрованном виде. В таком состоянии эта важнейшая информация находится в такой же безопасности, как и ваш компьютер.",
                    "updated": 1640163149064
                }
            ]
        },
        {
            "style": "Warning",
            "text": "Never share your workspace file AS IS. To share a workspace, use the Share button on the menu. It creates a share-safe copy of the workspace, stripped of sensitive information by removing the APIs hierarchy and the Exchange Accounts section of the Crypto Exchange node.",
            "updated": 1617020932950,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non condividere mai il tuo file workspace così com'è. Per condividerlo, usa il pulsante Share sul menù. Crea una copia del tuo workspace senza le informazioni personali, rimuovendo le gerarchie API e la sezione Exchange Accounts del nodo Crypto Exchange.",
                    "updated": 1619641476652,
                    "style": "Warning"
                },
                {
                    "language": "ES",
                    "text": "Nunca comparta tu archivo de workspace TAL CUAL. Para compartir un workspace, usa el botón Share en el menú. Crea una copia segura para compartir despojada de información confidencial al eliminar el APIs jerarquía y la sección Exchange Accounts del nodo Crypto Exchange.",
                    "updated": 1628196946570,
                    "style": "Warning"
                },
                {
                    "language": "DE",
                    "text": "Geben Sie Ihre Arbeitsbereichsdatei niemals in diesem Zustand weiter. Um einen Arbeitsbereich freizugeben, verwenden Sie die Schaltfläche Freigeben im Menü. Es wird eine freizugebende Kopie des Arbeitsbereichs erstellt, die um sensible Informationen bereinigt ist, indem die APIs Hierarchie und der Abschnitt Exchange Accounts des Crypto Exchange Knotens entfernt werden.",
                    "updated": 1635151467293
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanı dosyanızı asla OLDUĞU GİBİ paylaşmayın. Bir çalışma alanını paylaşmak için menüdeki Share düğmesini kullanın. Bu şekilde paylaşmanız, API hiyerarşisini ve Crypto Exchange düğümünün Exchange Accounts bölümünü kaldırarak çalışma alanınızı hassas bilgilerden arındırır ve güvenli bir kopyasını oluşturarak sizi korur.",
                    "updated": 1640002064921
                },
                {
                    "language": "RU",
                    "text": "Никогда не делитесь файлом рабочего пространства КАК ЕСТЬ. Чтобы поделиться рабочим пространством, используйте кнопку Share в меню. Она создает безопасную для общего доступа копию рабочего пространства, очищенную от конфиденциальной информации путем удаления иерархии APIs и раздела Exchange Accounts узла Crypto Exchange.",
                    "updated": 1640163182388
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}