{
    "tutorial": "Beyond the Basics",
    "pageNumber": 10,
    "type": "Tutorial Step - Before You Switch",
    "definition": {
        "text": "There are a few things you should consider every time you switch branches! Let's go through a quick list before you proceed!",
        "icon": {
            "name": "Bullet\\bullet-warning",
            "project": "Foundations"
        },
        "updated": 1618147991903,
        "translations": [
            {
                "language": "IT",
                "text": "Ci sono un paio di cose da considerare ogni volta che cambi branch! Vediamone una lista prima di continuare!",
                "updated": 1619634039951,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Hay algunas cosas que debes considerar cada vez que cambies de rama! ¡Antes de cambiar de rama, haz un Backup!",
                "updated": 1628204902504,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Es gibt ein paar Dinge, die Sie bei jedem Wechsel des Zweigs beachten sollten! Gehen wir eine kurze Liste durch, bevor Sie fortfahren!\n",
                "updated": 1634821919162
            },
            {
                "language": "RU",
                "text": "Есть несколько моментов, которые следует учитывать каждый раз, когда вы меняете ветку! Давайте пройдемся по краткому списку, прежде чем вы приступите к работе!",
                "updated": 1640155691994
            },
            {
                "language": "TR",
                "text": "Her şube değiştirdiğinizde göz önünde bulundurmanız gereken birkaç şey var! Devam etmeden önce hızlıca göz atalım!",
                "updated": 1640417403445
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "It may happen that the workspaces or other data structures in the master branch are not compatible with those in the other branch.",
            "updated": 1618158546133,
            "translations": [
                {
                    "language": "IT",
                    "text": "Può succedere che il workspace o altri dati nel master branch non siano compatibili con quelli in altri branch.",
                    "updated": 1619634081336,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Puede suceder que los workspaces u otras estructuras de datos en la rama maestra no sean compatibles con las de la otra rama.",
                    "updated": 1628204467432,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Es kann vorkommen, dass die Arbeitsbereiche oder andere Datenstrukturen im Master-Zweig nicht mit denen im anderen Zweig kompatibel sind.",
                    "updated": 1634821927757
                },
                {
                    "language": "RU",
                    "text": "Может случиться так, что рабочие пространства или другие структуры данных в основной ветви не совместимы с рабочими пространствами в другой ветви.",
                    "updated": 1640155716232
                },
                {
                    "language": "TR",
                    "text": "Ana daldaki ( Master Branch ) çalışma alanları veya diğer veri yapıları diğer daldakilerle uyumlu olmayabilir.",
                    "updated": 1640417455302
                }
            ]
        },
        {
            "style": "List",
            "text": "If the current workspace is incompatible with the software in the other branch, the workspace may break upon reloading the app. In such a case, load one of the Plugin Workspaces of the new branch.",
            "updated": 1618158600251,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se il workspace corrente è incompatibile con il software di un altro branch, esso potrebbe corrompersi ricaricando l'app. In questo caso, carica uno dei Plugin Workspace del nuovo branch.",
                    "updated": 1619634165746,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Si el Workspace actual es incompatible con el software de la otra rama, puede romperse al volver a cargar la aplicación. En tal caso, carga uno de los Plugin Workspaces de la nueva rama.",
                    "updated": 1628204753630,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Wenn der aktuelle Arbeitsbereich nicht mit der Software im anderen Zweig kompatibel ist, kann der Arbeitsbereich beim erneuten Laden der Anwendung abbrechen. Laden Sie in einem solchen Fall einen der Plugin Workspaces des neuen Zweigs.",
                    "updated": 1634821952256
                },
                {
                    "language": "RU",
                    "text": "Если текущее рабочее пространство несовместимо с программным обеспечением в другой ветке, при перезагрузке приложения рабочее пространство может сломаться. В этом случае загрузите одно из рабочих пространств Plugin Workspaces новой ветки.",
                    "updated": 1640155742807
                },
                {
                    "language": "TR",
                    "text": "Mevcut çalışma alanı diğer daldaki yazılımla uyumlu değilse, uygulama yeniden yüklendiğinde çalışma alanı bozulabilir. Böyle bir durumda yeni şubenin Plugin Workspace'lerinden birini yükleyin.",
                    "updated": 1640417497181
                }
            ]
        },
        {
            "style": "List",
            "text": "The structure of mined data may have changed!",
            "updated": 1636912993126,
            "translations": [
                {
                    "language": "IT",
                    "text": "Anche la struttura dei dati estratti potrebbe essere cambiata!",
                    "updated": 1619634182120,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "¡La estructura de los datos extraídos puede haber cambiado!",
                    "updated": 1628204506303,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Auch die Struktur der verarbeiteten/mined Daten kann sich geändert haben! ",
                    "updated": 1638832457386
                },
                {
                    "language": "RU",
                    "text": "Структура добытых данных могла измениться!",
                    "updated": 1640155763009
                },
                {
                    "language": "TR",
                    "text": "İşlenmiş verilerin ( Data Mined ) yapısı değişmiş olabilir!",
                    "updated": 1640417605561
                }
            ]
        },
        {
            "style": "Important",
            "text": "Always check the README file in the branch of the repository you wish to access for any comments on backward compatibility. Before switching branches, back up your work!",
            "updated": 1618158675366,
            "translations": [
                {
                    "language": "IT",
                    "text": "Leggi sempre il file README nel branch a cui vuoi accedere per leggere le note sulla retrocompatibilità. Prima di cambiare branches, fai un backup del tuo lavoro!",
                    "updated": 1619634260507,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "Lee el archivo README en la rama del repositorio al que deseas acceder para comentarios sobre la compatibilidad con versiones anteriores. ",
                    "updated": 1628204891328,
                    "style": "Important"
                },
                {
                    "language": "DE",
                    "text": "Prüfen Sie immer die README-Datei in dem Zweig des Repositorys, auf das Sie zugreifen möchten, auf Kommentare zur Abwärtskompatibilität. Bevor Sie den Zweig wechseln, sichern Sie Ihre Arbeit!",
                    "updated": 1634821965825
                },
                {
                    "language": "RU",
                    "text": "Всегда проверяйте файл README в ветке репозитория, к которому вы хотите получить доступ, на наличие комментариев по обратной совместимости. Перед переключением ветвей делайте резервные копии своей работы!",
                    "updated": 1640155785704
                },
                {
                    "language": "TR",
                    "text": "Geriye dönük uyumlulukla ilgili herhangi bir açıklama için her zaman geçiş yapmak istediğiniz deposunda bulunan README dosyasını kontrol edin. Şube değiştirmeden önce işinizi yedekleyin!",
                    "updated": 1640417786420
                }
            ]
        }
    ]
}