{
    "tutorial": "Beyond the Basics",
    "pageNumber": 28,
    "type": "Tutorial Step - Let's Run the Command!",
    "definition": {
        "text": "Let's get on with the task at hand! Copy the command below, paste it on the search/command box, and hit Enter!",
        "updated": 1610912478164,
        "icon": {
            "name": "Docs\\docs-json-code-style",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Copia il comando sotto, incollalo nella barra e premi Enter!",
                "updated": 1619637655966,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Sigamos con la tarea que tenemos entre manos! Copia el comando a continuación, pégalo en el cuadro de búsqueda / comando y presiona Enter!",
                "updated": 1628197068338,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Fangen wir mit der Aufgabe an, die vor uns liegt! Kopieren Sie den unten stehenden Befehl, fügen Sie ihn in das Such-/Befehlsfeld oben in den Docs ein und drücken Sie die Eingabetaste!",
                "updated": 1635151557353
            },
            {
                "language": "TR",
                "text": "Eğitime devam edelim! Aşağıdaki komutu kopyalayın, arama/komut kutusuna yapıştırın ve Enter'a basın!",
                "updated": 1640002139013
            },
            {
                "language": "RU",
                "text": "Давайте приступим к выполнению поставленной задачи! Скопируйте приведенную ниже команду, вставьте ее в поле поиска/команды и нажмите Enter!",
                "updated": 1640163425317
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Javascript",
            "text": "app.contribute My Superalgos Review",
            "updated": 1610984455117
        },
        {
            "style": "Important",
            "text": "On Windows, a GitHub sign in dialog pops-up offering to authenticate with your token or password. Either should work! Remember that the latest version of Git is required! If you have issues with the latest version, restarting the PC may help. On Mac and Linux, it is the Terminal that asks for credentials. If you enabled two-factor authentication on GitHub, use the token even if asked for the password!",
            "updated": 1622028555839,
            "translations": [
                {
                    "language": "IT",
                    "text": "Su Windows, un pop-up ti richiede l'autenticazione via token o password. Dovrebbe funzionare in entrambi i modi! Ricorda che è richiesta l'ultima versione di Git. Se hai problemi con quella, riavviare il pc può aiutare. Sul Mac, il Terminale potrebbe chiederti le credenziali. Se hai attivato l'autenticazione a due fattori su Github, usa il token anche se ti viene chiesta la password!",
                    "updated": 1619637781318,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "En Windows, aparece un cuadro de inicio de sesión de GitHub que ofrece la posibilidad de autenticarse con un token o contraseña. ¡Cualquiera debería funcionar! ¡Se requiere la última versión de Git! Si tienes problemas, reiniciar la PC puede ayudar. En Mac y Linux, es la Terminal la que solicita las credenciales. Si habilitaste la autenticación de dos factores en GitHub, usa el token incluso si se le solicita la contraseña.",
                    "updated": 1628198214740,
                    "style": "Important"
                },
                {
                    "language": "DE",
                    "text": "Unter Windows erscheint ein GitHub-Anmeldedialog, der Ihnen anbietet, sich mit Ihrem Token oder Passwort zu authentifizieren. Beides sollte funktionieren! Denken Sie daran, dass die neueste Version von Git erforderlich ist! Wenn Sie Probleme mit der neuesten Version haben, kann ein Neustart des PCs helfen. Auf Mac und Linux ist es das Terminal, das nach den Anmeldedaten fragt. Wenn Sie die Zwei-Faktor-Authentifizierung auf GitHub aktiviert haben, verwenden Sie den Token, auch wenn Sie nach dem Passwort gefragt werden!",
                    "updated": 1635151571393
                },
                {
                    "language": "TR",
                    "text": "Windows'ta, belirteciniz veya parolanızla kimlik doğrulaması yapmanızı sağlayan bir GitHub oturum açma iletişim kutusu açılır. Her ikiside işe yaramalıdır!Bu işlem için Git'in en son sürümünün gerekli olduğunu unutmayın! En son sürümle ilgili sorunlarınız varsa, bilgisayarı yeniden başlatmak yardımcı olabilir. Mac ve Linux'ta kimlik bilgilerini soran Terminal'dir. GitHub'da iki faktörlü kimlik doğrulamayı etkinleştirdiyseniz, şifre istense bile belirtecinizi kullanın!",
                    "updated": 1640002336323
                },
                {
                    "language": "RU",
                    "text": "В Windows появится диалоговое окно входа в GitHub, предлагающее пройти аутентификацию с помощью токена или пароля. Любой из этих вариантов должен сработать! Помните, что требуется последняя версия Git! Если у вас проблемы с последней версией, перезагрузка компьютера может помочь. На Mac и Linux учетные данные запрашивает Терминал. Если вы включили двухфакторную аутентификацию на GitHub, используйте токен, даже если вас попросят ввести пароль!",
                    "updated": 1640163486555
                }
            ]
        }
    ]
}