{
    "type": "Exchange Orders",
    "definition": {
        "text": "Exchange orders is the section of the data structure that keeps track of orders of all types.",
        "translations": [
            {
                "language": "ES",
                "text": "Exchange orders es la sección de la estructura de datos que realiza un seguimiento de los pedidos de todo tipo.",
                "updated": 1637231928099
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The function of this section of the trading engine is to provide the data structure to hold the information of orders as they are open and closed.",
            "translations": [
                {
                    "language": "ES",
                    "text": "La función de esta sección del trading engine es proveer  la estructura de datos para contener la información de los pedidos a medida que están abiertos y cerrados.",
                    "updated": 1637231763521
                }
            ]
        },
        {
            "style": "Text",
            "text": "Orders are organized by type, such as market orders and limit orders, and also by the type of transaction, such as buy or sell orders.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Orders se organizan por tipo, como órdenes de mercado y órdenes limitadas, y también por tipo de transacción, como órdenes de compra o venta.",
                    "updated": 1637231780323
                }
            ]
        },
        {
            "style": "Text",
            "text": "Each section of the hierarchy must have the definition of as many orders of each type as the trading system is capable of placing concurrently. For example, if the execution algorithm may place up to three limit buy orders to open a position, then three limit orders must exist under the limit buy orders section of the hierarchy. Each order defined in the trading system must reference the data structure of a matching type of order in the trading engine.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada sección de la jerarquía debe tener la definición de tantos órdenes de cada tipo como el sistema de  trading es capaz de colocar al mismo tiempo. Por ejemplo, si el algoritmo de ejecución puede colocar hasta tres órdenes de compra límite para abrir una posición, entonces deben existir tres órdenes límite bajo la sección de órdenes de compra límite de la jerarquía. Cada orden definida en el sistema de trading debe hacer referencia a la estructura de datos de un tipo de orden coincidente en el trading engine.",
                    "updated": 1637231883239
                }
            ]
        }
    ]
}