{
    "type": "API Query Parameter",
    "definition": {
        "text": "This node represent a single query parameter. For a full definition of what a query parameter is please see the API Query Parameters page.",
        "updated": 1622771217708,
        "translations": [
            {
                "language": "RU",
                "text": "Этот узел представляет собой один параметр запроса. Для полного определения того, что такое параметр запроса, пожалуйста, смотрите страницу API Query Parameters.",
                "updated": 1638629037370
            },
            {
                "language": "TR",
                "text": "Bu düğüm tek bir sorgu parametresini temsil eder. Sorgu parametresinin ne olduğuna dair tam bir tanım için lütfen API Sorgu Parametreleri sayfasına bakın.",
                "updated": 1654391398163
            },
            {
                "language": "DE",
                "text": "Dieser Knoten stellt einen einzelnen Abfrageparameter dar. Eine vollständige Definition des Begriffs Abfrageparameter finden Sie auf der Seite API Query Parameters.",
                "updated": 1701930778277
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "Even if you are not using every query parameter offered for an endpoint.  For the sake of completeness, it is a good idea to add it to the map and delete the value property.",
            "updated": 1622765045028,
            "translations": [
                {
                    "language": "RU",
                    "text": "Даже если вы не используете все параметры запроса, предлагаемые для конечной точки. Для полноты картины рекомендуется добавить его на карту и удалить свойство value.",
                    "updated": 1638629079552
                },
                {
                    "language": "TR",
                    "text": "Bir uç nokta için sunulan her sorgu parametresini kullanmıyor olsanız bile.  Bütünlük adına, haritaya eklemek ve değer özelliğini silmek iyi bir fikirdir.",
                    "updated": 1654391403924,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Auch wenn Sie nicht alle für einen Endpunkt angebotenen Abfrageparameter verwenden.  Der Vollständigkeit halber ist es eine gute Idee, ihn zur Karte hinzuzufügen und die Eigenschaft value zu löschen.",
                    "updated": 1701930778436,
                    "style": "Success"
                }
            ]
        },
        {
            "style": "Title",
            "text": "API Query Parameter Configuration",
            "updated": 1622895734675,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация API Query Parameter",
                    "updated": 1638629101825
                },
                {
                    "language": "TR",
                    "text": "API Sorgu Parametresi Yapılandırması",
                    "updated": 1654391409131,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Konfiguration der API Query Parameter",
                    "updated": 1701930778589,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1638629109290
                },
                {
                    "language": "TR",
                    "text": "Özellikler",
                    "updated": 1654391415215,
                    "style": "Subtitle"
                },
                {
                    "language": "DE",
                    "text": "Eigenschaften",
                    "updated": 1701930778701,
                    "style": "Subtitle"
                }
            ]
        },
        {
            "style": "List",
            "text": "codeName: This must match with the name of the query parameter defined at the API docs.",
            "translations": [
                {
                    "language": "RU",
                    "text": "codeName: Оно должно совпадать с именем параметра запроса, определенным в документации API.",
                    "updated": 1638629123379
                },
                {
                    "language": "TR",
                    "text": "codeName: Bu, API dokümanlarında tanımlanan sorgu parametresinin adıyla eşleşmelidir.",
                    "updated": 1654391422325,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "codeName: Dieser muss mit dem Namen des in den API-Dokumenten definierten Abfrageparameters übereinstimmen.",
                    "updated": 1701930778866,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "isString: Define if the path parameter is a string or not.",
            "translations": [
                {
                    "language": "RU",
                    "text": "isString: Определите, является ли параметр пути строкой или нет.",
                    "updated": 1638629144731
                },
                {
                    "language": "TR",
                    "text": "isString: Yol parametresinin bir dize olup olmadığını tanımlar.",
                    "updated": 1654391428286,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "isString: Definiert, ob der Pfadparameter eine Zeichenkette ist oder nicht.",
                    "updated": 1701930779016,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "isOptional: Define if this path parameter is optional or not.",
            "translations": [
                {
                    "language": "RU",
                    "text": "isOptional: Определите, является ли этот параметр пути необязательным или нет.",
                    "updated": 1638629155812
                },
                {
                    "language": "TR",
                    "text": "isOptional: Bu yol parametresinin isteğe bağlı olup olmadığını tanımlar.",
                    "updated": 1654391434285,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "isOptional: Legt fest, ob dieser Pfadparameter optional ist oder nicht.",
                    "updated": 1701930779155,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "description: Define a basic description of what this path parameter accomplishes.",
            "translations": [
                {
                    "language": "RU",
                    "text": "description: Определите базовое описание того, что выполняет этот параметр пути.",
                    "updated": 1638629167455
                },
                {
                    "language": "TR",
                    "text": "Açıklama: Bu yol parametresinin ne yaptığına dair temel bir açıklama tanımlayın.",
                    "updated": 1654391439744,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "description: Definieren Sie eine grundlegende Beschreibung dessen, was dieser Pfadparameter bewirkt.",
                    "updated": 1701930779276,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "value: This is the value to be used by the parameter. ",
            "updated": 1622764598076,
            "translations": [
                {
                    "language": "RU",
                    "text": "value: Это значение, которое будет использоваться параметром.",
                    "updated": 1638629181285
                },
                {
                    "language": "TR",
                    "text": "değer: Parametre tarafından kullanılacak değerdir.",
                    "updated": 1654391445484,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "value: Dies ist der Wert, der für den Parameter verwendet werden soll.",
                    "updated": 1701930779407,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Note",
            "text": "The value you type into the API Map will be considered the default value. The same parameter can be dynamically pulled from a users system using the replaceBy property.  When the replaceBy property is used the default value will be overwritten.",
            "updated": 1622771817973,
            "translations": [
                {
                    "language": "RU",
                    "text": "Значение, которое вы вводите в API Map, будет считаться значением по умолчанию. Тот же параметр может быть динамически извлечен из пользовательской системы с помощью свойства replaceBy. Когда используется свойство replaceBy, значение по умолчанию будет перезаписано.",
                    "updated": 1638629220709
                },
                {
                    "language": "TR",
                    "text": "API Haritasına yazdığınız değer varsayılan değer olarak kabul edilecektir. Aynı parametre replaceBy özelliği kullanılarak bir kullanıcının sisteminden dinamik olarak çekilebilir.  replaceBy özelliği kullanıldığında varsayılan değerin üzerine yazılacaktır.",
                    "updated": 1654391451184,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Der Wert, den Sie in die API Map eingeben, wird als Standardwert betrachtet. Derselbe Parameter kann mit der Eigenschaft replaceBy dynamisch aus dem System eines Benutzers abgerufen werden.  Wenn die replaceBy-Eigenschaft verwendet wird, wird der Standardwert überschrieben.",
                    "updated": 1701930779532,
                    "style": "Note"
                }
            ]
        },
        {
            "style": "List",
            "text": "replaceBy: [Optional] This property allows you to instruct the API Fetcher Bot to set a value to this parameter replacing the current default and using contextual information available only at runtime.",
            "updated": 1622863577107,
            "translations": [
                {
                    "language": "RU",
                    "text": "replaceBy: [Необязательно] Это свойство позволяет указать боту API Fetcher Bot установить значение этого параметра, заменяя текущее значение по умолчанию и используя контекстную информацию, доступную только во время выполнения.",
                    "updated": 1638629270861
                },
                {
                    "language": "TR",
                    "text": "replaceBy: [İsteğe bağlı] Bu özellik, API Fetcher Bot'a bu parametreye geçerli varsayılanın yerine bir değer ayarlaması ve yalnızca çalışma zamanında kullanılabilen bağlamsal bilgileri kullanması talimatını vermenizi sağlar.",
                    "updated": 1654391456940,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "replaceBy: [Optional] Mit dieser Eigenschaft können Sie den API Fetcher Bot anweisen, einen Wert für diesen Parameter festzulegen, der den aktuellen Standardwert ersetzt und kontextbezogene Informationen verwendet, die nur zur Laufzeit verfügbar sind.",
                    "updated": 1701930779699,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Here is an example config setting a query option to false:",
            "updated": 1622764541685,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вот пример конфигурации, устанавливающей для параметра запроса значение false:",
                    "updated": 1638629284976
                },
                {
                    "language": "TR",
                    "text": "İşte bir sorgu seçeneğini false olarak ayarlayan örnek bir yapılandırma:",
                    "updated": 1654391463415,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Hier ist eine Beispielkonfiguration, die eine Abfrageoption auf false setzt:",
                    "updated": 1701930779921,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n    \"codeName\": \"localization\",\n    \"isString\": false,\n    \"isOptional\": true,\n    \"description\": \"Trim down responce object\",\n    \"value\": false\n}",
            "updated": 1622764527431
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->replaceBy Config Property->How To Use It",
            "translations": [
                {
                    "language": "TR",
                    "text": "Foundations->Concept->replaceBy Config Property->Nasıl Kullanılır",
                    "updated": 1654391469321,
                    "style": "Include"
                },
                {
                    "language": "DE",
                    "text": "Foundations->Concept->replaceBy Config Property->Hinweise zur Verwendung",
                    "updated": 1701930780206,
                    "style": "Include"
                }
            ]
        }
    ]
}