{
    "type": "Plotter Panel",
    "definition": {
        "text": "A plotter panel usually shows numerical representations of data over the charts on a small window or panel. The plotter panel node features definitions to make that possible.",
        "translations": [
            {
                "language": "ES",
                "text": "A plotter panel generalmente muestra representaciones numéricas de datos sobre los gráficos en una pequeña ventana o panel. El nodo plotter panel presenta definiciones para hacerlo posible.",
                "updated": 1624410820906
            },
            {
                "language": "RU",
                "text": "Панель плоттера обычно отображает числовые представления данных на диаграммах в небольшом окне или панели. Узел панели плоттера содержит определения, позволяющие это сделать.",
                "updated": 1636566746211
            },
            {
                "language": "TR",
                "text": "Bir çizici paneli genellikle verilerin sayısal gösterimlerini küçük bir pencere veya panel üzerindeki grafikler üzerinde gösterir. Çizici panel düğümü bunu mümkün kılmak için tanımlara sahiptir.",
                "updated": 1674140664742
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Beyond the graphic representation of data over the charts, plotters may also feature a data panel, that is, a numerical representation of the data showing the exact figures corresponding to the column or period that is in focus (the point of the charts where the mouse pointer is at any point).",
            "translations": [
                {
                    "language": "TR",
                    "text": "Grafikler üzerinde verilerin grafik temsilinin ötesinde, çiziciler ayrıca bir veri paneli, yani odaklanılan sütun veya döneme karşılık gelen kesin rakamları gösteren verilerin sayısal bir temsilini de içerebilir (grafiklerin herhangi bir noktasında fare imlecinin bulunduğu nokta).",
                    "updated": 1674140746704
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609932499869
        },
        {
            "style": "Title",
            "text": "Plotter Panel Configuration",
            "updated": 1609932508408
        }
    ]
}