{
    "type": "Tutorial Step",
    "definition": {
        "text": "A tutorial step is a type of node within a tutorial that may not have offspring. As such, it is the smallest unit of information in the hierarchy.",
        "translations": [
            {
                "language": "RU",
                "text": "Шаг учебного пособия - это тип узла в пособии, который может не иметь потомков. Таким образом, это самая маленькая единица информации в иерархии.",
                "updated": 1635612531097
            },
            {
                "language": "ES",
                "text": "Un paso de tutorial es un tipo de nodo dentro de un tutorial que puede no tener descendencia. Como tal, es la unidad de información más pequeña de la jerarquía.",
                "updated": 1636719725988
            },
            {
                "language": "TR",
                "text": "Öğretici adım, bir öğreticinin alt düğümleri olmayan , bir düğüm tür olabilir. Bu nedenle, hiyerarşideki en küçük bilgi birimidir.",
                "updated": 1639142857774
            },
            {
                "language": "DE",
                "text": "Ein Tutorial Step (Schritt) ist eine Art von Knoten innerhalb eines Lernprogramms, der keine Nachkommen haben kann. Als solcher ist er die kleinste Informationseinheit in der Hierarchie.",
                "updated": 1674918053483
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Tutorial Step Configuration",
            "updated": 1609706397520,
            "translations": [
                {
                    "language": "TR",
                    "text": "Öğretici Adım Yapılandırması",
                    "updated": 1652016115644
                },
                {
                    "language": "DE",
                    "text": "Tutorial Step Konfiguration",
                    "updated": 1674917817099
                }
            ]
        },
        {
            "style": "Note",
            "text": "The basic configuration of the tutorial step node is the same as the Tutorial node. Refer to the latter, please.",
            "updated": 1613846300336,
            "translations": [
                {
                    "language": "ES",
                    "text": "La configuración básica del nodo del paso del tutorial es la misma que la del nodo Tutorial. Consulte este último, por favor.",
                    "updated": 1636719782428
                },
                {
                    "language": "TR",
                    "text": "Not: Öğretici ( Tutorial ) adım düğümünün temel yapılandırması, Eğitim düğümü ile aynıdır. İkincisine bakın, lütfen.",
                    "updated": 1652016179524
                },
                {
                    "language": "DE",
                    "text": "Die Grundkonfiguration des Knotens tutorial step (Schritt) ist die gleiche wie die des Knotens Tutorial . Beziehen Sie sich bitte auf letzteren.",
                    "updated": 1674918035206
                }
            ]
        },
        {
            "style": "Text",
            "text": "In addition to the basic configuration, tutorial step nodes feature a large collection of resources that allows you to manipulate the user interface and actual nodes in many ways.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Además de la configuración básica, los nodos de pasos del tutorial cuentan con una gran colección de recursos que le permite manipular la interfaz de usuario y los nodos reales de muchas formas.",
                    "updated": 1636719820832
                },
                {
                    "language": "TR",
                    "text": "Temel yapılandırmaya ek olarak, öğretici adım düğümleri, kullanıcı arabirimini ve gerçek düğümleri birçok şekilde değiştirmenize olanak tanıyan geniş bir kaynak koleksiyonuna sahiptir.",
                    "updated": 1652016190427
                },
                {
                    "language": "DE",
                    "text": "Zusätzlich zur Grundkonfiguration bietet der tutorial step Knoten eine große Sammlung von Ressourcen, mit denen Sie die Benutzeroberfläche und die eigentlichen Knoten auf vielfältige Weise manipulieren können.",
                    "updated": 1674918146511
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Navigation",
            "updated": 1609706308531,
            "translations": [
                {
                    "language": "TR",
                    "text": "Navigasyon",
                    "updated": 1652016202084
                }
            ]
        },
        {
            "style": "Text",
            "text": "Setting up a reference to any node in the workspace and using the below parameter makes the step load next to the referenced node.",
            "translations": [
                {
                    "language": "ES",
                    "text": "La configuración de una referencia a cualquier nodo en el espacio de trabajo y el uso del siguiente parámetro hace que el paso se cargue junto al nodo al que se hace referencia.",
                    "updated": 1636719856418
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanındaki herhangi bir düğüme referans ayarlamak ve aşağıdaki parametreyi kullanmak referans alınan düğümün yanındaki adım yükünü yapar.",
                    "updated": 1652016209837
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie einen Verweis auf einen beliebigen Knoten im Arbeitsbereich einrichten und den folgenden Parameter verwenden, wird der step (Schritt) neben dem referenzierten Knoten geladen.",
                    "updated": 1674918224124
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "    \"positionAtReferenceParent\": true,"
        },
        {
            "style": "Subtitle",
            "text": "Messages",
            "updated": 1613846598199,
            "translations": [
                {
                    "language": "TR",
                    "text": "Mesajlar",
                    "updated": 1652016296830
                },
                {
                    "language": "DE",
                    "text": "Nachrichten",
                    "updated": 1674918243751
                }
            ]
        },
        {
            "style": "Text",
            "text": "Setting up a reference to any node in the workspace and using the below parameters allows placing different types of messages on the referenced node.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Configurar una referencia a cualquier nodo en el espacio de trabajo y usar los siguientes parámetros permite colocar diferentes tipos de mensajes en el nodo referenciado.",
                    "updated": 1636719884062
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanındaki herhangi bir düğüme bir referans ayarlamak ve aşağıdaki parametreleri kullanmak, referans verilen düğüme farklı türde mesajların yerleştirilmesine izin verir.",
                    "updated": 1652016305470
                },
                {
                    "language": "DE",
                    "text": "Das Einrichten eines Verweises auf einen beliebigen Knoten im Arbeitsbereich und die Verwendung der unten aufgeführten Parameter ermöglicht es, verschiedene Arten von Nachrichten auf dem referenzierten Knoten zu platzieren.",
                    "updated": 1674918272320
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "\"setErrorMessageReferenceParent\": \"This is a simulated error message!\"\n\"setInfoMessageReferenceParent\": \"This is a simulated info message!\"\n\"setValueReferenceParent\": \"This is a simulated value message!\"\n\"setPercentageReferenceParent\": \"This is a simulated progress message!\"\n\"setStatusReferenceParent\": \"This is a simulated status message!\"",
            "updated": 1609706430970
        },
        {
            "style": "Subtitle",
            "text": "Centering and Zooming Into a Time Machine",
            "updated": 1609706456866,
            "translations": [
                {
                    "language": "TR",
                    "text": "Bir Zaman Makinesinde Merkezleme ve Yakınlaştırma",
                    "updated": 1652016317886
                },
                {
                    "language": "DE",
                    "text": "Zentrieren und Zoomen in einer Time Machine (Zeitmaschine)",
                    "updated": 1674918633584
                }
            ]
        },
        {
            "style": "Text",
            "text": "Setting up a reference to a time machine node in the Charting Space hierarchy while using the below parameter causes the following:",
            "updated": 1617706853889,
            "translations": [
                {
                    "language": "ES",
                    "text": "Configurar una referencia a un nodo de máquina del tiempo en la jerarquía del  Charting Space mientras se utiliza el siguiente parámetro provoca lo siguiente:",
                    "updated": 1636719950843
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki parametreyi kullanırken Grafik Alanı ( Charting Space ) hiyerarşisinde bir zaman makinesi düğümüne referans ayarlamak aşağıdakilere neden olur:",
                    "updated": 1652016350065
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie einen Verweis auf einen time machine Knoten in der Charting Space Hierarchie einrichten und dabei den unten aufgeführten Parameter verwenden, führt dies zu folgendem Problem:",
                    "updated": 1674918796042
                }
            ]
        },
        {
            "style": "List",
            "text": "The charting space viewport is centered on the referenced time machine.",
            "translations": [
                {
                    "language": "ES",
                    "text": "La ventana gráfica del espacio de gráficos está centrada en la máquina del tiempo referenciada.",
                    "updated": 1636719973599
                },
                {
                    "language": "TR",
                    "text": "Grafik alanı görünüm penceresi, başvurulan zaman makinesinde ortalanır.",
                    "updated": 1652016358339
                },
                {
                    "language": "DE",
                    "text": "Das Ansichtsfenster (viewport) des Diagrammbereichs wird auf die referenzierte Zeitmaschine (time machine) zentriert.",
                    "updated": 1674918902295
                }
            ]
        },
        {
            "style": "List",
            "text": "The time machine is adjusted to fit the aspect ratio of the screen.",
            "translations": [
                {
                    "language": "ES",
                    "text": "La máquina del tiempo se ajusta para adaptarse a la relación de aspecto de la pantalla.",
                    "updated": 1636719989566
                },
                {
                    "language": "TR",
                    "text": "Zaman makinesi ekranın en boy oranına uyacak şekilde ayarlanır.",
                    "updated": 1652016365843
                },
                {
                    "language": "DE",
                    "text": "Die Zeitmaschine (time machine) wird an das Seitenverhältnis des Bildschirms angepasst.",
                    "updated": 1674918954196
                }
            ]
        },
        {
            "style": "List",
            "text": "The viewport zooms into the time machine.",
            "translations": [
                {
                    "language": "ES",
                    "text": "La ventana gráfica se acerca a la máquina del tiempo.",
                    "updated": 1636720005080
                },
                {
                    "language": "TR",
                    "text": "Görüntü alanı, zaman makinesine yakınlaşır.",
                    "updated": 1652016378094
                },
                {
                    "language": "DE",
                    "text": "Das Ansichtsfenster zoomt in die Zeitmaschine.",
                    "updated": 1674918999010
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "    \"repositionAtTimeMachineReferenceParent\": true,"
        },
        {
            "style": "Subtitle",
            "text": "Pressing Keys When on a Time Machine",
            "updated": 1609706492050,
            "translations": [
                {
                    "language": "TR",
                    "text": "Zaman Makinesinde Tuşlara Basmak",
                    "updated": 1652016697947
                },
                {
                    "language": "DE",
                    "text": "Drücken von Tasten in einer Time Machine (Zeitmaschine)",
                    "updated": 1674919097967
                }
            ]
        },
        {
            "style": "Text",
            "text": "Setting up a reference to a time machine node in the charting space hierarchy and using the below parameters allows replicating the pressing of relevant key combinations when on a time machine.",
            "updated": 1617706916777,
            "translations": [
                {
                    "language": "ES",
                    "text": "La configuración de una referencia a un nodo de la máquina del tiempo en la jerarquía del espacio de gráficos y el uso de los siguientes parámetros permite replicar la pulsación de combinaciones de teclas relevantes en una máquina del tiempo.",
                    "updated": 1636720030872
                },
                {
                    "language": "TR",
                    "text": "Grafik alanı hiyerarşisinde bir zaman makinesi düğümüne bir referans ayarlamak ve aşağıdaki parametreleri kullanmak, bir zaman makinesindeyken ilgili tuş kombinasyonlarına basılmasının çoğaltılmasına izin verir.",
                    "updated": 1652016706837
                },
                {
                    "language": "DE",
                    "text": "Die Einrichtung eines Verweises auf einen (time machine node) Zeitmaschinenknoten in der Hierarchie des Diagrammbereichs und die Verwendung der nachstehenden Parameter ermöglichen es, das Drücken der entsprechenden Tastenkombinationen zu reproduzieren, wenn man sich auf einer Zeitmaschine befindet.",
                    "updated": 1674919189895
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "\"keyPressedTimeMachineReferenceParent\": {\n\"shiftKey\": true,\n\"ctrlKey\": true,\n\"metaKey\": true,\n\"key\": \"A\"\n}",
            "updated": 1609706515897
        },
        {
            "style": "List",
            "text": "shiftKey, ctrlKey, and metaKey (Mac OS equivalent to Control) may be true or false.",
            "translations": [
                {
                    "language": "TR",
                    "text": "shiftKey, ctrlKey ve metaKey (Mac OS'de Control'e eşdeğer) doğru veya yanlış olabilir.",
                    "updated": 1652016729875
                },
                {
                    "language": "DE",
                    "text": "shiftKey, ctrlKey und metaKey (Mac OS-Äquivalent zu Control) können true oder false sein.",
                    "updated": 1674919263918
                }
            ]
        },
        {
            "style": "List",
            "text": "key may be any letter or number.",
            "translations": [
                {
                    "language": "ES",
                    "text": "La clave puede ser cualquier letra o número.",
                    "updated": 1636720046853
                },
                {
                    "language": "TR",
                    "text": "anahtar herhangi bir harf veya sayı olabilir.",
                    "updated": 1652016740112
                },
                {
                    "language": "DE",
                    "text": "Taste kann ein beliebiger Buchstabe oder eine Zahl sein.",
                    "updated": 1674919284034
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Pressing Keys on the Design Space",
            "updated": 1620866371352,
            "translations": [
                {
                    "language": "ES",
                    "text": "Pressing Keys on the Design Space (Pulsando teclas en el espacio de diseño)",
                    "updated": 1636723423034
                },
                {
                    "language": "TR",
                    "text": "Tasarım Alanındaki Tuşlara Basmak",
                    "updated": 1652016749335
                },
                {
                    "language": "DE",
                    "text": "Drücken von Tasten auf dem Design Space",
                    "updated": 1674919346164
                }
            ]
        },
        {
            "style": "Text",
            "text": "It is also possible to press any combination of keys within the Design Space. The format works the same as above but the key press will happen within the context of the design space.",
            "updated": 1620866727876,
            "translations": [
                {
                    "language": "ES",
                    "text": "También es posible presionar cualquier combinación de teclas dentro del Design Space. El formato funciona igual que el anterior, pero la pulsación de la tecla se producirá dentro del contexto del espacio de diseño.",
                    "updated": 1636723494988
                },
                {
                    "language": "TR",
                    "text": "Tasarım Alanı ( Design Space ) içinde herhangi bir tuş kombinasyonuna basmak da mümkündür. Biçim, yukarıdakiyle aynı şekilde çalışır, ancak tuşa basma, tasarım alanı bağlamında gerçekleşir.",
                    "updated": 1652016817731
                },
                {
                    "language": "DE",
                    "text": "Es ist auch möglich, eine beliebige Tastenkombination innerhalb des Design Space (Designbereichs) zu drücken. Das Format ist dasselbe wie oben, aber der Tastendruck erfolgt im Kontext des design space.",
                    "updated": 1674919501565
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "\"keyPressed\": {\n\"shiftKey\": true,\n\"ctrlKey\": true,\n\"metaKey\": true,\n\"key\": \"R\"\n}",
            "updated": 1620866699727
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Subtitle",
            "text": "Toggling Map View",
            "updated": 1620866823195,
            "translations": [
                {
                    "language": "ES",
                    "text": "Toggling Map View (Alternar vista del mapa)",
                    "updated": 1636723537130
                },
                {
                    "language": "TR",
                    "text": "Harita Görünümünü Değiştirme",
                    "updated": 1652016867970
                },
                {
                    "language": "DE",
                    "text": "Umschalten der Map View (Kartenansicht)",
                    "updated": 1674919583241
                }
            ]
        },
        {
            "style": "Text",
            "text": "In order to switch between regular and map view, you can use the following configuration.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Para cambiar entre la vista normal y la vista de mapa, puede utilizar la siguiente configuración.",
                    "updated": 1636723564528
                },
                {
                    "language": "TR",
                    "text": "Normal ve harita görünümü arasında geçiş yapmak için aşağıdaki konfigürasyonu kullanabilirsiniz.",
                    "updated": 1652016871453
                },
                {
                    "language": "DE",
                    "text": "Um zwischen der normalen Ansicht und der Kartenansicht zu wechseln, können Sie die folgende Konfiguration verwenden.",
                    "updated": 1674919619234
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "\"toggleMapView\": {\n        \"view\": \"On\"\n    }",
            "updated": 1620867055273
        },
        {
            "style": "Text",
            "text": "Valid options are:",
            "updated": 1620867068878,
            "translations": [
                {
                    "language": "TR",
                    "text": "Geçerli seçenekler şunlardır:",
                    "updated": 1652016879057
                },
                {
                    "language": "DE",
                    "text": "Gültige Optionen sind:",
                    "updated": 1674919642199
                }
            ]
        },
        {
            "style": "List",
            "text": "\"On\"",
            "translations": [
                {
                    "language": "TR",
                    "text": "\"Açık\"",
                    "updated": 1654390501400,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "\"Off\"",
            "translations": [
                {
                    "language": "TR",
                    "text": "\"Kapalı\"",
                    "updated": 1654390507044,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Note",
            "text": "When this configuration is active within a tutorial step, the user will be unable to switch between views manually.",
            "updated": 1620867158361,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando esta configuración está activa dentro de un paso del tutorial, el usuario no podrá cambiar entre vistas manualmente.",
                    "updated": 1636723585752
                },
                {
                    "language": "TR",
                    "text": "Not: Bu yapılandırma bir eğitim adımında etkin olduğunda, kullanıcı görünümler arasında manuel olarak geçiş yapamaz.",
                    "updated": 1652016886755
                },
                {
                    "language": "DE",
                    "text": "Wenn diese Konfiguration innerhalb eines Lernschritts aktiv ist, kann der Benutzer nicht manuell zwischen den Ansichten wechseln.",
                    "updated": 1674919669830
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Changing Node's Configurations",
            "translations": [
                {
                    "language": "ES",
                    "text": "Changing Node's Configurations (Cambiando las configuraciones del nodo",
                    "updated": 1636723622329
                },
                {
                    "language": "TR",
                    "text": "Düğümün Yapılandırmalarını Değiştirme",
                    "updated": 1652016894122
                },
                {
                    "language": "DE",
                    "text": "Ändern von Knotenkonfigurationen",
                    "updated": 1674919990099
                }
            ]
        },
        {
            "style": "Text",
            "text": "The batchConfigChangesReferenceParent property allows you to edit the configuration of a referenced node and their offspring.",
            "updated": 1617707009812,
            "translations": [
                {
                    "language": "ES",
                    "text": "La propiedad batchConfigChangesReferenceParent aLe permite editar la configuración de un nodo referenciado y su descendencia.",
                    "updated": 1636723673596
                },
                {
                    "language": "TR",
                    "text": "BatchConfigChangesReferenceParent özelliği, başvurulan bir düğümün ve bunların yavrularının yapılandırmasını düzenlemenize olanak tanır.",
                    "updated": 1652016901878
                },
                {
                    "language": "DE",
                    "text": "Mit der Eigenschaft batchConfigChangesReferenceParent können Sie die Konfiguration eines referenzierten Knotens und seiner Nachkommen bearbeiten.",
                    "updated": 1674920034158
                }
            ]
        },
        {
            "style": "Text",
            "text": "The example below changes the configuration of the three different scale nodes under a time machine. In this case, the time machine is the node referenced, the nodePath is the path of the node whose configuration must be changed relative to the referenceParent, and the properties parameter is the actual configuration to be set.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El siguiente ejemplo cambia la configuración de los tres nodos de escala diferentes bajo una máquina del tiempo. En este caso, la máquina del tiempo es el nodo referenciado. el nodePath es la ruta del nodo cuya configuración debe cambiarse en relación con el referenceParent, y el parámetro de propiedades es la configuración real que se va a establecer.",
                    "updated": 1636723752011
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki örnek, bir zaman makinesi altındaki üç farklı ölçek düğümünün konfigürasyonunu değiştirir. Bu durumda, zaman makinesi başvurulan düğümdür, nodePath, konfigürasyonu ReferenceParent'e göre değiştirilmesi gereken düğümün yoludur ve özellikler parametresi, ayarlanacak gerçek konfigürasyondur.",
                    "updated": 1652016909952
                },
                {
                    "language": "DE",
                    "text": "Das folgende Beispiel ändert die Konfiguration der drei verschiedenen Skalierungsknoten unter einer Zeitmaschine (time machine). In diesem Fall ist die Zeitmaschine (time machine) der referenzierte Knoten, der nodePath ist der Pfad des Knotens, dessen Konfiguration relativ zum referenceParent geändert werden muss, und der properties-Parameter ist die eigentliche Konfiguration, die festgelegt werden soll.",
                    "updated": 1674920173378
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"batchConfigChangesReferenceParent\": [\n        {\n            \"nodePath\": \"referenceParent.timeScale\",\n            \"properties\": {\n                \"autoMinScale\": false,\n                \"autoMaxScale\": false,\n                \"fromDate\": \"2020-08-31T23:40:00.000Z\",\n                \"toDate\": \"2020-09-01T01:00:00.000Z\"\n            }\n        },\n        {\n            \"nodePath\": \"referenceParent.rateScale\",\n            \"properties\": {\n                \"autoMinScale\": false,\n                \"autoMaxScale\": false,\n                \"minValue\": 11400,\n                \"maxValue\": 11800\n            }\n        },\n        {\n            \"nodePath\": \"referenceParent.timeFrameScale\",\n            \"properties\": {\n                \"value\": \"01-min\"\n            }\n        }\n    ]",
            "updated": 1617707082553
        },
        {
            "style": "Success",
            "text": "A typical use case for this resource is when you wish to bring to user to a specific point in a chart, but it may be used for any other case that requires manipulating node's configurations.",
            "updated": 1617707174287,
            "translations": [
                {
                    "language": "ES",
                    "text": "Un caso de uso típico de este recurso es cuando desea llevar al usuario a un punto específico en un gráfico, pero puede usarse para cualquier otro caso que requiera manipular las configuraciones del nodo.",
                    "updated": 1636723793997
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bu kaynak için tipik bir kullanım durumu, kullanıcıya bir grafikte belirli bir noktaya getirmek istediğiniz zamandır, ancak bu, düğüm yapılandırmalarının manipüle edilmesini gerektiren başka herhangi bir durum için kullanılabilir.",
                    "updated": 1652016930858
                },
                {
                    "language": "DE",
                    "text": "Ein typischer Anwendungsfall für diese Ressource ist, wenn Sie den Benutzer zu einem bestimmten Punkt in einem Diagramm bringen wollen, aber sie kann auch für jeden anderen Fall verwendet werden, der eine Manipulation der Knotenkonfigurationen erfordert.",
                    "updated": 1674920266569
                }
            ]
        }
    ]
}