{
    "type": "Assets",
    "definition": {
        "text": "The Assets hierarchy defines the structure of assets that a project is composed of. Any digital component of a Project may be characterised as an asset, including code files, stylesheets, images, documentation pages, tutorial pages, and so on. Assets, like Features, need to be created and maintained, thus their creation and maintenance must be incentivized. ",
        "updated": 1624708951019,
        "translations": [
            {
                "language": "RU",
                "text": "Иерархия Assets определяет структуру ресурсов, из которых состоит проект. Любой цифровой компонент проекта может быть охарактеризован как ресурс, включая файлы кода, таблицы стилей, изображения, страницы документации, страницы руководств и так далее. Ресурсы, как и функции, необходимо создавать и поддерживать,\nтаким образом, их создание и поддержание необходимо стимулировать.",
                "updated": 1638617726711
            },
            {
                "language": "TR",
                "text": "Varlıklar hiyerarşisi, bir projenin oluşturduğu varlıkların yapısını tanımlar. Bir Projenin (Project) herhangi bir dijital bileşeni, kod dosyaları, stil sayfaları, resimler, dokümantasyon sayfaları, eğitim sayfaları vb. dahil olmak üzere bir varlık olarak nitelendirilebilir. Özellikler (Features) gibi varlıkların oluşturulması ve sürdürülmesi gerekir, bu nedenle bunların oluşturulması ve bakımı teşvik edilmelidir.",
                "updated": 1644568893756
            },
            {
                "language": "DE",
                "text": "Die Hierarchie der Assets definiert die Struktur der Assets, aus denen ein Projekt besteht. Jede digitale Komponente eines Projekts (Project) kann als Asset bezeichnet werden, einschließlich Codedateien, Stylesheets, Bilder, Dokumentationsseiten, Tutorialseiten usw. Assets müssen ebenso wie Features erstellt und gepflegt werden, daher müssen Anreize für ihre Erstellung und Pflege geschaffen werden.  ",
                "updated": 1708628874677
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624709007419
        },
        {
            "style": "Text",
            "text": "Defining assets at the project level is an excellent way to atomize the description of a project. This level of granularity allows multiple groups of Contributors to take charge of clearly delimited components, which is crucial to developing, evolving, and maintaining a vast project through massive collaboration.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Определение ресурсов на уровне проекта - отличный способ атомизировать описание проекта. Такой уровень детализации позволяет нескольким группам участников брать на себя ответственность за четко разграниченные компоненты, что имеет решающее значение для разработки, развития и поддержки обширного проекта посредством массового сотрудничества.",
                    "updated": 1638618106378
                },
                {
                    "language": "TR",
                    "text": "Varlıkları proje düzeyinde tanımlamak, bir projenin tanımını atomize etmenin mükemmel bir yoludur. Bu ayrıntı, çok sayıda Katkıda Bulunan grubunun, büyük bir işbirliği yoluyla geniş bir projeyi geliştirmek ve sürdürmek için çok önemli olan,bileşenlerin sorumluluğunu üstlenmesine olanak tanır.",
                    "updated": 1644569193331
                },
                {
                    "language": "DE",
                    "text": "Die Definition von Assets auf Projektebene ist eine hervorragende Möglichkeit, die Beschreibung eines Projekts zu atomisieren. Diese Granularität ermöglicht es mehreren Gruppen von Mitwirkenden, die Verantwortung für klar abgegrenzte Komponenten zu übernehmen, was für die Entwicklung, Weiterentwicklung und Pflege eines umfangreichen Projekts durch massive Zusammenarbeit entscheidend ist.",
                    "updated": 1708291393760
                }
            ]
        },
        {
            "style": "Text",
            "text": "The hierarchy features Asset Class nodes, an organizational device, and Asset nodes, the representation of actual assets. Both types of nodes may accept incoming Weight Votes but only Asset nodes may accept Contribution Claims.",
            "updated": 1630434541690,
            "translations": [
                {
                    "language": "RU",
                    "text": "Иерархия включает узлы класса ресурсов Asset Class, организационное устройство и узлы ресурсов Asset, представляющие фактические ресурсы. Оба типа узлов могут принимать входящие голоса Weight Votes, но только узлы ресурсов могут принимать заявки на участие Contribution Claims.",
                    "updated": 1638618493050
                },
                {
                    "language": "TR",
                    "text": "Hiyerarşi, bir kuruluş aygıtı olan Varlık Sınıfı (Asset Class) düğümlerini ve gerçek varlıkların temsili olan Varlık (Asset) düğümlerini içerir. Her iki düğüm türü de gelen Ağırlık Oylarını (Weight Votes) kabul edebilir, ancak yalnızca Varlık düğümleri Katkı Taleplerini (Contribution Claims) kabul edebilir.",
                    "updated": 1644569311827
                },
                {
                    "language": "DE",
                    "text": "Die Hierarchie besteht aus Asset-Klassen-Knoten (Asset Class nodes), einer organisatorischen Einrichtung, und Asset-Knoten, die tatsächliche Vermögenswerte darstellen. Beide Knotentypen können eingehende Gewichtungsstimmen (Weight Votes) annehmen, aber nur Asset-Knoten können Beitragsforderungen (Contribution Claims) annehmen.",
                    "updated": 1708291466130
                }
            ]
        },
        {
            "style": "Success",
            "text": "A crucial feature of this hierarchy is the Install Assets feature available both at the top-level of the hierarchy, and at the Asset Class node level.",
            "updated": 1624709216096,
            "translations": [
                {
                    "language": "RU",
                    "text": "Важнейшей особенностью этой иерархии является функция установки ресурсов Install Assets, доступная как на верхнем уровне иерархии, так и на уровне узла Assets Class.",
                    "updated": 1638618660748
                },
                {
                    "language": "TR",
                    "text": "Bu hiyerarşinin önemli bir özelliği, hem hiyerarşinin en üst düzeyinde hem de Varlık Sınıfı (Asset Class) düğüm düzeyinde kullanılabilen Varlıkları Kurabilme özelliğidir.",
                    "updated": 1644569374047
                },
                {
                    "language": "DE",
                    "text": "Ein wichtiges Merkmal dieser Hierarchie ist die Funktion Assets installieren, die sowohl auf der obersten Ebene der Hierarchie als auch auf der Ebene der Asset-Klassen-Knoten (Asset Class node) verfügbar ist.",
                    "updated": 1708291499341
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Install Missing Assets",
            "updated": 1624709536566,
            "translations": [
                {
                    "language": "RU",
                    "text": "Установка недостающих ресурсов",
                    "updated": 1638618890263
                },
                {
                    "language": "TR",
                    "text": "Eksik Varlıkları Yüklemek...",
                    "updated": 1644569398564
                },
                {
                    "language": "DE",
                    "text": "Fehlende Assets installieren",
                    "updated": 1708291507441
                }
            ]
        },
        {
            "style": "Note",
            "text": "The Install Missing Assets feature is oriented to people maintaining Project Definition Hierarchies. You may safely skip this explanation if you are a regular user learning about governance.",
            "updated": 1630434796338,
            "translations": [
                {
                    "language": "RU",
                    "text": "Функция Install Missing Assets предназначена для людей, поддерживающих иерархии Project Definition Hierarchies. Вы можете смело пропустить это объяснение, если вы обычный пользователь, изучающий управление.",
                    "updated": 1638618863067
                },
                {
                    "language": "TR",
                    "text": "Eksik Varlıkları Yükle (Install Missing Assets) özelliği, Proje Tanımı Hiyerarşilerini (Project Definition Hierarchies) tanıyıp anlayan kişilere yöneliktir. Yönetişim hakkında bilgi edinen düzenli bir kullanıcıysanız bu açıklamayı güvenle atlayabilirsiniz.",
                    "updated": 1644569719310
                },
                {
                    "language": "DE",
                    "text": "Die Funktion Fehlende Assets installieren richtet sich an Personen, die Projektdefinitionshierarchien (Project Definition Hierarchies) verwalten. Sie können diese Erklärung getrost überspringen, wenn Sie ein regelmäßiger Benutzer sind, der sich mit Governance beschäftigt.",
                    "updated": 1708291535616
                }
            ]
        },
        {
            "style": "Text",
            "text": "Both the Assets node and Asset Class nodes support the Install Missing Assets command available on the menu. Because Asset nodes map digital files shipping with the system, the Install Missing Assets feature is designed to map files on disk into a hierarchical structures of nodes below the node where the Install Missing Assets command is run. In the resulting structure of nodes, Asset Class nodes represent folders, and Asset nodes represent files.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узлы Asset и Asset Class поддерживают команду Install Missing Assets, доступную в меню. Поскольку узлы ресурсов сопоставляют цифровые файлы, доставляемые с системой, функция Install Missing Assets предназначена для сопоставления файлов на диске в иерархические структуры узлов ниже узла, на котором выполняется команда Install Missing Assets. В итоговой структуре узлов узлы Asset Class представляют папки, а узлы Assets представляют файлы.",
                    "updated": 1638619197330
                },
                {
                    "language": "TR",
                    "text": "Hem Varlıklar (Assets) düğümü hem de Varlık Sınıfı (Asset Class) düğümleri, menüde bulunan Eksik Varlıkları Yükle ((Install Missing Assets) ) komutunu destekler. Varlık düğümleri, sistemle birlikte gönderilen dijital dosyaları eşitlediğinden, Install Missing Assets özelliği, diskteki dosyaları, Install Missing Assets  komutunun çalıştırıldığı düğümün altındaki hiyerarşik düğüm yapılarına eşitlemek için tasarlanmıştır. Ortaya çıkan düğüm yapısında Varlık Sınıfı düğümleri klasörleri ve Varlık düğümleri dosyaları temsil eder.",
                    "updated": 1644569863745
                },
                {
                    "language": "DE",
                    "text": "Sowohl der Asset-Knoten als auch der Asset-Klassen-Knoten (Asset Class nodes) unterstützen den im Menü verfügbaren Befehl Fehlende Assets installieren. Da Asset-Knoten (Asset nodes) digitale Dateien abbilden, die mit dem System ausgeliefert werden, ist die Funktion \"Fehlende Assets installieren\" so konzipiert, dass sie die Dateien auf der Festplatte in eine hierarchische Struktur von Knoten unterhalb des Knotens einordnet, in dem der Befehl \"Fehlende Assets installieren\" ausgeführt wird. In der sich daraus ergebenden Knotenstruktur stehen Asset-Klassenknoten (Asset Class nodes) für Ordner und Asset-Knoten (Asset nodes) für Dateien.",
                    "updated": 1708291639743
                }
            ]
        },
        {
            "style": "Text",
            "text": "To run the command, you must configure the path you wish to map.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы выполнить команду, вы должны настроить путь, который хотите отобразить.",
                    "updated": 1638619233070
                },
                {
                    "language": "TR",
                    "text": "Komutu çalıştırmak için, eşitlemek istediğiniz yolu yapılandırmanız gerekir.",
                    "updated": 1644569886841
                },
                {
                    "language": "DE",
                    "text": "Um den Befehl auszuführen, müssen Sie den Pfad konfigurieren, den Sie zuordnen möchten.",
                    "updated": 1708291650479
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Например:",
                    "updated": 1638619248350
                },
                {
                    "language": "TR",
                    "text": "Örneğin:",
                    "updated": 1644569896608
                },
                {
                    "language": "DE",
                    "text": "Zum Beispiel:",
                    "updated": 1708291656535
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n\"folderPath\": \"Root/UI\"\n}",
            "updated": 1624709553788
        },
        {
            "style": "Text",
            "text": "Using the above configuration, the Install Missing Assets command creates a Superalgos Asset Class node (the root of the Superalgos folder), and the UI Asset Class node as an offspring node. Then, the contents of the UI folder are mapped as offspring of the UI Asset Class node.",
            "updated": 1630434897746,
            "translations": [
                {
                    "language": "RU",
                    "text": "Используя приведенную выше конфигурацию, команда Install Missing Assets создает узел Superalgos Asset Class (корневой каталог папки Superalgos) и и узел класса ресурсов пользовательского интерфейса UI Asset Class в качестве дочернего узла. Затем содержимое папки пользовательского интерфейса UI отображается как потомок узла UI Asset Class.",
                    "updated": 1638620164191
                },
                {
                    "language": "TR",
                    "text": "Yukarıdaki yapılandırmayı kullanarak, Eksik Varlıkları Yükle (Install Missing Assets) komutu bir Superalgos Varlık Sınıfı (Asset Class) düğümü (Superalgos klasörünün kökü) ve bir alt düğüm olarak UI Varlık Sınıfı (UI Asset Class) düğümü oluşturur. Ardından, UI klasörünün içeriği, UI Varlık Sınıfı düğümünün ürünü olarak eşitlenir.",
                    "updated": 1644570003781
                },
                {
                    "language": "DE",
                    "text": "Mit der obigen Konfiguration erstellt der Befehl Fehlende Assets installieren einen Superalgos- Asset Class -Knoten (die Wurzel des Superalgos-Ordners) und den UI Asset Class -Knoten als Unterknoten. Anschließend wird der Inhalt des UI -Ordners als Unterknoten des UI Asset Class -Knotens abgebildet.",
                    "updated": 1708291754797
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1638619862406
                },
                {
                    "language": "TR",
                    "text": "Yapılandırma",
                    "updated": 1644570014317
                },
                {
                    "language": "DE",
                    "text": "Konfiguration",
                    "updated": 1708291761358
                }
            ]
        }
    ]
}