{
    "type": "Social Bots",
    "definition": {
        "text": "A Social Bots node is used to define the bots for each messaging application. These messaging bots are used to send announcements and receive commands used to interact with Superalgos.",
        "updated": 1618222853055,
        "translations": [
            {
                "language": "ES",
                "text": "Un nodo Social Bots se utiliza para definir los bots para cada aplicación de mensajería. Estos bots de mensajería se utilizan para enviar anuncios y recibir comandos que se utilizan para interactuar con Superalgos.",
                "updated": 1628035119134
            },
            {
                "language": "RU",
                "text": "Узел Social Bots используется для определения ботов для каждого приложения обмена сообщениями. Эти боты для обмена сообщениями используются для отправки объявлений и получения команд, используемых для взаимодействия с Superalgos.",
                "updated": 1645194393648
            },
            {
                "language": "TR",
                "text": "Her mesajlaşma uygulaması için botları tanımlamak üzere bir Sosyal Botlar düğümü kullanılır. Bu mesajlaşma botları, Superalgos ile etkileşim kurmak için kullanılan duyuruları göndermek ve komutları almak için kullanılır.",
                "updated": 1654396388417
            },
            {
                "language": "DE",
                "text": "Ein Social Bots-Knoten wird verwendet, um die Bots für jede Messaging-Anwendung zu definieren. Diese Messaging-Bots werden verwendet, um Ankündigungen zu senden und Befehle zu empfangen, die zur Interaktion mit Superalgos verwendet werden.",
                "updated": 1705873179043
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Social Bots node contains children nodes for each messaging bot. These messaging bots are used to configure the third party applications used to send announcements and receive incoming commands.",
            "updated": 1618221943424,
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел Social Bots содержит дочерние узлы для каждого бота обмена сообщениями. Эти боты для обмена сообщениями используются для настройки сторонних приложений, используемых для отправки объявлений и приема входящих команд.",
                    "updated": 1645194407103
                },
                {
                    "language": "TR",
                    "text": "Sosyal Botlar düğümü, her bir mesajlaşma botu için alt düğümler içerir. Bu mesajlaşma botları, duyuru göndermek ve gelen komutları almak için kullanılan üçüncü taraf uygulamalarını yapılandırmak için kullanılır.",
                    "updated": 1654396394146,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Der Knoten Soziale Bots enthält untergeordnete Knoten für jeden Messaging-Bot. Diese Messaging-Bots werden verwendet, um die Anwendungen von Drittanbietern zu konfigurieren, die zum Senden von Ankündigungen und Empfangen eingehender Befehle verwendet werden.",
                    "updated": 1705873192841
                }
            ]
        },
        {
            "style": "Note",
            "text": "At present Superalgos only supports Telegram, Discord, and Slack messaging applications.",
            "updated": 1619547181067,
            "translations": [
                {
                    "language": "RU",
                    "text": "В настоящее время Superalgos поддерживает только приложения для обмена сообщениями Telegram, Discord и Slack.",
                    "updated": 1645194418766
                },
                {
                    "language": "TR",
                    "text": "Superalgos şu anda yalnızca Telegram, Discord ve Slack mesajlaşma uygulamalarını desteklemektedir.",
                    "updated": 1654396400192,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Zurzeit unterstützt Superalgos nur die Messaging-Anwendungen Telegram, Discord und Slack.",
                    "updated": 1705873200643
                }
            ]
        }
    ]
}