{
    "topic": "TS LF Trading Bot Errors",
    "pageNumber": 7,
    "type": "TS LF Trading Bot Error - Initial Targets Node Missing",
    "definition": {
        "text": "An Initial Targets node was expected but not found at the node where the error originated.",
        "updated": 1611938198885,
        "translations": [
            {
                "language": "TR",
                "text": "Bir İlk Hedefler ( Initial Targets ) düğümü bekleniyordu ancak hatanın kaynaklandığı düğümde bulunamadı.",
                "updated": 1648067657406
            },
            {
                "language": "DE",
                "text": "An dem Knoten, an dem der Fehler auftrat, wurde ein Knoten Initial Targets erwartet, aber nicht gefunden.",
                "updated": 1700077909337
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Trading Session may run without the Open Stage, Manage Stage, and Close Stage nodes present. But if a stage exists, then the required nodes within must be properly defined.",
            "updated": 1611938347979,
            "translations": [
                {
                    "language": "TR",
                    "text": "Ticaret Oturumu ,(  Trading Session ) Açık Aşama (  Open Stage ) , Aşamayı Yönet  ( Manage Stage ) ve Aşamayı Kapat (  Close Stage )  düğümleri olmadan çalışabilir. Ancak bir aşama varsa, içindeki gerekli düğümler uygun şekilde tanımlanmalıdır.",
                    "updated": 1648068197350
                },
                {
                    "language": "DE",
                    "text": "Die Trading Session kann ohne die Knoten Open Stage, Manage Stage und Close Stage ablaufen. Wenn jedoch eine Phase vorhanden ist, müssen die erforderlichen Knoten darin ordnungsgemäß definiert sein.",
                    "updated": 1700077923370
                }
            ]
        },
        {
            "style": "Error",
            "text": "Initial Targets Node Missing",
            "translations": [
                {
                    "language": "TR",
                    "text": "İlk Hedefler, Düğüm Eksik ( Initial Targets Node Missing )",
                    "updated": 1648068439220
                },
                {
                    "language": "DE",
                    "text": "Ursprünglicher Zielknoten fehlt (Initial Targets Node Missing)",
                    "updated": 1700077932393
                }
            ]
        },
        {
            "style": "Success",
            "text": "Add the missing node and try again. The session will not run free of errors until all required nodes are defined.",
            "updated": 1611938473498,
            "translations": [
                {
                    "language": "TR",
                    "text": "Eksik düğümü ekleyin ve tekrar deneyin. Gerekli tüm düğümler tanımlanıncaya kadar oturum hatasız çalışmayacaktır.",
                    "updated": 1648068289560
                },
                {
                    "language": "DE",
                    "text": "Fügen Sie den fehlenden Knoten hinzu und versuchen Sie es erneut. Die Sitzung läuft erst dann fehlerfrei, wenn alle erforderlichen Knoten definiert sind.",
                    "updated": 1700077950609
                }
            ]
        }
    ]
}