{
    "type": "Plugin File",
    "definition": {
        "text": "A plugin file is the JSON file that constitutes the plugin. In the context of the plugins hierarchy, a plugin is the definition of a hierarchy.",
        "translations": [
            {
                "language": "ES",
                "text": "Un pluginfile es el archivo JSON que constituye el complemento. En el contexto de la jerarquía de complementos, un complemento es la definición de una jerarquía.",
                "updated": 1628043670168
            },
            {
                "language": "RU",
                "text": "Plugin File - это файл JSON, составляющий плагин. В контексте иерархии плагинов, плагин - это определение иерархии.",
                "updated": 1645164981627
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Plugin files distributed with the system are stored in the corresponding folders on the following path:",
            "updated": 1609869641569,
            "translations": [
                {
                    "language": "RU",
                    "text": "Файлы плагинов, распространяемые вместе с системой, хранятся в соответствующих папках по следующему пути:",
                    "updated": 1645165011078
                }
            ]
        },
        {
            "style": "Json",
            "text": "\\Projects\\[ProjectName]\\Plugins\\",
            "updated": 1609869650031
        },
        {
            "style": "Text",
            "text": "To create a plugin and make it available to the system you need to:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы создать плагин и сделать его доступным для системы, необходимо:",
                    "updated": 1645165021746
                }
            ]
        },
        {
            "style": "List",
            "text": "Take a backup of the hierarchy.",
            "updated": 1609869665918,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сделайте резервную копию иерархии.",
                    "updated": 1645165028001
                }
            ]
        },
        {
            "style": "List",
            "text": "Place it in the proper folder of the path.",
            "updated": 1609869675048,
            "translations": [
                {
                    "language": "RU",
                    "text": "Поместите его в соответствующую папку пути.",
                    "updated": 1645165051561
                }
            ]
        },
        {
            "style": "Important",
            "text": "Hierarchies included in the workspace as plugins are not saved at the workspace level. As such, changes made in those hierarchies do not persist. If you wish to modify a plugin and keep working with the modified version in the future, you must either clone or backup the plugin and work on the resulting copy instead.",
            "updated": 1609869687063,
            "translations": [
                {
                    "language": "RU",
                    "text": "Иерархии, включенные в рабочее пространство в качестве подключаемых модулей, не сохраняются на уровне рабочего пространства. Поэтому изменения, внесенные в эти иерархии, не сохраняются. Если вы хотите изменить плагин и продолжить работу с измененной версией в будущем, вы должны либо клонировать, либо создать резервную копию плагина и работать с полученной копией.",
                    "updated": 1645165196927
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        }
    ]
}