{
    "topic": "The Art of Documenting",
    "pageNumber": "5",
    "type": "Planning Topics and Books",
    "definition": {
        "text": "Now that you have iterated on Definition Pages, it's time to consider how you will present all the information to the reader.",
        "updated": 1643049278880,
        "translations": [
            {
                "language": "TR",
                "text": "Özet: Artık Tanım Sayfalarında ( Definition Pages ) tekrar ettiğinize göre, tüm bilgileri okuyucuya nasıl sunacağınızı düşünmenin zamanı geldi.",
                "updated": 1650446770689
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "At the highest level, the Docs are organized in books.",
            "updated": 1643049291781,
            "translations": [
                {
                    "language": "TR",
                    "text": "En üst düzeyde, Dokümanlar kitaplarda düzenlenir.",
                    "updated": 1650446846816
                }
            ]
        },
        {
            "style": "Text",
            "text": "A book is a collection of topics, each representing a chapter in the book. The purpose of a book is to offer a compendium of information optimized for linear reading, from start to end, usually covering an entire Project.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Kitap, her biri kitaptaki bir bölümü temsil eden konuların bir koleksiyonudur. Bir kitabın amacı, genellikle tüm bir Projeyi kapsayan, baştan sona doğrusal okuma için optimize edilmiş bir bilgi özeti sunmaktır.",
                    "updated": 1650446854173
                }
            ]
        },
        {
            "style": "Text",
            "text": "A topic is a collection of pages that explore a certain feature or a particular dimension of a Project. When arranged in a book, each topic makes up a chapter in the book.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Konu, bir Projenin belirli bir özelliğini veya belirli bir boyutunu araştıran bir sayfa koleksiyonudur. Bir kitapta düzenlendiğinde, her konu kitapta bir bölüm oluşturur.",
                    "updated": 1650446861750
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Definition Pages you wrote are building blocks you will use to feed content on new pages you will create. Those pages will be topic pages, that is, the pages that make up a topic.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Yazdığınız Tanımlama Sayfaları oluşturacağınız yeni sayfalarda içerik beslemek için kullanacağınız yapı taşlarıdır. Bu sayfalar konu sayfaları, yani bir konuyu oluşturan sayfalar olacaktır.",
                    "updated": 1650446876628
                }
            ]
        },
        {
            "style": "Callout",
            "text": "With the above in mind, it's time to take a deep breath, sit, and think! The task at hand is a creative task for which there is no specific directive or formula to tell you how to approach it. You need to think what is the best way to explain the whole feature or project to someone that knows absolutely nothing about it!",
            "translations": [
                {
                    "language": "TR",
                    "text": "Yukarıdakileri akılda tutarak, derin bir nefes almanın, oturmanın ve düşünmenin zamanı geldi! Eldeki görev, size nasıl yaklaşacağınızı söyleyen belirli bir yönerge veya formül bulunmayan yaratıcı bir görevdir. Tüm özelliği veya projeyi bu konuda kesinlikle hiçbir şey bilmeyen birine açıklamanın en iyi yolunun ne olduğunu düşünmeniz gerekir!",
                    "updated": 1650446885789
                }
            ]
        },
        {
            "style": "Title",
            "text": "Does the Content Fit an Existing Book?",
            "translations": [
                {
                    "language": "TR",
                    "text": "İçerik Var Olan Bir Kitaba Uygun mu?",
                    "updated": 1650446918632
                }
            ]
        },
        {
            "style": "Text",
            "text": "The main book in the Docs is the User Manual. This book covers all the aspects of the Superalgos Platform that involve the individual use of the system for individual traders.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Dokümanlar'daki ana kitap Kullanıcı Kılavuzu'dur ( User Manual ). Bu kitap, sistemin bireysel tüccarlar için bireysel kullanımını içeren Superalgos Platformunun tüm yönlerini kapsar.",
                    "updated": 1650446986175
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the feature or project you're documenting involves functionality directly related to trading automation using the Superalgos Platform, chances are that the content should end up enriching the User Manual book.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Belgelediğiniz özellik veya proje, Superalgos Platformu kullanılarak doğrudan ticaret otomasyonu ile ilgili işlevsellik içeriyorsa, içeriğin Kullanıcı Kılavuzu kitabını zenginleştirme olasılığı yüksektir.",
                    "updated": 1650446999774
                }
            ]
        },
        {
            "style": "Text",
            "text": "If, on the other hand, the functionality involves other uses of the Superalgos Platform, like Governance, for instance, or is about collaborative uses of the platform, then chances are the content belongs to other existing books or a new book altogether.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Öte yandan, işlevsellik, örneğin Yönetişim gibi Superalgos Platformunun diğer kullanımlarını içeriyorsa veya platformun ortak kullanımlarıyla ilgiliyse, içeriğin mevcut diğer kitaplara veya tamamen yeni bir kitaba ait olma olasılığı yüksektir.",
                    "updated": 1650447007878
                }
            ]
        },
        {
            "style": "Important",
            "text": "All in all, this is the kind of decision that you shouldn't make on your own. Instead, you should get other contributors involved, particularly Community members with a track record writing documentation!",
            "translations": [
                {
                    "language": "TR",
                    "text": "Önemli: Sonuç olarak, bu kendi başınıza vermemeniz gereken bir karardır. Bunun yerine, diğer katkıda bulunanları, özellikle de geçmişe dönük yazma belgelerine sahip Topluluk üyelerini dahil etmelisiniz!",
                    "updated": 1650447024742
                }
            ]
        },
        {
            "style": "Title",
            "text": "General Guidance",
            "translations": [
                {
                    "language": "TR",
                    "text": "Genel Kılavuz",
                    "updated": 1650447066043
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you're writing documentation for a whole new project, chances are you will write at least one topic, and likely more. How many topics you need depends on the depth and complexity of the project.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Tamamen yeni bir proje için belgeler yazıyorsanız, en az bir konu ve muhtemelen daha fazlasını yazacaksınız. İhtiyacınız olan konu sayısı, projenin derinliğine ve karmaşıklığına bağlıdır.",
                    "updated": 1650447077465
                }
            ]
        },
        {
            "style": "Text",
            "text": "If a project is large and deep enough, consider writing an entire introduction topic. The topic will likely have several pages offering an overview of the most important aspects of the project. This is where you will explain what the project is about, the kind of functionality it brings, and what users may achieve with it. It may also offer an overview of how the project interacts with the rest of the infrastructure. In any case, this introduction should feature the birds'-eye view and not go into operational details.",
            "updated": 1643049460434,
            "translations": [
                {
                    "language": "TR",
                    "text": "Bir proje yeterince büyük ve derinse, tam bir giriş konusu yazmayı düşünün. Konunun muhtemelen projenin en önemli yönlerine genel bir bakış sunan birkaç sayfası olacaktır. Bu, projenin ne hakkında olduğunu, getirdiği işlevsellik türünü ve kullanıcıların onunla neler başarabileceğini açıklayacağınız yerdir. Ayrıca, projenin altyapının geri kalanıyla nasıl etkileşime girdiğine dair bir genel bakış sunabilir. Her halükarda, bu tanıtım kuşbakışı görünümü içermeli ve operasyonel ayrıntılara girmemelidir.",
                    "updated": 1650447086574
                }
            ]
        },
        {
            "style": "Success",
            "text": "You may look into the introduction chapter of the User Manual and Governance books for reference.",
            "updated": 1643049508392,
            "translations": [
                {
                    "language": "TR",
                    "text": "İpucu: Referans için Kullanım Kılavuzu ve Yönetim kitaplarının giriş bölümüne bakabilirsiniz.",
                    "updated": 1650447113827
                }
            ]
        },
        {
            "style": "Text",
            "text": "Let's briefly explore the layout of the introduction chapter of the User Manual. These are a few ideas worth mentioning:",
            "updated": 1643049515630,
            "translations": [
                {
                    "language": "TR",
                    "text": "Kullanıcı Kılavuzunun ( User Manual ) giriş bölümünün düzenini kısaca inceleyelim. Bunlar, bahsetmeye değer birkaç fikir:",
                    "updated": 1650447148798
                }
            ]
        },
        {
            "style": "List",
            "text": "The first page describes the few theoretical concepts and the main elements that make up the experience of engaging with the Superalgos Platform.",
            "translations": [
                {
                    "language": "TR",
                    "text": "İlk sayfa, birkaç teorik kavramı ve Superalgos Platformu ile etkileşim kurma deneyimini oluşturan ana unsurları açıklar.",
                    "updated": 1650447180926
                }
            ]
        },
        {
            "style": "Note",
            "text": "It's a first glimpse into what users are getting into, mentioning a few specific notions like hierarchies, nodes, spaces, and workspaces.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Not: Hiyerarşiler, düğümler, boşluklar ve çalışma alanları gibi birkaç özel kavramdan bahsederek, kullanıcıların neyle uğraştığına ilk bakış.",
                    "updated": 1650447198830
                }
            ]
        },
        {
            "style": "List",
            "text": "The second page offers an overview of the concept of bots and clarifies some fundamental terminology.",
            "translations": [
                {
                    "language": "TR",
                    "text": "İkinci sayfa, bot kavramına genel bir bakış sunar ve bazı temel terminolojiyi netleştirir.",
                    "updated": 1650447221237
                }
            ]
        },
        {
            "style": "Note",
            "text": "The page goes a little bit deeper touching on other fundamental concepts, but still from the bird's-eye perspective.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Not: Sayfa, diğer temel kavramlara değinerek biraz daha derine iniyor, ancak yine de kuşbakışı perspektiften.",
                    "updated": 1650447263572
                }
            ]
        },
        {
            "style": "List",
            "text": "The rest of the pages explore the rest of the fundamental concepts behind the overall design of the platform, this time offering a certain level of detail that help the user bring things down to earth.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Sayfaların geri kalanı, platformun genel tasarımının ardındaki temel kavramların geri kalanını keşfediyor ve bu sefer, kullanıcının işleri dünyaya getirmesine yardımcı olan belirli bir ayrıntı düzeyi sunuyor.",
                    "updated": 1650447287177
                }
            ]
        },
        {
            "style": "Note",
            "text": "These pages complete the overview of other high-level concepts that are particular to the workings of the Superalgos Platform.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Not: Bu sayfalar, Superalgos Platformunun işleyişine özel olan diğer üst düzey kavramların genel görünümünü tamamlar.",
                    "updated": 1650447308294
                }
            ]
        },
        {
            "style": "Text",
            "text": "After this broad introduction, the user is now ready to dive into a sequence of chapters offering the deepest level of detail on each of the topics covered.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Bu geniş girişten sonra, kullanıcı artık kapsanan konuların her biri hakkında en derin düzeyde ayrıntı sunan bir dizi bölüme dalmaya hazırdır.",
                    "updated": 1650447499295
                }
            ]
        },
        {
            "style": "Text",
            "text": "Each subsequent chapter in the book covers either a specific hierarchy or a specific concept. Because all of these concepts and hierarchies interact with each other in complex manners, there is no absolute best way to order chapters. However, we try to arrange them in a logical order, with the following question in mind: ",
            "translations": [
                {
                    "language": "TR",
                    "text": "Kitaptaki her bir sonraki bölüm ya belirli bir hiyerarşiyi ya da belirli bir kavramı kapsar. Tüm bu kavramlar ve hiyerarşiler birbirleriyle karmaşık şekillerde etkileşime girdiğinden, bölümleri sıralamanın mutlak en iyi yolu yoktur. Ancak, aşağıdaki soruyu akılda tutarak bunları mantıklı bir sıraya koymaya çalışıyoruz:",
                    "updated": 1650447532685
                }
            ]
        },
        {
            "style": "Callout",
            "text": "What is the best way to explain the whole thing to someone that knows nothing about it?",
            "translations": [
                {
                    "language": "TR",
                    "text": "Hakkında hiçbir şey bilmeyen birine her şeyi açıklamanın en iyi yolu nedir?",
                    "updated": 1650447541122
                }
            ]
        }
    ]
}