{
    "topic": "The Art of Documenting",
    "pageNumber": "1",
    "type": "General Notions on Documenting",
    "definition": {
        "text": "The main challenge in producing collaborative documentation is in maintaining quality and consistency. Let's start with a few general guidelines that will help us set the tone for what's to come.",
        "updated": 1642956159522,
        "translations": [
            {
                "language": "RU",
                "text": "Основная сложность при создании совместной документации заключается в поддержании качества и последовательности. Давайте начнем с нескольких общих рекомендаций, которые помогут нам задать тон всему предстоящему.",
                "updated": 1670678191658
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->The Quest for Quality"
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Proper English"
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Use Precise Language"
        },
        {
            "style": "Title",
            "text": "Beauty and Readability",
            "updated": 1642962839272,
            "translations": [
                {
                    "language": "RU",
                    "text": "Красота и читабельность",
                    "updated": 1670678229282
                }
            ]
        },
        {
            "style": "Text",
            "text": "The ultimate goal of the Docs is to provide the tools that enable everyone to become power users as soon as possible. Beyond clear and accessible content, the Docs must also be easy to read.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конечная цель \"Документов\" - предоставить инструменты, которые позволят каждому стать опытным пользователем как можно скорее. Помимо ясного и доступного содержания, документы должны быть удобными для чтения.",
                    "updated": 1670678302245
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Long pages of plain text are quite painful to read… and are ugly! Instead, alternating different kinds of paragraph styles help make pages nicer and easier to read. Use the callout style for paragraphs that offer key insights or revelations that make up the core of the topic in discussion.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Длинные страницы обычного текста довольно мучительны для чтения... и некрасивы! Вместо этого чередование различных стилей абзацев помогает сделать страницы более приятными и легкими для чтения. Используйте стиль выделения для абзацев, которые предлагают ключевые идеи или раскрывают суть обсуждаемой темы.",
                    "updated": 1670678341991
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Alternating Colors",
            "updated": 1642962935227
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Title Case"
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Documenting Snippets->Tooltips"
        }
    ]
}