{
    "type": "Metrics",
    "definition": {
        "text": "A number that you care about. May or may not be directly optimized in a machine-learning system. A metric that your system tries to optimize is called an objective.",
        "updated": 1615895860780,
        "translations": [
            {
                "language": "RU",
                "text": "Число, которое вам важно. Может быть или не быть непосредственно оптимизировано в системе машинного обучения. Метрика, которую ваша система пытается оптимизировать, называется целью.",
                "updated": 1645248978655
            },
            {
                "language": "TR",
                "text": "Önemsediğiniz bir sayı. Bir makine öğrenimi sisteminde doğrudan optimize edilebilir veya edilmeyebilir. Sisteminizin optimize etmeye çalıştığı bir metriğe hedef denir.",
                "updated": 1654397331971
            },
            {
                "language": "DE",
                "text": "Eine Zahl, die Ihnen wichtig ist. Sie kann, muss aber nicht direkt in einem maschinellen Lernsystem optimiert werden. Eine Metrik, die Ihr System zu optimieren versucht, wird als Ziel bezeichnet.",
                "updated": 1707240530770
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645248983760
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397339564,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1707240538565
                }
            ]
        }
    ]
}