{
    "type": "Tutorial",
    "definition": {
        "text": "The tutorial hierarchy features a free arrangement of Tutorial Topic and Tutorial Step nodes that make up a tutorial. Each node in the hierarchy, including the parent tutorial node, represents an HTML page that may be overlaid on top of both the Design Space and the Charting Space.",
        "updated": 1617610222444,
        "translations": [
            {
                "language": "ES",
                "text": "La jerarquía del tutorial presenta una disposición libre de los nodos Tutorial Topic y Tutorial Step que componen un tutorial. Cada nodo de la jerarquía, incluido el nodo del tutorial principal, representa una página HTML que puede superponerse en la parte superior de ambos Design Space y el Charting Space.",
                "updated": 1627245866146,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Die Tutorial-Hierarchie besteht aus einer freien Anordnung von Tutorial Topic (Themen) und Tutorial Step nodes (Schritten), die ein Tutorial ausmachen. Jede node in der Hierarchie, einschließlich des übergeordneten Tutorial-nodes, stellt eine HTML-Seite dar, die sowohl über dem Design Space als auch dem Charting Space eingeblendet werden kann. Übersetzt ins deutsche von gitforkgit.",
                "updated": 1633975790458,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Иерархия Tutorial содержит свободное расположение Tutorial Topic и узлов Tutorial Step, которые вместе составляют это учебное пособие. Каждый узел в иерархии, включая родительский узел пособия, представляет собой HTML-страницу, которая может быть наложена поверх Design Space и Charting Space.",
                "updated": 1638340460215
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Nodes in the hierarchy may be arranged freely, meaning that there may be as many tutorial topics and tutorial steps as desired. Tutorial topics may contain tutorial steps but also other tutorial topics. This allows nesting topics to be used as subtopics.",
            "updated": 1617649482153,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Nodes in der Hierarchie können frei angeordnet werden, das heißt es können beliebig viele Tutorial-Themen (topic) und Tutorial-Steps vorhanden sein. Tutorial Themen können Tutorial Schritte aber auch andere Tutorial Themen enthalten. Dies erlaubt es verschachtelte Themen als Unterthemen verwendet werden.",
                    "updated": 1633975991952,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Узлы в иерархии могут быть расположены произвольно, что означает, что может быть столько обучающих тем и обучающих шагов, сколько необходимо. Темы учебного пособия могут содержать этапы обучения, а также другие разделы учебного пособия. Это позволяет использовать вложенные темы в качестве подтем.",
                    "updated": 1638340558172
                }
            ]
        },
        {
            "style": "Text",
            "text": "The system – as usual – evaluates the hierarchy in a clockwise direction starting from the node to the right of the parent Tutorial node, and goes to the deepest node of each branch before moving to the next one.",
            "updated": 1617649522223,
            "translations": [
                {
                    "language": "DE",
                    "text": "Das System wertet die Hierarchie - wie üblich - im Uhrzeigersinn aus, beginnend mit dem Knoten rechts vom übergeordneten Tutorial-Knoten, zum tiefsten Knoten jedes Zweigs geht, bevor es zum nächsten geht.",
                    "updated": 1633976627129,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Система, как обычно, оценивает иерархию по часовой стрелке, начиная с узла справа от родительского узла Tutorial, и переходит к самому глубокому узлу каждой ветви перед переходом к следующему.",
                    "updated": 1638340581444
                }
            ]
        },
        {
            "style": "Callout",
            "text": "In general terms, all types of nodes behave similarly in the sense that each node, independently of the precise type, represents a tutorial step in and of itself. That is, all nodes including the top-level Tutorial node, the Tutorial Topic node, and the Tutorial Step node may display a content page as a step in the tutorial. Subtle differences shall be pointed where appropriate.",
            "updated": 1617622995279,
            "translations": [
                {
                    "language": "DE",
                    "text": "Im Allgemeinen verhalten sich alle nodes ähnlich in dem Sinne, dass jede node, unabhängig vom genauen Typ, für sich genommen einen Lernschritt darstellt. Das heißt, alle nodes, einschließlich der obersten Tutorial-node, der Tutorial Topic node und der Tutorial Step node können eine Inhaltsseite als Schritt im Tutorial anzeigen. Feinere Unterschiede sind gegebenenfalls hervorzuheben.",
                    "updated": 1633976586338,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "В общих чертах, все типы узлов ведут себя одинаково в том смысле, что каждый узел, независимо от конкретного типа, представляет собой учебный шаг сам по себе. То есть все узлы, включая узел верхнего уровня Tutorial, узел Tutorial Topic и узел Tutorial Step, могут отображать страницу содержимого в качестве шага в руководстве. При необходимости следует указать на незначительные различия.",
                    "updated": 1638340613514
                }
            ]
        },
        {
            "style": "Note",
            "text": "The key similarity among all types of nodes in the hierarchy is that all of them may draw content from the tutorial's collection of pages in the Docs. That is, each node in the hierarchy points to a Docs Page, and it is that page in the Docs that features the content displayed for the given step. The pointer is specified in the configuration of each node (see the docs property).",
            "updated": 1617623101039,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die wichtigste Gemeinsamkeit aller Knotentypen in der Hierarchie ist, dass sie alle Inhalte aus der Sammlung der Dokumentseiten des Tutorials beziehen können. Das heißt, jeder Knoten in der Hierarchie zeigt auf eine Docs Page (Dokumentationsseite), und es ist diese Seite in den Dokumenten, die den Inhalt für den gegebenen Schritt anzeigt. Der Zeiger wird in der Konfiguration jedes Knotens angegeben (siehe die Eigenschaft docs).",
                    "updated": 1633976778899,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Ключевое сходство между всеми типами узлов в иерархии заключается в том, что все они могут рисовать контент из коллекции страниц в Документах. То есть каждый узел в иерархии указывает на страницу Docs, и именно эта страница Docs Page содержит контент, отображаемый для данного шага. Указатель указывается в конфигурации каждого узла (см. Свойство docs).",
                    "updated": 1638340776119
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Tutorial Configuration",
            "updated": 1609704877058,
            "translations": [
                {
                    "language": "DE",
                    "text": "Tutorial Konfiguration",
                    "updated": 1633976794872,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Конфигурация Tutorial",
                    "updated": 1638340822415
                }
            ]
        },
        {
            "style": "Text",
            "text": "The configuration of each node in the tutorial hierarchy determines the content and behavior of each step. All types of nodes share the same basic configuration. However, Tutorial Step nodes have extra properties, described on the Tutorial Step node page.",
            "updated": 1617623609988,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Konfiguration jedes Knotens in der Tutorial-Hierarchie bestimmt den Inhalt und das Verhalten der einzelnen Schritte. Alle node-typen haben die gleiche Grundkonfiguration. Tutorial Step nodes haben jedoch zusätzliche Eigenschaften, die auf der Seite \" Tutorial Step nodes \" beschrieben werden.",
                    "updated": 1633977045116,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Конфигурация каждого узла в иерархии учебника определяет содержание и поведение каждого шага. Все типы узлов имеют одинаковую базовую конфигурацию. Однако узлы Tutorial Step имеют дополнительные свойства, описанные на странице узла Tutorial Step.",
                    "updated": 1638340869518
                }
            ]
        },
        {
            "style": "Success",
            "text": "The configuration properties discussed on this page apply to all types of nodes in the hierarchy.",
            "updated": 1617623631110,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die auf dieser Seite beschriebenen Konfigurationseigenschaften gelten für alle Arten von Nodes in der Hierarchie.",
                    "updated": 1633977077545,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Свойства конфигурации, обсуждаемые на этой странице, применяются ко всем типам узлов в иерархии.",
                    "updated": 1638340885116
                }
            ]
        },
        {
            "style": "Text",
            "text": "The layout of the HTML page follows the layout of the associated page in the Docs, although displayed within the confines of the tutorial window.",
            "updated": 1617610416865,
            "translations": [
                {
                    "language": "DE",
                    "text": "Das Layout der HTML-Seite folgt dem Layout der zugehörigen Seite in den Docs, wird aber innerhalb der Grenzen des Tutorial-Fensters angezeigt.",
                    "updated": 1633977110132,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Макет HTML-страницы соответствует макету связанной страницы в Docs, хотя отображается в пределах окна учебника.",
                    "updated": 1638340917482
                }
            ]
        },
        {
            "style": "Callout",
            "text": "In other words, you affect the layout of the particular step by writing content and applying styles to individual paragraphs in the associated Docs Page.",
            "updated": 1617610435932,
            "translations": [
                {
                    "language": "DE",
                    "text": "Mit anderen Worten beeinflussen Sie das Layout des jeweiligen Schritts, indem Sie Inhalte schreiben und Stile auf einzelne Absätze in der zugehörigen Docs-Page anwenden.",
                    "updated": 1633977352460,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Другими словами, вы влияете на макет конкретного шага, записывая содержимое и применяя стили к отдельным абзацам на связанной странице Docs Page.",
                    "updated": 1638340975740
                }
            ]
        },
        {
            "style": "Note",
            "text": "The HTML page features a limited space and does not support scrolling. If too much information is defined in the associated Docs Page, the resulting content overflows the available space in the tutorial window. There is no system-side control to deal with such overflows, so it's up to you to spread information across multiple steps and keep each page within its limits.",
            "updated": 1613839536547,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die HTML / Tutorial -Seite verfügt über einen begrenzten Platz und unterstützt kein Scrollen. Wenn zu viele Informationen in der zugehörigen Docs Page definiert werden, übersteigt der resultierende Inhalt den verfügbaren Platz im Tutorial-Fenster. Es gibt keine systemseitige Kontrolle, um mit solchen Text-Überläufen (in den Tutorial fenstern) umzugehen, so dass es an Ihnen liegt, die Informationen auf mehrere Schritte zu verteilen und jede Seite innerhalb ihrer Grenzen zu halten.",
                    "updated": 1633977528479,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "HTML-страница имеет ограниченное пространство и не поддерживает прокрутку. Если на связанной странице Docs Page определено слишком много информации, результирующий контент будет переполнять доступное пространство в окне руководства. Нет никакого системного контроля, чтобы справиться с такими переполнениями, так что вам решать, распределять информацию по нескольким шагам и держать каждую страницу в своих пределах.",
                    "updated": 1638341066695
                }
            ]
        },
        {
            "style": "Title",
            "text": "Configuration Properties",
            "updated": 1617635291377,
            "translations": [
                {
                    "language": "DE",
                    "text": "Eigenschaften der Konfiguration",
                    "updated": 1633977545673,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Свойства конфигурации",
                    "updated": 1638341097060
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "icon",
            "updated": 1617635214170
        },
        {
            "style": "Text",
            "text": "The property icon requires two definitions:",
            "updated": 1617635366207,
            "translations": [
                {
                    "language": "DE",
                    "text": "Das Eigenschaftssymbol benötigt zwei Definitionen:",
                    "updated": 1633977572877,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство \"icon\" требует двух определений:",
                    "updated": 1638341508736
                }
            ]
        },
        {
            "style": "List",
            "text": "The \"name\" of the icon without the extension; ",
            "translations": [
                {
                    "language": "DE",
                    "text": "Der \"name\" des Symbols ohne die Erweiterung;",
                    "updated": 1633977609627,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Название \"name\" значка без расширения;",
                    "updated": 1638341578178
                }
            ]
        },
        {
            "style": "List",
            "text": "The \"project\" the icon belongs to.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Das \"project\", zu dem das Symbol gehört.",
                    "updated": 1633977635502,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Название пректа \"Project\", которому принадлежит значок.",
                    "updated": 1638341642470
                }
            ]
        },
        {
            "style": "Text",
            "text": "For your reference, icons are stored in the following path:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Zu Ihrer Information: Die Icons (Symbole) werden unter folgendem Pfad gespeichert:",
                    "updated": 1633977674577,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Для справки, значки хранятся по следующему пути:",
                    "updated": 1638341659063
                }
            ]
        },
        {
            "style": "Json",
            "text": "\\Projects\\[Project-Name]\\Icons",
            "updated": 1617610685030
        },
        {
            "style": "Success",
            "text": "Use the existing collection of icons to illustrate each step of the tutorial. These illustrations help make for more compelling communication.",
            "updated": 1617623866873,
            "translations": [
                {
                    "language": "DE",
                    "text": "Verwenden Sie die vorhandene Sammlung von Icons (Symbolen), um jeden Schritt des Tutorials zu illustrieren. Diese Illustrationen tragen sehr viel zu einer überzeugenderen Kommunikation bei.",
                    "updated": 1633977745001,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Используйте существующую коллекцию значков, чтобы проиллюстрировать каждый шаг учебного пособия. Эти иллюстрации помогают сделать общение более убедительным.",
                    "updated": 1638341684555
                }
            ]
        },
        {
            "style": "Text",
            "text": "When the configuration exists, the icon is placed within a table, side by side with the text block that makes up the definition field of the associated Docs Page. When there is no icon, the definition occupies the full width of the page.",
            "updated": 1617635415677,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn die Konfiguration vorhanden ist, wird das Symbol in einer Tabelle neben dem Textblock platziert, der das Definitionsfeld der zugehörigen Docs Page bildet. Wenn kein Symbol vorhanden ist, nimmt die Definition die gesamte Breite der Seite ein.",
                    "updated": 1633977797138,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Когда конфигурация существует, значок помещается в таблицу рядом с текстовым блоком, который составляет поле определения связанной страницы Docs Page. Когда нет значка, определение занимает всю ширину страницы.",
                    "updated": 1638341729479
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"icon\": {\n        \"name\": \"balance\",\n        \"project\": \"Foundations\"\n    }",
            "updated": 1613840669552
        },
        {
            "style": "Text",
            "text": "The above configuration places the balance.png icon of the Superalgos project in the table of the corresponding Docs page (see the docs property below).",
            "updated": 1617635461827,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die obige Konfiguration platziert das Symbol balance.png des Superalgos-Projekts in der Tabelle der entsprechenden Docs-Seite (siehe die docs Eigenschaft unten).",
                    "updated": 1633977851249,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Приведенная выше конфигурация помещает значок balance.png проекта Superalgos в таблицу на соответствующей странице Docs (см. Свойство docs ниже).",
                    "updated": 1638341767468
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "position",
            "updated": 1617635475423
        },
        {
            "style": "Text",
            "text": "The position property determines the position of the floating HTML. There are three alternatives... \"Left\", \"Right\", or leave the field empty to position the page on the center of the screen.",
            "updated": 1617635484212,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Eigenschaft \"position\" bestimmt die Position des fließenden HTML-Dokuments (Tutorial-Fensters). Es gibt drei Alternativen... \"Links\", \"Rechts\", oder lassen Sie das Feld leer, um die Seite in der Mitte des Bildschirms zu positionieren.",
                    "updated": 1633977968939,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство \"position\" определяет положение плавающего HTML. Есть три варианта: «Left», «Right» или оставьте поле пустым, чтобы разместить страницу в центре экрана.",
                    "updated": 1638341861917
                }
            ]
        },
        {
            "style": "Json",
            "text": "    \"position\": \"Left\"",
            "updated": 1613840787300
        },
        {
            "style": "Text",
            "text": "The configuration above places the tutorial step on the left-hand side of the screen.",
            "updated": 1617635642707,
            "translations": [
                {
                    "language": "DE",
                    "text": "Bei der obigen Konfiguration befindet sich das Tutorial-Fenster auf der linken Seite des Bildschirms.",
                    "updated": 1633978012441,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Приведенная выше конфигурация помещает шаг обучения в левой части экрана.",
                    "updated": 1638341886907
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "slider",
            "updated": 1617635668767
        },
        {
            "style": "Text",
            "text": "The slider property determines the position of the horizontal slider. There are three alternatives... \"toTop\", \"toBottom\", \"toMiddle\".",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Eigenschaft slider bestimmt die Position des horizontalen Schiebereglers. Es gibt drei Alternativen... \"toTop\", \"toBottom\", \"toMiddle\".",
                    "updated": 1633978051324,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство \"slider\" определяет положение горизонтального ползунка. Есть три альтернативы: toTop, toBottom, toMiddle.",
                    "updated": 1638342086859
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"slider\": \"toBottom\" // Opens the Charting Space",
            "updated": 1617624084984,
            "translations": [
                {
                    "language": "RU",
                    "text": "\"slider\": \"toBottom\" // Открывает область графиков",
                    "updated": 1638342112119
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"slider\": \"toTop\" // Opens the Design Space",
            "updated": 1617624125599
        },
        {
            "style": "Json",
            "text": "\"slider\": \"toMiddle\" // Enables using the Charting Space and the Design Space concurrently",
            "updated": 1617624154127
        },
        {
            "style": "Subtitle",
            "text": "pressButton",
            "updated": 1617635952027
        },
        {
            "style": "Text",
            "text": "The pressButton property allows you to forcefully \"Stop\" the tutorial, go to the \"Next\" step, go to the \"Previous\" step, or \"Skip\" a step. When a step is loaded and one of these options is configured in this property, the action is applied immediately.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Mit der Eigenschaft pressButton können Sie das Tutorial zwangsweise \"anhalten\", zum \"nächsten\" Schritt gehen, zum \"vorherigen\" Schritt gehen oder einen Schritt \"überspringen\". Wenn ein Schritt geladen wird und eine dieser Optionen in dieser Eigenschaft konfiguriert ist, wird die Aktion sofort ausgeführt.",
                    "updated": 1633978127988,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство pressButton позволяет принудительно остановить учебник «Stop», перейти к следующему шагу «Next», перейти к предыдущему шагу «Previous» или пропустить шаг «Skip». Когда шаг загружен и в этом свойстве настроен один из этих параметров, действие применяется немедленно.",
                    "updated": 1638342503229
                }
            ]
        },
        {
            "style": "Note",
            "text": "A common use of this feature is to skip a step, for instance, a Tutorial Topic node that is used solely for organizational purposes within the hierarchy, thus features no content. Leave the field empty for the step to play in the usual fashion.",
            "updated": 1617649582774,
            "translations": [
                {
                    "language": "DE",
                    "text": "Eine häufige Verwendung dieser Funktion ist das Überspringen eines Schrittes, z.B. einer Tutorial-topic-node, die ausschließlich für organisatorische Zwecke innerhalb der Hierarchie verwendet wird und daher keinen Inhalt hat. Lassen Sie das Feld leer, damit der Schritt auf die übliche Weise abgespielt wird.",
                    "updated": 1633978359504,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Обычно эта функция используется для пропуска шага, например, узла Tutorial Topic, который используется исключительно для организационных целей в иерархии и поэтому не содержит содержимого. Оставьте поле пустым, чтобы шаг играл обычным образом.",
                    "updated": 1638342559154
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"pressButton\": \"Next\"",
            "updated": 1613841332185
        },
        {
            "style": "Text",
            "text": "The above configuration takes the user to the next step in the tutorial without displaying any content for the node in question.",
            "updated": 1617648136262,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die obige Konfiguration führt den Benutzer zum nächsten Schritt des Tutorials, ohne dass der Inhalt der betreffenden node angezeigt wird.",
                    "updated": 1633978461463,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Приведенная выше конфигурация переводит пользователя на следующий шаг в руководстве без отображения какого-либо содержимого для рассматриваемого узла.",
                    "updated": 1638342577730
                }
            ]
        },
        {
            "style": "Success",
            "text": "You may use Tutorial Topic nodes for organizational purposes only, for instance, to arrange the hierarchy in a way that it's easy to read and maintain. Topics with too many steps are harder to deal with later on. In other words, you may use a Tutorial Topic node to group several steps, even if you don't intend the Tutorial Topic node to display any content. In such cases, you may use this property to skip the step that is not intended for content display.",
            "updated": 1617649616576,
            "translations": [
                {
                    "language": "DE",
                    "text": "Sie können Tutorial Topic nodes nur zu organisatorischen Zwecken verwenden, z.B. um die Hierarchie so anzuordnen, dass sie einfach zu lesen und zu pflegen ist. Themen mit zu vielen Schritten sind später schwieriger zu handhaben. Mit anderen Worten: Sie können einen Tutorial Topic node verwenden, um mehrere Schritte zu gruppieren, auch wenn Sie nicht beabsichtigen, dass die Tutorial Topic node irgendeinen Inhalt anzeigt. In solchen Fällen können Sie diese Eigenschaft verwenden, um den Schritt zu überspringen, der nicht für die Anzeige von Inhalten vorgesehen ist.",
                    "updated": 1633979074457,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Вы можете использовать узлы Tutorial Topic только для организационных целей, например, чтобы упорядочить иерархию таким образом, чтобы ее было легко читать и поддерживать. С темами, в которых слишком много шагов, потом будет труднее разбираться. Другими словами, вы можете использовать узел Tutorial Topic, чтобы сгруппировать несколько шагов, даже если вы не собираетесь в узле Tutorial Topic отображать какой-либо контент. В таких случаях вы можете использовать это свойство, чтобы пропустить шаг, не предназначенный для отображения содержимого.",
                    "updated": 1638343008771
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "docs",
            "updated": 1617636114812
        },
        {
            "style": "Text",
            "text": "The docs property is used to point to the Docs Tutorial Page that feeds content to the particular tutorial step. The definition requires the name of the Project, the Docs Page Category which is always \"Tutorial\", and the complete name of the Docs Page, that is, the \"type\" as specified in the JSON file.",
            "updated": 1617648211414,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die docs-Eigenschaft wird verwendet, um auf die Docs Tutorial Page zu verweisen, die den Inhalt für den jeweiligen Tutorial-Schritt liefert. Die Definition erfordert den Namen des Project (Projekts), die Docs Page Category (Kategorie) welche immer \"Tutorial\" ist, und den vollständigen Namen der Docs Page, das heißt den \"Typ\", wie in der JSON-Datei angegeben.",
                    "updated": 1633979212224,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство \"docs\" используется для указания на страницу Docs Tutorial Page, которая передает контент на конкретный шаг учебного пособия. Для определения требуется имя проекта, категория страницы документов, которая всегда является «Tutorial», и полное имя страницы документов, то есть типа «type», как указано в файле JSON.",
                    "updated": 1638343213692
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"docs\": {\n        \"project\": \"Foundations\",\n        \"category\": \"Tutorial\",\n        \"type\": \"Tutorial Step - Scales' Best-Kept Secrets\"\n    }",
            "updated": 1613842164831
        },
        {
            "style": "Subtitle",
            "text": "controlDocs",
            "updated": 1617648219190
        },
        {
            "style": "Text",
            "text": "The property is used to control the behavior of the Docs panel. Within controlDocs, several properties are available, and all of them are optional. Let's review each in detail.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Eigenschaft wird verwendet, um das Verhalten des Docs-Panels zu steuern. Innerhalb von controlDocs sind mehrere Eigenschaften verfügbar, die alle optional sind. Sehen wir uns jede im Detail an.",
                    "updated": 1633979296433,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство используется для управления поведением панели Docs Panel. В controlDocs доступно несколько свойств, и все они являются необязательными. Рассмотрим подробно каждый.",
                    "updated": 1638343486932
                }
            ]
        },
        {
            "style": "Text",
            "text": "The panel property may be set to \"Open\" or \"Close\". This property controls the tab that allows you to open the Docs Panel in one step, and close it on a different step when it's no longer needed.",
            "updated": 1617649653900,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Panel-Eigenschaft kann auf \"Öffnen\" oder \"Schließen\" eingestellt werden. Diese Eigenschaft steuert die Registerkarte, mit der Sie das Doku-Panel in einem Schritt öffnen und in einem anderen Schritt wieder schließen können, wenn es nicht mehr benötigt wird.",
                    "updated": 1633979356912,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство панели может быть установлено на «Open» или «Close». Это свойство управляет вкладкой, которая позволяет вам открыть панель документов за один шаг и закрыть ее на другом шаге, когда она больше не нужна.",
                    "updated": 1638343378776
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"controlDocs\": {\n        \"panel\": \"Open\",\n        }",
            "updated": 1617634451884
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Success",
            "text": "If the Docs Panel is closed, the rest of the properties are somehow irrelevant. However, when the Docs Panel is open, the rest of the properties control what is displayed in the Docs Panel.",
            "updated": 1617635061507,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn das Docs Panel geschlossen ist, sind die restlichen Eigenschaften irgendwie irrelevant. Wenn das Docs-Panel jedoch geöffnet ist, steuern die restlichen Eigenschaften, was im Docs-Panel angezeigt wird.",
                    "updated": 1633979402232,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Если панель Docs Panel закрыта, остальные свойства не имеют значения. Однако, когда панель Docs Panel открыта, остальные свойства управляют тем, что отображается на панели Docs Panel.",
                    "updated": 1638343471175
                }
            ]
        },
        {
            "style": "Text",
            "text": "The property closeTutorialEditor may switch on and off the Docs editor. When set to false or when there is no definition, and provided no specific Docs Page is called (see controlDocs below), the Docs panel shows the page associated with the current tutorial step in editing mode.",
            "updated": 1617649781891,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Eigenschaft closeTutorialEditor kann den Docs-Editor ein- und ausschalten. Wenn die Eigenschaft auf false gesetzt ist oder wenn es keine Definition gibt und wenn keine spezifische Docs-Seite aufgerufen wird (siehe controlDocs unten), zeigt das Docs-Panel die Seite, die mit dem aktuellen Tutorial-Schritt im Bearbeitungsmodus verbunden ist.",
                    "updated": 1633979594120,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство closeTutorialEditor может включать и выключать редактор документов. Если установлено значение false или нет определения и при условии, что не вызывается конкретная страница Docs Page (см. ControlDocs ниже), на панели Docs Panel отображается страница, связанная с текущим этапом обучения в режиме редактирования.",
                    "updated": 1638343628965
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"controlDocs\": {\n        \"panel\": \"Open\",\n        \"closeTutorialEditor\": false,\n        }",
            "updated": 1617648310737
        },
        {
            "style": "Success",
            "text": "Because this definition is set to false by default, this is the usual behavior. That is, by default, when the Docs Panel is opened while a tutorial step is playing, the Docs Panel shows the Docs Page associated with the specific step so that the page may be edited right then and there.",
            "updated": 1617648335347,
            "translations": [
                {
                    "language": "DE",
                    "text": "Da diese Definition standardmäßig auf false gesetzt ist, ist dies das standardmäßige Verhalten. Das heißt, wenn das Docs-Bedienfeld geöffnet wird, während ein Tutorial-Schritt abgespielt wird, zeigt das Docs-Bedienfeld standardmäßig die Docs-Seite an, die mit dem jeweiligen Schritt verknüpft ist, so dass die Seite direkt an Ort und Stelle bearbeitet werden kann.",
                    "updated": 1633979921238,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Поскольку для этого определения по умолчанию установлено значение false, это обычное поведение. То есть по умолчанию, когда панель Docs Panel открывается во время выполнения шага обучения, на панели Docs Panel отображается страница Docs Page, связанная с конкретным шагом, так что страницу можно редактировать прямо сейчас.",
                    "updated": 1638343747105
                }
            ]
        },
        {
            "style": "Text",
            "text": "When the closeTutorialEditor property is set to true and there is no request to open a Docs page (see page property below), then the Docs panel shows whatever Docs Page was being displayed in the previous step.",
            "updated": 1617648434580,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn die Eigenschaft closeTutorialEditor auf true gesetzt ist und keine Anforderung zum Öffnen einer Dokumentseite vorliegt (siehe Eigenschaft page weiter unten), dann zeigt das Dokumentseiten-Panel die Dokumentseite an, die im vorherigen Schritt angezeigt wurde.",
                    "updated": 1633979700958,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Если для свойства closeTutorialEditor установлено значение true и нет запроса на открытие страницы Docs (см. Свойство страницы ниже), тогда на панели Docs отображается любая страница Docs Page, отображаемая на предыдущем шаге.",
                    "updated": 1638343921788
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"controlDocs\": {\n        \"panel\": \"Open\",\n        \"closeTutorialEditor\": true,\n        }",
            "updated": 1617634444688
        },
        {
            "style": "Success",
            "text": "You may want to close the tutorial editor when the user is supposed to interact with the Docs from one step to the next. For example, let's say the tutorial instructs the user to run a search and discusses the search results in the following step. In that case, you will want the tutorial editor to remain closed, as otherwise, the search performed by the user would be lost, and instead the page corresponding to the new tutorial step would be loaded.",
            "updated": 1617649832578,
            "translations": [
                {
                    "language": "DE",
                    "text": "Es kann sinnvoll sein, den Tutorial Editor zu schließen, wenn der Benutzer von einem Schritt zum nächsten mit den Docs interagieren soll. Nehmen wir zum Beispiel an, das Tutorial weist den Benutzer an, eine Suche durchzuführen und dieses Ergebnis im nächsten Schritt zu besprechen. In diesem Fall möchten Sie, dass der Editor des Tutorials geschlossen bleibt, da sonst die vom Benutzer durchgeführte Suche verloren ginge und stattdessen die Seite geladen würde, die dem neuen Schritt des Tutorials entspricht.",
                    "updated": 1633979902886,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Вы можете закрыть редактор учебника, когда пользователь должен взаимодействовать с Docs от одного шага к другому. Например, предположим, что учебник инструктирует пользователя выполнить поиск и обсуждает результаты поиска на следующем шаге. В этом случае вы захотите, чтобы редактор учебников оставался закрытым, иначе поиск, выполненный пользователем, будет потерян, и вместо этого будет загружена страница, соответствующая новому шагу руководства.",
                    "updated": 1638344026667
                }
            ]
        },
        {
            "style": "Text",
            "text": "The searchPage property overruns the tutorial editor settings and loads the home search page featuring the search box in the center.",
            "updated": 1617649861459,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Eigenschaft searchPage überschreibt die Einstellungen des Tutorial-Editors und lädt die Hauptsuchseite mit dem Suchfeld in der Mitte.",
                    "updated": 1633979953175,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство searchPage выходит за пределы настроек редактора учебника и загружает домашнюю страницу поиска с полем поиска в центре.",
                    "updated": 1638344044257
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"controlDocs\": {\n        \"panel\": \"Open\",\n        \"searchPage\": true,\n        }",
            "updated": 1617648855034
        },
        {
            "style": "Success",
            "text": "Use the above setting when you wish the user to get the clean search box to make a search or run a command.",
            "updated": 1617648884933,
            "translations": [
                {
                    "language": "DE",
                    "text": "Verwenden Sie die obige Einstellung, wenn Sie möchten, dass der Benutzer das saubere Suchfeld erhält, um eine Suche durchzuführen oder einen Befehl auszuführen.",
                    "updated": 1633980006636,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Используйте указанную выше настройку, если хотите, чтобы пользователь получил чистое поле поиска для выполнения поиска или выполнения команды.",
                    "updated": 1638344074943
                }
            ]
        },
        {
            "style": "Text",
            "text": "The page property is where you define which Docs Page must be loaded. You must specify the Project, the Docs Page Category, and the \"type\" which is the complete name of the page. The optional property anchor allows you to point the user to a specific paragraph in the page with the Docs Anchor Style.",
            "updated": 1630752089891,
            "translations": [
                {
                    "language": "DE",
                    "text": "Mit der page property legen Sie fest, welche Docs Page geladen werden soll. Sie müssen das Project (Projekt), die Docs Page Category (Kategorie) und den \"type\" (Typ), also den vollständigen Namen der Seite, angeben. Die optionale Eigenschaft anchor ermöglicht es Ihnen, den Benutzer mit dem Docs Anchor Style auf einen bestimmten Absatz der Seite zu verweisen.",
                    "updated": 1633980112889,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Свойство page - это то место, где вы определяете, какая страница Docs Page должна быть загружена. Вы должны указать проект Project, категорию страницы Docs Page Category и «type», который является полным именем страницы. Необязательная привязка свойства позволяет указать пользователю на определенный абзац на странице с помощью привязки Docs Anchor Style.",
                    "updated": 1638344326671
                }
            ]
        },
        {
            "style": "Json",
            "text": "\"controlDocs\": {\n        \"panel\": \"Open\",\n        \"page\": {\n            \"project\": \"Foundations\",\n            \"category\": \"Topic\",\n            \"type\": \"Syntax Overview\",\n            \"anchor\": \"Previous Property\"\n            }\n         }",
            "updated": 1617649170254
        },
        {
            "style": "Success",
            "text": "Use the above configuration when you wish the user to read a specific page in the Docs.",
            "updated": 1617649085529,
            "translations": [
                {
                    "language": "DE",
                    "text": "Verwenden Sie die obige Konfiguration, wenn Sie möchten, dass der Benutzer eine bestimmte Seite in den Docs liest.",
                    "updated": 1633980693215,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Используйте указанную выше конфигурацию, если хотите, чтобы пользователь читал определенную страницу в Docs.",
                    "updated": 1638344372113
                }
            ]
        }
    ]
}