{
    "topic": "How To",
    "pageNumber": 4,
    "type": "Run Two Independent Installations of Superalgos in Parallel",
    "definition": {
        "text": "Run two independent installations of Superalgos in parallel but be aware of possible issues.",
        "updated": 1620660561822
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Superalgos in its essence is very easy and straightforward. This is the big advantage of this software that let you do literally whatever you want. One of the many Big Questions we face in the community is how to run multiple instances of SA at the same time. This is totally achievable and indeed it's really easy but, please, read everything carefully because this is not exempted from downsides. So first of all let's see how to configure SA to achieve this feature and at the end of this How To you will find what aspects to consider.",
            "updated": 1620660089736
        },
        {
            "style": "Text",
            "text": "Basically Superalgos consists of two different parts, the UI and the CLI, that live together. To communicate with us they use 3 different parameters defined in the Environment.js file (see default values below) and are the following:",
            "updated": 1620714602413
        },
        {
            "style": "List",
            "text": "IP Address -> WEB_SERVER_URL localhost\n",
            "updated": 1620714659625
        },
        {
            "style": "List",
            "text": "HTTP Port -> HTTP_INTERFACE_PORT 34248",
            "updated": 1620664211003
        },
        {
            "style": "List",
            "text": "Web Socket Port -> WEB_SOCKETS_INTERFACE_PORT 18041",
            "updated": 1620664191467
        },
        {
            "style": "Text",
            "text": "It will therefore be sufficient to simply change these parameters to obtain the desired result. But note that changing the values in the Environment.js file could not be sufficient though. Superalgos saves these values not only as global variables but as straight values when you save a workspace, for example. You must then be sure to change these parameters in all your SA install. One way to achieve this quickly is to use a software like VSCode that let you do a search and replace in a whole directory.",
            "updated": 1620714695058
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/how-to/SA2IndependInstall-SArunDifferentBranches.png",
            "updated": 1620715052275
        },
        {
            "style": "Text",
            "text": "In the above screenshot you can see two different installation of SA running together at the same time. To avoid any type of conflict it's suggested to change not only the ports being used but also to replace 'localhost' with the IP of your local lan. In Windows you can know which IP is assigned to your machine with a simple CLI command. Just type ipconfig and you will presented with details about your local lan as in the following screenshot. IPv4 Address is your local IP:",
            "updated": 1620717800744
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/how-to/SA2IndependInstall-IPlocalAddress.png",
            "updated": 1620717894730
        },
        {
            "style": "Text",
            "text": "Using VSCode or any other editor that let you import the whole Supealgos folder is easy to do a search and replace. Just be sure to replace the exact match to avoid errors and ending up replacing something that should not be replaced like nested values in json files.",
            "updated": 1620718097975
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/how-to/SA2IndependInstall-VSCodeSearch.png",
            "updated": 1620718137061
        },
        {
            "style": "Text",
            "text": "Once all 3 parameters are changed you can fire up Superalgos. The first step now is to navigate to the Network node and make sure the values are updated. In the screenshot below you can see that localhost and WebPort have updated values from the default ones (arbitrary set to 192.168.0.2 for IP and 34444 for the WebPort), but not the WebSocketPort that has the default value 18041. This mistake will end up with errors in Superalgos.",
            "updated": 1620718262006
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/how-to/SA2IndependInstall-CheckNetworkNode.png",
            "updated": 1620718468553
        },
        {
            "style": "Text",
            "text": "Once everything is properly set up you can now run two independent installations of Superalgos in parallel. The two installation are independent and can run different branches or different workspaces:",
            "updated": 1620718883900
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/how-to/SA2IndependInstall-SA2Branches.png",
            "updated": 1620719054815
        },
        {
            "style": "Text",
            "text": "One downside aspect to consider with such configuration is possible issues if you want to contribute to Superalgos. In the following screenshot, for example, you can see that a simple git checkout command will present you with a list of changed files that probably you don't want to use to contribute:",
            "updated": 1620719690807
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/how-to/SA2IndependInstall-GitCheckoutIssues.png",
            "updated": 1620719642661
        },
        {
            "style": "Text",
            "text": "It is therefore advisable to carefully decide how to handle an SA installation when changing to arbitrary parameters.",
            "updated": 1620719781972
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}