{
    "type": "Plotter Module",
    "definition": {
        "text": "A plotter module is a device within a plotter that contains the definitions to create the visualization for a product definition.",
        "translations": [
            {
                "language": "DE",
                "text": "Ein \"plotter module\" ist ein Modul innerhalb eines Plotters, das die Definitionen zur Erstellung der Visualisierung für eine \"product definition\" enthält.",
                "updated": 1636659770379
            },
            {
                "language": "RU",
                "text": "Plotter Module - это устройство внутри плоттера, которое содержит определения для создания визуализации для определения продукта.",
                "updated": 1639724113668
            },
            {
                "language": "TR",
                "text": "Bir çizici modülü, ürün tanımı için görselleştirme oluşturmak üzere tanımları içeren çizici içindeki bir cihazdır.",
                "updated": 1674139530733
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "A single plotter may have several modules. Different modules may be used to plot each product of the bot, or as best suits the expected use-pattern.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Ein einzelner Plotter kann mehrere Module haben. Für jedes Produkt des Bots können verschiedene Module verwendet werden, je nachdem, wie es dem erwarteten Nutzungsmuster am besten entspricht.",
                    "updated": 1636659901038
                },
                {
                    "language": "RU",
                    "text": "Один плоттер может иметь несколько модулей. Различные модули могут использоваться для построения графиков для каждого продукта бота или в соответствии с предполагаемой схемой использования.",
                    "updated": 1639724162840
                },
                {
                    "language": "TR",
                    "text": "Tek bir çizici birkaç modüle sahip olabilir. Botun her bir ürününü çizmek için farklı modüller kullanılabilir veya beklenen kullanım modeline en uygun şekilde kullanılabilir.",
                    "updated": 1674139635360
                }
            ]
        },
        {
            "style": "Important",
            "text": "For a bot to use a plotter, the corresponding Product Definition must establish a reference with the plotter module built to interpret the dataset.",
            "updated": 1609790272500,
            "translations": [
                {
                    "language": "DE",
                    "text": "Damit ein Bot einen Plotter verwenden kann, muss die entsprechende Produktdefinition eine reference zu dem Plottermodul herstellen, das zur Interpretation des Datensatzes gebaut wurde.",
                    "updated": 1636659964219
                },
                {
                    "language": "RU",
                    "text": "Чтобы бот мог использовать плоттер, соответствующее определение продукта Product Definition должно установить связь с модулем плоттера, созданным для интерпретации набора данных.",
                    "updated": 1639724227656
                },
                {
                    "language": "TR",
                    "text": "Bir botun çizici kullanabilmesi için, ilgili Ürün Tanımının ( Product Definition ) veri kümesini yorumlamak üzere oluşturulmuş çizici modülü ile referans kurması gerekir.",
                    "updated": 1674139874462
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609790308422
        },
        {
            "style": "Title",
            "text": "Plotter Module Configuration",
            "translations": [
                {
                    "language": "DE",
                    "text": "Konfiguration des Plottermoduls:",
                    "updated": 1636659978962
                },
                {
                    "language": "RU",
                    "text": "Конфигурация Plotter Module",
                    "updated": 1639724245315
                },
                {
                    "language": "TR",
                    "text": "Çizici Modülü Yapılandırması (Plotter Module Configuration)",
                    "updated": 1674139943886
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609790324389,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1639724252178
                },
                {
                    "language": "TR",
                    "text": "Özellikler",
                    "updated": 1674139980511
                }
            ]
        },
        {
            "style": "List",
            "text": "codeName is the name used in the code to refer to the module.",
            "translations": [
                {
                    "language": "DE",
                    "text": "codeName ist der Name, der im Code verwendet wird, um auf das Modul zu verweisen.",
                    "updated": 1636660003241
                },
                {
                    "language": "RU",
                    "text": "codeName - это имя, используемое в коде для обозначения модуля.",
                    "updated": 1639724265790
                },
                {
                    "language": "TR",
                    "text": "codeName kod içinde modüle atıfta bulunmak için kullanılan addır.",
                    "updated": 1674140040576
                }
            ]
        },
        {
            "style": "List",
            "text": "isLegacy is true for plotters modules developed entirely in JavaScript, and is false or doesn't show in the configuration for plotters built with the tools featured in the data mine hierarchy.",
            "translations": [
                {
                    "language": "DE",
                    "text": "isLegacy ist wahr für Plotter-Module, die vollständig in JavaScript entwickelt wurden, und ist falsch oder wird in der Konfiguration nicht angezeigt für Plotter, die mit den in der Data-Mine-Hierarchie enthaltenen Tools erstellt wurden.",
                    "updated": 1636660060029
                },
                {
                    "language": "RU",
                    "text": "isLegacy является истинным (true) для модулей плоттеров, разработанных полностью на JavaScript, и является ложным или не отображается в конфигурации для плоттеров, построенных с использованием инструментов, представленных в иерархии Data Mine.",
                    "updated": 1639724369231
                },
                {
                    "language": "TR",
                    "text": "isLegacy tamamen JavaScript ile geliştirilen çizici modülleri için doğrudur ve veri madeni hiyerarşisinde yer alan araçlarla oluşturulan çiziciler için yanlıştır veya yapılandırmada gösterilmez.",
                    "updated": 1674140153023
                }
            ]
        },
        {
            "style": "List",
            "text": "icon is the name of the image that illustrates the corresponding layer in the Layers Panel. In case the icon is not specified, the default icon is used. Possible values are...",
            "updated": 1647934253343,
            "translations": [
                {
                    "language": "RU",
                    "text": "icon - это имя изображения, иллюстрирующего соответствующий слой на панели слоев. Если значок не указан, используется значок по умолчанию. Возможные значения...",
                    "updated": 1661275622519
                },
                {
                    "language": "TR",
                    "text": "simgesi, Katmanlar Panelinde ilgili katmanı gösteren görüntünün adıdır. Simge belirtilmediği takdirde, varsayılan simge kullanılır. Olası değerler şunlardır...",
                    "updated": 1674140190952
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "layer-moving-averages\nlayer-bands\nlayer-candles\nlayer-histogram\nlayer-oscilator\nlayer-resistance\nlayer-support\nlayer-trends\nlayer-volume",
            "updated": 1609852285167
        },
        {
            "style": "Text",
            "text": "Custom images may be added too. To do that:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Es können auch eigene Bilder hinzugefügt werden. Um das zu tun:",
                    "updated": 1636660314385
                },
                {
                    "language": "RU",
                    "text": "Можно также добавлять пользовательские изображения. Для этого:",
                    "updated": 1639724436480
                },
                {
                    "language": "TR",
                    "text": "Özel resimler de eklenebilir. Bunu yapmak için:",
                    "updated": 1674140318592
                }
            ]
        },
        {
            "style": "Text",
            "text": "1. Name the image in the following format: image-name.png;",
            "updated": 1609852305205,
            "translations": [
                {
                    "language": "DE",
                    "text": "1. Benennen Sie das Bild in folgendem Format: bild-name.png;",
                    "updated": 1636660337014
                },
                {
                    "language": "RU",
                    "text": "1. Назовите изображение в следующем формате: image-name.png;",
                    "updated": 1639724449960
                },
                {
                    "language": "TR",
                    "text": "1.  Görüntüyü aşağıdaki formatta adlandırın: image-name.png;",
                    "updated": 1674140367290
                }
            ]
        },
        {
            "style": "Text",
            "text": "2. Place images in the WebServer\\Images\\Icons folder;",
            "updated": 1609852315978,
            "translations": [
                {
                    "language": "DE",
                    "text": "2. Legen Sie die Bilder in den Ordner WebServer\\Images\\Icons;",
                    "updated": 1636660361650
                },
                {
                    "language": "RU",
                    "text": "2. Поместите изображения в папку WebServer\\Images\\Icons;",
                    "updated": 1639724474141
                },
                {
                    "language": "TR",
                    "text": "2. Görüntüleri WebServer\\Images\\Icons klasörüne yerleştirin;",
                    "updated": 1674140409856
                }
            ]
        },
        {
            "style": "Text",
            "text": "3. In the configuration of the module, use the name as is (e.g.: \"icon\": \"image-name\")",
            "updated": 1609852322876,
            "translations": [
                {
                    "language": "DE",
                    "text": "3. In der Konfiguration des Moduls ist der Name unverändert zu verwenden (z. B.: \"icon\": \"image-name\")",
                    "updated": 1636660481504
                },
                {
                    "language": "RU",
                    "text": "3. В конфигурации модуля используйте имя как есть (например: \"icon\": \"image-name\")",
                    "updated": 1639724498949
                },
                {
                    "language": "TR",
                    "text": "3. Modülün yapılandırmasında, adı olduğu gibi kullanın (örneğin: \"icon\": \"image-name\")",
                    "updated": 1674140446935
                }
            ]
        }
    ]
}