{
    "type": "Task Server App",
    "definition": {
        "text": "The Task Server App node allows a user to define an identity for a Task Server.",
        "updated": 1643078111479,
        "translations": [
            {
                "language": "RU",
                "text": "Узел Task Server App позволяет пользователю определить идентификатор для сервера задач.",
                "updated": 1645253875643
            },
            {
                "language": "TR",
                "text": "Görev Sunucusu Uygulaması düğümü, bir kullanıcının Görev Sunucusu (Task Server) için bir kimlik tanımlamasına izin verir.",
                "updated": 1666688184049
            },
            {
                "language": "DE",
                "text": "Der Knoten Task Server App ermöglicht es einem Benutzer, eine Identität für einen Task Server zu definieren. ",
                "updated": 1704581436762
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1643078288954,
            "translations": [
                {
                    "language": "TR",
                    "text": "Bir görev sunucusu için kimlik tanımlamak, mevcut Kullanıcı Profilinin (USer Profile) Superalgos Platformunun bir örneğini Superalgos Eşler Arası Ağına bağlamasını sağlar.",
                    "updated": 1666688314644
                }
            ]
        },
        {
            "style": "Text",
            "text": "Defining an identity for a task server allows the current User Profile to connect an instance of the Superalgos Platform to the Superalgos Peer to Peer Network.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Определение идентификатора для сервера задач позволяет текущему профилю пользователя подключить экземпляр платформы Superalgos к одноранговой сети Superalgos.",
                    "updated": 1645253883937
                },
                {
                    "language": "TR",
                    "text": "Bir görev sunucusu için kimlik tanımlamak, mevcut Kullanıcı Profiline (User Profile) ait Superalgos Platformunun bir örneğini, Superalgos Eşler Arası Ağa bağlar.",
                    "updated": 1666688649228
                },
                {
                    "language": "DE",
                    "text": "Die Definition einer Identität für einen Aufgabenserver ermöglicht es dem aktuellen Benutzerprofil (User Profile), eine Instanz der Superalgos Plattform mit dem Superalgos Peer-to-Peer Netzwerk zu verbinden.",
                    "updated": 1704577879621
                }
            ]
        },
        {
            "style": "Note",
            "text": "This is achieved through the creation of a Signing Account.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Это достигается путем создания учетной записи (Signing Account).",
                    "updated": 1645253955715
                },
                {
                    "language": "TR",
                    "text": "Bu, bir İmzalama Hesabı (Signing Account) oluşturulmasıyla sağlanır.",
                    "updated": 1666688739217
                },
                {
                    "language": "DE",
                    "text": "Dies wird durch die Erstellung eines Signing Account erreicht.",
                    "updated": 1704577902509
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Properties",
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1645253961521
                },
                {
                    "language": "TR",
                    "text": "Özellikler",
                    "updated": 1666688789633
                },
                {
                    "language": "DE",
                    "text": "Eigenschaften",
                    "updated": 1704577916564
                }
            ]
        },
        {
            "style": "List",
            "text": "codeName: This property defines the chosen name for a User's task server app.",
            "translations": [
                {
                    "language": "RU",
                    "text": "codeName: Это свойство определяет выбранное имя для приложения сервера задач пользователя.",
                    "updated": 1645253967137
                },
                {
                    "language": "TR",
                    "text": "codeName: Bu özellik, bir Kullanıcının görev sunucusu uygulaması için seçilen adı tanımlar.",
                    "updated": 1666688828704
                },
                {
                    "language": "DE",
                    "text": "CodeName: Diese Eigenschaft definiert den gewählten Namen für die Aufgaben-Server-App eines Benutzers.",
                    "updated": 1704578105707
                }
            ]
        }
    ]
}