{
    "type": "Exchange Data Tasks",
    "definition": {
        "text": "The exchange data tasks node organizes data mining tasks by exchange. That is, each exchange installed in the system has an exchange data tasks node grouping all market data tasks corresponding to the said exchange.",
        "translations": [
            {
                "language": "ES",
                "text": "\nEl nodo exchange data tasks organiza las tareas de minería de datos por mercado. Es decir, cada mercado instalado en el sistema tiene un nodo de exchange data tasks que agrupa datos del mercado correspondientes a dicho mercado.\n",
                "updated": 1624283490092,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Узел Exchange Data Tasks организует задачи интеллектуального анализа данных по бирже. Т.е. каждая биржа, установленная в системе, умеет узел Exchange Data Tasks, объединяющий все задачи рыночных данных, соответствующие указанной бирже.",
                "updated": 1638358984303
            },
            {
                "language": "TR",
                "text": "Borsa veri görevleri düğümü, borsaya göre veri madenciliği görevlerini düzenler. Yani, sistemde kurulu olan her borsa, söz konusu borsaya karşılık gelen tüm piyasa verileri görevlerini gruplayan bir borsa verileri görevleri düğümüne sahiptir.",
                "updated": 1639120723421
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The exchange data tasks node must reference the exchange of choice. This reference constraints the rest of the definitions to the context of the said exchange.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел Exchange Data Tasks должен ссылаться на выбранную биржу. Эта ссылка ограничивает остальные определения контекстом упомянутой биржи.",
                    "updated": 1638359117939
                },
                {
                    "language": "ES",
                    "text": "El nodo de Exchange Data Tasks debe hacer referencia al Exchange elegido. Esta referencia limita el resto de definiciones al contexto de dicho Exchange.",
                    "updated": 1641092155389
                },
                {
                    "language": "TR",
                    "text": "Borsa veri görevleri düğümü tercih edilen borsaya referans vermelidir. Bu referans, tanımların geri kalanını söz konusu borsa bağlamıyla sınırlar.",
                    "updated": 1654392271592,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "When representing an exchange featured in the system's icons library, the standard exchange data tasks icon is replaced by the exchange's logo.",
            "translations": [
                {
                    "language": "RU",
                    "text": "При использовнии биржи, представленной в библиотеке значков системы, стандартный значок задач обмена данными заменяется логотипом биржи.",
                    "updated": 1638358906400
                },
                {
                    "language": "ES",
                    "text": "Cuando se representa un Exchange que se encuentra en la biblioteca de íconos del sistema, el ícono estándar del Exchange Data Tasks se reemplaza por logo del Exchange elegido.",
                    "updated": 1641092171894
                },
                {
                    "language": "TR",
                    "text": "Sistemin simgeler kitaplığında yer alan bir borsayı temsil ederken, standart borsa veri görevleri simgesinin yerini borsanın logosu alır.",
                    "updated": 1654392279515,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Block",
            "text": "Running"
        }
    ]
}