{
    "type": "Exchange Data Tasks",
    "definition": {
        "text": "The exchange data tasks node organizes data mining tasks by exchange. That is, each exchange installed in the system has an exchange data tasks node grouping all market data tasks corresponding to the said exchange.",
        "translations": [
            {
                "language": "ES",
                "text": "\nEl nodo exchange data tasks organiza las tareas de minería de datos por mercado. Es decir, cada mercado instalado en el sistema tiene un nodo de exchange data tasks que agrupa datos del mercado correspondientes a dicho mercado.\n",
                "updated": 1624283490092,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Узел Exchange Data Tasks организует задачи интеллектуального анализа данных по бирже. Т.е. каждая биржа, установленная в системе, умеет узел Exchange Data Tasks, объединяющий все задачи рыночных данных, соответствующие указанной бирже.",
                "updated": 1638358984303
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The exchange data tasks node must reference the exchange of choice. This reference constraints the rest of the definitions to the context of the said exchange.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел Exchange Data Tasks должен ссылаться на выбранную биржу. Эта ссылка ограничивает остальные определения контекстом упомянутой биржи.",
                    "updated": 1638359117939
                }
            ]
        },
        {
            "style": "Text",
            "text": "When representing an exchange featured in the system's icons library, the standard exchange data tasks icon is replaced by the exchange's logo.",
            "translations": [
                {
                    "language": "RU",
                    "text": "При использовнии биржи, представленной в библиотеке значков системы, стандартный значок задач обмена данными заменяется логотипом биржи.",
                    "updated": 1638358906400
                }
            ]
        },
        {
            "style": "Block",
            "text": "Running"
        }
    ]
}