{
    "type": "Bot Products",
    "definition": {
        "text": "A bot products node is an organizational device used to arrange data products corresponding to a specific bot.",
        "translations": [
            {
                "language": "ES",
                "text": "Un nodo bot products es un dispositivo organizativo que se utiliza para organizar los productos de datos correspondientes a un bot específico.",
                "updated": 1628902888224
            },
            {
                "language": "RU",
                "text": "Узел Bot Products - это организационное устройство, используемое для организации продуктов данных, соответствующих конкретному боту.",
                "updated": 1638645086501
            },
            {
                "language": "TR",
                "text": "Bir bot ürünleri düğümü, belirli bir bota karşılık gelen veri ürünlerini düzenlemek için kullanılan kurumsal bir cihazdır.",
                "updated": 1652796385450
            },
            {
                "language": "DE",
                "text": "Ein Bot-Produktknoten ist ein Organisationsmittel, das dazu dient, Datenprodukte zu ordnen, die einem bestimmten Bot entsprechen.",
                "updated": 1701930802189
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The device exists as an offspring of a data or trading mine products node, and does not require a reference to a bot in the given data or trading mine.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Устройство существует как потомок узла данных или хранилища торговых продуктов и не требует ссылки на бота.",
                    "updated": 1638645309497
                },
                {
                    "language": "TR",
                    "text": "Cihaz, bir veri veya ticari maden ürünleri düğümünün ürünü olarak bulunur ve verilen verilerde veya ticaret madeninde bir bot referansı gerektirmez.",
                    "updated": 1652796403572
                },
                {
                    "language": "DE",
                    "text": "Das Gerät existiert als Abkömmling eines Daten- oder Handelsminenproduktknotens ( data or trading mine products ) und benötigt keinen Verweis auf einen Bot in der gegebenen Daten- oder Handelsmine.",
                    "updated": 1701930802360,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "The use of the bot products node is optional, as data products may also exist outside of bot products.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Использование узла Bot Products необязательно, так как продукты данных также могут существовать за пределами продуктов ботов.",
                    "updated": 1638645454646
                },
                {
                    "language": "TR",
                    "text": "Veri ürünleri bot ürünlerinin dışında da bulunabileceğinden, bot ürünleri düğümünün kullanımı isteğe bağlıdır.",
                    "updated": 1652796413138
                },
                {
                    "language": "DE",
                    "text": "Die Verwendung des Knotens Bot-Produkte ist optional, da Datenprodukte auch außerhalb von Bot-Produkten existieren können.",
                    "updated": 1701930802530,
                    "style": "Text"
                }
            ]
        }
    ]
}