{
    "topic": "LAN Network",
    "pageNumber": "2",
    "type": "Organization of Tasks",
    "definition": {
        "text": "The network hierarchy supports a multi-exchange, multi-market, and multi-mine deployment, and tasks are organized by those criteria.",
        "updated": 1610050221585,
        "translations": [
            {
                "language": "RU",
                "text": "Сетевая иерархия поддерживает развертывание с несколькими биржами, несколькими рынками и несколькими шахтами, и задачи организованы по этим критериям.",
                "updated": 1638357947652
            },
            {
                "language": "DE",
                "text": "Die Netzwerkhierarchie unterstützt den Einsatz mehrerer Börsen, Märkte und Minen, und die Aufgaben werden nach diesen Kriterien organisiert.",
                "updated": 1651910723729
            },
            {
                "language": "PT",
                "text": "A hierarquia de rede suporta uma implantação multi-corretora, multi-mercado e multi-minas, e as tarefas são organizadas com base nesses critérios.  ",
                "updated": 1711655702914
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Before diving into the workings of each of the operations that you may define and control from within the Network hierarchy, it is worth pointing out a certain commonality among them.",
            "updated": 1610050241056,
            "translations": [
                {
                    "language": "RU",
                    "text": "Прежде чем погрузиться в работу каждой из операций, которые вы можете определять и контролировать из сетевой иерархии, стоит указать на определенную общность между ними.",
                    "updated": 1638357973058
                },
                {
                    "language": "DE",
                    "text": "Bevor Sie sich mit der Funktionsweise der einzelnen Vorgänge befassen, die Sie in der Netzwerkhierarchie definieren und steuern können, sollten Sie auf einige Gemeinsamkeiten zwischen ihnen hinweisen.",
                    "updated": 1651910747159
                },
                {
                    "language": "PT",
                    "text": "Antes de mergulhar nos detalhes de cada uma das operações que você pode definir e controlar dentro da hierarquia de Rede, vale ressaltar uma certa semelhança entre elas.",
                    "updated": 1711557589698
                }
            ]
        },
        {
            "style": "Text",
            "text": "Because Superalgos supports deploying data mining and trading operations on multiple exchanges, multiple markets, and using bots originating in multiple data and trading mines, the organization of the different data structures under the network node follows the same pattern in each of them:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Поскольку Superalgos поддерживает развертывание интеллектуального анализа данных и торговых операций на нескольких биржах, на нескольких рынках и с использованием ботов, происходящих из нескольких источников данных и торговых рудников, организация различных структур данных в узле сети следует одному и тому же шаблону в каждом из них:",
                    "updated": 1638358006810
                },
                {
                    "language": "DE",
                    "text": "Da Superalgos den Einsatz von Data-Mining- und Trading-Operationen an mehreren Börsen und Märkten sowie die Verwendung von Bots aus mehreren Data- und Trading-Mines unterstützt, folgt die Organisation der verschiedenen Datenstrukturen unter jedem Netzwerkknoten demselben Muster:",
                    "updated": 1651910800905
                },
                {
                    "language": "PT",
                    "text": "Como o Superalgos suporta a implantação de operações de mineração de dados e de negociação em múltiplas corretoras, múltiplos mercados e usando bots originários de várias minas de dados e de negociação, a organização das diferentes estruturas de dados sob o nó de rede segue o mesmo padrão em cada uma delas:",
                    "updated": 1711557663905
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Type of operation > Project Reference > Crypto Exchange Reference > Market Reference > Mine involved in the operation.",
            "updated": 1610050392306,
            "translations": [
                {
                    "language": "DE",
                    "text": "Art des Vorgangs > Projektreferenz > Krypto-Börsenreferenz > Marktreferenz > An dem Vorgang beteiligte Mine.",
                    "updated": 1651910830215
                },
                {
                    "language": "PT",
                    "text": "Tipo de operação > Referência do Projeto (Project) > Referência da Corretora de Criptomoedas (Crypto Exchange) > Referência de Mercado (Market) > A mina envolvida na operação.",
                    "updated": 1711557797549
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example, this is the data structure under Data Tasks:",
            "updated": 1610050437663,
            "translations": [
                {
                    "language": "RU",
                    "text": "Например, это структура данных в разделе Data Tasks:",
                    "updated": 1638358102441
                },
                {
                    "language": "DE",
                    "text": "Dies ist zum Beispiel die Struktur unter Data Tasks:",
                    "updated": 1651910859279
                },
                {
                    "language": "PT",
                    "text": "Por exemplo, esta estrutura de dados sob as Tarefas de Dados (Data Tasks):",
                    "updated": 1711557874057
                }
            ]
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Data Tasks->5",
            "updated": 1610050346817
        },
        {
            "style": "Text",
            "text": "Notice how the pattern repeats under the Testing Trading Tasks node:",
            "updated": 1610050482112,
            "translations": [
                {
                    "language": "RU",
                    "text": "Обратите внимание, как шаблон повторяется под узлом Testing Trading Tasks:",
                    "updated": 1638358129563
                },
                {
                    "language": "DE",
                    "text": "Beachten Sie, wie sich das Muster unter dem Knoten Testing Trading Tasks wiederholt:",
                    "updated": 1651910911019
                },
                {
                    "language": "PT",
                    "text": "Repare como o igual padrão se repete sob o Nó das Tarefas de Simulação de Negociação (Testing Trading Tasks):",
                    "updated": 1711558058807
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Testing Trading Tasks->5",
            "updated": 1610050520094
        },
        {
            "style": "Text",
            "text": "The Production Trading Tasks data structure is virtually the same:",
            "updated": 1610050572647,
            "translations": [
                {
                    "language": "RU",
                    "text": "Структура данных Production Trading Tasks практически такая же:",
                    "updated": 1638358150300
                },
                {
                    "language": "DE",
                    "text": "Die Datenstruktur der Production Trading Tasks ist praktisch identisch:",
                    "updated": 1651910927426
                },
                {
                    "language": "PT",
                    "text": "A estrutura das Tarefas de Negociação / Produção, (Production Trading Tasks) é virtualmente a mesma:",
                    "updated": 1711558203312
                }
            ]
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Production Trading Tasks->5",
            "updated": 1610050601207
        },
        {
            "style": "Text",
            "text": "The case of Data Storage is slightly different because there is a split in the structure into Data Mines Data, Trading Mines Data, and Learning Mines Data. However, each of the resulting structures of nodes bare a similarity with the organizational criteria explained above:",
            "updated": 1610050788902,
            "translations": [
                {
                    "language": "RU",
                    "text": "Случай с хранилищем данных Data Storage немного отличается, потому что структура разделена на данные Data Mines, данные Trading Mines и данные Learning Mines. Однако каждая из результирующих структур узлов имеет сходство с организационными критериями, описанными выше:",
                    "updated": 1638358249953
                },
                {
                    "language": "DE",
                    "text": "Der Fall bei Data Storage ist etwas anders, da es eine Aufteilung der Struktur in Data Mines Data, Trading Mines Data und Learning Mines Data gibt. Jede der daraus resultierenden Knotenstrukturen weist jedoch eine Ähnlichkeit mit den oben erläuterten organisatorischen Kriterien auf:",
                    "updated": 1651911014819
                },
                {
                    "language": "PT",
                    "text": "No caso do Armazenamento de Dados (Data Storage), há uma ligeira diferença porque há uma divisão na estrutura em Dados de Mineração de Dados (Data Mines Data), Dados de Mineração de Negociação (Trading Mines Data) e Dados de Mineração de Aprendizado (Learning Mines Data). No entanto, cada uma das estruturas resultantes de Nós (Node's) apresenta uma semelhança com os critérios de organização explicados acima:",
                    "updated": 1711558470709
                }
            ]
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Data Storage->5",
            "updated": 1610050722323
        },
        {
            "style": "Text",
            "text": "This kind of organization is required for scalable operations, as it helps in keeping a logical grouping of tasks, and helps avoid mixing up tasks from different exchanges, markets, or mines.",
            "updated": 1610050968717,
            "translations": [
                {
                    "language": "RU",
                    "text": "Такая организация необходима для масштабируемых операций, поскольку она помогает сохранять логическую группировку задач и помогает избежать смешения задач с разных бирж, рынков или шахт.",
                    "updated": 1638358283632
                },
                {
                    "language": "DE",
                    "text": "Diese Art der Organisation ist für einen skalierbaren Betrieb erforderlich, da sie dazu beiträgt, eine logische Gruppierung von Aufgaben beizubehalten und die Vermischung von Aufgaben aus verschiedenen Börsen, Märkten oder Minen zu vermeiden.",
                    "updated": 1651911070799
                },
                {
                    "language": "PT",
                    "text": "Esse tipo de organização é necessário para operações escaláveis, pois ajuda a manter um agrupamento lógico de tarefas e evita misturar tarefas de diferentes bolsas, mercados ou minas.",
                    "updated": 1711558643558
                }
            ]
        }
    ]
}