{
    "type": "Trigger Off Event",
    "definition": {
        "text": "The trigger-off event defines the situation in which the corresponding strategy shall be triggered-off. A strategy that is triggered-off releases the capital in reserve and makes it available to other strategies in the trading system.",
        "translations": [
            {
                "language": "ES",
                "text": "El evento trigger-off define la situación en la que se activará la estrategia correspondiente. Una estrategia que se activa libera el capital en reserva y lo pone a disposición de otras estrategias en el sistema de trading.",
                "updated": 1629580571614
            },
            {
                "language": "RU",
                "text": "Trigger Off Event (событие выключения) определяет ситуацию, в которой соответствующая стратегия должна быть выключена. Выключенная стратегия освобождает резервный капитал и делает его доступным для других стратегий в торговой системе.",
                "updated": 1639736651020
            },
            {
                "language": "DE",
                "text": "Der Trigger Off Event definiert die Situation, in der die entsprechende Strategie ausgeschaltet werden soll. Eine Strategie, die ausgeschaltet wird, setzt das Kapital in der Reserve frei und macht es für andere Strategien im Handelssystem verfügbar.",
                "updated": 1641648030277
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "In conceptual terms, the trigger-off event is the mechanism you use to define the situation in which the corresponding strategy should stop considering the trading opportunity signaled by the trigger-on event. That is, you use the trigger off event to describe the scenario for the invalidation of the trading idea behind the strategy.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В концептуальном плане событие выключения - это механизм, который вы используете для определения ситуации, в которой соответствующая стратегия должна прекратить рассматривать торговую возможность, о которой сигнализирует событие включения. Иными словами, вы используете событие выключения для описания сценария отмены торговой идеи, лежащей в основе стратегии.",
                    "updated": 1639736793351
                },
                {
                    "language": "DE",
                    "text": "Konzeptionell gesehen ist der Trigger Off Event der Mechanismus, den Sie verwenden, um die Situation zu definieren, in der die entsprechende Strategie aufhören soll, die durch den Trigger On Event signalisierte Handelsmöglichkeit zu berücksichtigen. Das heißt, Sie verwenden den Trigger Off Event, um das Szenario zu beschreiben, in dem die Handelsidee, die der Strategie zugrunde liegt, ungültig wird.",
                    "updated": 1641648165372
                }
            ]
        },
        {
            "style": "Text",
            "text": "Once a strategy is triggered-on, only two possible scenarios may follow. Either the take position event is triggered, thus, taking a position, or the trigger-off event is triggered first.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда стратегия включена, возможны только два сценария развития событий. Либо срабатывает событие открытия позиции, что приводит к открытию позиции, либо сначала срабатывает событие закрытия позиции.",
                    "updated": 1639736885955
                },
                {
                    "language": "DE",
                    "text": "Sobald eine Strategie getriggert wird, können nur zwei mögliche Szenarien folgen. Entweder wird der Take Position Event ausgelöst und damit eine Position eröffnet, oder der Trigger Off Event wird zuerst ausgelöst.",
                    "updated": 1641648219745
                }
            ]
        },
        {
            "style": "Text",
            "text": "In the first scenario, the strategy remains on until the position is closed. As the position is closed, the strategy is triggered-off. In the second scenario, the strategy is triggered-off immediately.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В первом случае стратегия остается включенной до тех пор, пока позиция не будет закрыта. Когда позиция закрывается, стратегия отключается. Во втором случае стратегия срабатывает немедленно.",
                    "updated": 1639736973779
                },
                {
                    "language": "DE",
                    "text": "Im ersten Fall bleibt die Strategie aktiviert, bis die Position geschlossen wird. Wenn die Position geschlossen wird, wird die Strategie deaktiviert. Im zweiten Szenario wird die Strategie sofort deaktiviert.",
                    "updated": 1641648279114
                }
            ]
        }
    ]
}