{
    "type": "Project",
    "definition": {
        "text": "The Superalgos infrastructure integrates different projects. The main goal of these integrations is to automate cross-project operations, extracting valuable information from blockchains or the particular domain of each project to be used on Trading Systems.",
        "updated": 1613841611271,
        "translations": [
            {
                "language": "ES",
                "text": "La infraestructura de Superalgos integra diferentes proyectos. El objetivo principal de estas integraciones es automatizar las operaciones entre proyectos, extrayendo información valiosa del blockchain o el dominio particular de cada proyecto para ser utilizado en los sistemas de Trading.\n",
                "updated": 1624283023464
            },
            {
                "language": "DE",
                "text": "Die Superalgos-Infrastruktur integriert verschiedene Projekte. Das Hauptziel dieser Integrationen ist es, projektübergreifende Operationen zu automatisieren und wertvolle Informationen aus Blockchains oder der jeweiligen Domäne eines jeden Projekts zu extrahieren, um sie in Trading Systems zu verwenden.",
                "updated": 1636669199719
            },
            {
                "language": "RU",
                "text": "Инфраструктура Superalgos объединяет разные проекты. Основная цель этих интеграций - автоматизировать межпроектные операции, извлекая ценную информацию из блокчейнов или конкретной области каждого проекта, которая будет использоваться в торговых системах.",
                "updated": 1638287476258
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The first project is Superalgos itselft, witch provides a lowest level infraestructure that any other integrated project can freely reuse. On the pipeline we have these projects waiting to be integrated soon:",
            "updated": 1609144390540,
            "translations": [
                {
                    "language": "DE",
                    "text": "Das erste Projekt ist Superalgos selbst, das eine Infrastruktur der untersten Ebene bereitstellt, die jedes andere integrierte Projekt frei wiederverwenden kann. In der Pipeline haben wir diese Projekte, die darauf warten, bald integriert zu werden:",
                    "updated": 1636669240132
                },
                {
                    "language": "RU",
                    "text": "Первый проект - это сам Superalgos, который обеспечивает инфраструктуру самого низкого уровня, которую любой другой интегрированный проект может свободно повторно использовать. В разработке находятся следующие проекты, которые скоро будут интегрированы:",
                    "updated": 1638287541874
                }
            ]
        },
        {
            "style": "Table",
            "text": "| # | Project |\n| 1 | Superalgos |\n| 2 | Ethereum |",
            "updated": 1609144471691
        },
        {
            "style": "Text",
            "text": "Once integrated, each project will provide even more infraestructure which can later be used by other projects to be integrated after that. For example, once Ethereum is fully integrated, it will enable DeFi projects to be integrated on top of it.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Sobald es integriert ist, wird jedes Projekt noch mehr Infrastruktur bereitstellen, die später von anderen Projekten genutzt werden kann, die danach integriert werden. Sobald beispielsweise Ethereum vollständig integriert ist, können darauf aufbauend DeFi-Projekte integriert werden.",
                    "updated": 1636669265115
                },
                {
                    "language": "RU",
                    "text": "После интеграции каждый проект будет предоставлять еще больше инфраструктуры, которая впоследствии может быть использована другими проектами для интеграции после этого. Например, как только Ethereum будет полностью интегрирован, он позволит интегрировать проекты DeFi поверх него.",
                    "updated": 1638287570052
                }
            ]
        }
    ]
}