{
    "type": "Data Tasks",
    "paragraphs": [
        {
            "style": "Text",
            "text": "Having access to quality information is a crucial element of trading. For that reason, Superalgos strives to give users full control over how, where, and when data is processed. You will use this section of the network hierarchy to exert that control.",
            "updated": 1609613582225,
            "translations": [
                {
                    "language": "ES",
                    "text": "Tener acceso a información de calidad es un elemento crucial en el trading. Por esta razón, Superalgos se esfuerza en dar a los usuarios total control sobre cómo, dónde, y cuándo se procesan los datos. Utilizarás esta sección de la jerarquía del nodo Network para ejercer este control.",
                    "updated": 1638156495599
                },
                {
                    "language": "RU",
                    "text": "Доступ к качественной информации - важный элемент торговли. По этой причине Superalgos стремится предоставить пользователям полный контроль над тем, как, где и когда обрабатываются данные. Вы будете использовать этот раздел сетевой иерархии для осуществления этого контроля.",
                    "updated": 1638355167748
                }
            ]
        },
        {
            "style": "Text",
            "text": "Data mining is done through tasks running instances of sensor and indicator bots. The data structure under this node allows organizing the data mining operation by project, exchange, market, and data mine.",
            "updated": 1609618336656,
            "translations": [
                {
                    "language": "ES",
                    "text": "El Data mining se realiza a través de tareas que ejecutan instancias de Sensor Bots e Indicator Bots. La estructura de datos bajo este nodo permite organizar las operaciones de Data mining por Projecto, Exchange, Market y Data Mine.",
                    "updated": 1638156512510
                },
                {
                    "language": "RU",
                    "text": "Интеллектуальный анализ данных выполняется с помощью задач, запускающих экземпляры сенсорных и индикаторных ботов. Структура данных под этим узлом позволяет организовать операцию интеллектуального анализа данных по проектам, биржам, рынкам и добыче данных.",
                    "updated": 1638355196622
                }
            ]
        },
        {
            "style": "Text",
            "text": "The setup of the data mining operation may be done using the Install Market function of the market you wish to install as defined in the Crypto Ecosystem hierarchy under the exchange markets node.",
            "updated": 1609618361260,
            "translations": [
                {
                    "language": "ES",
                    "text": "La configuración de la operación de Data mining se puede realizar usando la función Install Market del Market que se desea instalar definido en la jerarquía del Crypto Ecosystem, bajo el nodo de mercado del exchange.",
                    "updated": 1638156525730
                },
                {
                    "language": "RU",
                    "text": "Настройка операции интеллектуального анализа данных может быть выполнена с помощью функции «Install Market» для рынка, который вы хотите установить, как определено в иерархии Crypto Ecosystem в узле биржевых рынков.",
                    "updated": 1638355283215
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may also set up data mining tasks by using the different functions in this section of the hierarchy, starting with the options in the menu of this node. This route offers finer control over what tasks you set up, and how.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Se pueden establecer tareas de Data mining a través de las diferentes funciones en esta sección de la jerarquía, comenzando con las opciones del menú de este nodo. Esta ruta ofrece un control más preciso sobre qué tareas se configuran y cómo.",
                    "updated": 1638156530776
                },
                {
                    "language": "RU",
                    "text": "Вы также можете настроить задачи интеллектуального анализа данных, используя различные функции в этом разделе иерархии, начиная с параметров в меню этого узла. Этот маршрут предлагает более точный контроль над тем, какие задачи вы настраиваете и как.",
                    "updated": 1638355323726
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Deleting Node Warning",
            "updated": 1610122758940
        }
    ],
    "definition": {
        "text": "Data tasks referes to data-mining, that is, the activity of processing data. You need to process data to feed charts, and so that your trading systems may make decisions based on quality information.",
        "updated": 1609618235002,
        "translations": [
            {
                "language": "ES",
                "text": "Data tasks refiere a la minería de datos, es decir, la actividad de procesamiento de datos. Necesitarás procesar datos para alimentar gráficos y para que sus sistemas de trading puedan tomar decisiones basadas en información de calidad.",
                "updated": 1624283536808,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Data Tasks относятся к интеллектуальному анализу данных, т.е. к деятельности по обработке данных. Вам необходимо обрабатывать данные для подачи графиков, чтобы Ваши торговые системы могли принимать решения на основе качественной информации.",
                "updated": 1638356535434
            }
        ]
    }
}