{
    "tutorial": "Basic Education",
    "pageNumber": 44,
    "type": "Tutorial Step - Placing Plugins",
    "definition": {
        "text": "To place a plugin in a workspace you must select the option to add the missing plugins on the node of the matching type!",
        "icon": {
            "name": "plugin-trading-systems",
            "project": "Superalgos"
        },
        "updated": 1615925984822,
        "translations": [
            {
                "language": "IT",
                "text": "Per inserire un plugin nel Workspace devi selezionare l' opzione per aggiungere i plugins mancanti sul nodo del tipo corrispondente!",
                "updated": 1619589885057
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Let's give it a shot! Select Add Missing Trading Systems in the Plugin Trading Systems node!",
            "updated": 1615926961650,
            "translations": [
                {
                    "language": "IT",
                    "text": "Provaci! Seleziona Add Missing Trading Systems nel nodo Plugin Trading Systems!",
                    "updated": 1619589922157
                }
            ]
        },
        {
            "style": "Text",
            "text": "New Plugin File nodes are created for every plugin in the \\Plugins\\Trading-Systems folder! You may delete the Plugin File nodes you don't need and keep the ones you do need! Now you may pin the Plugin File Position node where you wish to place the actual plugin data structure!",
            "updated": 1615927372538,
            "translations": [
                {
                    "language": "IT",
                    "text": "Per ogni plugin nella cartella \\Plugins\\Trading-Systems, viene creato un nodo Plugin File! Cancella i nodi che non ti servono, e magari fissare il nodo Plugin File Position nel punto in cui vuoi piazzare la struttura!",
                    "updated": 1619590168274
                }
            ]
        },
        {
            "style": "Success",
            "text": "Plugins will be added the next time you load the workspace! If you wish to test it, refresh!",
            "updated": 1615978260752,
            "translations": [
                {
                    "language": "IT",
                    "text": "I Plugins verranno riaggiunti la prossima volta che carichi il workspace.",
                    "updated": 1619590143992
                }
            ]
        }
    ]
}