{
    "tutorial": "Basic Education",
    "pageNumber": 4,
    "type": "Tutorial Step - Let's Start With the Menu",
    "definition": {
        "text": "The left-hand side of a node's menu is common to most nodes. The right-hand side, however, is specific to the type of node!",
        "updated": 1615315122923,
        "icon": {
            "name": "unpinned-node",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Il lato sinistro del menù di un nodo è generalmente sempre uguale. Il lato destro, invece, è specifico per ogni tipo di nodo!",
                "updated": 1619459213047
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Note",
            "text": "Let's take a close look at the left-hand side!",
            "updated": 1615313694440,
            "translations": [
                {
                    "language": "IT",
                    "text": "Diamo un'occhiata al lato sinistro!",
                    "updated": 1619459263897
                }
            ]
        },
        {
            "style": "Text",
            "text": "The design space functions under the paradigm of a self-organizing workspace in which nodes tend to find their place guided by certain arrangement properties that you may control from the node's menu.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il design space è basato sul paradigma di un workspace auto-organizzato, in cui i nodi tendono a trovare la propria posizione guidati da specifiche proprietà che puoi controllare dal menù di ogni nodo.",
                    "updated": 1619459329778
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Click the pin button on the top-left corner of the Session Base Asset node. Now drag the node away and release it! Now drag and release any other node without pinning it. See the difference?",
            "updated": 1615315170878,
            "translations": [
                {
                    "language": "IT",
                    "text": "Clicca il pulsante \"pin\" nell'angolo in alto a sinistra del nodo Session Base Asset. Ora trascina il nodo e rilascialo! Poi trascina e rilascia un qualsiasi altro nodo senza cliccare \"pin\". Vedi la differenza?",
                    "updated": 1619459430359
                }
            ]
        }
    ]
}