{
    "tutorial": "Basic Education",
    "pageNumber": 17,
    "type": "Tutorial Step - Freeze!",
    "definition": {
        "text": "The freeze button makes sense under very specific circumstances: when physics are activated at the level of the Design Space.",
        "updated": 1615543120064,
        "icon": {
            "name": "freeze-structure-of-nodes",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "La proprietà freeze ha senso in circostanze molto specifiche: quando le animazioni sono attive a livello del Design Space.",
                "updated": 1619461541404
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Design Space offers some customization features, one of which is activating the physics of the universe. When physics is on, the whole space becomes alive!",
            "updated": 1615544003132,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il Design Space offre diverse personalizzazioni, tra le quali l'attivazione dell'animazione dell'universo. Quando è attiva, l'intero spazio diventa vivo!",
                    "updated": 1619461604832
                }
            ]
        },
        {
            "style": "Note",
            "text": "We won't go into that rabbit hole at this point as it's not in the basic education curriculum!",
            "updated": 1615544598765,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non approfondiremo la materia ora: non è parte del curriculum di educazione base!",
                    "updated": 1619461641768
                }
            ]
        },
        {
            "style": "Text",
            "text": "The freeze option freezes the node’s chain connections with its parent and offspring and connecting lines turn blue. Freezing releases CPU resources when physics animations are on, as the system stops calculating nodes' positions and status.",
            "updated": 1615544553909,
            "translations": [
                {
                    "language": "IT",
                    "text": "L'opzione freeze blocca le connessioni del nodo con il padre e i propri figli: le linee di collegamento diventano blu. Quando le animazioni sono attive, questa opzione rilascia le risorse della CPU perchè il sistema smette di calcolare la posizione e lo stato del nodo.",
                    "updated": 1619461763901
                }
            ]
        }
    ]
}