{
    "tutorial": "Basic Education",
    "pageNumber": 29,
    "type": "Tutorial Step - Is It Done?",
    "definition": {
        "text": "If you haven't yet, go ahead and establish a reference from the Trading System Reference to the Lightning Strike Trading System!",
        "updated": 1615808208398,
        "icon": {
            "name": "trading-system",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Se non lo hai già fatto, stabilisci una reference dal Trading System Reference al Lightning Strike Trading System!",
                "updated": 1619502021908
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may find this technique to establish a reference to be a bit clumsy or impractical. If you have a better idea or know how to improve it, feel free to open a feature request issue. Make sure you consider the following:",
            "updated": 1615808367637,
            "translations": [
                {
                    "language": "IT",
                    "text": "Forse troverai questa tecnica per creare le reference un po' caotica o poco pratica. Se hai idee su come migliorarla, apri pure una feature request issue su Github. Considerà però quanto segue:",
                    "updated": 1619502100883
                }
            ]
        },
        {
            "style": "List",
            "text": "In a complex workspace, there may be hundreds of nodes that may be able to accept a reference.",
            "translations": [
                {
                    "language": "IT",
                    "text": "In un workspace complesso, centinaia di nodi potrebbero accettare una reference.",
                    "updated": 1619502129280
                }
            ]
        },
        {
            "style": "List",
            "text": "The reference must be established unequivocally from a specific node to another specific node.",
            "updated": 1615808355918,
            "translations": [
                {
                    "language": "IT",
                    "text": "La reference deve essere stabilita in modo univoco tra una coppia di nodi.",
                    "updated": 1619502166682
                }
            ]
        },
        {
            "style": "Success",
            "text": "In the meantime, let me assure you it's not that hard once you do it a couple of times!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ti assicuro che comunque non è complicato se lo fai un paio di volte!",
                    "updated": 1619502186118
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}