{
    "tutorial": "Basic Education",
    "pageNumber": 27,
    "type": "Tutorial Step - Establishing References",
    "definition": {
        "text": "At some point, you will need to establish a reference, so let's do some basic training to develop the formidable skills required!",
        "updated": 1615806228297,
        "icon": {
            "name": "delink-node",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "A un certo punto, dovrai stabilire tu una reference con un nodo. Quindi tanto vale imparare subito come si fa!",
                "updated": 1619501421155
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Click the delink button on the menu of the Trading System Reference node!",
            "updated": 1615806300267,
            "translations": [
                {
                    "language": "IT",
                    "text": "Clicca sul bottone \"delink\" nel menù del nodo Trading System Reference!",
                    "updated": 1619501451689
                }
            ]
        },
        {
            "style": "Note",
            "text": "You just broke the reference! But don't worry... we'll recreate it in the next steps!",
            "updated": 1615806406944,
            "translations": [
                {
                    "language": "IT",
                    "text": "Hai rotto la reference! Ma non preoccuparti...la ricreeremo nei prossimi step!",
                    "updated": 1619501479311
                }
            ]
        },
        {
            "style": "Text",
            "text": "To establish a reference, follow the same process you use to attach a node. That is, right-click on the node where the reference will originate, drag it close to the node with which the reference will be established, and release the click once the orange ring shows up!",
            "updated": 1615806699660,
            "translations": [
                {
                    "language": "IT",
                    "text": "Per stabilire una reference, segui lo stesso processo usato per collegare un nodo: clicca con il tasto destro sul nodo da cui la reference avrà origine, trascinala vicino al nodo con cui vuoi stabilire il collegamento e rilascia quando vedi un anello arancione!",
                    "updated": 1619501669049
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}