{
    "tutorial": "Basic Education",
    "pageNumber": 25,
    "type": "Tutorial Step - Let's See Some References",
    "definition": {
        "text": "Notice the two nodes under the Backtesting Session: Trading System Reference and Trading Engine Reference. Why do we need these nodes?",
        "updated": 1615798435799,
        "icon": {
            "name": "trading-system-reference",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Nota i due nodi sotto Backtesting Session: Trading System Reference e Trading Engine Reference. A cosa servono questi nodi?",
                "updated": 1619500944274
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Backtesting Session needs to reference the Trading System so that it may obtain the rules for trading. It must also reference the Trading Engine so that it may store information relative to the trading session. However, a node may establish only one outgoing reference!",
            "updated": 1615798936552,
            "translations": [
                {
                    "language": "IT",
                    "text": "Backtesting Session deve referenziare il Trading System così da ottenere le regole per il trading. Deve anche avere un riferimento al Trading Engine così da avere info relative alla sessione di trading. Un nodo può però stabilire solo una reference in uscita!",
                    "updated": 1619501079718
                }
            ]
        },
        {
            "style": "Note",
            "text": "That is why these nodes exist: they are an aid to the Backtesting Session node so that each of them may reference one node!",
            "updated": 1615798882867,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ecco perchè questi nodi esistono: sono un supporto per il nodo Backtesting Session, così che ognuno di essi abbia un collegamento in uscita con un altro nodo!",
                    "updated": 1619501188069
                }
            ]
        }
    ]
}