{
    "tutorial": "Basic Education",
    "pageNumber": 43,
    "type": "Tutorial Step - Positioning Plugins",
    "definition": {
        "text": "Here's the crazy bit... the Plugin File Position node determines where in the workspace the plugin is placed!",
        "updated": 1615921131447,
        "icon": {
            "name": "plugin-file-position",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Il nodo Plugin File Position determina dove sarà posizionato il nodo nel workspace!",
                "updated": 1619554715666
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "That is why you found the Trading System node on top of the Plugin File Position node!",
            "updated": 1615920675491,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ecco perchè trovi il nodo Trading System sopra il nodo Plugin File Position!",
                    "updated": 1619554752815
                }
            ]
        },
        {
            "style": "Success",
            "text": "If you deleted the Trading System node, it would show up again the next time you reload the workspace! Plugins are loaded from the plugin file every time the workspace is loaded!",
            "updated": 1615920995477,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se cancelli il nodo Trading System, ricomparirà la prossima volta che ricarichi il workspace. I Plugins sono caricati dal file plugin ogni volta che il workspace viene caricato!",
                    "updated": 1619554795779
                }
            ]
        },
        {
            "style": "Text",
            "text": "Feel free to try it! If so you wish, you may delete the Trading System node and refresh the page. Bear in mind that you will need to find the Basic Education tutorial and click Resume on the menu to continue!",
            "updated": 1615921187621,
            "translations": [
                {
                    "language": "IT",
                    "text": "Prova, se vuoi! Puoi anche cancellare il nodo Trading System e aggiornare la pagina. Tieni a mente che per continuare da qui dovrai cercare il Basic Education Tutorial e cliccare Resume sul menù!",
                    "updated": 1619554844566
                }
            ]
        }
    ]
}