{
    "tutorial": "Basic Education",
    "pageNumber": 34,
    "type": "Tutorial Step - One Last Backup!",
    "definition": {
        "text": "Let's try the third example! Notice the references flowing from polygon vertices to points under the Chart Points node!",
        "icon": {
            "name": "backup-entity",
            "project": "Superalgos"
        },
        "updated": 1615828736799,
        "translations": [
            {
                "language": "IT",
                "text": "Proviamo il terzo esempio! Nota le references che vanno dai Polygon Vertices ai punti sotto il nodo Chart Points!",
                "updated": 1619503169774
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Take a backup of the Shapes node and restore it on the side without deleting the original. Then repeat, but deleting the original before restoring the backup!",
            "updated": 1615828883417,
            "translations": [
                {
                    "language": "IT",
                    "text": "Fai un backup del nodo Shapes e ripristinalo senza cancellare l'originale. Poi ripeti l'operazione, cancellando prima il nodo originale.",
                    "updated": 1619503205236
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Notice that in the first case, references point to the original points turning into external references! On the contrary, in the second case, references remain internal!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Nota che, nel primo caso, le references si sono trasformate in reference esterne! Nel secondo caso, invece, sono rimaste interne!",
                    "updated": 1619503254934
                }
            ]
        },
        {
            "style": "Success",
            "text": "Remember that references remain internal only when you delete the original structure first!",
            "updated": 1615828954919,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ricorda che le references rimangono interne solo cancellando la struttura originale prima del ripristino!",
                    "updated": 1619503283883
                }
            ]
        }
    ]
}