{
    "tutorial": "Basic Education",
    "pageNumber": 22,
    "type": "Tutorial Step - Irrelevant Nodes",
    "definition": {
        "text": "Nodes that are not attached to a hierarchy are not computed. They exist in the workspace, but they don't affect the workings of the system at any level.",
        "updated": 1615575416918,
        "icon": {
            "name": "detach-node",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "I nodi che non appartengono a una gerarchia non sono calcolati. Esistono nel workspace, ma non influenzano i calcoli del sistema in alcun modo.",
                "updated": 1619467123969
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This means that you may keep as many structures of nodes detached from hierarchies, for as long as you wish, keeping them at hand for later use, or for whatever reason.",
            "updated": 1615580307483,
            "translations": [
                {
                    "language": "IT",
                    "text": "È quindi possibile conservare un numero qualsiasi di nodi o strutture scollegati dalle gerarchie, per quanto tempo si desidera, tenendoli a disposizione per un uso futuro o per un qualsiasi altro motivo.",
                    "updated": 1619467283026
                }
            ]
        },
        {
            "style": "Success",
            "text": "A common scenario is keeping multiple versions of certain definitions while building strategies, so that you may test a set of rules and switch to other rules for the next run. You may even keep multiple versions of entire strategies!",
            "updated": 1615575707975,
            "translations": [
                {
                    "language": "IT",
                    "text": "Uno scenario comune è mantenere versioni multiple di alcune configurazioni mentre si costruiscono strategie, così da poter testare un set di regole e cambiarlo con un altro al test successivo. È perfino possibile mantenere diverse versioni di intere strategie!",
                    "updated": 1619467375126
                }
            ]
        }
    ]
}