{
    "tutorial": "Basic Education",
    "pageNumber": 35,
    "type": "Tutorial Step - No Need to Memorize",
    "definition": {
        "text": "I hope you got to grasp the intricacies of backups and how references are affected in each particular restoration case!",
        "updated": 1615831565379,
        "icon": {
            "name": "docs-warning-style",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Spero tu abbia afferrato i meccanismi dei backup e di come le references si comportano nei vari casi di ripristino!",
                "updated": 1619503394556
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You don't need to memorize the individual cases. Instead, if you understand the underlying mechanism involving references, then you may deduce the behavior on each case!",
            "updated": 1615838818500,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non hai bisogno di memorizzare ogni scenario. Se comprendi come funzionano le references, puoi dedurne il comportamento in ogni caso!",
                    "updated": 1619503471627
                }
            ]
        },
        {
            "style": "Note",
            "text": "Remember that each node has a specific ID! When a reference is established, both nodes involved have a unique ID. Outgoing references do not depend on the node's ID, but incoming references do! If the backed up node may be restored with the same ID, incoming references will persist; otherwise, they will change or be lost!",
            "updated": 1615831079650,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ricorda che ogni nodo ha un ID! Quando viene stabilita una reference, entrambi i nodi hanno un ID univoco. Le references in uscita non dipendono dall'ID del nodo, ma quelle in entrata sì! Se il nodo salvato può essere ripristinato con lo stesso ID allora le references in entrata saranno mantenute, altrimenti cambieranno o andranno perse!",
                    "updated": 1619503580082
                }
            ]
        }
    ]
}