{
    "tutorial": "Contribute to Superalgos!",
    "pageNumber": 5,
    "type": "Tutorial Step - A Brilliant Idea",
    "definition": {
        "text": "Superalgos is free for everyone because we want your help! We want the best minds in the space to help us build the ultimate trading automation platform!",
        "icon": {
            "name": "nodes-highlights",
            "project": "Superalgos"
        },
        "updated": 1610719931963,
        "translations": [
            {
                "language": "IT",
                "text": "Superalgos è gratis per tutti, perchè vogliamo il tuo aiuto! Vogliamo le menti migliori e più volenterose per aiutarci a costruire la piattaforma di trading automatizzato definitiva!",
                "updated": 1619632162177
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Your first contribution is your feedback!",
            "updated": 1610715230137,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il tuo primo contributo è il tuo feedback!",
                    "updated": 1619632177630
                }
            ]
        },
        {
            "style": "Text",
            "text": "You've likely spent hours discovering Superalgos. We want to have your first impression, fresh from the recent experience! And we want your initial feedback to be the first of many contributions to the project.",
            "updated": 1611594469593,
            "translations": [
                {
                    "language": "IT",
                    "text": "Probabilmente ormai hai investito ore scoprendo Superalgos. Vorremmo sapere la tua prima impressione, fresca di un'esperienza recente! E vogliamo che il tuo feedback sia il primo di molti contributi al progetto.",
                    "updated": 1619632239016
                }
            ]
        },
        {
            "style": "Success",
            "text": "You don't need to be a star programmer or professional trader to contribute. Every user is expected to give back! I'll tell you how!",
            "updated": 1610822419407,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non devi essere un super-programmatore o un trader professionista per contribuire. Ci si aspetta che ogni utente dia un contributo! Ti dico come!",
                    "updated": 1619632343742
                }
            ]
        }
    ]
}