{
    "tutorial": "Contribute to Superalgos!",
    "pageNumber": 10,
    "type": "Tutorial Step - Before You Switch",
    "definition": {
        "text": "There are a few things you should consider every time you switch branches! Let's go through a quick list before you proceed!",
        "icon": {
            "name": "bullet-warning",
            "project": "Superalgos"
        },
        "updated": 1618147991903,
        "translations": [
            {
                "language": "IT",
                "text": "Ci sono un paio di cose da considerare ogni volta che cambi branch! Vediamone una lista prima di continuare!",
                "updated": 1619634039951
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "It may happen that the workspaces or other data structures in the master branch are not compatible with those in the other branch.",
            "updated": 1618158546133,
            "translations": [
                {
                    "language": "IT",
                    "text": "Può succedere che il workspace o altri dati nel master branch non siano compatibili con quelli in altri branch.",
                    "updated": 1619634081336
                }
            ]
        },
        {
            "style": "List",
            "text": "If the current workspace is incompatible with the software in the other branch, the workspace may break upon reloading the app. In such a case, load one of the Plugin Workspaces of the new branch.",
            "updated": 1618158600251,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se il workspace corrente è incompatibile con il software di un altro branch, esso potrebbe corrompersi ricaricando l'app. In questo caso, carica uno dei Plugin Workspace del nuovo branch.",
                    "updated": 1619634165746
                }
            ]
        },
        {
            "style": "List",
            "text": "Even the structure of mined data may have changed!",
            "updated": 1617017781902,
            "translations": [
                {
                    "language": "IT",
                    "text": "Anche la struttura dei dati estratti potrebbe essere cambiata!",
                    "updated": 1619634182120
                }
            ]
        },
        {
            "style": "Important",
            "text": "Always check the README file in the branch of the repository you wish to access for any comments on backward compatibility. Before switching branches, back up your work!",
            "updated": 1618158675366,
            "translations": [
                {
                    "language": "IT",
                    "text": "Leggi sempre il file README nel branch a cui vuoi accedere per leggere le note sulla retrocompatibilità. Prima di cambiare branches, fai un backup del tuo lavoro!",
                    "updated": 1619634260507
                }
            ]
        }
    ]
}