{
    "tutorial": "Contribute to Superalgos!",
    "pageNumber": 11,
    "type": "Tutorial Step - Double Trouble?",
    "definition": {
        "text": "Many users choose to run the two branches from separate folders! This seems like a sensible solution for active contributors!",
        "updated": 1617018855666,
        "icon": {
            "name": "clone-entity",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Molti utenti scelgono di lanciare le branches da cartelle separate. È una buona soluzione per i contributors più attivi!",
                "updated": 1619634353624
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may have two clones of your fork running from separate folders, each on different branches.",
            "updated": 1618158812449,
            "translations": [
                {
                    "language": "IT",
                    "text": "Potresti avere due cloni del tuo fork che girano su cartelle diverse, ognuna su un diverso branch.",
                    "updated": 1619634392400
                }
            ]
        },
        {
            "style": "Note",
            "text": "Two instances of Superalogs running from different folders are completely independent. They run distinct workspaces and output unique data.",
            "updated": 1617018971209,
            "translations": [
                {
                    "language": "IT",
                    "text": "Due istanze di Superalgos eseguite da cartelle diverse sono completamente indipendenti. Contengono workspace separati e output diversi.",
                    "updated": 1619634452638
                }
            ]
        },
        {
            "style": "Success",
            "text": "Such a setup allows you to run the stable version for your production tasks, and the version in another branch to contribute and test new features! But you can't run two versions at the same time, unless you change ports! We won't go there now!",
            "updated": 1618148172616,
            "translations": [
                {
                    "language": "IT",
                    "text": "Questo setup ti permette di utilizzare la versione stabile contemporaneamente alla versione di un altro branch a cui vuoi contribuire, o su cui fai test! Ma non potrai lanciare due istanze separate insieme, a meno che non cambi le porte. Non parleremo di questo per ora!",
                    "updated": 1619634623463
                }
            ]
        }
    ]
}