{
    "tutorial": "Contribute to Superalgos!",
    "pageNumber": 9,
    "type": "Tutorial Step - Now the Current Branch",
    "definition": {
        "text": "If everything went well, you must have got a confirmation that the Contributions Branch was changed! Awesome!",
        "icon": {
            "name": "github",
            "project": "Superalgos"
        },
        "updated": 1616873181582,
        "translations": [
            {
                "language": "IT",
                "text": "Se tutto è andato bene, dovresti aver ricevuto una conferma che la Contributions Branch è cambiata! Fantastico!",
                "updated": 1619633713475
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Next in line is switching the Current Branch, but we need to run some checks first!",
            "updated": 1618154759190,
            "translations": [
                {
                    "language": "IT",
                    "text": "La prossima cosa da fare è cambiare la Current Branch, ma dobbiamo prima controllare un paio di cose!",
                    "updated": 1619633736968
                }
            ]
        },
        {
            "style": "Callout",
            "text": "If you forked the Superalgos repo before April 6th, 2021, follow the instructions on this page to create the plugins-docs branch. Otherwise, keep going!",
            "updated": 1618154888356,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se hai fatto il fork di Superalgos prima del 6 aprile 2021, segui le istruzioni su questa pagine per creare il branch Plugins-Docs. Altrimenti continua!",
                    "updated": 1619633825511
                }
            ]
        },
        {
            "style": "Text",
            "text": "When you switch branches, the app will run a series of Git commands that will download the software from the plugins-docs branch of your fork! The current software will be replaced on your disk! For that reason, you will need to close the app after switching. But let's discuss a couple more things before you proceed!",
            "updated": 1618159009151,
            "translations": [
                {
                    "language": "IT",
                    "text": "Quando cambi branch, l'app esegue una serie di comandi Git che scaricano il software dal branch Plugins-Docs del tuo fork! Il software corrente viene quindi rimpiazzato su disco. Per questo motivo, dovrai chiudere l'app dopo aver cambiato. Ma prima di continuare vediamo un altro paio di cose!",
                    "updated": 1619634001960
                }
            ]
        }
    ]
}