{
    "tutorial": "Contribute to Superalgos!",
    "pageNumber": 8,
    "type": "Tutorial Step - Switching Branches",
    "definition": {
        "text": "Superalgos allows you to switch branches directly from within the app! But, why would you want to switch branches?",
        "updated": 1618145423371,
        "icon": {
            "name": "github",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Superalgos ti permette di cambiare branches direttamente da dentro l'app! Ma perchè dovresti volerlo fare?",
                "updated": 1619633498230,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Superalgos is constantly improving. At some point, you may wish to try the software version in the develop branch. Maybe there is a new feature, or a fix for a bug that hasn't got to the master branch yet...",
            "updated": 1617007301530,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos è in costante evoluzione. A un certo punto, potresti voler provare la versione in sviluppo. Forse contiene una nuova funzionalità, o un fix non ancora portato nel branch master...",
                    "updated": 1619633561044,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Success",
            "text": "Or you may wish to submit a contribution, like in our case right now! Let's do it!",
            "updated": 1618145540691,
            "translations": [
                {
                    "language": "IT",
                    "text": "O magari vuoi mandare un contributo, come faremo noi adesso! Forza!",
                    "updated": 1619633608903,
                    "style": "Success"
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Scroll down the Docs page to the footer and select Plugins-Docs as your Contributions Branch! It's the option on the right-hand side, not in the center!",
            "updated": 1619794957137,
            "translations": [
                {
                    "language": "IT",
                    "text": "Scorri la pagina dei Docs fino al footer e selezione Plugins/Docs come Contributions Branch! È l'opzione sulla destra, non al centro!",
                    "updated": 1619633667745,
                    "style": "Callout"
                }
            ]
        }
    ]
}