{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 22,
    "type": "Tutorial Step - Need a Quick Reminder?",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "key-left"
        },
        "text": "At this point, I'm probably overflowing your hippocampus! But don't worry... you may go back to any previous step!",
        "translations": [
            {
                "language": "IT",
                "text": "Tutte queste informazioni ti avranno sovraccaricato l'ippocampo! Ma non preccuparti, puoi tornare indietro a qualunque step precedente.",
                "updated": 1614790380193,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If you ever need a reminder about any of these topics...",
            "translations": [
                {
                    "language": "IT",
                    "text": "Se mai ti servirà un ripasso su uno di quesi topic...",
                    "updated": 1614790424338,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "List",
            "text": "Find a Tutorial Topic and replay it! You may find me on the bottom-left corner of the design space, expand me, browse through the hierarchy of topics and steps, and click Play on any of them. Topics are arranged in a clockwise direction, starting from the right-hand side of the main Tutorial node.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Cerca un Tutorial Topic e ri-eseguilo! Puoi trovarmi nell'angolo in basso a sinistra del Design Space. Espandimi, naviga nella gerarchia dei topics e degli steps e clicca Play su uno qualsiasi di questi. I topics sono strutturati in senso orario, a partire dal lato destro del nodo Tutorial principale.",
                    "updated": 1614790602319,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Need a Quick Reminder? Find the step under the Tutorials & Help topic below. Then click Stop, and restart by clicking Play on the said Tutorial Step!",
            "updated": 1611076850328,
            "translations": [
                {
                    "language": "IT",
                    "text": "Hai bisogno di un ripasso veloce? Trova lo step sotto il topic Tutorial & Help. Poi clicca Stop, e ricomincia cliccando Play su quel Tutorial Step!",
                    "updated": 1614790783510,
                    "style": "Callout"
                }
            ]
        }
    ]
}