{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 85,
    "type": "Tutorial Step - Feedback Loops",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "limit-buy-order"
        },
        "text": "Lets take a look at another example to let the notion of the constant feedback loop sink in before we move on!",
        "translations": [
            {
                "language": "IT",
                "text": "Diamo un'occhiata a un altro esempio per assorbire bene la nozione di \"constant feedback loop\" prima di proseguire!",
                "updated": 1618068120939
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This is the data structure where information about limit buy orders is kept.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Questa è la struttura di dati dove si trovano le informazioni sui limit buy orders.",
                    "updated": 1618068157301
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Go to the Trading Engine layers manager on the charts (the second counting from the left). Scroll down and turn on the Limit Buy Orders layer. Now swipe the mouse pointer over a few of the buy orders and check the effect on the nodes on the design space.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Vai al layer manager del Trading Engine sul grafico (il secondo da sinistra). Scorri verso il basso e attiva il layer dei Limit Buy Orders. Ora passa con il mouse su alcuni dei buy orders e osserva l'effetto sui nodi nel Design Space.",
                    "updated": 1618068248928
                }
            ]
        },
        {
            "style": "Text",
            "text": "Can you envision the implications of having this level of control over the data managed by the trading bot?",
            "translations": [
                {
                    "language": "IT",
                    "text": "Capisci le implicazioni di avere un tale livello di controllo sui dati su cui lavora il Trading Bot?",
                    "updated": 1618068321644
                }
            ]
        }
    ]
}