{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 30,
    "type": "Tutorial Step - Time to Stop!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "stop"
        },
        "text": "We are not going to run a Live Trading Session just yet, so there is no point in keeping our data mining running at this point.",
        "translations": [
            {
                "language": "IT",
                "text": "Non ci lanceremo subito in una Live Trading Session, quindi non c'è motivo di mantenere attivo il data mining.",
                "updated": 1614846160007,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Sekarang kita tidak akan menjalankan Live Trading Session, jadi tidak ada gunanya data mining berjalan saat ini.",
                "updated": 1616773798618,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "There are two main use cases for running Data Tasks:",
            "updated": 1616415730741,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ci sono due casi d'uso principali per le Data Tasks:",
                    "updated": 1618646593100,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Ada dua kasusutama untuk menjalankan Data Tasks:",
                    "updated": 1616774098023,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "List",
            "text": "To process historic data: You may want to process a datetime range of any given Market to run a Backtesting Session, or to process new indicators.",
            "updated": 1610617009486,
            "translations": [
                {
                    "language": "IT",
                    "text": "<b>Per processare dati storici:</b> potresti voler elaborare un intervallo di tempo di un Market per una Backtesting Session, o per generare nuovi indicatori.",
                    "updated": 1614846254449,
                    "style": "List"
                },
                {
                    "language": "ID",
                    "text": "Untuk memproses data historis: Kamu mungkin ingin memproses range datetime dari Market untuk menjalankan Backtesting Session, atau memproses indicators baru.",
                    "updated": 1616773908847,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "To run a live session:   Live sessions of different types, like Paper Trading Session, Forward Testing Session, and Live Trading Session, all need a live market feed.",
            "updated": 1610619757862,
            "translations": [
                {
                    "language": "IT",
                    "text": "<b>Per eseguire una live session:</b> live session di tipo diverso, come Paper Trading Session, Forward Testing Session e Live Trading Session, hanno tutte bisogno di un market feed live.",
                    "updated": 1614846320422,
                    "style": "List"
                },
                {
                    "language": "ID",
                    "text": "Untuk menjalankan live session: Live sessions dari tipe berbeda, seperti Paper Trading Session, Forward Testing Session, dan Live Trading Session, membutuhkan umpan live market.",
                    "updated": 1616774152845,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Callout",
            "text": "If all processes are up to date, then select Stop All Tasks in the Masters Task Manager. If not, wait a bit longer!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Se tutti i processi sono up to date, seleziona Stop All Tasks nel Task Manager. Altrimenti aspetta ancora un po'.",
                    "updated": 1618646617286,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Jika semua proses up to date, pilih Stop All Tasks pada Masters Task Manager. Jika tidak, tunggu lebih lama!",
                    "updated": 1616774172365,
                    "style": "Callout"
                }
            ],
            "updated": 1616415772977
        }
    ]
}