{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 111,
    "type": "Tutorial Step - Ready for More Tutorials?",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "tutorial"
        },
        "text": "Not to brag, but I can't stress enough how important it is that you make all tutorials available before venturing on your own!",
        "updated": 1610984910896,
        "translations": [
            {
                "language": "IT",
                "text": "Non voglio stressarti, ma non smetterò mai di ripetere quanto sia importante che tu segua tutti i tutorial prima di avventurarti da solo!",
                "updated": 1618074463758
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The system is vast and covers complex matters. Going solo on your first days with Superalgos is only recommended for people who enjoy banging their heads against the wall!",
            "updated": 1610956232418,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il sistema è enorme e copre concetti complessi. Iniziare avventurandosi da solo in Superalgos è raccomandato solo a coloro a cui piace finire per sbattere la testa contro il muro!",
                    "updated": 1618074517616
                }
            ]
        },
        {
            "style": "Success",
            "text": "The First Steps Tutorials book to your right provides all the details on the best way to invest your time learning Superalgos. ",
            "updated": 1616706102160,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il First Steps Tutorials alla tua destra fornisce tutti i dettagli sul miglior modo di investire il tuo tempo per imparare Superalgos.",
                    "updated": 1618074583238
                }
            ]
        },
        {
            "style": "Note",
            "text": "Before you finish, I will leave you with the next best tutorial in the series!",
            "updated": 1616706133031,
            "translations": [
                {
                    "language": "IT",
                    "text": "Prima di terminare, ti lascio con il prossimo miglior tutorial della serie!",
                    "updated": 1618074621074
                }
            ]
        }
    ]
}