{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 20,
    "type": "Tutorial Step - A Bit About Tutorials...",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "tutorial"
        },
        "text": "Before we get back to business, let me tell you a few things about how we&mdash;tutorials&mdash;work.",
        "translations": [
            {
                "language": "IT",
                "text": "Prima di tornare al lavoro, lascia che ti spieghi un paio di cose su come funzioniamo noi tutorial.",
                "updated": 1614790205512,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "In brief, you're the boss!",
            "updated": 1616415192952,
            "translations": [
                {
                    "language": "IT",
                    "text": "Questo è il concetto più importante: sei tu il boss! Puoi stoppare un tutorial e saltare step o interi capitoli in qualsiasi momento. Una volta che sei pronto a riprendere, ci trovi nell'angolo in basso a sinistra del Design Space. Seleziona Resume nel menu per riprendere da dove ti sei fermato, o dal primo step saltato. Oppure seleziona Play per ricominciare da capo!",
                    "updated": 1614789696848,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may stop a tutorial and skip steps—or entire topics—at any point. Once you're ready to pick up the lesson again, find us on the bottom section of the design space. Select Resume on the menu to start where you left, or on the first step you  skipped. Select Play to start from the beginning!",
            "updated": 1616415232478
        },
        {
            "style": "Callout",
            "text": "Let's try that! Click the Stop button below, and once I'm gone, open my menu and select Resume.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Provaci! Premi il pulsante Stop qui sotto, e una volta che sono sparito apri il mio menu e seleziona Resume.",
                    "updated": 1614790103478,
                    "style": "Callout"
                }
            ]
        }
    ]
}