{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 108,
    "type": "Tutorial Step - A Couple More Things!",
    "definition": {
        "text": "There're a couple more things I want to tell you about before I let you go! Bear with me!",
        "updated": 1619810326034,
        "icon": {
            "name": "strategy-counters",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Mancano ancora un paio di cose prima che ci salutiamo! Coraggio!",
                "updated": 1618073095923,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "I'll give you a quick introduction on what we are working on for upcoming versions of Superalgos! I mentioned Machine Learning algorithms, but there's more! It has to do with integrating crypto projects!",
            "updated": 1611583731733,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ti dò un'introduzione rapida di ciò su cui stiamo lavorando per la prossima versione. Ho menzionato algoritmi di Machine Learning, ma c'è di più! Riguarda l'integrazione con dei progetti crypto!",
                    "updated": 1618073169920,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "I also want to let you know that—if you appreciate what we are doing—you can help! Tens of thousands of hours of hard work have gone into building Superalgos and bringing it to its current state. I hope you can take a couple of minutes of your time to give back, and I'll be happy to tell you where to start!",
            "updated": 1611584131359,
            "translations": [
                {
                    "language": "IT",
                    "text": "Volevo anche dirti che, se apprezzi ciò che stiamo facendo, ci puoi aiutare! Decine di migliaia di ore e duro lavoro sono state impiegte per costruire Superalgos così come lo vedi ora. Spero che vorrai contribuire anche solo con qualche minuto, e sarò felice di farti vedere da dove iniziare!",
                    "updated": 1618073272368,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Success",
            "text": "Let's get on with it!",
            "updated": 1611584148459,
            "translations": [
                {
                    "language": "IT",
                    "text": "Coraggio, ti faccio vedere!",
                    "updated": 1618073296750,
                    "style": "Success"
                }
            ]
        }
    ]
}