{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 28,
    "type": "Tutorial Step - Are We Up to Date?",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "indicator-process-instance"
        },
        "text": "By now, all processes should be at 100%. When that happens, we refer to the data mining operation as being up to date.",
        "translations": [
            {
                "language": "IT",
                "text": "Ormai tutti i processi dovrebbero essere al 100%. Quando ciò accade, diciamo che l`operazione di data mining è up to date.",
                "updated": 1614845999951
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "When all processes are up to date, the bots keep running, processing information in realtime as it is produced at the exchange. That is, the data mining operation doesn't stop unless you stop it!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Quando i processi sono up to date, i bots continuano a lavorare e processare dati in tempo reale man mano che sono prodotti dall'exchange. Quindi l'operazione di mining non si ferma a meno che non la stoppi tu!",
                    "updated": 1614845991321
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Look around and see if all processes are at 100%",
            "translations": [
                {
                    "language": "IT",
                    "text": "Controlla se tutti i processi sono al 100%",
                    "updated": 1614846041698
                }
            ]
        },
        {
            "style": "Text",
            "text": "To run a Live Trading Session, you need a constant feed of information from the exchange, being processed in realtime, so that the Trading Bot may apply the rules of your Trading System to make live trading decisions.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Per una Live Trading Session hai bisogno di un feed costante di dati dall'exchange che vengono processae in tempo realte, cosicchè il Trading Bot possa applicare le regole del tuo Trading System per prendere decisioni.",
                    "updated": 1614846102542
                }
            ]
        }
    ]
}