{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 19,
    "type": "Tutorial Step - Spacetime Teleportation!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "mouse-right-click"
        },
        "text": "Ok, you're not actually going to be teleporting, nor will you bend spacetime, but it almost feels like it! It's time to learn to use the design space map.",
        "translations": [
            {
                "language": "IT",
                "text": "Okay, non ti teletrasporterai davvero nè piegherai lo spazio-tempo, ma la sensazione sarà la stessa! È il momento di utilizzare la mappa del Design Space.",
                "updated": 1614789351031,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Apakah kamu menyukai teleportasi? Saatnya mengimplementasikan hal tersebut. Dengan cara menggunakan design space map.",
                "updated": 1616699119657,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Vale, en realidad no te vas a teletransportar, ni vas a doblar el espacio-tiempo, ¡pero casi lo parece! Es hora de aprender a utilizar el mapa del Desing Space.",
                "updated": 1618435736486,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I said earlier that the Design Space is huge, and I meant it! Going from one corner to the opposite would take hundreds of clicks and drags. While using the keyboard allows you to develop neck-breaking speeds, it's not as cool as teleporting! This is how it works:",
            "translations": [
                {
                    "language": "IT",
                    "text": "Come detto prima, il Design Space è veramente grande: andare da un angolo all'altro richiederebbe centinaia di click. Usare la tastiera ti permette di spostarti a grandi velocità, ma non è forte come teletrasportarsi! Ora ti spiego come si fa: ",
                    "updated": 1618646122102,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Design space sangatlah besar, Butuh clicks dan drags yang sangat banyak. Namun dengan keyboard akan mempercepat waktumu, Tetapi itu tidak semenarik teleporting! Baiklah ini dia cara menggunakannya:",
                    "updated": 1616699222605,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Dije antes que el Design Space es gigantesco, y lo decía en serio! Ir de una esquina a la opuesta llevaría cientos de clics y arrastres. Aunque el uso del teclado te permite desarrollar velocidades que te rompen el cuello, ¡no es tan guay como teletransportarse! Así es como funciona:",
                    "updated": 1618435825322,
                    "style": "Text"
                }
            ],
            "updated": 1616414991030
        },
        {
            "style": "Callout",
            "text": "Right-click to open the map and left-click anywhere to go to that specific spot!",
            "updated": 1611076477382,
            "translations": [
                {
                    "language": "IT",
                    "text": "Fai click con il tasto destro del mouse per aprire la mappa e clicca un punto qualsiasi con il tasto sinistro per raggiungerlo!",
                    "updated": 1614788954113,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Click-kanan untuk membuka map dan click-kiri dimana saja untuk teleport ke tempat yang dituju!",
                    "updated": 1616699289600,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Haz clic con el botón derecho para abrir el mapa y haz clic con el botón izquierdo en cualquier lugar para ir a ese punto específico.",
                    "updated": 1618435846567,
                    "style": "Callout"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Look at me on the bottom-left corner of the design space? Now you know where to find me!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Mi vedi nell'angolo in basso a sinistra del Design Space? Ora sai dove trovarmi!",
                    "updated": 1614789481521,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Apakah kamu melihat aku dibawah kiri dari design space? Sekarang kamu menemukanku!",
                    "updated": 1616699370261,
                    "style": "Text"
                }
            ]
        }
    ]
}