{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 26,
    "type": "Tutorial Step - Broke Something?",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "workspace"
        },
        "text": "If you ever break something&mdash;like deleting a node or changing a configuration&mdash;and don't know how to deal with the outcome...",
        "translations": [
            {
                "language": "IT",
                "text": "Se ti capiterà mai di rompere qualcosa (per esempio cancellare un nodo o cambiare una configurazione) e non sai come sistemare...",
                "updated": 1614791180230,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Jika kamu merusak sesuatu seperti menghapus node atau merubah konfigurasi dan tidak tahu cara untuk menghadapinya...",
                "updated": 1616770121960,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si alguna vez rompes algo -como borrar un nodo por error o cambiar la configuración- y no sabes cómo afrontar el resultado...",
                "updated": 1618438157553,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "... you may easily start over with the original Getting Started Tutorials Plugin Workspace!",
            "translations": [
                {
                    "language": "IT",
                    "text": "...c'è un modo semplice di ricominciare con un nuovo workspace!",
                    "updated": 1614791206441,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "... ada cara mudah untuk memulai kembali dengan workspace baru!",
                    "updated": 1616770151572,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Hay una manera facil de empezar con un espacio de trabajo como nuevo",
                    "updated": 1618438101054,
                    "style": "Callout"
                }
            ],
            "updated": 1622196973760
        },
        {
            "style": "Text",
            "text": "In such a case, just pull the tab on the left-hand side, scroll, find the Getting Started Tutorials plugin, and click it! The original Plugin Workspace will load and the tutorial will show up again, fresh from the start!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Tutto ciò che devi fare è tirare la tab sul lato sinistro dello schermo e cliccare sul plugin workspace Getting-Started.",
                    "updated": 1614791245119,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "yang kamu butuhkan yaitu menarik tab yang ada di sisi kiri dari layarmu dan click pada Getting-Started plugin workspace.",
                    "updated": 1616770232356,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Todo lo que tienes que hacer es tirar de la pestaña de la izquierda de la pantalla y hacer clic en Getting-Started plugin workspace.",
                    "updated": 1618438234984,
                    "style": "Text"
                }
            ],
            "updated": 1622634394712
        },
        {
            "style": "Note",
            "text": "Plugin Workspaces are first in the list, featuring a black background. Then comes the list of user workspaces, on a purple background.",
            "updated": 1622634460755
        }
    ]
}