{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 9,
    "type": "Tutorial Step - About Small Hardware",
    "definition": {
        "text": "While minimalist hardware like the Raspberry Pi can handle the Superalgos Client to run both data and trading tasks, some may be too small for active work!",
        "updated": 1610615755927,
        "icon": {
            "name": "bullet-warning",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Anche se dispositivi embedded come il Raspberry Pi possono gestire il Client Superalgos per eseguire sia le task relative ai dati che quelle relative al trading, alcuni potrebbero non essere abbastanza potenti.",
                "updated": 1614718975756,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Tau ngga perangkat keras minimalis seperti Raspberry Pi dapat menangani Client Superalgos untuk menjalankan data dan trading tasks!",
                "updated": 1616696668510,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Aunque hardware minimalista como la Raspberry Pi puede manejar el Cliente Superalgos y ejecutar las trading y data task. Puede ser necesaria mas potencia para correr la UI.",
                "updated": 1618432603490,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The core idea behind running the client in small physical or virtual hardware is to maximize cost efficiency in production deployments. In such contexts, the UI is used to a minimum.",
            "updated": 1610616659750,
            "translations": [
                {
                    "language": "IT",
                    "text": "Eseguire il Client in hardware fisici o virtuali dalle dimensioni ridotte ha l'obiettivo di massimizzare l'efficienza dei costi in un ambiente di produzione. In questi contesti, l'utilizzo della UI é ridotto al minimo.",
                    "updated": 1614718792202,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Hal ini ditujukan untuk menjalankan Client dalam perangkat keras fisik atau virtual untuk memaksimalkan efisiensi biaya dalam penerapan produksi. Dalam konteks seperti ini, UI akan digunakan seminimal mungkin.",
                    "updated": 1616696694333,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "La idea central de ejecutar el cliente en un hardware físico o virtual sencillo es maximizar la eficiencia de costo en un modelo de produccion. En estos contextos, la interfaz de usuario se utiliza al mínimo.",
                    "updated": 1617882393315,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Success",
            "text": "We highly recommend learning Superalgos while running in a full-size machine. If you notice your small hardware is too slow during this tutorial, consider installing in regular hardware until you learn system, build your first strategies, and are ready to deploy. Otherwise, it may be frustrating.",
            "updated": 1616411164854,
            "translations": [
                {
                    "language": "IT",
                    "text": "Raccomandiamo caldamente di imparare Superalgos su un computer normale. Se durante il tutorial ti accorgi che il tuo sistema embedded é troppo lento, installalo su un hardware normale finché non impari le basi e non costruisci le tue prime strategie. Altrimenti può essere frustrante.",
                    "updated": 1618645476325,
                    "style": "Success"
                },
                {
                    "language": "ID",
                    "text": "Jika spesifikasi perangkat terlalu lambat selama tutorial, Saya sarankan untuk menginstal di spesifikasi perangkat yang biasa seperti PC untuk mempelajari Superalgos, membuat strategi pertama, dan siap untuk diterapkan. Jika tidak, ini mungkin akan sangat memfrustasikan.",
                    "updated": 1616696610795,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Recomendamos utilizar un PC normal mientras aprendes a usara SA. Si nota que su hardware es demasiado lento durante el tutorial, considere la posibilidad de usar un PC normal hasta que aprenda el sistema, desarrolle sus primeras estrategias y esté listo para desplegarlo. De lo contrario, puede ser frustrante.",
                    "updated": 1617885366802,
                    "style": "Success"
                }
            ]
        }
    ]
}