{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 13,
    "type": "Tutorial Step - Let's Mine Some Data!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "run"
        },
        "text": "Open the Data Tasks node menu and find the Run All Project Data Tasks button on the top-right corner...",
        "updated": 1611076262685,
        "translations": [
            {
                "language": "IT",
                "text": "Apri il menu del nodo Data Tasks e cerca il pulsante Run All Project Data Tasks nell'angolo in alto a destra...",
                "updated": 1614720124109,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Open the Data Tasks node menu dan cari tombol Run All Project Data Tasks dibagian atas kanan...",
                "updated": 1616697053489,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Abra el menú del nodo Data Tasks y busque el botón Run All Project Data Tasks en la esquina superior derecha...",
                "updated": 1618434308521
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Click the Run All Project Data Tasks button!",
            "updated": 1611076332667,
            "translations": [
                {
                    "language": "IT",
                    "text": "Clicca sul pulsante Run All Project Data Tasks!",
                    "updated": 1614720129427,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Click tombol Run All Project Data Tasks!",
                    "updated": 1616697004627,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Haz click en el botón Run All Project Data Tasks!",
                    "updated": 1618434334439
                }
            ]
        },
        {
            "style": "Text",
            "text": "Confirm the request by clicking the button a second time. In about 30 seconds, you should see a status notice below the Data Mining node indicating that 1 out of 1 Exchange Data Tasks node is running.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Conferma la richiesta cliccando il pulsante una seconda volta. In circa 30 secondi, dovresti vedere un messaggio di stato sotto il nodo Data Mining che ti indica che é in corso 1 Exchange Data Tasks su 1. ",
                    "updated": 1614720224584,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Konfirmasi request dengan click tombol di second time. Dalam 30 detik, kamu akan melihat notice status dibawah Data Mining node yang menjelaskan 1/1 Exchange Data Tasks node sedang berjalan.",
                    "updated": 1616696981851,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Confirme la solicitud haciendo clic en el botón por segunda vez. En unos 30 segundos, debería ver un aviso de estado bajo el nodo Data Mining que indica que se está ejecutando 1 out of 1 Exchange Data Tasks.",
                    "updated": 1618434426749
                }
            ]
        },
        {
            "style": "Note",
            "text": "Your console app should show something similar to the video on the next step.",
            "translations": [
                {
                    "language": "IT",
                    "text": "La tua console app dovrebbe mostrarti qualcosa di simile al video nello step successivo.",
                    "updated": 1614720247842,
                    "style": "Note"
                },
                {
                    "language": "ID",
                    "text": "Console app akan memperlihatkan sesuatu yang mirip dengan video di step selanjutnya.",
                    "updated": 1616696802459,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Tu aplicación de consola, deberia mostrar algo similar a lo que aparece en el video, a continuación",
                    "updated": 1618434455552
                }
            ]
        }
    ]
}