{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 1,
    "type": "Tutorial - Welcome to Superalgos!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "tutorial"
        },
        "text": "I'm an interactive tutorial, the first in a series designed to facilitate your onboarding and teach you all the basics!",
        "translations": [
            {
                "language": "ID",
                "text": "Aku adalah tutorial yang interaktif, yang berkerja untuk memfasilitasi orientasi pemikiran kamu dan mengajari kamu semua dasar tentang Superalgos!",
                "updated": 1614416780981
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I will get you started, show you the tools that will help you move around comfortably, and help you discover all the cool things that Superalgos may do for you.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Aku akan membantumu dalam memulai, dan menunjukkan alat yang akan membantumu bergerak dengan nyaman, dan menemukan semua hal keren yang akan dilakukan Superalgos untuk tradingmu.",
                    "updated": 1614416877222
                }
            ]
        },
        {
            "style": "Callout",
            "text": "I'm the ultimate Superalgos onboarding tool! Starting with Superalgos in any other way is a mistake, as no other resource will get you up to speed faster. I will answer most of your questions!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Aku adalah tutorial orientasi Superalgos yang terbaik! Memulai Superalgos dengan cara yang tidak direkomendasikan sangatlah salah, karena tidak ada sumber lain yang dapat mempercepat kamu selain aku. Aku akan menjawab sebagian besar pertanyaan kamu!",
                    "updated": 1614417059937
                }
            ]
        },
        {
            "style": "Success",
            "text": "Please, always click Next to continue!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Mohon, klik Next untuk melanjutkan",
                    "updated": 1614417191759
                }
            ]
        }
    ]
}