{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 61,
    "type": "Tutorial Step - Aim High, Trade Big!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "network-node"
        },
        "text": "Picture an army of bots working with multiple exchanges, markets, and strategies, running on a network ala trading farm.",
        "translations": [
            {
                "language": "IT",
                "text": "Immagina un esercito di bots che lavorano con vari exchange, mercati e strategie, coordinati da un network che fa da trading farm.",
                "updated": 1618057758985
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "That is what the Network Node is about. What you've seen so far is running on a single machine. But...",
            "updated": 1616427867794,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il Network Node fa esattamente questo. I processi che hai visto finora girano su una singola macchina. Però...",
                    "updated": 1618057806513
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Superalgos supports distributing and coordinating tasks across networks of nodes running the Client! This enables smart and scalable operations. Any machine running the GUI may control the enterprise!",
            "updated": 1616693637435,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos permette di distribuire e coordinare tasks attraverso una rete di macchine che eseguono il Client! Questo permette di eseguire operazioni avanzate e scalabili. Qualsiasi macchina che esegue la GUI può controllare il tutto!",
                    "updated": 1618057957707
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may set up a network with a few Raspberry Pi, an industrial-grade datacenter&mdash;or anything in between.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Puoi creare network arbitrariamente complessi che vanno da qualche Raspberry Pi a un datacenter industriale.",
                    "updated": 1618058007870
                }
            ]
        }
    ]
}