{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 15,
    "type": "Tutorial Step - How Are Things Going?",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "sensor-bot-instance"
        },
        "text": "I just dragged you deep into the confines of the Data Mining operation. See the progress of the Sensor Bot Instance to your right!",
        "translations": [
            {
                "language": "IT",
                "text": "Sei stato appena trascinato dentro i confini dell'operazione di Data Mining. Controlla i progressi della Sensor Bot Instance alla tua destra!",
                "updated": 1614720420362,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The sensor bot is currently extracting data from the exchange. As soon as she completes the extraction for the defined datetime range something really cool will happen... automatically!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il sensor bot sta estraendo dati dal mercato. Appena avrà finito l'estrazione per l'intervallo di tempo selezionato, qualcosa di veramente forte accadrà...automaticamente!",
                    "updated": 1614720508108,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Can you guess what that may be?",
            "translations": [
                {
                    "language": "IT",
                    "text": "Riesci a immaginare cosa possa essere?",
                    "updated": 1614720522523,
                    "style": "Callout"
                }
            ]
        },
        {
            "style": "Success",
            "text": "It should take no longer than 3 to 5 minutes to extract the data from Binance, or a bit longer, depending on your hardware. Can't wait? Fine! Click Next for a quick hint!",
            "updated": 1616414820007,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non te lo dirò! Lo scoprirai presto...sii paziente! Ci dovrebbero volere soltanto dai 3 ai 5 minuti per estrarre i dati da Binance, o un pò di più, in base al tuo hardware. Non puoi proprio aspettare? Va bene! Clicca su Next per un anticipo!",
                    "updated": 1614720621816,
                    "style": "Success"
                }
            ]
        }
    ]
}