{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 40,
    "type": "Tutorial Step - The Elegant Way...",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "mouse-pointer"
        },
        "text": "I know! Zooming into a random spot is unlikely to position the chart squared with your screen, right? No worries... try this trick!",
        "translations": [
            {
                "language": "IT",
                "text": "Lo so, zoommare su un punto a caso difficilmente farà sì che il grafico si adatti al tuo schermo, vero? No problem...",
                "updated": 1614893061080,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Aku tahu!, Memperbesar ke tempat acak tidak seperti langsung menuju ke kotak chart discreenmu, benar? Jangan khawatir... Coba trik ini!",
                "updated": 1616948885540,
                "style": "Definition"
            }
        ],
        "updated": 1616417516192
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "Adjust the aspect ratio: Point your mouse to the chart and hit Ctrl + Shift + Key-A",
            "updated": 1616418151629,
            "translations": [
                {
                    "language": "ID",
                    "text": "Menyesuaikan aspect ratio: Point mouse-mu ke chart dan tekan Ctrl + Shift + Key-A",
                    "updated": 1616948923519,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Zoom out: use the mouse wheel to go to the furthest zoom out position; only from this position will the next command work!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Zoom out: gunakan mouse wheel untuk memposisikan zoom out terkecil; hanya dari posisi ini perintah berikutnya akan bekerja!",
                    "updated": 1616949119939,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Double-click once: this centers the chart and takes you to a certain level of zoom; a margin is left to fit the name and tab of the chart on the top-left corner.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Fai doppio click sulla Time Machine in cima: questo centrerà il grafico e lo zoomerà, lasciando del margine per visualizzarne il nome e la tab in alto a sinistra.",
                    "updated": 1618647317393,
                    "style": "List"
                },
                {
                    "language": "ID",
                    "text": "Double-click sekali: Ini memusatkan chart dan membawamu ke tingkat zoom tertentu; margin terlihat kekiri agar pas dengan nama dan tab chart di sudut kiri atas.",
                    "updated": 1616949208729,
                    "style": "List"
                }
            ],
            "updated": 1616418234728
        },
        {
            "style": "List",
            "text": "Double-click again: this takes you further in the chart, to the zoom level in which the chart perfectly fits the screen and layer managers emerge.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Fai un altro doppio click: questo ti trasporterà dentro il grafico, zoomandolo quanto basta per adattarlo perfettamente allo schermo e farne emergere i layer.",
                    "updated": 1618647548231,
                    "style": "List"
                },
                {
                    "language": "ID",
                    "text": "Double-click lagi: Ini membawamu lebih jauh kedalam bagan, tingkat zoom ini secara sempurna cocok dengan layar beserta layer managers yang muncul.",
                    "updated": 1616949317416,
                    "style": "List"
                }
            ],
            "updated": 1616418383322
        }
    ]
}