{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 20,
    "type": "Tutorial Step - Warp-Speed Zooming!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "mouse-wheel-down"
        },
        "text": "There's one more tool that you may find useful to manipulate spacetime! The native browser zoom function!",
        "translations": [
            {
                "language": "IT",
                "text": "C'è ancora uno strumento utile per manipolare lo spazio-tempo: la funzione zoom del tuo browser!",
                "updated": 1614789109029,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Ada satu hal lagi yang berguna untukmu dalam memanipulasi waktu! yaitu fungsi zomm native browser!",
                "updated": 1616699454737,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Hay una herramienta más que puede resultarte útil para manipular el espacio-tiempo. La función nativa de zoom del navegador.",
                "updated": 1618436075914
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Sometimes you may wish to visualize larger sections of the Design Space than your screen allows.",
            "updated": 1611314074367,
            "translations": [
                {
                    "language": "IT",
                    "text": "A volte potresti voler visualizzare porzioni del Design Space più ampie di quanto permesso dal tuo schermo.",
                    "updated": 1614789154147,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Terkadang kamu ingin visualisasi yang lebih besar dari Design Space yang tertahan dari layarmu.",
                    "updated": 1616699514300,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "A veces es posible que desee visualizar secciones más grandes del Design Space de lo que permite su pantalla.",
                    "updated": 1618436141915
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Hit Ctrl and scroll the mouse wheel on Windows or <kbd>⌘</kbd> and <kbd>-</kbd> or <kbd>+</kbd> in Mac.",
            "updated": 1611314352825,
            "translations": [
                {
                    "language": "IT",
                    "text": "Clicca Ctrl e scorri con la rotella del mouse su Windows o usa ⌘ e - oppure + su Mac.",
                    "updated": 1614789231899,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Tekan Ctrl dan scroll mouse wheel di Windows atau ⌘ dan - atau + di Mac.",
                    "updated": 1616699557574,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Pulsa Ctrl y desplaza la rueda del ratón en Windows o ⌘ y - o + en Mac.",
                    "updated": 1618436175073
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Success",
            "text": "Chrome indicates the level of zoom on the top-right corner. When zooming in or out, the design space gets centered on the screen. Use the design space map to go back where you were.",
            "updated": 1611314381796,
            "translations": [
                {
                    "language": "IT",
                    "text": "Chrome ti mostra il livello di zoom nell'angolo in alto a destra. Quando zoommi, il Design Space viene centrato sullo schermo. Usa la mappa per tornare dove eri prima.",
                    "updated": 1614789306337,
                    "style": "Success"
                },
                {
                    "language": "ID",
                    "text": "Chrome mengindikasi ukuran zoom di bagian atas-kanan. Saat zooming kecil/besar,desing space akan ketengah layar. Gunakan design space map untuk kembali ketempat yang seharusnya.",
                    "updated": 1616699735896,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Chrome indica el nivel de zoom en la esquina superior derecha. Al acercar o alejar el zoom, el Desing Space vuelve al centro. Utiliza el mapa para volver a donde estabas.",
                    "updated": 1618436232576
                }
            ]
        }
    ]
}