{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 101,
    "type": "Tutorial Step - Monitoring the Fun Way!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "bullet-limit-buy-order"
        },
        "text": "You thought I would let you monitor the Live Trading Session watching the ugly list of orders at the exchange? No way!",
        "translations": [
            {
                "language": "IT",
                "text": "Pensavi che ti avrei lasciato monitorare la Live Trading Session controllando quella brutta lista di ordini sull'exchange? Neanche per sogno!",
                "updated": 1618071826917
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Superalgos produces the same kind of simulations you fell in love with for live sessions too, in realtime!",
            "updated": 1616435345542,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos produce lo stesso tipo di simulazioni di cui ti sei innamorato anche per le live sessions, e lo fa in tempo reale!",
                    "updated": 1618071876792
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Can you see the first few buy orders on the chart?",
            "translations": [
                {
                    "language": "IT",
                    "text": "Vedi i primi buy orders sul grafico?",
                    "updated": 1618071889300
                }
            ]
        },
        {
            "style": "Note",
            "text": "I just brought you to the present time, on the 1-minute chart. You should be able to see the latest candle forming and a few orders already. The Rate Scale is in automatic mode at both ends. Feel free to change the scales to your liking.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ti ho appena portato al momento attuale, sul grafico da 1-min. Dovresti vedere le ultime candele che si formano e già alcuni ordini. La Rate Scale è in automatico a entrambi gli estremi: cambiala pure come preferisci.",
                    "updated": 1618071961435
                }
            ]
        }
    ]
}