{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 88,
    "type": "Tutorial Step - Disclaimer",
    "definition": {
        "text": "This warning will be rendered in full screen mode.",
        "translations": [
            {
                "language": "IT",
                "text": "Questo warning verrà visualizzato a schermo intero.",
                "updated": 1618069224090
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Warning",
            "text": "Superalgos is a piece of computer software. Like with any software, errors may occur at any point, including errors that may cause you to lose money. You are responsible for taking all precautions you may deem appropriate before trading live. Even if you take all possible precautionary measures, things may still go wrong and errors may occur. By using this software to trade live despite the warnings, you acknowledge that you are aware of the inherent risks in trading and in using software for that purpose. The Superalgos Project offers the software AS IS, with no explicit or implied warranties of any kind. The project, the software, the superalgos.org website, and this tutorial do not offer financial advice. Although the strategies shipping with the system may be fully functional, Superalgos does not make any express or implied recommendation as to how you should use them. We share strategies for educational purposes only. Trade under your responsibility and at your own risk. The use of the software is subject to the terms of the LICENSE.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos è un software. Come ogni altro software, può presentare errori di qualsiasi tipo, inclusi errori che possono causare all'utente perdita di denaro. Sei responsabile di prendere ogni precauzione che tu ritenga appropriata prima di fare trading live. Anche prendendo ogni precauzione possibile, è comunque possibile che si verifichino errori. Utilizzando questo software per fare trading live, nonostante i presenti avvertimenti, riconosci di essere a conoscenza dei rischi inerenti all'attività di trading e all'uso di un software per quello scopo. Superalgos Project offre il software \"AS IS\", senza alcun tipo di garanzia esplicita o implicita. Il progetto, il software, il sito superalgos.org e questo tutorial non offrono consulenza finanziaria. Nonostante le strategie incluse nel sistema possano essere funzionanti, Superalgos non fa alcuna raccomandazione esplicita o implicita su come usarle. Condividiamo strategia a puro scopo educativo. Fai trading sotto la tua responsabilità e a tuo rischio e pericolo. L'uso del software è soggetto ai termini di licenza.",
                    "updated": 1618069837996
                }
            ]
        }
    ]
}