{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 43,
    "type": "Tutorial Step - Unlocking Time!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "time-scale"
        },
        "text": "The reason why you can't move is that scales are locked in the automatic mode so that you may easily find the data after your first data mining operation.",
        "translations": [
            {
                "language": "IT",
                "text": "Il motivo per cui non ti puoi muovere è che le scale sono bloccate in modalità automatica, così puoi trovare facilmente i dati dopo la tua prima operazione di mining.",
                "updated": 1614893522639,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Setting the Time Scale in automatic mode forces the whole datetime range of available data into the chart.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Settare la Time Scale in modalità automatica fa sì che i dati sull'intera scala temporale vengano mostrati insieme sul grafico.",
                    "updated": 1614893577134,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Callout",
            "text": "To toggle between the various automatic modes and manual mode, hit Shift and make a gentle one-step roll with the wheel of your mouse on top of the time scale box. Alternatively, you can also place the mouse pointer over the scale box and hit the up and down arrow keys ↑ ↓. ",
            "translations": [
                {
                    "language": "IT",
                    "text": "Per cambiare tra automatico e manuale, premi Shift e ruota una volta la rotella del mouse sopra a una time scale box. Oppure, posiziona il cursore sulla scale box e usa i tasti freccia ↑ ↓.",
                    "updated": 1618647811116,
                    "style": "Callout"
                }
            ],
            "updated": 1616495659408
        },
        {
            "style": "Text",
            "text": "You should now be able to move freely on the X-axis, that is, the time axis of the chart.",
            "updated": 1616495689238,
            "translations": [
                {
                    "language": "IT",
                    "text": "Dovresti poterti muovere liberamente sull'asse X del grafico, ossia quella del tempo.",
                    "updated": 1618647843971
                }
            ]
        }
    ]
}