{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 22,
    "type": "Tutorial Step - Need a Quick Reminder?",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "key-left"
        },
        "text": "At this point, I'm probably overflowing your hippocampus! But don't worry... you may go back to any previous step!",
        "translations": [
            {
                "language": "IT",
                "text": "Tutte queste informazioni ti avranno sovraccaricato l'ippocampo! Ma non preccuparti, puoi tornare indietro a qualunque step precedente.",
                "updated": 1614790380193,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Pada point ini, Aku sudah membuatmu banyak mengingat! Tapi jangan khawatir ... kamu dapat kembali ke step sebelumnya!",
                "updated": 1616768312747,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "En este punto, probablemente esté  saturando tu hipocampo! Pero no te preocupes... ¡puedes volver a cualquier paso anterior!",
                "updated": 1618436677513
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If you ever need a reminder about any of these topics...",
            "translations": [
                {
                    "language": "IT",
                    "text": "Se mai ti servirà un ripasso su uno di quesi topic...",
                    "updated": 1614790424338,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Jika kamu membutuhkan pengingat tentang salah satu topik...",
                    "updated": 1616768354407,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Si alguna vez necesitas un recordatorio sobre estos temas...",
                    "updated": 1618436771239
                }
            ]
        },
        {
            "style": "List",
            "text": "Find a Tutorial Topic and replay it! You may find me on the bottom-left corner of the design space, expand me, browse through the hierarchy of topics and steps, and click Play on any of them. Topics are arranged in a clockwise direction, starting from the right-hand side of the main Tutorial node.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Cerca un Tutorial Topic e ri-eseguilo! Puoi trovarmi nell'angolo in basso a sinistra del Design Space. Espandimi, naviga nella gerarchia dei topics e degli steps e clicca Play su uno qualsiasi di questi. I topics sono strutturati in senso orario, a partire dal lato destro del nodo Tutorial principale.",
                    "updated": 1614790602319,
                    "style": "List"
                },
                {
                    "language": "ID",
                    "text": "Temukan Tutorial Topic dan replay! Kamu mungkin menemukannya dibawah-kiri dari design space, expand itu, dan Jelajahi melalui hirarki dari topik dan step, dan click Play yang dipilih. Topik diatur searah jarum jam, dimulai dari kanan yang ada pada main Tutorial node.",
                    "updated": 1616769317775,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Busque el Tutorial Topic y reprodúzcalo! Puede encontrarme en la esquina inferior izquierda del Desing Space, expandirme, navegar por la jerarquía de temas y pasos, y hacer clic en Play en cualquiera de ellos. Los temas están ordenados en el sentido de las agujas del reloj, empezando por la derecha del nodo principal de Tutorial.",
                    "updated": 1618436934915
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Need a Quick Reminder? Find the step under the Tutorials & Help topic below. Then click Stop, and restart by clicking Play on the said Tutorial Step!",
            "updated": 1611076850328,
            "translations": [
                {
                    "language": "IT",
                    "text": "Hai bisogno di un ripasso veloce? Trova lo step sotto il topic Tutorial & Help. Poi clicca Stop, e ricomincia cliccando Play su quel Tutorial Step!",
                    "updated": 1614790783510,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Butuh Reminder Cepat? Temukan step pada Tutorials & Help topik dibawah. Lalu click Stop, dan mulai ulang dengan Mengclick Play disamping Tutorial Step!",
                    "updated": 1616769536924,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Necesitas refrescar tu memoria? Busque el paso en el tema de Tutorials & Help. A continuación, haga clic en Stop y reinicie haciendo clic en Play en dicho paso del tutorial.",
                    "updated": 1618437112467
                }
            ]
        }
    ]
}