{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 89,
    "type": "Tutorial Step - Let's Start With 100 Bucks!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "session-quoted-asset"
        },
        "text": "The default initialBalance is set to 100 USDT, well above the minimum transaction size supported by Binance.",
        "translations": [
            {
                "language": "IT",
                "text": "Il capitale iniziale initialBalance è impostato a 100 USDT, ben al di sopra del limite minimo per transazione supportato da Binance.",
                "updated": 1618069933006
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The initialBalance is defined in the configuration of the Session Quoted Asset. Check it out and decide for yourself if you wish to change it!",
            "translations": [
                {
                    "language": "IT",
                    "text": "initialBalance è definito nella configurazione del Session Quoted Asset. Esaminalo e decidi pure se preferisci cambiarlo!",
                    "updated": 1618069983048
                }
            ]
        },
        {
            "style": "Success",
            "text": "Binance defines the minimum transaction size in BTC, so the requirement in USDT varies a lot with time. I set the amount to 100 USDT just to ensure you don't run into errors. You are free to try with a smaller amount. You will get errors if it's too small but may try again as many times as needed. Just stop the task, change the initialBalance in the Session Quoted Asset, and try again!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Binance definisce il valore minimo di una transazione in BTC, quindi il corrispondente valore in USDT varia molto nel tempo. Sei libero di provare con un importo minore dei 100 USDT iniziali. Riceverai un errore se l'importo è troppo piccolo, ma puoi provare di nuovo quante volte vuoi. Basta fermare la task, cambiare initialBalance nel Session Quoted Asset e riprovare!",
                    "updated": 1618070211585
                }
            ]
        }
    ]
}