{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 71,
    "type": "Tutorial Step - Shall We Dig Deeper?",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "layer-resistance"
        },
        "text": "The logic behind the placing of buy orders is influenced by the Resistances and Supports indicator bot from the Masters Data Mine you ran earlier.",
        "updated": 1610641051577,
        "translations": [
            {
                "language": "IT",
                "text": "L'inserimento dei buy orders è influenzato dai supporti e resistenze dell'Indicator Bot della Masters Data Mine che abbiamo eseguito prima.",
                "updated": 1618061894381
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I took the liberty to turn the Supports layer on to show you this beauty... I hope you don't mind!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Mi sono preso la libertà di attivare il layer dei Supporti per mostrarti questa bellezza. Spero non ti dispiaccia!",
                    "updated": 1618061926335
                }
            ]
        },
        {
            "style": "Callout",
            "text": "The indicator identifies levels (price ranges) on which price is rejected, and keeps a counter of how many rejections occur until the level is breached.",
            "translations": [
                {
                    "language": "IT",
                    "text": "L'indicatore identifica livelli (range di prezzo) oltre i quali il prezzo fatica a salire, e tiene conto di quante volte è respinto da essi prima di romperli.",
                    "updated": 1618062124164
                }
            ]
        },
        {
            "style": "Text",
            "text": "The way levels are represented on-screen varies with the number of rejections the level has witnessed, giving us a visual clue of how strong each support level may be. Once a level is breached, it disappears.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il modo in cui i livelli sono disegnati varia a seconda del numero di \"rimbalzi\" del prezzo su quel livello, dandoci un'idea visiva di quanto sia forte il supporto. Una volta che viene rotto, sparisce.",
                    "updated": 1618062095822
                }
            ]
        }
    ]
}