{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 5,
    "type": "Tutorial Step - Expand That Node!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "expand-structure-of-nodes"
        },
        "text": "Each node features a menu. The button on the bottom-left expands and collapses the structure of nodes below the current node.",
        "translations": [
            {
                "language": "ID",
                "text": "Setiap node memiliki menunya sendiri. Tombol dikiri bawah bisa membesar dan mengecilkan struktur dari sekumpulan nodes lainnya yang masih berada di node yang sekarang.",
                "updated": 1614424892833,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Cada nodo cuenta con un menú. El botón de la parte inferior izquierda expande y colapsa la estructura de los nodos por debajo del nodo actual.",
                "updated": 1613595237180,
                "style": "Definition"
            },
            {
                "language": "IT",
                "text": "Ogni nodo ha un menu. Il bottone in basso a sinistra espande o comprime la struttura dei nodi sotto il nodo corrente.",
                "updated": 1614713202090,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Go ahead and click the expand button!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Ayo coba dengan men-click tombol expand tersebut!",
                    "updated": 1614424924865,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Adelante, haz clic en el botón de expansión.",
                    "updated": 1613595248682,
                    "style": "Callout"
                },
                {
                    "language": "IT",
                    "text": "Prova a cliccare il bottone per espandere!",
                    "updated": 1614713217883,
                    "style": "Callout"
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Tutorial node has several offspring, and these have several more offspring. That's why it's a hierarchy!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Node Tutorial memiliki beberapa turunan, dan setiap turunan mempunyai turunannya lagi. Itulah hirarki!",
                    "updated": 1614425111632,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El nodo Tutorial tiene varios subnodos, y éstos tienen varios subnodos más. ¡Por eso es una jerarquía!",
                    "updated": 1613595290969,
                    "style": "Text"
                },
                {
                    "language": "IT",
                    "text": "Il nodo Tutorial ha diversi discendenti, e questi ne hanno altri a loro volta. Ecco perché é una gerarchia!",
                    "updated": 1614713286305,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Note",
            "text": "Structured visual representations of information are at the core of how Superalgos administers the complexity behind flexible and scalable trading operations.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Representasi visual terstruktur dari informasi merupakan inti dari cara Superalgos mengelola kompleksitas di balik aplikasi trading yang fleksibel dan dapat dikembangkan.",
                    "updated": 1614425276894,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Las representaciones visuales estructuradas de la información son el núcleo de la forma en que Superalgos administra la complejidad de las operaciones de trading flexibles y escalables.",
                    "updated": 1613595317733,
                    "style": "Note"
                },
                {
                    "language": "IT",
                    "text": "Le rappresentazioni visive strutturate di informazioni sono la chiave di come Superalgos gestisce operazioni di trading complesse, flessibili e scalabili.",
                    "updated": 1614717222097,
                    "style": "Note"
                }
            ]
        }
    ]
}