{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 79,
    "type": "Tutorial Step - Simplifying Complexity",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "trading-system"
        },
        "text": "We haven't discussed trading systems as a framework, but a feature relevant to this explanation is that they may handle multiple strategies.",
        "translations": [
            {
                "language": "IT",
                "text": "Non abbiamo discusso dei Trading System come dei framework, ma un feature di rilievo in questo senso è che possono gestire diverse strategie.",
                "updated": 1618065765945
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Each strategy features an Open Stage and a Close Stage, each with its own execution definitions. Each stage may feature multiple execution algorithms, and each algorithm may handle multiple orders.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ogni strategia ha un Open Stage e un Close Stage, ognuno dei quali ha i propri metodi di esecuzione. Ogni stage può avere diversi execution algorithms e ognuno di questi può gestire vari ordini.",
                    "updated": 1618065861963
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Do you see the pattern? We call it granularity.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Riesci a vedere lo schema? Noi lo chiamiamo granularità.",
                    "updated": 1618065885044
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos breaks down each issue to the minimum expression, and integrates the solutions. This is how it allows you to design, deploy, and manage both simple and the most complex trading setups you may envision.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos decompone ogni problema al minimo, e integra le soluzioni. In questo modo ti permette di progettare, rilasciare e gestire ogni tipo di trading setup, semplice o complesso, che vuoi implementare!",
                    "updated": 1618065967425
                }
            ]
        }
    ]
}