{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 83,
    "type": "Tutorial Step - The Coolest Trick!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "exit-target-rate"
        },
        "text": "Humans may access this information by using a cool trick that makes the charting space interact with the design space!",
        "translations": [
            {
                "language": "IT",
                "text": "Gli umani possono accedere a questi dati utilizzando un trucchetto che permette al Charting Space di interagire con il Design Space.",
                "updated": 1618067821598
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "To use this trick, I just did the following:",
            "translations": [
                {
                    "language": "IT",
                    "text": "Per usare questo trucco basta fare così:",
                    "updated": 1618067975774
                }
            ]
        },
        {
            "style": "List",
            "text": "Split the screen in half pulling the slider up so that we can see both spaces at the same time.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Dividi lo schermo in due trascinando lo slider in su, così che possiamo vedere entrambi gli spazi",
                    "updated": 1618067893855
                }
            ]
        },
        {
            "style": "List",
            "text": "Turn on the Current Position layer on the Trading engine layer manager. I chose this layer because it corresponds to this section of the hierarchy... tradingEngine.tradingCurrent.position, remember?",
            "updated": 1616430381277,
            "translations": [
                {
                    "language": "IT",
                    "text": "Attiva il layer Current Position nel layer manager del Trading Engine. Ho scelto questo layer perchè corrisponde alla famosa sezione della gerarchia... tradingEngine.tradingCurrent.position, ricordi?",
                    "updated": 1618067950391
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Now, slide the mouse pointer across the candles on which the position is taken and see what happens on the nodes to the left...",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ora, trascina il puntatore del mouse attraverso le candele sulle quali è definita la posizione e guarda cosa succede ai nodi a sinistra...",
                    "updated": 1618068017032
                }
            ]
        }
    ]
}