{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 6,
    "type": "Tutorial Step - Remote Access!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "network-node"
        },
        "text": "Superalgos allows running the Client on a machine and accessing it via Chrome from another machine in the network.",
        "translations": [
            {
                "language": "ES",
                "text": "Superalgos permite ejecutar el Cliente en una máquina y acceder a él a través de Chrome desde otra máquina de la red.",
                "updated": 1613595518833
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Many users choose to run the Client in the cloud, on single-board machines like the Raspberry Pi, or on a dedicated PC that they can leave on at all times when trading live. The My Computer Network Node represents the machine the Client is running on.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Muchos usuarios optan por ejecutar el Cliente en la nube, en máquinas sencillas como la Raspberry Pi, o en un PC dedicado que pueden dejar encendido en todo momento cuando operan en live. El nodo de red de My Computer Network representa la máquina en la que se ejecuta el Cliente.",
                    "updated": 1613595575444
                }
            ]
        },
        {
            "style": "Warning",
            "text": "At this stage, Superalgos does not implement any form of security. You should use the system in the context of a restricted Local Area Network only. If you chose to run the Client in the cloud, you must implement your own security.",
            "updated": 1611076067427,
            "translations": [
                {
                    "language": "ES",
                    "text": "En este momento, Superalgos no implementa ninguna forma de seguridad. Debe utilizar el sistema únicamente en el contexto de una red de área local restringida. Si decide ejecutar el Cliente en la nube, deberá implementar su propia seguridad.",
                    "updated": 1613595591178
                }
            ]
        }
    ]
}