{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 45,
    "type": "Tutorial Step - Scaling Time!",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "time-scale"
        },
        "text": "Did you pick up the trick to scale time from the previous video? If not, go to the previous step and watch attentively!",
        "translations": [
            {
                "language": "IT",
                "text": "Sei riuscito a mettere in pratica il trucchetto nel video precedente? Se non ce l'hai fatta, torna all'ultimo step e guarda bene!",
                "updated": 1614893781372,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Scrolling the wheel of the mouse on top of the time scale box shrinks and expands time! Alternatively, you can point the mouse to the scale box and hit the side arrow keys ← →",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ruotare la rotella del mouse su una time scale box espande e comprime il tempo! In alternativa, posiziona il mouse sulla scale box e usa i tasti freccia ← → ",
                    "updated": 1618647977786,
                    "style": "Callout"
                }
            ],
            "updated": 1616495837967
        },
        {
            "style": "Note",
            "text": "There's one more interesting detail worth noting in the previous video: when the time scale exits the automatic mode, the two tiny green triangles indicating each end of the automatic scale disappear! The scale can be set to automatic on either, neither, or both sides!",
            "translations": [
                {
                    "language": "IT",
                    "text": "C'è un dettaglio interessante nel video precedente: quando la time scale esce dalla modalità automatica, i due triangoli verdi che indicano gli estremi della scala scompaiono! La scala puó essere impostata come automatica su uno degli estremi, entrambi o nessuno!",
                    "updated": 1618648074699,
                    "style": "Note"
                }
            ],
            "updated": 1616504911488
        }
    ]
}