{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 25,
    "type": "Tutorial Step - More Workspaces?",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "workspace"
        },
        "text": "Yes! Some of them are plugins shipping with the system and some are your own!",
        "translations": [
            {
                "language": "IT",
                "text": "Oh sì! Alcuni di quelli sono plugin nativi del sistema, e altri sono i tuoi!",
                "updated": 1614791394697,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Yes! Beberapa dari plugin berkaitan dengan sistem dan beberapa adalah milikmu sendiri!",
                "updated": 1616770406123,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Sí. Algunos de ellos son plugins que vienen con el sistema y otros son los tuyos propios! ",
                "updated": 1618438936999
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "As soon as you start using the system, the workspace is saved every minute. It is also saved before closing the browser or browser tab, and you may save it manually using the Ctrl + Shift + Key-S",
            "updated": 1610614718976,
            "translations": [
                {
                    "language": "IT",
                    "text": "Mentre usi il sistema, il workspace viene salvato automaticamente ogni minuto. Viene salvato anche quando chiudi il browser o la tab, e puoi salvarlo manualmente usando Ctrl + Shift + Key-S",
                    "updated": 1614791481642,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Segera setelah memulai sistem, workspace akan tersimpan setiap menit. Hal itu juga tersimpan sebelum menutup browser atau tab browser, dan juga bisa simpan manual dengan Ctrl + Shift + Key-S",
                    "updated": 1616770552231,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Tan pronto como empiezas a usar el sistema, el workspace es guardado cada minuto. También se guarda antes de cerrar el navegador o la pestaña del navegador, y puedes guardarlo manualmente utilizando las teclas Ctrl + Shift + Key-S",
                    "updated": 1618439054191
                }
            ]
        },
        {
            "style": "Callout",
            "text": "When a plugin workspace is modified in any way, a copy is stored in your My-Workspaces folder.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Quando un plugin workspace viene modificato in qualunque modo, una copia viene salvata su disco nella tua cartella My-Workspaces.",
                    "updated": 1614791526653,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Saat workspace plugin dimodifikasi dalam cara apapun, salinan akan tersimpan di folder My-Workspaces.",
                    "updated": 1616770626561,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Cuando un plugin workspace se modifica de alguna manera, se almacena una copia en la carpeta  My-Workspaces.",
                    "updated": 1618439039856
                }
            ]
        },
        {
            "style": "Important",
            "text": "Plugin files may not be modified from within the system!",
            "translations": [
                {
                    "language": "IT",
                    "text": "I file plugin non devono essere modificati in altro modo!",
                    "updated": 1614791561359,
                    "style": "Important"
                },
                {
                    "language": "ID",
                    "text": "File plugin tidak boleh dimodifikasi tanpa menggunakan sistem!",
                    "updated": 1616770726775,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "Los archivos de los plugins no pueden ser modificados desde el sistema!",
                    "updated": 1618439194749
                }
            ]
        }
    ]
}