{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 32,
    "type": "Tutorial Step - The Bright Side",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "charting-space"
        },
        "text": "So far, you've been confined to the dark side of Superalgos. Get ready to be exposed to the bright side: the Charting Space.",
        "translations": [
            {
                "language": "IT",
                "text": "Finora sei rimasto confinato nel lato oscuro di Superalgos. Preparati a incontrare il lato chiaro: il Charting Space.",
                "updated": 1614846601940,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Sejauh ini, kamu telah selalu berada di sisi gelap dari Superalgos. Bersiaplah untuk terekspos di sisi terang: Charting Space.",
                "updated": 1616932464702,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The charting space lives on top of the design space, separated by a turquoise slider. As you will come to expect from Superalgos, the charting space is configurable and highly flexible. Everything that happens there is defined on the Charting Space.",
            "updated": 1616416243162,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il Charting Space si trova al di sopra del Design Space, separato da uno slider turchese. Come imparerai ad aspettarti da Superalgos, il Charting Space è configurabile e molto flessibile. Tutto ciò che accade lí ha una definizione sul Charting Space. ",
                    "updated": 1618646977566,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Charting Space tinggal diatas dari design space, terbagi atas turquoise slider. Seperti yang kamu ekspektasikan dari Superalgos, Charting Space sebuah konfigurasi dari fleksibilitas yang tinggi. Semua yang terjadi akan terlihat dari Charing Space.",
                    "updated": 1616932593483,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Warning",
            "text": "The charting space is known for blowing people's minds. Please, refrain from continuing with this tutorial if you are currently under the influence of psychoactive substances.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il Charting Space può sbalordire al punto da far girare la testa. Non proseguire questo tutorial se ti trovi sotto l'effetto di sostanze psicotrope.",
                    "updated": 1618647032231,
                    "style": "Warning"
                },
                {
                    "language": "ID",
                    "text": "Charting Space digunakan untuk meledakkan kepalamu. Dimohon untuk berhenti dari tutorial ini jika kamu merasakan hal di bawah pengaruh zat psikoaktif.",
                    "updated": 1616932686549,
                    "style": "Warning"
                }
            ],
            "updated": 1616416552336
        }
    ]
}