{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 8,
    "type": "Tutorial Step - About Small Hardware",
    "definition": {
        "text": "While minimalist hardware like the Raspberry Pi can handle the Superalgos Client to run both data and trading tasks, some may be too small for active work!",
        "updated": 1610615755927,
        "icon": {
            "name": "bullet-warning",
            "project": "Superalgos"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Anche se dispositivi embedded come il Raspberry Pi possono gestire il Client Superalgos per eseguire sia le task relative ai dati che quelle relative al trading, alcuni potrebbero non essere abbastanza potenti.",
                "updated": 1614718975756
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The core idea behind running the client in small physical or virtual hardware is to maximize cost efficiency in production deployments. In such contexts, the UI is used to a minimum.",
            "updated": 1610616659750,
            "translations": [
                {
                    "language": "IT",
                    "text": "Eseguire il Client in hardware fisici o virtuali dalle dimensioni ridotte ha l'obiettivo di massimizzare l'efficienza dei costi in un ambiente di produzione. In questi contesti, l'utilizzo della UI é ridotto al minimo.",
                    "updated": 1614718792202
                }
            ]
        },
        {
            "style": "Success",
            "text": "If you notice your small hardware is too slow during this tutorial, you may want to consider installing in regular hardware until you learn Superalgos, build your first strategies, and are ready to deploy. Otherwise, it may be frustrating.",
            "updated": 1610616740275,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se durante questo tutorial ti accorgi che il tuo sistema embedded é troppo lento, considera l'idea di installarlo su un sistema con un hardware normale finché non impari le basi, costruisci le tue prime strategie e sei pronto a rilasciarle. Altrimenti può essere frustrante.",
                    "updated": 1614719047421
                }
            ]
        }
    ]
}