{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 24,
    "type": "Tutorial Step - Broke Something?",
    "definition": {
        "icon": {
            "project": "Superalgos",
            "name": "workspace"
        },
        "text": "If you ever break something&mdash;like deleting a node or changing a configuration&mdash;and don't know how to deal with the outcome...",
        "translations": [
            {
                "language": "IT",
                "text": "Se ti capiterà mai di rompere qualcosa (per esempio cancellare un nodo o cambiare una configurazione) e non sai come sistemare...",
                "updated": 1614791180230,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Jika kamu merusak sesuatu seperti menghapus node atau merubah konfigurasi dan tidak tahu cara untuk menghadapinya...",
                "updated": 1616770121960,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si alguna vez rompes algo -como borrar un nodo por error o cambiar la configuración- y no sabes cómo afrontar el resultado...",
                "updated": 1618438157553
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "... there is an easy way to start over with a brand new workspace!",
            "translations": [
                {
                    "language": "IT",
                    "text": "...c'è un modo semplice di ricominciare con un nuovo workspace!",
                    "updated": 1614791206441,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "... ada cara mudah untuk memulai kembali dengan workspace baru!",
                    "updated": 1616770151572,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Hay una manera facil de empezar con un espacio de trabajo como nuevo",
                    "updated": 1618438101054
                }
            ]
        },
        {
            "style": "Text",
            "text": "All you need to do is pull the tab on the left-hand side of the screen and click on the Getting-Started plugin workspace.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Tutto ciò che devi fare è tirare la tab sul lato sinistro dello schermo e cliccare sul plugin workspace Getting-Started.",
                    "updated": 1614791245119,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "yang kamu butuhkan yaitu menarik tab yang ada di sisi kiri dari layarmu dan click pada Getting-Started plugin workspace.",
                    "updated": 1616770232356,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Todo lo que tienes que hacer es tirar de la pestaña de la izquierda de la pantalla y hacer clic en Getting-Started plugin workspace.",
                    "updated": 1618438234984
                }
            ]
        },
        {
            "style": "Success",
            "text": "A brand new Getting Started workspace will load and I will show up again, fresh from the start!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Un workspace Getting-Started nuovo e pulito verrà caricato e lanciato dall'inizio!",
                    "updated": 1614791287049,
                    "style": "Success"
                },
                {
                    "language": "ID",
                    "text": "Getting Started wokspace yang baru akan dimuat dan muncul kembali, seperti memulai dari awal!",
                    "updated": 1616770297595,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Se cargará un nuevo espacio de trabajo de \"Getting Started\" y apareceré de nuevo, fresco desde el principio!",
                    "updated": 1618438286128
                }
            ]
        }
    ]
}