{
    "topic": "Docs Commands Messages",
    "pageNumber": 2,
    "type": "Docs Message - Reindexing Started",
    "definition": {
        "text": "The docs.reindex command started the rebuilding of the Docs Search Engine Index.",
        "updated": 1610972866423,
        "translations": [
            {
                "language": "IT",
                "text": "Il comando docs.reindex ha avviato la ricostruzione del Docs Search Engine Index.",
                "updated": 1614713649286,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "docs.reindex command akan menyusun ulang Docs Search Engine Index.",
                "updated": 1616764015935,
                "style": "Definition"
            },
            {
                "language": "FR",
                "text": "La commande docs.reindex lance la reconstruction de l'index du moteur de recherche Docs.",
                "updated": 1630748344734
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "Reindexing is a resource-intensive process. While the process is running, you will not be able to use the interface since all CPU resources are dedicated to recreating the index as fast as possible. ",
            "updated": 1610973251479,
            "translations": [
                {
                    "language": "IT",
                    "text": "La reindicizzazione é un processo dispendioso dal punto di vista computazionale. Mentre é in atto, non sarai in grado di usare l'interfaccia grafica perché tutte le risorse della CPU saranno impegnate a ricostruire l'indice il più velocemente possibile.",
                    "updated": 1614713781526,
                    "style": "Success"
                },
                {
                    "language": "ID",
                    "text": "Reindexing merupakan proses intensif sumber daya. Saat proses berjalan, kamu tidak akan dapat menggunakan antarmuka karena semua sumber daya CPU didedikasikan untuk membuat ulang indeks secepat mungkin.",
                    "updated": 1616764125582,
                    "style": "Success"
                },
                {
                    "language": "FR",
                    "text": "La réindexation est un processus gourmand en ressources. Pendant que le processus est en cours, vous ne pourrez pas utiliser l'interface car toutes les ressources du processeur sont consacrées à la recréation de l'index le plus rapidement possible.",
                    "updated": 1630748396792
                }
            ]
        },
        {
            "style": "Text",
            "text": "The weight of your workspace impacts the time required to reindex the content since every node in the workspace must be scanned. All code and configurations are indexed. ",
            "translations": [
                {
                    "language": "IT",
                    "text": "La dimensione del tuo Workspace ha influenza sul tempo richiesto per la reindicizzazione, perché ogni suo nodo deve essere scansionato. Tutto il codice e le varie configurazioni sono indicizzate.",
                    "updated": 1614714208819,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Beratnya workspace berdampak pada waktu yang digunakan untuk reindex konten karena tiap node di workspace harus discan. Semua code dan konfigurasi juga diindex.",
                    "updated": 1616764251832,
                    "style": "Text"
                },
                {
                    "language": "FR",
                    "text": "La taille de votre Workspace a un impact sur le temps nécessaire à la réindexation du contenu puisque chaque nœud du workspace doit être analysé. Tous les codes et configurations sont indexés.",
                    "updated": 1630748453678
                }
            ]
        },
        {
            "style": "Text",
            "text": "Hold on for a few seconds until the process finishes. You will receive a new message when it's over.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Aspetta qualche secondo perché il processo finisca. Riceverai un messaggio quando questo avviene.",
                    "updated": 1614713939759,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Tunggu sebentar untuk beberapa detik sampai proses selesai. Kamu akan mendapatkan pesan baru setelah selesai.",
                    "updated": 1616764371829,
                    "style": "Text"
                },
                {
                    "language": "FR",
                    "text": "Patientez quelques secondes jusqu'à la fin du processus. Vous recevrez un nouveau message lorsque celui-ci sera terminé.",
                    "updated": 1630748481744
                }
            ]
        }
    ]
}