{
    "topic": "Docs Commands Messages",
    "pageNumber": 1,
    "type": "Docs Message - Saving Done",
    "definition": {
        "text": "The docs.save command was successful and all changes were saved at the Superalgos Client.",
        "updated": 1611937734586,
        "translations": [
            {
                "language": "ID",
                "text": "Perintah docs.save telah selesai dan setiap perubahan telah tersimpan di Client Superalgos.",
                "updated": 1613861161653,
                "style": "Definition"
            },
            {
                "language": "IT",
                "text": "L'istruzione docs.save é stata eseguita con successo e tutte le modifiche sono state salvate sul Client.",
                "updated": 1614711069063,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "El comando docs.save tuvo éxito y todos los cambios se guardaron en el Cliente Superalgos.",
                "updated": 1680708765419,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Der Befehl docs.save war erfolgreich und alle Änderungen wurden auf dem Superalgos Client gespeichert.",
                "updated": 1633901325278
            },
            {
                "language": "RU",
                "text": "Команда docs.save была выполнена успешно, и все изменения были сохранены в клиенте Superalgos Client.",
                "updated": 1637925175363
            },
            {
                "language": "TR",
                "text": "docs.save komutu başarılı oldu ve tüm değişiklikler Superalgos İstemcisine kaydedildi",
                "updated": 1640002778163
            },
            {
                "language": "NL",
                "text": "De opdracht docs.save is gelukt en alle wijzigingen zijn opgeslagen in de Superalgos-client.",
                "updated": 1669749167457
            },
            {
                "language": "PT",
                "text": "O comando docs.save foi bem-sucedido e todas as alterações foram guardadas no Cliente Superalgos.",
                "updated": 1711479834565
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "All the latest changes to node, concept, topic, tutorial, review, and book pages have been saved to disk.",
            "updated": 1610973308339,
            "translations": [
                {
                    "language": "ID",
                    "text": "Setiap perubahan dari halaman node, concept, topic, tutorial, review, dan book sudah tersimpan kedalam perangkat.",
                    "updated": 1613861219116,
                    "style": "Success"
                },
                {
                    "language": "IT",
                    "text": "Tutte le ultime modifiche a nodi, concetti, argomenti, tutorial, recensioni e pagine sono state salvate su disco.",
                    "updated": 1614713472019,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Alle Änderungen an node, concept, topic, tutorial, review, und book pages wurden auf der Festplatte gespeichert.",
                    "updated": 1677190798473
                },
                {
                    "language": "RU",
                    "text": "Все последние изменения узла, концепций, тем, учебной пособии, обзоров и страниц книги были сохранены на диск.",
                    "updated": 1637925337735
                },
                {
                    "language": "TR",
                    "text": "Node, concept, topic, tutorial, review, and dokümanlar sayfalarındaki en son değişikliklerin tümü diske kaydedildi.",
                    "updated": 1640002830025
                },
                {
                    "language": "ES",
                    "text": "Todos los últimos cambios en las páginas de nodos, conceptos, temas, tutoriales, revisiones y libros se han guardado en el disco.",
                    "updated": 1668195020322
                },
                {
                    "language": "PT",
                    "text": "Todas as últimas alterações nas páginas de nó (node), conceitos, título, tutorial, revisão e livro foram guardadas no seu disco.",
                    "updated": 1711480018676
                }
            ]
        }
    ]
}