{
    "topic": "Docs Commands Messages",
    "pageNumber": 4,
    "type": "Docs Message - Deleting Done",
    "definition": {
        "text": "The docs.delete command deleted from memory the page you requested.",
        "updated": 1610973738997,
        "translations": [
            {
                "language": "ID",
                "text": "docs.delete command menghapus page yang diminta dari memori.",
                "updated": 1616763338862,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Der Befehl docs.delete hat die von Ihnen angeforderte Seite aus dem Speicher gelöscht.",
                "updated": 1633903299265
            },
            {
                "language": "RU",
                "text": "Команда docs.delete удалила из памяти запрошенную вами страницу.",
                "updated": 1638461569361
            },
            {
                "language": "TR",
                "text": "docs.delete komutu, istediğiniz sayfayı bellekten sildi.",
                "updated": 1652203790727
            },
            {
                "language": "ES",
                "text": "El comando docs.delete ha borrado de la memoria la página solicitada.",
                "updated": 1677428110603
            },
            {
                "language": "PT",
                "text": "O comando docs.delete eliminou da memória a página que solicitou.",
                "updated": 1711481123695
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Important",
            "text": "The page was flagged to be deleted. It will be removed from the in-memory collection of pages once you run the Docs Save Command. The Docs Save Command instructs the Client to delete the file from disk. To remove the page from the index you must run the Docs Reindex Command.",
            "updated": 1610973712136,
            "translations": [
                {
                    "language": "ID",
                    "text": "Page ini ditandai untuk dihapus. Dan akan dihapus dari koleksi page dari memori setelah kamu menjalankan Docs Save Command yang mengintruksi Client untuk menghapus file dari disk. Untuk menghapus page dari index kamu harus menjalankan Docs Reindex Command.",
                    "updated": 1616763669131,
                    "style": "Important"
                },
                {
                    "language": "DE",
                    "text": "Die Seite wurde als \"zu löschen\" gekennzeichnet. Sie wird aus der speicherinternen Seitensammlung entfernt, sobald Sie den Befehl Docs Save Command ausführen. Der Docs Save Command weist den Client an, die Datei von der Festplatte zu löschen. Um die Seite aus dem Index zu entfernen, müssen Sie den Befehl Docs Reindex ausführen.",
                    "updated": 1677190977964
                },
                {
                    "language": "RU",
                    "text": "Страница была отмечена для удаления. Она будет удалена из коллекции страниц после запуска команды Docs Save Command, которая указывает клиенту Client удалить файл с диска. Чтобы удалить страницу из индекса, вы должны запустить команду Docs Reindex Command.",
                    "updated": 1638461829275
                },
                {
                    "language": "TR",
                    "text": "Sayfa silinmek üzere işaretlendi. Belgeleri Kaydetme Komutunu ( Docs Save Command ) çalıştırdığınızda, bellek içi sayfa koleksiyonundan kaldırılacaktır. Dokümanları Kaydetme Komutu ( Docs Save Command ) İstemciye dosyayı diskten silmesini söyler. Sayfayı dizinden kaldırmak için Dokümanları indexleme ( Docs Reindex Command )Komutunu çalıştırmalısınız.",
                    "updated": 1652204084183
                },
                {
                    "language": "ES",
                    "text": "La página ha sido marcada para ser borrada. Se eliminará de la colección de páginas en memoria una vez que ejecute el comando Docs Save Command. El comando Docs Save Command indica al Client que elimine el archivo del disco. Para eliminar la página del índice, es necesario ejecutar el comando Docs Reindex.",
                    "updated": 1677428114802
                },
                {
                    "language": "PT",
                    "text": "A página foi marcada para ser excluída. Será removida da coleção de páginas em memória assim que executar o comando \"Docs Save Command\". O comando \"Docs Save Command\" instrui o Cliente a eliminar o ficheiro do disco. Para remover a página do índice, deve executar o comando \"Docs Reindex Command\".",
                    "updated": 1711481317337
                }
            ]
        }
    ]
}