{
    "type": "Data Building Procedure",
    "definition": {
        "text": "The data building procedure processes information to be fed to properties that are stored in the output dataset.",
        "translations": [
            {
                "language": "ES",
                "text": "El Data Building Procedure  procesa la información que se enviará a las propiedades que se almacenan en el conjunto de datos de salida.",
                "updated": 1624413867963
            },
            {
                "language": "RU",
                "text": "Data Building Procedure обрабатывает информацию, которая должна быть передана свойствам, хранящимся в выходном наборе данных.",
                "updated": 1638729673934
            },
            {
                "language": "DE",
                "text": "Die data building procedure verarbeitet die Informationen, die den Eigenschaften (properties) zugeführt werden, die im Ausgabedatensatz (output dataset) gespeichert sind.",
                "updated": 1637588171931
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "This procedure holds the core logic of the bot, as it features the code that performs the calculations required to produce the new data set. The code is split between a procedure initialization and a procedure loop.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Diese Prozedur enthält die Kernlogik des Bots, da sie den Code enthält, der die Berechnungen durchführt, die erforderlich sind, um den neuen Datensatz zu erzeugen. Der Code ist aufgeteilt in eine Prozedurinitialisierung (procedure initialization) und eine Prozedurschleife (procedure loop).",
                    "updated": 1637588231987
                },
                {
                    "language": "RU",
                    "text": "Эта процедура содержит основную логику бота, поскольку она содержит код, который выполняет вычисления, необходимые для создания нового набора данных. Код разделен между инициализацией процедуры и циклом процедуры.",
                    "updated": 1638729725869
                }
            ]
        }
    ]
}