{
    "tutorial": "How to set up a custom Rate Scale for an Indicator",
    "pageNumber": "1",
    "type": "How to set up a custom Rate Scale Tutorial",
    "definition": {
        "text": "This Tutorial explains the ins and outs of setting up a custom Rate Scale for an indicator.  A custom rate scale allows you to visualize multiple indicators side by side in even more flexible ways. ",
        "updated": 1617375842097,
        "translations": [
            {
                "language": "ES",
                "text": "Este Tutorial explica los entresijos de la configuración de un Rate Scalepara un indicador. Una escala de tasas personalizada le permite visualizar múltiples indicadores uno al lado del otro de formas aún más flexibles.",
                "updated": 1628906695538
            },
            {
                "language": "TR",
                "text": "Bu Eğitim, bir gösterge için özel bir Oran Ölçeği oluşturmanın tüm ayrıntılarını açıklar.  Özel bir oran ölçeği, birden fazla göstergeyi daha da esnek yollarla yan yana görselleştirmenize olanak tanır.",
                "updated": 1654394034656,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "In diesem Tutorial wird erklärt, wie man eine benutzerdefinierte Kursskala (Rate Scale) für einen Indikator einrichtet. Mit einer benutzerdefinierten Kursskala können Sie mehrere Indikatoren auf noch flexiblere Weise nebeneinander darstellen.",
                "updated": 1703089550026
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This Tutorial can be found in Workspace TBD",
            "updated": 1617375668105,
            "translations": [
                {
                    "language": "TR",
                    "text": "Bu Öğretici Çalışma Alanı TBD'de bulunabilir",
                    "updated": 1654394042173,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Dieses Tutorial befindet sich im Arbeitsbereich (Workspace) TBD",
                    "updated": 1703089565468
                }
            ]
        }
    ]
}