{
    "type": "Rate Scale",
    "definition": {
        "text": "The rate scale controls the scale of the vertical axis, that is, the scale of the quoted asset, either of the time machine or of the timeline chart, depending on where the node is located."
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Rate scales may exist both at the level of a time machine and at the level of a timeline chart, each affecting the corresponding concept."
        },
        {
            "style": "Text",
            "text": "When set at the level of the time machine, the scale settings affect all charts within the time machine. When set at the level of the timeline chart, the settings override the rate scale at the time machine level.",
            "updated": 1616512866155
        },
        {
            "style": "Success",
            "text": "This allows having multiple charts on the same time machine, each with a different rate scales. This is the way to set up indicators the are designed for a scale different than that of the rate of the assets in the market. For example, the RSI and Percentage Bandwidth indicators oscillate between 0 and 100.",
            "updated": 1616512886656
        },
        {
            "style": "Title",
            "text": "Scale Minimum and Maximum Values"
        },
        {
            "style": "Text",
            "text": "A rate scale has a minimum and a maximum value. The minimum value is the value at bottom of the chart. The maximum, is the value at the top of the chart."
        },
        {
            "style": "Text",
            "text": "In technical terms, the minimum and maximum scale values are constantly changing as, whenever you pan the charts vertically, you are directly affecting the minimum and maximum scale values. That said, the actual scale may change dynamically or not, depending on the scale-automation settings.",
            "updated": 1616512946283
        },
        {
            "style": "Title",
            "text": "Automatic Scale"
        },
        {
            "style": "Text",
            "text": "The system features an automatic adjustment of the scale, which is turned on by default in some of the Plugin Workspaces. The scale may be automatic in its minimum value, in its maximum value, on both, or on none (manual mode).",
            "updated": 1616513013651
        },
        {
            "style": "List",
            "text": "When the scale is automatic in the minimum value, the scale is adjusted so that no piece of information in the span of the chart ever remains below the bottom of the chart. As a result, the lowest data point aligns with the bottom of the chart."
        },
        {
            "style": "List",
            "text": "When the scale is automatic in the maximum value, the scale is adjusted so that no piece of information in the span of the chart ever remains above the top of the chart. As a result, the highest data point aligns with the top of the chart."
        },
        {
            "style": "List",
            "text": "The scale may be automated on either, or both minimum and maximum values at the same time. In the later case, no data point in the span of the chart ever remains out of the visible area of the chart, as the lowest data point aligns with the bottom of the chart and the highest aligns with the top."
        },
        {
            "style": "Title",
            "text": "Manual Scale"
        },
        {
            "style": "Text",
            "text": "The system also features a manual mode. When in manual mode the scale does not change, even if the minimum and maximum values change while panning across a chart. This design feature allows comparing different periods using the same scale, which may be valuable in many cases."
        },
        {
            "style": "Title",
            "text": "Scale Offset"
        },
        {
            "style": "Text",
            "text": "The offset is a feature of the rate scale by which the scale may be shifted upwards or downwards. As a result, charts aligned on the vertical axis&mdash;synchronized in datetime by a shared time machine&mdash;may be put one above the other. In technical terms, what happens is that the scale is shifted upwards or downwards."
        },
        {
            "style": "Block",
            "text": "Charts",
            "updated": 1616673863766
        },
        {
            "style": "Title",
            "text": "Rate Scale at the Charts"
        },
        {
            "style": "Subtitle",
            "text": "Automatic Scale",
            "updated": 1609783271471
        },
        {
            "style": "Text",
            "text": "To change the automatic scale settings, place the mouse pointer over the corresponding time machine or timeline chart rate box, press the Shift key and slowly scroll the wheel of the mouse. The action cycles through different possible scale automation settings. ",
            "updated": 1616513170991
        },
        {
            "style": "Text",
            "text": "You may also place the mouse pointer on the scale box and use the side arrows ← → to toggle through the different automation settings.",
            "updated": 1616513210816
        },
        {
            "style": "Success",
            "text": "Notice a tiny green triangle below and/or above the rate scale icon."
        },
        {
            "style": "List",
            "text": "A triangle pointing up means that the maximum value of the scale is automatic."
        },
        {
            "style": "List",
            "text": "A triangle pointing down means that the minimum value of the scale is automatic."
        },
        {
            "style": "List",
            "text": "Both triangles present at the same time means that both minimum and maximum values are automatic."
        },
        {
            "style": "List",
            "text": "No triangle means that both minimum and maximum values are in manual mode."
        },
        {
            "style": "Subtitle",
            "text": "Manual Scale",
            "updated": 1609783276345
        },
        {
            "style": "Text",
            "text": "To adjust the scale, make sure either or both minimum and maximum values are in manual mode. Place the mouse pointer over the corresponding time machine or timeline chart rate box and scroll the wheel of the mouse. The scale will increase or decrease accordingly, depending on which values are set to manual.",
            "updated": 1616513228715
        },
        {
            "style": "Text",
            "text": "Alternatively, you may also place the mouse pointer on the scale box and use the vertical arrows ↑ ↓ to affect the scale.",
            "updated": 1616513309746
        },
        {
            "style": "Text",
            "text": "Notice that, while changing the scale, a number is displayed replacing the actual rate. This is a reference value of the scale, that may serve for comparison purposes, with scales in other charts."
        },
        {
            "style": "Note",
            "text": "This action has no effect when both minimum and maximum values are set to automatic mode."
        },
        {
            "style": "Subtitle",
            "text": "Scale Offset",
            "updated": 1609783281780
        },
        {
            "style": "Text",
            "text": "To shift or offset a timeline chart on the vertical axis, place the mouse pointer on the rate box, left-click and drag upwards or downwards, as desired. The timeline chart will shift in the specified direction while the remaining charts stay in the same position.",
            "updated": 1616513340914
        },
        {
            "style": "Note",
            "text": "Setting an offset in a timeline chart only makes sense in the context of a time machine with multiple charts. That is, if you are browsing a single chart, an offset behaves the same as moving the single chart up or down."
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609783339189
        },
        {
            "style": "Title",
            "text": "Rate Scale Configuration",
            "updated": 1609783329574
        },
        {
            "style": "Subtitle",
            "text": "Properties"
        },
        {
            "style": "List",
            "text": "minValue is a numerical value that represents the value of the scale at the bottom of the chart.",
            "updated": 1609783389883
        },
        {
            "style": "List",
            "text": "maxValue is a numerical value that represents the value of the scale at the top of the chart."
        },
        {
            "style": "List",
            "text": "autoMinScale sets the mode of the scale for the minimum value; true sets the value to automatic, false sets the value to manual."
        },
        {
            "style": "List",
            "text": "autoMaxScale sets the mode of the scale for the maximum value; true sets the value to automatic, false sets the value to manual."
        }
    ]
}