{
    "type": "Telegram Groups",
    "definition": {
        "text": "Telegram groups are currently the communication tool for all people who want to participate and organize the project/Governance. No matter if developers, translators, UI/UX designers etc.. Everyone can ask their questions here or discuss with others. Beside the main communication tool Telegram, an discord server exists. Feel free to extend or correct the list.",
        "updated": 1640219649114
    },
    "paragraphs": [
        {
            "style": "Warning",
            "text": "Important as Scammers are always around. Community Mods never! PM (send you a private message) you first. They will only write to you if you write to them first. It may be that if they want to help you, they will tell you in a group that you should write to them, but they will not write to you on their own. A good tool to check if you are writing with e.g. the real julian molina is the username. This appears when you click on his telegram account via username. There it should say: @julianmolina. If a scammer has contacted you and told you that he has a very good strategy or anything else, do not do what he says, block him and report him inside the telegram group and leave a message in the superalgos groups. Never give out your access data to your wallet, your coins or your pc. Never!",
            "updated": 1640216439295
        },
        {
            "style": "Text",
            "text": "Now that you know that you should never share your data, I'll explain to you exactly how it works with telegram groups. There are several Superalgos telegram groups. Each Telegram group has its own \"topic\". The official Superlagos group with the most members is the \"Superalgos Community\" group. Here you can always ask questions of any kind.",
            "updated": 1640216748878
        },
        {
            "style": "Success",
            "text": "You can stay as anonymous as you want on Telegram. You dont need to reveal any personal data.",
            "updated": 1640220211571
        },
        {
            "style": "Title",
            "text": "General things about Telegram groups and how to work with them:",
            "updated": 1640217254427
        },
        {
            "style": "List",
            "text": "Stay friendly and respectful the whole time",
            "updated": 1640219745137
        },
        {
            "style": "List",
            "text": "Feel free to ask even if you think your question might sound stupid. We all started at the same point",
            "updated": 1640219798996
        },
        {
            "style": "List",
            "text": "Try to find the correct group for your concern ",
            "updated": 1640219862850
        },
        {
            "style": "List",
            "text": "If it is possible put your questions only in one group",
            "updated": 1640219969568
        },
        {
            "style": "List",
            "text": "You can later on reference your mentors/user-supporters if you take part in governance.",
            "updated": 1640220116496
        },
        {
            "style": "List",
            "text": "Welcome to the Superalgos community ;)",
            "updated": 1640220002482
        },
        {
            "style": "Title",
            "text": "Most important Telegram groups shortly explained:",
            "updated": 1640216707814
        },
        {
            "style": "Subtitle",
            "text": "Superalgos Community",
            "updated": 1640216785721
        },
        {
            "style": "Text",
            "text": "This Group is the biggest official Superalgos-Telegram-group with at the moment over 1.752 members. This group is a good start if you have questions or just want to find orientation within the Superalgos Organisation/Project.",
            "updated": 1640217018273
        },
        {
            "style": "Subtitle",
            "text": "Superalgos Support",
            "updated": 1640217043087
        },
        {
            "style": "Text",
            "text": "In this group, you can ask any question regarding problems with your installation. Under the at the moment 459 members are people who know how to resolve nearly any problem. If your installation doesn`t work or Superalgos doesn`t start probably, just ask your question in this group. No matter how technical it is.",
            "updated": 1640217209199
        },
        {
            "style": "Important",
            "text": "If you send pictures for making debugging easier, anonymize the pictures as far as possible and as far as you want. You don`t need to send pictures at all, remember that.",
            "updated": 1640220286126
        },
        {
            "style": "Subtitle",
            "text": "Superalgos Announcements",
            "updated": 1640217314806
        },
        {
            "style": "Text",
            "text": "In this group you get regulary updates about how Superalgos develops. You get Information about new Medium articles published about the project and how you can help the project. It is always smart joining this telegram channel as you stay informed automatically without needing to be in every group. Think of this channel like a Superalgos Newsticker. This group is not for discussion. ",
            "updated": 1640217747337
        },
        {
            "style": "Title",
            "text": "Below you will find the links to the most important Superalgos groups:",
            "updated": 1640217840276
        },
        {
            "style": "Table",
            "text": "| Group Name | Telegram Group/Channel link |\n| Superalgos Community | https://t.me/superalgoscommunity |\n| Superalgos Support | https://t.me/superalgossupport |\n| Superalgos Announcements| https://t.me/superalgos |\n| Superalgos Develop | https://t.me/superalgosdevelop |\n| Superalgos Docs | https://t.me/superalgosdocs |\n| Superalgos Translations | https://t.me/superalgostranslations |\n| Superalgos Marketing | https://t.me/superalgosmarketing |\n| Superalgos UX/UI Design | https://t.me/superalgosuxui |\n| Superalgos Data Mining | https://t.me/superalgosdatamining |\n| Superalgos Token | https://t.me/superalgostoken |",
            "updated": 1640219621965
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": "The links given in the Table will redirect you to the group, where you then can decide if you want to join the group/channel.",
            "updated": 1640219550646
        },
        {
            "style": "Title",
            "text": "Non-English Telegram Groups",
            "updated": 1640218930080
        },
        {
            "style": "Table",
            "text": "| Group topic | Telegram Group link |\n| Superalgos German Group | https://t.me/superalgos_de |\n| Superalgos russian Group | https://t.me/superalgos_ru |\n| Superalgos espanol Group | https://t.me/superalgos_es |\n| Superalgos Turkish group | https://t.me/tr_superalgos |",
            "updated": 1640219328711
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}