{
    "type": "Batch Size",
    "definition": {
        "text": "The number of examples in a batch. For example, the batch size of SGD is 1, while the batch size of a mini-batch is usually between 10 and 1000. Batch size is usually fixed during training and inference; however, TensorFlow does permit dynamic batch sizes.",
        "updated": 1613243372713,
        "translations": [
            {
                "language": "RU",
                "text": "Количество примеров в партии. Например, размер партии в SGD равен 1, а размер партии в мини-партии обычно составляет от 10 до 1000. Размер партии обычно фиксирован во время обучения и вывода; однако TensorFlow допускает динамическое изменение размера партии.",
                "updated": 1645195656073
            },
            {
                "language": "TR",
                "text": "Bir toplu işteki örnek sayısı. Örneğin, SGD'nin parti boyutu 1 iken, mini partinin parti boyutu genellikle 10 ila 1000 arasındadır. Toplu iş boyutu genellikle eğitim ve çıkarım sırasında sabittir; ancak TensorFlow dinamik toplu iş boyutlarına izin verir.",
                "updated": 1654396679271
            },
            {
                "language": "DE",
                "text": "Die Anzahl der Beispiele in einer Charge. Zum Beispiel ist die Stapelgröße von SGD 1, während die Stapelgröße eines Mini-Batches normalerweise zwischen 10 und 1000 liegt. Die Stapelgröße ist normalerweise während des Trainings und der Inferenz festgelegt; TensorFlow erlaubt jedoch dynamische Stapelgrößen.",
                "updated": 1706371579278
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If inputShape is specified and batchInputShape is not specified, batchSize is used to construct the batchInputShape: [batchSize,...inputShape]",
            "updated": 1613243409493,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если inputShape указан, а batchInputShape не указан, batchSize используется для построения batchInputShape: [batchSize,...inputShape].",
                    "updated": 1645195669838
                },
                {
                    "language": "TR",
                    "text": "inputShape belirtilmiş ve batchInputShape belirtilmemişse, batchInputShape'i oluşturmak için batchSize kullanılır: [batchSize,...inputShape]",
                    "updated": 1654396685172,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wenn inputShape angegeben ist und batchInputShape nicht, wird batchSize verwendet, um die batchInputShape zu konstruieren: [batchSize,...inputShape]",
                    "updated": 1706371591279
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Possible Values",
            "translations": [
                {
                    "language": "RU",
                    "text": "Возможные значения",
                    "updated": 1645195674573
                },
                {
                    "language": "TR",
                    "text": "Olası Değerler",
                    "updated": 1654396690982,
                    "style": "Subtitle"
                },
                {
                    "language": "DE",
                    "text": "Mögliche Werte",
                    "updated": 1706371598615
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "number"
        }
    ]
}