{
    "type": "LAN Network",
    "definition": {
        "text": "The network hierarchy provides the control functions for running data-mining and trading operations. Because operations may be run either on a single machine or distributed over a network of machines, it also contains definitions regarding the physical location in which nodes live or function.",
        "translations": [
            {
                "language": "RU",
                "text": "LAN Network обеспечивает функции управления для выполнения операций интеллектуального анализа данных и торговых операций. Поскольку операции могут выполняться либо на одной машине, либо распределяться по сети машин, он также содержит определения, касающиеся физического местоположения, в котором узлы находятся или функционируют.",
                "updated": 1638336238608
            },
            {
                "language": "ES",
                "text": "La jerarquia de la network proporciona las funciones de control para ejecutar el procesamiento de datos y las operaciones de trading. Dado que las operaciones pueden ejecutarse en una sola máquina o distribuirse en una red de máquinas, también contiene definiciones con respecto a la ubicación física en la que los nodos viven o funcionan.",
                "updated": 1624281124469
            },
            {
                "language": "DE",
                "text": "\nDie network hierarchy (Netzhierarchie) bietet die Kontrollfunktionen für die Durchführung von DataMining und trading operations (Handelsoperationen). Da die Operationen entweder auf einem einzigen Rechner oder über ein Netz von Rechnern verteilt ausgeführt werden können, enthält sie auch Definitionen bezüglich des physischen Standorts, an dem die Knoten leben oder arbeiten.\nDie network hierarchy (Netzhierarchie) bietet die Kontrollfunktionen für die Durchführung von DataMining und trading operations (Handelsoperationen). Da die Operationen entweder auf einem einzigen Rechner oder über ein Netz von Rechnern verteilt ausgeführt werden können, enthält sie auch Definitionen bezüglich des physischen Standorts, an dem die Knoten leben oder arbeiten.",
                "updated": 1639568652528
            },
            {
                "language": "EL",
                "text": "Η ιεραρχία δικτύου παρέχει τις λειτουργίες ελέγχου για την εκτέλεση λειτουργιών εξόρυξης δεδομένων και συναλλαγών. Επειδή οι λειτουργίες μπορούν να εκτελεστούν είτε σε ένα μόνο μηχάνημα είτε να κατανεμηθούν σε ένα δίκτυο μηχανών, περιέχει επίσης ορισμούς σχετικά με τη φυσική θέση στην οποία ζουν ή λειτουργούν οι κόμβοι.",
                "updated": 1641827650343
            },
            {
                "language": "TR",
                "text": "Ağ hiyerarşisi, veri madenciliği ve alım satım işlemlerini yürütmek için kontrol işlevleri sağlar. İşlemler tek bir makinede yürütülebildiği veya bir makine ağı üzerinden dağıtılabildiği için, düğümlerin yaşadığı veya işlev gördüğü fiziksel konuma ilişkin tanımları da içerir.",
                "updated": 1701083893818
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The network hierarchy defines where in the network you run each of the bots you choose to run, and where the data they output is stored.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Иерархия LAN Network определяет, где в сети вы запускаете каждого из выбранных вами ботов и где хранятся данные, которые они выводят.",
                    "updated": 1639553757767
                },
                {
                    "language": "DE",
                    "text": "Die Netzwerkhierarchie legt fest, an welcher Stelle des Netzwerks Sie die einzelnen Bots ausführen und wo die von den bots ausgegebenen Daten gespeichert werden.",
                    "updated": 1639568724618
                },
                {
                    "language": "EL",
                    "text": "Η ιεραρχία δικτύου ορίζει πού στο δίκτυο εκτελείτε καθένα από τα ρομπότ που επιλέγετε να εκτελεστούν και πού αποθηκεύονται τα δεδομένα που εξάγουν.",
                    "updated": 1641827681624
                },
                {
                    "language": "TR",
                    "text": "Ağ hiyerarşisi, çalıştırmayı seçtiğiniz botların her birini ağda nerede çalıştırdığınızı ve ürettikleri verilerin nerede depolandığını tanımlar.",
                    "updated": 1701083900922
                }
            ]
        },
        {
            "style": "Text",
            "text": "You will use the network hierarchy for the following purposes:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы будете использовать LAN Network для следующих целей:",
                    "updated": 1638336311510
                },
                {
                    "language": "DE",
                    "text": "Sie werden die Netzhierarchie für die folgenden Zwecke nutzen:",
                    "updated": 1639570749626
                },
                {
                    "language": "EL",
                    "text": "Θα χρησιμοποιήσετε την ιεραρχία δικτύου για τους ακόλουθους σκοπούς:",
                    "updated": 1641827704546
                },
                {
                    "language": "TR",
                    "text": "Ağ hiyerarşisini aşağıdaki amaçlar için kullanacaksınız:",
                    "updated": 1701083905834
                }
            ]
        },
        {
            "style": "List",
            "text": "To control your data mining operation — that is, tasks running sensor and indicator bots. Data mining tasks process data that may be consumed by others; for example, so that your trading systems may count with quality information.",
            "updated": 1611058647352,
            "translations": [
                {
                    "language": "RU",
                    "text": "Для управления операциями интеллектуального анализа данных, то есть задачами, запускающими сенсорные и индикаторные боты. Задачи интеллектуального анализа данных обрабатывают данные, которые могут быть использованы другими; например, чтобы ваши торговые системы могли рассчитывать на качественную информацию.",
                    "updated": 1638337563157
                },
                {
                    "language": "DE",
                    "text": "Zur Steuerung Ihrer Data Mining Operationen, d. h. der Aufgaben, die Sensor  und Indicator Bots ausführen. Data Mining tasks verarbeiten Daten, die von anderen genutzt werden können, z. B. damit Ihre trading systems mit qualitätsreichen Informationen rechnen können.",
                    "updated": 1639570835575
                },
                {
                    "language": "EL",
                    "text": "Για να ελέγξετε τη λειτουργία εξόρυξης δεδομένων σας — δηλαδή, εργασίες που εκτελούν ρομπότ αισθητήρων και δεικτών. Οι εργασίες εξόρυξης δεδομένων επεξεργάζονται δεδομένα που μπορεί να χρησιμοποιηθούν από άλλους. Για παράδειγμα, έτσι ώστε τα συστήματα συναλλαγών σας να μετρούν με ποιοτικές πληροφορίες.",
                    "updated": 1641827724923
                },
                {
                    "language": "TR",
                    "text": "Veri madenciliği operasyonunuzu kontrol etmek için - yani sensör ve gösterge botlarını çalıştıran görevler. Veri madenciliği görevleri, başkaları tarafından tüketilebilecek verileri işler; örneğin, ticaret sistemlerinizin kaliteli bilgilerle sayılabilmesi için.",
                    "updated": 1701083910000
                }
            ]
        },
        {
            "style": "List",
            "text": "To control your testing environment — that is, trading sessions including backtesting and paper trading sessions.",
            "updated": 1611073262412,
            "translations": [
                {
                    "language": "RU",
                    "text": "Для управления вашей тестовой средой, то есть торговыми сессиями, включая бэктестирование и бумажные торговые сессии.",
                    "updated": 1638337582273
                },
                {
                    "language": "DE",
                    "text": "Kontrolle der testing environement (Testumgebung), d. h. der trading sessions inklusive Backtesting und paper trading sessions.",
                    "updated": 1639570874728
                },
                {
                    "language": "EL",
                    "text": "Για να ελέγχετε το περιβάλλον δοκιμών σας — δηλαδή, συνεδρίες συναλλαγών, συμπεριλαμβανομένων των τεστ συνεδριών και συνεδριάσεων σε χαρτί.",
                    "updated": 1641827744182
                },
                {
                    "language": "TR",
                    "text": "Test ortamınızı kontrol etmek için - yani, geriye dönük test ve kağıt ticareti oturumları dahil olmak üzere ticaret oturumları.",
                    "updated": 1701083915074
                }
            ]
        },
        {
            "style": "List",
            "text": "To control your production environment&mdash;that is, forward testing, and live trading sessions.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Для управления производственной средой, то есть форвард-тестирования и торговых сессий в реальном времени.",
                    "updated": 1638337597816
                },
                {
                    "language": "DE",
                    "text": "zur Kontrolle Ihrer production environment (Produktionsumgebung), d. h. für forward testing (Vorwärtstests) und live trading sessions.",
                    "updated": 1639570942222
                },
                {
                    "language": "EL",
                    "text": "•\tΓια να ελέγχετε το περιβάλλον παραγωγής σας—δηλαδή, μελλοντικές δοκιμές και ζωντανές συνεδρίες συναλλαγών.",
                    "updated": 1641827763634
                },
                {
                    "language": "TR",
                    "text": "Üretim ortamınızı kontrol etmek için - yani, ileri test ve canlı ticaret oturumları.",
                    "updated": 1701083919274
                }
            ]
        },
        {
            "style": "List",
            "text": "To manage the storage of the data produced by the bots you run as outputs. This includes administering the physical locations on which the data products produced by bots reside.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы управлять хранением данных, созданных ботами, вы запускаете их в качестве выходных данных. Это включает в себя администрирование физических местоположений, на которых размещаются информационные продукты, созданные ботами.",
                    "updated": 1638337618647
                },
                {
                    "language": "DE",
                    "text": "Verwaltung der Speicherung der Daten, die von den Bots erzeugt werden, die Sie als Outputs ausführen. Dazu gehört auch die Verwaltung der physischen Speicherorte, an denen die von den Bots erzeugten Datenprodukte gespeichert werden.",
                    "updated": 1639570975495
                },
                {
                    "language": "EL",
                    "text": "Για να διαχειριστείτε την αποθήκευση των δεδομένων που παράγονται από τα ρομπότ που εκτελείτε ως αποτελέσματα. Αυτό περιλαμβάνει τη διαχείριση των φυσικών τοποθεσιών στις οποίες βρίσκονται τα προϊόντα δεδομένων που παράγονται από ρομπότ.",
                    "updated": 1641827779980
                },
                {
                    "language": "TR",
                    "text": "Çıktı olarak çalıştırdığınız botlar tarafından üretilen verilerin depolanmasını yönetmek. Bu, botlar tarafından üretilen veri ürünlerinin bulunduğu fiziksel konumların yönetilmesini içerir.",
                    "updated": 1701083924375
                }
            ]
        },
        {
            "style": "Warning",
            "text": "At this stage, the system does not implement any form of security measures, therefore, Superalgos is to be run in the context of a restricted Local Area Network only, unless you implement your own network security.",
            "translations": [
                {
                    "language": "RU",
                    "text": "На данном этапе в системе не реализованы какие-либо меры безопасности, поэтому Superalgos следует запускать только в контексте ограниченной локальной сети, если вы не реализуете собственную сетевую безопасность.",
                    "updated": 1638337639123
                },
                {
                    "language": "DE",
                    "text": "In diesem Stadium implementiert das System keinerlei Sicherheitsmaßnahmen, daher sollte Superalgos nur im Rahmen eines eingeschränkten lokalen Netzwerks betrieben werden, es sei denn, Sie implementieren Ihre eigene Netzwerksicherheit.",
                    "updated": 1639570995473
                },
                {
                    "language": "EL",
                    "text": "Σε αυτό το στάδιο, το σύστημα δεν εφαρμόζει κανενός είδους μέτρα ασφαλείας, επομένως, το Superalgos πρέπει να εκτελείται μόνο στο πλαίσιο ενός περιορισμένου τοπικού δικτύου, εκτός εάν εφαρμόζετε τη δική σας ασφάλεια δικτύου.",
                    "updated": 1641827797173
                },
                {
                    "language": "TR",
                    "text": "Bu aşamada, sistem herhangi bir güvenlik önlemi uygulamamaktadır, bu nedenle Superalgos, kendi ağ güvenliğinizi uygulamadığınız sürece yalnızca kısıtlı bir Yerel Alan Ağı bağlamında çalıştırılmalıdır.",
                    "updated": 1701083931986
                }
            ]
        }
    ]
}