{
    "type": "First Steps Tutorials",
    "definition": {
        "text": "This book walks you through the path that will help you learn Superalgos in the most efficient possible way. Interactive tutorials are the very best tool to tackle the learning curve. Doing the tutorials in the order proposed is highly recommended.",
        "updated": 1610915328705
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You can explore the content of these tutorials by reading this book, or even better, locate the tutorials in the workspace where they are defined and DO the tutorial there. There is a big difference between reading the content and doing the tutorial, since in the last case the tutorial will positionn you at the right places withing the Desing Space and the Charting Space so as to facilitate your understanding.",
            "updated": 1610015175932
        },
        {
            "style": "Chapter",
            "text": "I->Superalgos->Tutorial->Welcome to Superalgos!->You have most likely already done the Welcome tutorial. However, it is so densely packed with information that most users choose to do it more than once. Find the Welcome tutorial in the Getting Started plugin workspace.",
            "updated": 1610915848630
        },
        {
            "style": "Chapter",
            "text": "II->Superalgos->Tutorial->Install a New Market->If you are anxious to start trying things out in your preferred altcoin markets, this tutorial teaches you how to set them up. Find this tutorial in the Getting Started plugin workspace.",
            "updated": 1610916232999
        },
        {
            "style": "Chapter",
            "text": "III->Superalgos->Tutorial->Trading Bot Layers->This tutorial expands what you learned on the Welcome tutorial about the layers that the Trading Bot makes available in the charts. It is fundamental information to understand your backtests and simulations in general. Find this tutorial in the Weak-hands Buster V2 plugin workspace.",
            "updated": 1610916386240
        },
        {
            "style": "Chapter",
            "text": "IV->Superalgos->Tutorial->Intro to Trading Systems->This is the first tutorial in a series about building trading systems and the strategies within. The tutorial lays out the key aspects of the framework so that you may open your mind to what comes next. Find this tutorial in the Trading Systems Design Tutorial workspace.",
            "updated": 1610916756033
        },
        {
            "style": "Chapter",
            "text": "V->Superalgos->Tutorial->Defining a Trading Idea->This tutorial is the second in the series about building strategies. It covers the conceptual aspects of formulating a testable trading idea, a requirement for designing a trading strategy.",
            "updated": 1610916978397
        },
        {
            "style": "Chapter",
            "text": "VII->Superalgos->Tutorial->Testing a Trading Idea - The Trigger Stage->This tutorial is the third in the series about building strategies. It covers the implementation of the trading idea developed in the previous tutorial, at the level of the Trigger Stage.",
            "updated": 1610917153325
        },
        {
            "style": "Chapter",
            "text": "VIII->Superalgos->Tutorial->"
        },
        {
            "style": "Chapter",
            "text": "IX->Superalgos->Tutorial->"
        }
    ]
}