{
    "topic": "Polus Data Mine",
    "pageNumber": 10,
    "type": "Relative Vigor Index",
    "definition": {
        "text": "The Relative Vigor Index (RVI) is a momentum indicator similar to the Stochastic indicator. The RVI compares candle open and closes to determine the output trend, instead of the Stochastic's comparison of a candle's close to minimum.",
        "translations": [
            {
                "language": "RU",
                "text": "Relative Vigor Index (RVI) - это индикатор импульса, аналогичный индикатору Stochastic. RVI сравнивает открытия и закрытия свечей для определения выходного тренда, вместо того чтобы сравнивать закрытие свечи с минимумом, как это делает Стохастик.",
                "updated": 1645716018763
            },
            {
                "language": "DE",
                "text": "Der Relative Vigor Index (RVI) ist ein Momentum Indikator, der dem Stochastik Indikator ähnlich ist. Der RVI vergleicht die offenen und geschlossenen Kerzen, um den Ausgangstrend zu bestimmen, anstatt wie die Stochastik den Schluss einer Kerze mit dem Minimum zu vergleichen.",
                "updated": 1671347548444
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Info:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Информация:",
                    "updated": 1645716023784
                }
            ]
        },
        {
            "style": "Text",
            "text": "From Investopedia: The Relative Vigor Index (RVI) is a momentum indicator used in technical analysis that measures the strength of a trend by comparing a security's closing price to its trading range while smoothing the results using a simple moving average (SMA).",
            "translations": [
                {
                    "language": "RU",
                    "text": "Из Investopedia: Relative Vigor Index (RVI) - это индикатор импульса, используемый в техническом анализе, который измеряет силу тренда, сравнивая цену закрытия ценной бумаги с ее торговым диапазоном и сглаживая результаты с помощью простой скользящей средней (SMA).",
                    "updated": 1645716029817
                },
                {
                    "language": "DE",
                    "text": "Der Relative Vigor Index (RVI) ist ein in der technischen Analyse verwendeter Momentum Indikator, der die Stärke eines Trends misst, indem er den Schlusskurs eines Wertpapiers mit seiner Handelsspanne vergleicht und die Ergebnisse mithilfe eines einfachen gleitenden Durchschnitts (SMA) glättet.",
                    "updated": 1671347590267
                }
            ]
        },
        {
            "style": "Link",
            "text": "Investopedia: RVI->www.investopedia.com/terms/r/relative_vigor_index.asp"
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Polus-RVI.png"
        },
        {
            "style": "Text",
            "text": "The length of the calculation for the RVI can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Loop under ’RVI’ Product Definition.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Длину расчета для RVI можно изменить, найдя и открыв Javascript Code в разделе Data Building Procedure -> Procedure Loop в разделе 'RVI' Product Definition.",
                    "updated": 1645716038433
                },
                {
                    "language": "DE",
                    "text": "Die Länge der Berechnung für den RVI kann geändert werden, indem der Javascript Code unter Data Building Procedure -> Procedure Loop unter ’RVI’ Product Definition gesucht und geöffnet wird.",
                    "updated": 1671347661421
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Polus-RVI-params.png"
        },
        {
            "style": "Title",
            "text": "Products & Properties",
            "translations": [
                {
                    "language": "RU",
                    "text": "Продукты и свойства",
                    "updated": 1645716043448
                },
                {
                    "language": "DE",
                    "text": "Produkte & Eigenschaften",
                    "updated": 1671347684992
                }
            ]
        },
        {
            "style": "Text",
            "text": "The following properties are available to access:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Доступны следующие свойства:",
                    "updated": 1645716049604
                },
                {
                    "language": "DE",
                    "text": "Die folgenden Eigenschaften sind zugänglich:",
                    "updated": 1671347705206
                }
            ]
        },
        {
            "style": "Table",
            "text": "| Product Name | Product Variable | Properties |\n| RVI | RVI | rvi, signal |",
            "translations": [
                {
                    "language": "DE",
                    "text": "| Produktname | Produktvariable | Eigenschaften |\n| RVI | RVI | rvi, signal |",
                    "updated": 1671347727915
                }
            ]
        },
        {
            "style": "Text",
            "text": "Example:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Пример:",
                    "updated": 1645716055423
                },
                {
                    "language": "DE",
                    "text": "Beispiel:",
                    "updated": 1671347750336
                }
            ]
        },
        {
            "style": "Text",
            "text": "A simple strategy could be built to open a trade when the RVI crosses the signal line upwards:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Можно построить простую стратегию, которая будет открывать сделку, когда RVI пересечет сигнальную линию вверх:",
                    "updated": 1645716063097
                },
                {
                    "language": "DE",
                    "text": "Es könnte eine einfache Strategie entwickelt werden, um einen Handel zu eröffnen, wenn der RVI die Signallinie nach oben kreuzt:",
                    "updated": 1671347776909
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "chart.at01hs.RVI.rvi > chart.at01hs.RVI.signal && \nchart.at01hs.RVI.previous.rvi < chart.at01hs.RVI.previous.signal"
        },
        {
            "style": "Text",
            "text": "The RVI is prone to false signals in rangebound markets, so it is recommended to set longer lookback periods (at the cost of increasing lag), or to combine with a directional indicator such as ADX, RSI, or a divergence detector.",
            "translations": [
                {
                    "language": "RU",
                    "text": "RVI склонен к ложным сигналам на рынках, ограниченных диапазоном, поэтому рекомендуется устанавливать более длительные периоды оглядки (ценой увеличения запаздывания), или комбинировать с индикатором направленности, таким как ADX, RSI, или детектором дивергенции.",
                    "updated": 1645716071539
                },
                {
                    "language": "DE",
                    "text": "Der RVI ist anfällig für Fehlsignale in Märkten mit engen Bandbreiten, daher wird empfohlen, längere Rückblickzeiträume festzulegen (auf Kosten einer größeren Verzögerung) oder ihn mit einem Richtungsindikator wie ADX, RSI oder einem Divergenzmelder zu kombinieren.",
                    "updated": 1671347851029
                }
            ]
        },
        {
            "style": "Title",
            "text": "Maintainer:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Betreuer:",
                    "updated": 1671347868926
                }
            ]
        },
        {
            "style": "Link",
            "text": "@ThomasHuault (Telegram)->t.me/ThomasHuault"
        }
    ]
}