{
    "topic": "Polus Data Mine",
    "pageNumber": "8",
    "type": "Volatility Index",
    "definition": {
        "text": "The Volatility Index represents how an asset's prices moves around the calculated mean price.",
        "translations": [
            {
                "language": "RU",
                "text": "Индекс волатильности отражает движение цен актива вокруг рассчитанной средней цены.",
                "updated": 1645715773453
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Info:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Информация:",
                    "updated": 1645715779030
                }
            ]
        },
        {
            "style": "Text",
            "text": "According to investopedia: Volatility is a statistical measure of the dispersion of returns for a given security or market index. In most cases, the higher the volatility, the riskier the security. Volatility is often measured as either the standard deviation or variance between returns from that same security or market index.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Согласно investopedia: Волатильность - это статистическая мера дисперсии доходности для данной ценной бумаги или рыночного индекса. В большинстве случаев, чем выше волатильность, тем рискованнее ценная бумага. Волатильность часто измеряется как стандартное отклонение или дисперсия между доходностями одной и той же ценной бумаги или рыночного индекса.",
                    "updated": 1645715786963
                }
            ]
        },
        {
            "style": "Text",
            "text": "The volatility index indicator provides two signals, positive and negative. The positive volatility indicates periods of high choppiness or consolidation in the price action, where the negative signal potentially indicates a trend emerging, and as such, this lagging indicator is best used as a confimation indicator.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Индикатор индекса волатильности подает два сигнала - положительный и отрицательный. Положительный сигнал волатильности указывает на периоды высокой прерывистости или консолидации ценового действия, в то время как отрицательный сигнал потенциально указывает на зарождение тренда, и поэтому этот запаздывающий индикатор лучше всего использовать в качестве индикатора конфирмации.",
                    "updated": 1645715795507
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Polus-Volatility-Index.png"
        },
        {
            "style": "Text",
            "text": "The parameters of the volatility index can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Loop under ’Volatility Index’ Product Definition.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Параметры индекса волатильности можно изменить, найдя и открыв Javascript Code в разделе Data Building Procedure -> Procedure Loop под продуктом 'Volatility Index' Product Definition.",
                    "updated": 1645715805840
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Polus-Volatility-Index-params.png"
        },
        {
            "style": "Title",
            "text": "Products & Properties",
            "translations": [
                {
                    "language": "RU",
                    "text": "Продукты и свойства",
                    "updated": 1645715811902
                }
            ]
        },
        {
            "style": "Text",
            "text": "The indicator also includes data for bollinger bands and keltner channels if needed.",
            "translations": [
                {
                    "language": "RU",
                    "text": "При необходимости индикатор также включает данные для полос Боллинджера и каналов Кельтнера.",
                    "updated": 1645715820765
                }
            ]
        },
        {
            "style": "Text",
            "text": "The following properties are available to access:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Доступны следующие свойства:",
                    "updated": 1645715828444
                }
            ]
        },
        {
            "style": "Table",
            "text": "| Product Name | Product Variable | Properties |\n| Volatility Index | VolatilityIndex | upvol, lowvol |\n| | (Bollinger) | BOLMA, UPbol, LOWbol |\n| | (Keltner) | ema, upKelt, downKelt |"
        },
        {
            "style": "Text",
            "text": "Example:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Пример:",
                    "updated": 1645715836704
                }
            ]
        },
        {
            "style": "Text",
            "text": "A simple strategy could be built when the volatiliy positive index falls below the negative index, and the overall volatility falls below the zero line:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Можно построить простую стратегию, когда волатильность положительного индекса падает ниже отрицательного индекса, а общая волатильность падает ниже нулевой линии:",
                    "updated": 1645715844527
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "chart.at30min.VolatilityIndex.upvol < chart.at30min.VolatilityIndex.lowvol &&\n chart.at30min.VolatilityIndex.upvol < 0"
        },
        {
            "style": "Title",
            "text": "Maintainer:"
        },
        {
            "style": "Link",
            "text": "@ThomasHuault (Telegram)->t.me/ThomasHuault"
        }
    ]
}