{
    "type": "Social Trading Bot",
    "definition": {
        "text": "Social Trading Bots are a new kind of bot used within the Trading Signals process. A Social Trading Bot is the main interface between a signal provider and recipient.",
        "updated": 1643080425503
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1643080459294
        },
        {
            "style": "Text",
            "text": "A basic way to think about a Social Trading Bot is as a collection of signals, as well as all the information a recipient will need in order to subscribe and receive those signals."
        },
        {
            "style": "Text",
            "text": "Each Social Trading Bot defines the following information:"
        },
        {
            "style": "List",
            "text": "The bot’s Signing Account."
        },
        {
            "style": "List",
            "text": "Available Signals provided by this bot."
        },
        {
            "style": "List",
            "text": "The location of open storage where signal content is saved."
        },
        {
            "style": "List",
            "text": "Other Social Trading Bots Followed."
        },
        {
            "style": "Text",
            "text": "These Social Trading Bots are defined under the User Profile of the provider. Since they live within the provider’s profile and can be referenced by recipients, the Social Trading Bot is the only interface between the provider and and the recipient. This means that only signal data is shared, no other sensitive data or configuration details are vulnerable on the network or saved publicly."
        },
        {
            "style": "Block",
            "text": "Configuration",
            "updated": 1643080584759
        },
        {
            "style": "Title",
            "text": "Social Trading Bot Configuration"
        },
        {
            "style": "List",
            "text": "codeName This is the name this bot will use internally within the user's instance of the Superalgos Platform.",
            "updated": 1642907946205
        },
        {
            "style": "List",
            "text": "<code class=\"docs-code\">handle</code> This is the name this bot will use on the Superalgos peer to peer network.",
            "updated": 1642907895972
        }
    ]
}