{
    "type": "Social Trading Bot",
    "definition": {
        "text": "Social Trading Bots are a new kind of bot used within the Trading Signals process. A Social Trading Bot is the main interface between a signal provider and recipient.",
        "updated": 1643080425503,
        "translations": [
            {
                "language": "RU",
                "text": "Social Trading Bot - это новый вид ботов, используемых в процессе торговли сигналами. Social Trading Bot - это основной интерфейс между поставщиком и получателем сигнала.",
                "updated": 1645194866228
            },
            {
                "language": "TR",
                "text": "Sosyal Ticaret Botları (Social Trading Bots), Ticaret Sinyalleri (Trading Signals) sürecinde kullanılan yeni bir bot türüdür. Bir Sosyal Ticaret Botu, bir sinyal sağlayıcı ve alıcı arasındaki ana arayüzdür.",
                "updated": 1666700995751
            },
            {
                "language": "DE",
                "text": "Social Trading Bots sind eine neue Art von Bot, die im Rahmen des Handelssignalprozesses (Trading Signals process) eingesetzt werden. Ein Social Trading Bot ist die Hauptschnittstelle zwischen einem Signalanbieter und dem Empfänger.",
                "updated": 1705958390329
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1643080459294
        },
        {
            "style": "Text",
            "text": "A basic way to think about a Social Trading Bot is as a collection of signals, as well as all the information a recipient will need in order to subscribe and receive those signals.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Основной способ представить себе социального торгового бота - это коллекция сигналов, а также вся информация, необходимая получателю для подписки и получения этих сигналов.",
                    "updated": 1645194881380
                },
                {
                    "language": "TR",
                    "text": "Bir Sosyal Ticaret Botu hakkında düşünmenin temel yolu, bir sinyaller koleksiyonunun yanı sıra bir alıcının abone olması ve bu sinyalleri almak için ihtiyaç duyacağı tüm bilgileri barındırır.",
                    "updated": 1666701057189
                },
                {
                    "language": "DE",
                    "text": "Grundsätzlich kann man sich einen Social Trading Bot als eine Sammlung von Signalen vorstellen, sowie als alle Informationen, die ein Empfänger benötigt, um diese Signale zu abonnieren und zu empfangen.",
                    "updated": 1705958434138
                }
            ]
        },
        {
            "style": "Text",
            "text": "Each Social Trading Bot defines the following information:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Каждый Social Trading Bot определяет следующую информацию:",
                    "updated": 1645194889761
                },
                {
                    "language": "TR",
                    "text": "Her Sosyal Ticaret Botu aşağıdaki bilgileri tanımlar:",
                    "updated": 1666701080677
                },
                {
                    "language": "DE",
                    "text": "Jeder Social Trading Bot definiert die folgenden Informationen:",
                    "updated": 1705958442754
                }
            ]
        },
        {
            "style": "List",
            "text": "The bot’s Signing Account.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Регистрационная учетная запись бота.",
                    "updated": 1645194914168
                },
                {
                    "language": "TR",
                    "text": "Botun İmzalama Hesabı (Signing Account).",
                    "updated": 1666701101440
                },
                {
                    "language": "DE",
                    "text": "Das Signing Account des Bots.",
                    "updated": 1705958457378
                }
            ]
        },
        {
            "style": "List",
            "text": "Available Signals provided by this bot.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Available Signals (\"Доступные сигналы\"), предоставляемые этим ботом.",
                    "updated": 1645194943224
                },
                {
                    "language": "TR",
                    "text": "Bu bot tarafından sağlanan Mevcut Sinyaller (Available Signals).",
                    "updated": 1666701128086
                },
                {
                    "language": "DE",
                    "text": "Verfügbare Signale (Available Signals), die von diesem Bot bereitgestellt werden.",
                    "updated": 1705958477099
                }
            ]
        },
        {
            "style": "List",
            "text": "The location of open storage where signal content is saved.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Расположение открытого хранилища, в котором сохраняется содержимое сигнала.",
                    "updated": 1645194954807
                },
                {
                    "language": "TR",
                    "text": "Sinyal içeriğinin kaydedildiği açık depolama konumu.",
                    "updated": 1666701151899
                },
                {
                    "language": "DE",
                    "text": "Der Ort des offenen Speichers, an dem der Signalinhalt gespeichert wird.",
                    "updated": 1705958487570
                }
            ]
        },
        {
            "style": "List",
            "text": "Other Social Trading Bots Followed.",
            "translations": [
                {
                    "language": "RU",
                    "text": "За ним следуют другие социальные торговые боты.",
                    "updated": 1645194970321
                },
                {
                    "language": "TR",
                    "text": "Takip edilen diğer Sosyal Ticaret Botları (Social Trading Bots)",
                    "updated": 1666701173746
                },
                {
                    "language": "DE",
                    "text": "Andere Social Trading Bots folgten.",
                    "updated": 1705958523610
                }
            ]
        },
        {
            "style": "Text",
            "text": "These Social Trading Bots are defined under the User Profile of the provider. Since they live within the provider’s profile and can be referenced by recipients, the Social Trading Bot is the only interface between the provider and and the recipient. This means that only signal data is shared, no other sensitive data or configuration details are vulnerable on the network or saved publicly.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Эти социальные торговые боты определяются в профиле пользователя провайдера. Поскольку они находятся в профиле провайдера и на них могут ссылаться получатели, социальный торговый бот является единственным интерфейсом между провайдером и получателем. Это означает, что обмен осуществляется только сигнальными данными, никакие другие конфиденциальные данные или детали конфигурации не уязвимы в сети и не сохраняются в открытом доступе.",
                    "updated": 1645195002013
                },
                {
                    "language": "TR",
                    "text": "Bu Sosyal Ticaret Botları (Social Trading Bots), göndericinin Kullanıcı Profili (User Profile) altında tanımlanır. Göndericinin profilinde yaşadıkları ve alıcılar tarafından referans alınabildikleri için Sosyal Ticaret Botu, gönderici ve alıcı arasındaki tek arayüzdür. Bu, yalnızca sinyal verilerinin paylaşıldığı, başka hiçbir hassas verinin veya yapılandırma ayrıntılarının ağda savunmasız olmadığı veya herkese açık olarak kaydedilmediği anlamına gelir.",
                    "updated": 1666701239551
                },
                {
                    "language": "DE",
                    "text": "Diese Social Trading Bots werden unter dem Benutzerprofil (User Profile) des Anbieters definiert. Da sie im Profil des Anbieters leben und von den Empfängern referenziert werden können, ist der Social Trading Bot die einzige Schnittstelle zwischen dem Anbieter und dem Empfänger. Das bedeutet, dass nur Signaldaten ausgetauscht werden, keine anderen sensiblen Daten oder Konfigurationsdetails sind im Netzwerk angreifbar oder öffentlich gespeichert.",
                    "updated": 1705958548386
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuration",
            "updated": 1643080584759
        },
        {
            "style": "Title",
            "text": "Social Trading Bot Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Social Trading Bot",
                    "updated": 1645195020248
                },
                {
                    "language": "TR",
                    "text": "Sosyal Ticaret Botu Yapılandırması",
                    "updated": 1666701273878
                },
                {
                    "language": "DE",
                    "text": "Social Trading Bot Konfiguration",
                    "updated": 1705958560607
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1643399791705,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1645195032403
                },
                {
                    "language": "TR",
                    "text": "Özellikleri",
                    "updated": 1666701299916
                },
                {
                    "language": "DE",
                    "text": "Eigenschaften",
                    "updated": 1705958569399
                }
            ]
        },
        {
            "style": "List",
            "text": "codeName This is the name this bot will use internally within the user's instance of the Superalgos Platform.",
            "translations": [
                {
                    "language": "RU",
                    "text": "codeName Это имя, которое бот будет использовать внутри пользовательского экземпляра платформы Superalgos.",
                    "updated": 1645195041827
                },
                {
                    "language": "TR",
                    "text": "codeName Bu bot, kullanıcının Superalgos Platformu arayüzünde dahili olarak kullanacağı addır.",
                    "updated": 1666701319387
                },
                {
                    "language": "DE",
                    "text": "codeName Dies ist der Name, den der Bot intern in der Instanz der Superalgos-Plattform des Benutzers verwenden wird.",
                    "updated": 1705958583375
                }
            ]
        },
        {
            "style": "List",
            "text": "handle This is the name this bot will use on the Superalgos peer to peer network.",
            "updated": 1666701564869,
            "translations": [
                {
                    "language": "RU",
                    "text": "handle Это имя, которое бот будет использовать в одноранговой сети Superalgos.",
                    "updated": 1645195052522
                },
                {
                    "language": "TR",
                    "text": "handle Bu, botun Superalgos eşler arası ağda kullanacağı adıdır.",
                    "updated": 1666701674356
                },
                {
                    "language": "DE",
                    "text": "handle Dies ist der Name, den der Bot im Superalgos Peer-to-Peer-Netzwerk verwenden wird.",
                    "updated": 1705958592503
                }
            ]
        }
    ]
}