{
    "type": "Design Space",
    "definition": {
        "text": "The Design Space is the visual environment that hosts all system and user definitions. In practical terms, it is the black space below the slider that splits the screen horizontally, separating the Design Space in the bottom from the Charting Space on top. As a hierarchy, it features nodes that enable user-control over certain aspects of the look, feel, and behavior of the space.",
        "updated": 1609861711688,
        "translations": [
            {
                "language": "ES",
                "text": "El Design Space es el entorno visual que alberga todas las definiciones de usuario y del sistema. En términos prácticos, es el espacio negro debajo del control deslizante que divide la pantalla horizontalmente, separando el Design Space en la parte inferior del\n Charting Space en la parte superior. Como jerarquía, presenta nodos que permiten al usuario controlar ciertos aspectos del aspecto, la sensación y el comportamiento del espacio.",
                "updated": 1624286217210,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Design Space - это визуальная среда, в которой размещаются все системные и пользовательские определения. С практической точки зрения - это черное пространство под ползунком, которое разделяет экран по горизонтали, отделяя пространства дизайна внизу от Charting Space - сверху. Как иерархия, он сожержит узлы, которые позволяют контролировать определенные аспекты внешнего вида, ощущения и поведения пространства.",
                "updated": 1638336016765
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Think of the design space as your desktop, or the control room of the system.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Считайте, пространство дизайна - это ваш рабочий стол или диспетчерская системы.",
                    "updated": 1638732146344
                }
            ]
        }
    ]
}