{
    "type": "Design Space",
    "definition": {
        "text": "The Design Space is the visual environment that hosts all system and user definitions. In practical terms, it is the black space below the slider that splits the screen horizontally, separating the Design Space in the bottom from the Charting Space on top. As a hierarchy, it features nodes that enable user-control over certain aspects of the look, feel, and behavior of the space.",
        "updated": 1609861711688,
        "translations": [
            {
                "language": "ES",
                "text": "El Design Space es el entorno visual que alberga todas las definiciones de usuario y del sistema. En términos prácticos, es el espacio negro debajo del control deslizante que divide la pantalla horizontalmente, separando el Design Space en la parte inferior del\n Charting Space en la parte superior. Como jerarquía, presenta nodos que permiten al usuario controlar ciertos aspectos del aspecto, la sensación y el comportamiento del espacio.",
                "updated": 1624286217210,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Design Space - это визуальная среда, в которой размещаются все системные и пользовательские определения. С практической точки зрения - это черное пространство под ползунком, которое разделяет экран по горизонтали, отделяя пространства проектирования внизу от Charting Space - сверху. Как иерархия, он сожержит узлы, которые позволяют контролировать определенные аспекты внешнего вида, ощущения и поведения пространства.",
                "updated": 1638336016765
            },
            {
                "language": "TR",
                "text": "Tasarım Alanı, tüm sistem ve kullanıcı tanımlarını barındıran görsel ortamdır. Pratik anlamda, ekranı yatay olarak bölen, alttaki Tasarım Alanı ile üstteki Grafik Alanı'nı ( Chartibng Space ) ayıran kaydırıcının altındaki siyah boşluktur. Bir hiyerarşi olarak, alanın görünümü, hissi ve davranışının belirli yönleri üzerinde kullanıcı kontrolü sağlayan düğümler içerir.",
                "updated": 1639142615774
            },
            {
                "language": "EL",
                "text": "Ο Σχεδιαστικός Χώρος είναι το οπτικό περιβάλλον που φιλοξενεί όλους τους ορισμούς του συστήματος και των χρηστών. Πρακτικά, είναι ο μαύρος χώρος κάτω από το ρυθμιστικό που χωρίζει την οθόνη οριζόντια, χωρίζοντας το Σχεδιαστικό Χώροςστο στο κάτω μέρος από το Charting Space (Χώρο Χαρτογράφησης) στο επάνω μέρος. Ως ιεραρχία, διαθέτει κόμβους που επιτρέπουν τον έλεγχο του χρήστη σε ορισμένες πτυχές της εμφάνισης, της αίσθησης και της συμπεριφοράς του χώρου.\n",
                "updated": 1641827497657
            },
            {
                "language": "DE",
                "text": "Der Design Space (Designbereich) ist die visuelle Umgebung, die alle System- und Benutzerdefinitionen enthält. In der Praxis ist dies der schwarze Bereich unter dem Schieberegler, der den Bildschirm horizontal teilt und den Design Space unten vom Charting Space oben trennt. Die Hierarchie besteht aus Nodes, die es dem Benutzer ermöglichen, bestimmte Aspekte des Aussehens, der Atmosphäre und des Verhaltens des Design Space zu steuern.",
                "updated": 1642890445978
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Think of the design space as your desktop, or the control room of the system.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Считайте, пространство проектирования - это ваш рабочий стол или диспетчерская системы.",
                    "updated": 1638732146344
                },
                {
                    "language": "EL",
                    "text": "Σκεφτείτε τον χώρο σχεδιασμού ως την επιφάνεια εργασίας σας ή το δωμάτιο ελέγχου του συστήματος.",
                    "updated": 1641827524706
                },
                {
                    "language": "DE",
                    "text": "Betrachten Sie den Design Space als Ihren Schreibtisch oder als den Kontrollraum des Systems.",
                    "updated": 1642890522712
                }
            ]
        }
    ]
}