{
    "topic": "Docs Context Menu Actions",
    "pageNumber": "2",
    "type": "Docs Action Delete Paragraph",
    "definition": {
        "text": "Use this action to delete a paragraph. This action can not be undone.  You can still refresh the page without executing the Docs Save Command to rollback all your changes until the last execution of the save command.",
        "updated": 1609262026576,
        "translations": [
            {
                "language": "DE",
                "text": "Mit dieser Aktion können Sie einen Absatz löschen. Diese Aktion kann nicht rückgängig gemacht werden. Sie können die Seite jedoch aktualisieren, ohne den Docs Save Command auszuführen, um alle Änderungen bis zur letzten Ausführung des Save command rückgängig zu machen.",
                "updated": 1633965789039
            },
            {
                "language": "RU",
                "text": "Используйте это действие, чтобы удалить абзац. Это действие не может быть отменено. Вы по-прежнему можете обновить страницу, не выполняя команду сохранения документов Docs Save Command, чтобы откатить все изменения до последнего выполнения команды сохранения.",
                "updated": 1638532144893
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen.",
                    "updated": 1633965820597
                },
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования.",
                    "updated": 1638532157426
                }
            ]
        }
    ]
}