{
    "type": "User Bots",
    "definition": {
        "text": "The User Bots hierarchy stores definitions for all Bots associated with the current User Profile available on the Superalgos Peer to Peer Network.",
        "updated": 1643079103859,
        "translations": [
            {
                "language": "RU",
                "text": "Иерархия User Bots хранит определения всех ботов, связанных с текущим профилем пользователя, доступным в одноранговой сети Superalgos.",
                "updated": 1645184004558
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Unlike bots found within the Superalgos Platfrom (as described in this article Bots In Superalgos), bots held in this hierarchy run within the context of the Superalgos Peer to Peer Network.",
            "updated": 1643079895812,
            "translations": [
                {
                    "language": "RU",
                    "text": "В отличие от ботов, находящихся внутри Superalgos Platfrom (как описано в статье Bots In Superalgos), боты, находящиеся в этой иерархии, работают в контексте одноранговой сети Superalgos.",
                    "updated": 1645184024486
                }
            ]
        },
        {
            "style": "Note",
            "text": "A helpful way to differenciate these kinds of bots is to remember that bots running in the platform complete tasks within the platform. While bots running on the network complete tasks on the network.",
            "updated": 1643079928524,
            "translations": [
                {
                    "language": "RU",
                    "text": "Полезный способ отличить эти виды ботов - помнить, что боты, работающие в платформе, выполняют задачи внутри платформы. В то время как боты, работающие в сети, выполняют задачи в сети.",
                    "updated": 1645184039379
                }
            ]
        },
        {
            "style": "Text",
            "text": "What this means is that bots under this hierarchy are meant to be discoverable on the Superalgos Peer to Peer Network. This allows these bots to do things such as send trading signals across the network or interact with other bots on the network in social trading activities.",
            "updated": 1643080277585,
            "translations": [
                {
                    "language": "RU",
                    "text": "Это означает, что боты этой иерархии должны быть обнаруживаемы в одноранговой сети Superalgos. Это позволяет этим ботам делать такие вещи, как отправлять торговые сигналы по сети или взаимодействовать с другими ботами в сети в социальных торговых операциях.",
                    "updated": 1645184063901
                }
            ]
        }
    ]
}