{
    "type": "Data Mine Tasks",
    "definition": {
        "text": "The data mine tasks node is an organizational device that groups tasks corresponding to the referenced data mine.",
        "translations": [
            {
                "language": "ES",
                "text": "El nodo data mine tasks es un dispositivo organizativo que agrupa las tareas correspondientes a la mina de datos referenciada.",
                "updated": 1629581022406
            },
            {
                "language": "RU",
                "text": "Узел Data Mine Tasks - это организационное устройство, которое группирует задачи, соответствующие указанной Data Mine.",
                "updated": 1638359470772
            },
            {
                "language": "TR",
                "text": "Veri madeni görevleri düğümü, başvurulan veri madenine karşılık gelen görevleri gruplayan bir organizasyon aracıdır.",
                "updated": 1654391685080
            },
            {
                "language": "DE",
                "text": "Der Knoten \"Data-Mine-Aufgaben\" ist ein Organisationsmittel, das die Aufgaben gruppiert, die dem referenzierten Data Mine entsprechen.",
                "updated": 1708265572398
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The data mine tasks node must reference the definition of a data mine. The node may spawn tasks for each bot in the data mine.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел задач добычи данных должен ссылаться на определение добычи данных. Узел может порождать задачи для каждого бота Data Mine.",
                    "updated": 1638359458140
                },
                {
                    "language": "TR",
                    "text": "Veri madeni görevleri düğümü bir veri madeni tanımına referans vermelidir. Düğüm, veri madenindeki her bot için görevler oluşturabilir.",
                    "updated": 1654391694853,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Der Knoten für Datenminenaufgaben muss auf die Definition einer Datenmine verweisen. Der Knoten kann Aufgaben für jeden Bot in der Datenmine erzeugen.",
                    "updated": 1708265572570,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Block",
            "text": "Running"
        }
    ]
}