{
    "type": "Machine Learning",
    "definition": {
        "text": "A program or system that builds (trains) a predictive model from input data. The system uses the learned model to make useful predictions from new (never-before-seen) data drawn from the same distribution as the one used to train the model. Machine learning also refers to the field of study concerned with these programs or systems.",
        "updated": 1613055672003,
        "translations": [
            {
                "language": "TR",
                "text": "Girdi verilerinden tahmine dayalı bir model oluşturan (eğiten) bir program veya sistem. Sistem, modeli eğitmek için kullanılan veriler ile  yeni (daha önce hiç görülmemiş) verilerden faydalı tahminler yapmak için bu modeli kullanır. Makine öğrenimi, bu programlar veya sistemlerle ilgili çalışma alanını da ifade eder.",
                "updated": 1639233358531
            },
            {
                "language": "RU",
                "text": "Machine Learning - это программа или система, которая строит (обучает) прогностическую модель на основе входных данных. Система использует выученную модель для составления полезных прогнозов на основе новых (ранее не встречавшихся) данных, взятых из того же распределения, которое использовалось для обучения модели. Машинное обучение также относится к области исследований, связанных с этими программами или системами.",
                "updated": 1645248932641
            },
            {
                "language": "DE",
                "text": "Ein Programm oder System, das aus Eingabedaten ein Vorhersagemodell erstellt (trainiert). Das System verwendet das gelernte Modell, um nützliche Vorhersagen aus neuen (noch nie zuvor gesehenen) Daten zu treffen, die aus derselben Verteilung stammen wie die, die zum Trainieren des Modells verwendet wurde. Maschinelles Lernen bezieht sich auch auf das Studiengebiet, das sich mit diesen Programmen oder Systemen befasst.",
                "updated": 1707240501649
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645248941954
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397325885,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1707240509123
                }
            ]
        }
    ]
}