{
    "topic": "Exchange Listing Requirements Research",
    "pageNumber": "4",
    "type": "Bittrex Global Listing Requirements",
    "definition": {
        "text": "Write a summary for this topic page."
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Listing Requirements",
            "updated": 1628515483720
        },
        {
            "style": "List",
            "text": "Exchange name: Bittrex Global",
            "updated": 1638247413956
        },
        {
            "style": "List",
            "text": "CMC ranking: 22",
            "updated": 1638247359468
        },
        {
            "style": "List",
            "text": "Exchange home page: ",
            "updated": 1638247592952
        },
        {
            "style": "Link",
            "text": "Exchange URL->global.bittrex.com",
            "updated": 1638256419764
        },
        {
            "style": "Link",
            "text": "Listing requirements->bittrex.zendesk.com/hc/en-us/articles/360000475411-How-do-I-submit-a-token-to-Bittrex-for-listing-",
            "updated": 1638256481325
        },
        {
            "style": "Link",
            "text": "Listing request form->bittrex.zendesk.com/hc/en-us/requests/new?ticket_form_id=114093958872",
            "updated": 1638256549477
        },
        {
            "style": "List",
            "text": "Can list BEP 20 BSC tokens: No. Bittrex does not provide support for Binance Coin(BNB), and the tokens on Binance Chain(BEP-20)",
            "updated": 1638257738584
        },
        {
            "style": "List",
            "text": "Listing fee: No fees. Bitrrex doesn't charge any listing fees",
            "updated": 1638258406928
        },
        {
            "style": "List",
            "text": "Security deposit: None",
            "updated": 1638258584529
        },
        {
            "style": "List",
            "text": "Volume requirements: Exchanges are in the business of charging transaction fees, so they usually expect to list tokens that have traction, in the understanding that such tokens will generate a certain level of trading volume. Some exchanges have a specific requirement about the expected volume. If the exchange requires a precise volume, enter it in numbers. Otherwise, describe what is expected in words."
        },
        {
            "style": "List",
            "text": "Market-making requirements: Many times exchanges expect projects to guarantee liquidity for the token on both sides of the order book. They sometimes require projects to hire specific market-makers or ask the project how they will deal with the issue. Explain what the exchange expects in this regard."
        },
        {
            "style": "List",
            "text": "Exchange users requirement: Some exchanges require the project to drive a certain number of users to the exchange. Describe any requirements that may exist in this regard."
        },
        {
            "style": "List",
            "text": "Pairs available for first listing: BTC,  USDT, ETH, USD,EUR",
            "updated": 1638259437816
        },
        {
            "style": "List",
            "text": "Waiting period: Most exchanges have a queue of listing requests and they may be able to estimate how long it takes to process. If there is information in this regard, include it here. The exchange may not announce what the estimate is, but you may deduce it or find out in community chats, forums, etc. Do your research."
        },
        {
            "style": "List",
            "text": "Legal entity: Some exchanges may require the project to be represented by a legal entity (a foundation, corporation, etc). If that is the case, enter \"Yes\", and describe what the requirement is. If there is no such requirement, enter \"No\"."
        },
        {
            "style": "List",
            "text": "Legal opinion: Some exchanges may require the project to get legal advice in the form of a \"legal opinion letter\" or some instrument of the sort, most times about the nature of the token, in particular, to determine if the token is a security or not. If that is the case, enter \"Yes\", and describe what the requirement is. If there is no such requirement, enter \"No\"."
        },
        {
            "style": "List",
            "text": "Selection process: Some exchanges describe the nature of the decision-making process to select which tokens shall be listed. Some involve the participation of their community, a voting process, or things of the sort. Describe what the process is like if there is any information about it."
        },
        {
            "style": "List",
            "text": "Researcher's comments: If you notice any information of importance to the listing process that is not covered in this list, include it here."
        },
        {
            "style": "List",
            "text": "Researcher's Github.com Username: end-debug",
            "updated": 1638258845963
        },
        {
            "style": "List",
            "text": "Researcher's Telegram Username: Sifiso Khumalo",
            "updated": 1638258927224
        },
        {
            "style": "List",
            "text": "Date of last revision: This report may be updated every once in a while. Use this field to note the last time the report was updated."
        },
        {
            "style": "Title",
            "text": "Negotiation"
        },
        {
            "style": "Text",
            "text": "List what progress has been made in the ongoing negotiation."
        }
    ]
}