{
    "topic": "Nodes",
    "pageNumber": "11",
    "type": "Parent Node",
    "definition": {
        "text": "The Parent Node of a certain Node A, is the Node who was used to create A. Nodes are automatically attached to their Parent Node. Not all nodes have a Parent Node.",
        "updated": 1609240097919,
        "translations": [
            {
                "language": "RU",
                "text": "Родительский узел определенного узла A - это узел, который был использован для создания A. Узлы автоматически привязываются к своему родительскому узлу. Не все узлы имеют родительский узел.",
                "updated": 1640356692142
            },
            {
                "language": "TR",
                "text": "Belirli bir Düğüm ( Node ) A'nın Ana Düğümü, A'yı oluşturmak için kullanılan Düğümdür. Düğümler ( Node ) otomatik olarak Ana Düğümlerine eklenir. Tüm düğümlerin bir Ana Düğümü yoktur.",
                "updated": 1654892354253
            },
            {
                "language": "DE",
                "text": "Der übergeordnete Knoten (Node) eines bestimmten Knotens A ist der Knoten, der zur Erstellung von A verwendet wurde. Nicht alle Knoten haben einen Elternknoten.",
                "updated": 1689423063285
            },
            {
                "language": "PT",
                "text": "O Nó Primário (Parent Node) de um certo Nó (Node) A é o Nó (Node) que foi usado para criar A. Os nós são automaticamente anexados ao seu Nó Primário (Parent Node). Nem todos os nós têm um Nó Primário (Parent Node).",
                "updated": 1711484898010
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования.",
                    "updated": 1640356700616
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle . Yeni paragraflar yazmak için ENTER'a basın. Düzenleme modundan çıkmak için ESC.",
                    "updated": 1654892385013
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen.",
                    "updated": 1689423077447
                },
                {
                    "language": "PT",
                    "text": "Para entrar no modo de edição e alterar este texto, clique com o botão direito do rato e selecione \"Editar\". Pressione ENTER para escrever novos parágrafos e ESC para sair do modo de edição.",
                    "updated": 1711484807235
                }
            ]
        }
    ]
}