{
    "topic": "Nodes",
    "pageNumber": "9",
    "type": "Node Referencing Rules",
    "definition": {
        "text": "Each Node Type can have a set of rules that defines with which Node Type it can Establish a reference.",
        "updated": 1609244259240,
        "translations": [
            {
                "language": "ES",
                "text": "Cada Node Type puede tener un conjunto de reglas que defina con qué Node Type puede establecer una referencia.",
                "updated": 1628036524256
            },
            {
                "language": "RU",
                "text": "Каждый тип узла может иметь набор правил, определяющих, с каким типом узла он может установить ссылку.",
                "updated": 1640356616144
            },
            {
                "language": "TR",
                "text": "Her Düğüm Türü ( Node Type ) hangi Düğüm Türüyle ( Node Type ) başvuru oluşturabileceğini tanımlayan bir kurallar kümesine sahip olabilir.",
                "updated": 1652901804081
            },
            {
                "language": "DE",
                "text": "Jeder Knotentyp (Node Type) kann über eine Reihe von Regeln verfügen, die festlegen, mit welchem Knotentyp er einen Bezug herstellen kann.",
                "updated": 1689421600448
            },
            {
                "language": "PT",
                "text": "Cada tipo de Nó (Node Type) pode ter um conjunto de regras que define com qual tipo de Nó (Node Type) pode estabelecer uma referência.",
                "updated": 1711484607783
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования.",
                    "updated": 1640356624548
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle . Yeni paragraflar yazmak için ENTER'a basın. Düzenleme modundan çıkmak için ESC.",
                    "updated": 1652901839913
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen.",
                    "updated": 1689421611035
                },
                {
                    "language": "PT",
                    "text": "Para entrar no modo de edição e alterar este texto, clique com o botão direito do rato e selecione \"Editar\". Pressione ENTER para escrever novos parágrafos e ESC para sair do modo de edição.",
                    "updated": 1711484627998
                }
            ]
        }
    ]
}