{
    "topic": "Nodes",
    "pageNumber": "2",
    "type": "Node Type",
    "definition": {
        "text": "Each Node is of a certain type. It's type defines what the Node can be used for, the Node Menu, to which other nodes it can attach to, and may other properties that are dependent on the Node Type At the Design Space, the type of the node is displayed below the Node Icon.    ",
        "updated": 1609236288974,
        "translations": [
            {
                "language": "RU",
                "text": "Каждый узел Node имеет определенный тип. Тип определяет, для чего узел может быть использован, меню узла Node Menu, к каким другим узлам он может присоединяться, а также другие свойства, которые зависят от типа узла. В пространстве проектирования Design Space тип узла отображается под значком узла Node Icon.",
                "updated": 1640356097257
            },
            {
                "language": "TR",
                "text": "Her Düğüm belirli bir türdedir. Bu tür, Düğümün ne için kullanılabileceğini, Düğüm Menüsünü ( Node Menu ) hangi düğümlere bağlanabileceğini ve Tasarım Alanındaki Düğüm ( Design Space ) Türüne bağlı olan diğer özellikleri tanımlar, düğümün türü Düğüm Simgesinin ( Node Icon ) altında görüntülenir.",
                "updated": 1652803813816
            },
            {
                "language": "DE",
                "text": "Jeder Knoten (Node) ist von einem bestimmten Typ. Sein Typ definiert, wofür der Knoten verwendet werden kann, das Knotenmenü (Node Menu, an welche anderen Knoten er angehängt werden kann, und möglicherweise andere Eigenschaften, die vom Knotentyp abhängen Im Entwurfsbereich (Design Space) wird der Typ des Knotens unter dem Knotensymbol (Node Icon) angezeigt.",
                "updated": 1689417652438
            },
            {
                "language": "PT",
                "text": "Cada nó (node) é de um determinado tipo. O seu tipo define para que o nó (node) pode ser usado, o Menu do Nó (Node), a que outros nós pode ser anexado e muitas outras propriedades que dependem do Tipo de Nó. Na Interface de Design (Design Space), o tipo de Nó (Node) é exibido abaixo do Ícone do Nó (Node).",
                "updated": 1711482408102
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования.",
                    "updated": 1640356106143
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle. Yeni paragraflar yazmak için ENTER'a basın. Düzenleme modundan çıkmak için ESC.",
                    "updated": 1652803845100
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen.",
                    "updated": 1689417661590
                },
                {
                    "language": "PT",
                    "text": "Para entrar no modo de edição e alterar este texto, clique com o botão direito do rato e selecione \"Editar\". Pressione ENTER para escrever novos parágrafos e ESC para sair do modo de edição.",
                    "updated": 1711482430697
                }
            ]
        }
    ]
}