{
    "topic": "Nodes",
    "pageNumber": "6",
    "type": "Node Menu",
    "definition": {
        "text": "Nodes usually have a menu that allows users to interact with the node. Each Node Type can have a different set of menu items. ",
        "updated": 1609236892270,
        "translations": [
            {
                "language": "RU",
                "text": "Узлы обычно имеют меню, которое позволяет пользователям взаимодействовать с узлом. Каждый тип узла может иметь свой набор пунктов меню.",
                "updated": 1640356426094
            },
            {
                "language": "TR",
                "text": "Düğümler genellikle kullanıcıların düğümle etkileşime girmesine olanak tanıyan bir menüye sahiptir. Her bir Düğüm Türü ( Node Type ) farklı menü öğelerine sahip olabilir.",
                "updated": 1652805698690
            },
            {
                "language": "DE",
                "text": "Knoten verfügen in der Regel über ein Menü, das es dem Benutzer ermöglicht, mit dem Knoten zu interagieren. Jeder Knotentyp (Node Type) kann einen anderen Satz von Menüpunkten haben.",
                "updated": 1689423413442
            },
            {
                "language": "PT",
                "text": "Os Nós (Nodes) geralmente têm um menu que permite aos utilizadores interagir com o Nó (Node). Cada tipo de Nó (Node) pode ter um conjunto diferente de itens de menu.",
                "updated": 1711483511238
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Each Node Type, might have a menu which allow users to interact with the Node. There is no fixed set of menu items. Instead each menu items is defined at each Node's definition. Each menu item has a set of properties that allow the system to execute some action when the menu item is clicked by users.",
            "updated": 1609240463871,
            "translations": [
                {
                    "language": "RU",
                    "text": "Каждый тип узла может иметь меню, которое позволяет пользователям взаимодействовать с узлом. Не существует фиксированного набора пунктов меню. Вместо этого каждый пункт меню определяется при определении каждого узла. Каждый пункт меню имеет набор свойств, которые позволяют системе выполнять некоторые действия, когда пользователь нажимает на пункт меню.",
                    "updated": 1640356468055
                },
                {
                    "language": "TR",
                    "text": "Her Düğüm Türü ( Node Type ) kullanıcıların Düğümle ( Node ) etkileşime girmesine izin veren bir menüye sahip olabilir. Sabit bir menü öğesi kümesi yoktur. Bunun yerine, her menü öğesi her Düğümün ( Node ) tanımında tanımlanır. Her menü öğesi, menü öğesi kullanıcılar tarafından tıklatıldığında sistemin bazı eylemleri gerçekleştirmesine izin veren bir dizi özelliğe sahiptir.",
                    "updated": 1652805827254
                },
                {
                    "language": "DE",
                    "text": "Jeder Knotentyp kann ein Menü haben, das es den Benutzern ermöglicht, mit dem Knoten (Node) zu interagieren. Es gibt keinen festen Satz von Menüpunkten. Stattdessen wird jeder Menüpunkt bei der Definition eines jeden Knotens (Node's) definiert. Jeder Menüpunkt hat eine Reihe von Eigenschaften, die es dem System ermöglichen, eine Aktion auszuführen, wenn der Benutzer auf den Menüpunkt klickt.",
                    "updated": 1689423436043
                },
                {
                    "language": "PT",
                    "text": "Cada tipo de Nó (Node Type)  pode ter um menu que permite aos utilizadores interagir com o Nó (Node). Não há um conjunto fixo de itens de menu. Em vez disso, cada item de menu é definido na definição de cada Nó (Node). Cada item de menu possui um conjunto de propriedades que permitem ao sistema executar alguma ação quando o item de menu é acedido pelos utilizadores.",
                    "updated": 1711483617463
                }
            ]
        }
    ]
}