{
    "topic": "Nodes",
    "pageNumber": "4",
    "type": "Node Config",
    "definition": {
        "text": "Nodes might have a config -only when needed- that it is used to store information related to that node. When they do, they usually allow users to access it via one of the Node Menu items.  A Node Config is later used by Tasks or Bots during their processing.",
        "updated": 1609236556444,
        "translations": [
            {
                "language": "RU",
                "text": "Узлы могут иметь конфигурацию - только при необходимости - которая используется для хранения информации, связанной с этим узлом. Когда это так, они обычно позволяют пользователям получить к нему доступ через один из пунктов меню узла. Конфигурация узла позже используется задачами или ботами во время их работы.",
                "updated": 1640356225848
            },
            {
                "language": "TR",
                "text": "Düğümler, yalnızca gerektiğinde, bu düğümle ilgili bilgileri depolamak için kullanılan bir yapılandırmaya sahip olabilir. Bunu yaptıklarında, genellikle kullanıcıların Düğüm Menü ( Node Menu ) öğelerinden biri aracılığıyla erişmelerine izin verirler. Düğüm Yapılandırması daha sonra Görevler veya Önyüklemeler tarafından işlenirken kullanılır.",
                "updated": 1652804625025
            },
            {
                "language": "DE",
                "text": "Knoten können - nur bei Bedarf - eine Konfiguration haben, die zum Speichern von Informationen zu diesem Knoten verwendet wird. Wenn dies der Fall ist, kann der Benutzer normalerweise über einen der Knotenmenüpunkte (Node Menu) darauf zugreifen. Eine Knotenkonfiguration wird später von Tasks oder Bots während ihrer Verarbeitung verwendet.",
                "updated": 1689420114035
            },
            {
                "language": "PT",
                "text": "Os Nós (Nodes) podem ter uma configuração - apenas quando necessário - que é usada para armazenar informações relacionadas a esse Nó (Node). Quando têm uma configuração, geralmente permitem que os utilizadores acedam através de um dos itens do Menu do Nó (Node Menu). Mais tarde, uma Configuração de Nó é usada por Tarefas (Tasks) ou Bots durante o seu processamento.",
                "updated": 1711482967538
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Each type of node, might have a definition with the initial values for it's configuration. The Initial Values are set at the node when the Node is first created. ",
            "updated": 1609244634949,
            "translations": [
                {
                    "language": "RU",
                    "text": "Каждый тип узла может иметь определение с начальными значениями для его конфигурации. Начальные значения устанавливаются на узле при первом создании узла.",
                    "updated": 1640356249680
                },
                {
                    "language": "TR",
                    "text": "Her düğüm türü, yapılandırması için başlangıç değerlerine sahip bir tanıma sahip olabilir. Düğüm ( Node ) ilk oluşturulduğunda başlangıç Değerleri düğümde ayarlanır.",
                    "updated": 1652804685508
                },
                {
                    "language": "DE",
                    "text": "Jeder Knotentyp kann eine Definition mit den Anfangswerten für seine Konfiguration haben. Die Anfangswerte werden am Knoten festgelegt, wenn der Knoten (Node) zum ersten Mal erstellt wird.",
                    "updated": 1689420141109
                }
            ]
        }
    ]
}