{
    "topic": "Docs Basics",
    "pageNumber": 5,
    "type": "Docs Page Name",
    "definition": {
        "text": "The Docs Page Name is not only the visible name of a page displayed as the main title at the top but also the unique identifier of a page within a Project.",
        "updated": 1613755348083,
        "translations": [
            {
                "language": "DE",
                "text": "Der Name der Dokumentseite ist nicht nur der sichtbare Name einer Seite, der oben als Haupttitel angezeigt wird, sondern auch der eindeutige Bezeichner einer Seite innerhalb eines Project.",
                "updated": 1633859779373
            },
            {
                "language": "RU",
                "text": "Docs Page Name - это не только название страницы, отображаемое в качестве основного заголовка вверху, но и уникальный идентификатор страницы в проекте Project.",
                "updated": 1638460986853
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The page name is always featured as the main title of the page and no two pages may have the same name.",
            "updated": 1613755273710,
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Seitenname wird immer als Haupttitel der Seite angezeigt, und keine zwei Seiten dürfen denselben Namen haben.",
                    "updated": 1633859841437
                },
                {
                    "language": "RU",
                    "text": "Название страницы всегда указывается в качестве основного заголовка страницы, и никакие две страницы не могут иметь одинаковое имя.",
                    "updated": 1638461041771
                }
            ]
        },
        {
            "style": "Success",
            "text": "It is important to remember the above at the time of naming a page. You should always use an unambiguous descriptive name as the name of a page.",
            "updated": 1613755338171,
            "translations": [
                {
                    "language": "DE",
                    "text": "Es ist wichtig, bei der Benennung einer Seite an die oben genannten Punkte zu denken. Sie sollten immer einen eindeutigen Namen für die Bezeichnung einer Seite verwenden.",
                    "updated": 1633859935042
                },
                {
                    "language": "RU",
                    "text": "Важно помнить вышесказанное во время присвоения названия странице. В качестве названия страницы всегда следует использовать однозначное описательное название.",
                    "updated": 1638461202992
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Important",
            "text": "At this point, the name of the page may not be changed from within the Docs interface. To change the name of the page you need to manually modify the corresponding file, editing the type field and properly mapping the name of the page in the name of the file.",
            "updated": 1613755498049,
            "translations": [
                {
                    "language": "DE",
                    "text": "Zu diesem Zeitpunkt kann die Seitennummer nicht innerhalb des Docs-Interface geändert werden. Um die Seitennummer zu ändern, müssen Sie die entsprechende Datei manuell ändern, das Feld Seitennummer bearbeiten und die Seitennummer der Seite im Namen der Datei richtig zuordnen.",
                    "updated": 1633860025392
                },
                {
                    "language": "RU",
                    "text": "На этом этапе название страницы нельзя изменить в интерфейсе документов. Чтобы изменить название страницы, вам необходимо вручную изменить соответствующий файл, отредактировав поле типа и правильно сопоставив название страницы с именем файла.",
                    "updated": 1638461297941
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}