{
    "topic": "Docs Basics",
    "pageNumber": 6,
    "type": "Docs Topic Name",
    "definition": {
        "text": "Refers to the name of the topic. Pages with the same Docs Topic Name belong to the same topic.",
        "updated": 1613755594915,
        "translations": [
            {
                "language": "DE",
                "text": "Bezieht sich auf den Namen des Themas. Seiten mit demselben Docs-Thema-Namen gehören zu demselben Thema.",
                "updated": 1633860169342
            },
            {
                "language": "RU",
                "text": "Относится к названию темы. Страницы с одинаковым Docs Topic Name относятся к одной и той же теме.",
                "updated": 1638463832753
            },
            {
                "language": "TR",
                "text": "Konunun adına atıfta bulunur. Aynı Dokümanlar Konu Adına sahip sayfalar, aynı konuya aittir.",
                "updated": 1646208374982
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Important",
            "text": "Notice that topics are not pages in and of themselves. Instead, the Docs Topic Name is a property of a Docs Page.",
            "updated": 1643046467558,
            "translations": [
                {
                    "language": "DE",
                    "text": "Es gibt keine Seite, die exakt ein Thema beschreibt. Stattdessen wird der Name des Docs-Themas verwendet, um eine Reihe von verwandten Seiten unter einem bestimmten Thema zu gruppieren.",
                    "updated": 1633860255701
                },
                {
                    "language": "RU",
                    "text": "Обратите внимание, что темы сами по себе не являются страницами. Вместо этого название темы документа (Docs Topic Name) является свойством страницы документа (Docs Page).",
                    "updated": 1647781257730
                },
                {
                    "language": "TR",
                    "text": "Konuların kendi başlarına sayfalar olmadığına dikkat edin. Bunun yerine Dokümanlar Konu Adı, Dokümanlar Sayfasının bir özelliğidir.",
                    "updated": 1646208392350
                }
            ]
        },
        {
            "style": "Text",
            "text": "In other words, there is no page describing a topic. Instead, the Docs Topic Name is used to group a set of related pages under a certain topic.",
            "updated": 1644143474077,
            "translations": [
                {
                    "language": "TR",
                    "text": "Başka bir deyişle, bir konuyu (Topic) açıklayan bir sayfa yoktur. Bunun yerine, Docs Topic Name, belirli bir konu altında bir dizi ilgili sayfayı gruplamak için kullanılır.",
                    "updated": 1646208486093
                },
                {
                    "language": "RU",
                    "text": "Другими словами, не существует страницы, описывающей тему. Вместо этого название темы используется для группировки набора связанных страниц под определенной темой.",
                    "updated": 1647781294980
                },
                {
                    "language": "DE",
                    "text": "Mit anderen Worten, es gibt keine Seite, die ein Thema beschreibt. Stattdessen wird der Name des Docs-Themas verwendet, um eine Reihe von verwandten Seiten unter einem bestimmten Thema zu gruppieren.",
                    "updated": 1689415959882
                }
            ]
        }
    ]
}