{
    "type": "LF",
    "definition": {
        "text": "LF is the abbreviation of Low Frequency, and most likely referring to the Low Frequency Trading Bot implemented at the Masters Trading Mine.",
        "updated": 1611577213413,
        "translations": [
            {
                "language": "RU",
                "text": "LF - это аббревиатура от Low Frequency и, скорее всего, относится к низкочастотному торговому боту, реализованному на Trading Mine.",
                "updated": 1638285373185
            },
            {
                "language": "TR",
                "text": "LF, Düşük Frekansın kısaltmasıdır ve büyük olasılıkla Masters Trading Mine'da uygulanan Düşük Frekanslı Ticaret Botuna ( Trading Bot ) atıfta bulunmaktadır.",
                "updated": 1670331492907
            },
            {
                "language": "DE",
                "text": "LF ist die Abkürzung für Low Frequency und bezieht sich am ehesten auf den in der Masters Trading Mine implementierten Low Frequency Trading Bot.",
                "updated": 1696955470831
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode. Then you can use docs.save to save your changes and app.contribute to send it to the main repository.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования. Затем вы можете использовать docs.save для сохранения изменений и app.contribute для отправки их в основной репозиторий.",
                    "updated": 1638285398628
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle deyin. Yeni paragraflar yazmak için ENTER tuşuna basın. Düzenleme modundan çıkmak için ESC. Daha sonra değişikliklerinizi kaydetmek için docs.save ve ana depoya göndermek için app.contribute kullanabilirsiniz.",
                    "updated": 1654391202463,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen. Dann können Sie docs.save verwenden, um Ihre Änderungen zu speichern und app.contribute, um sie an das Haupt-Repository zu senden.",
                    "updated": 1696955471004,
                    "style": "Text"
                }
            ]
        }
    ]
}