{
    "topic": "Introduction to Governance",
    "pageNumber": "3",
    "type": "Referral Program Overview",
    "definition": {
        "text": "The referral program is one of the Community Building Programs designed to incentivize the promotion of the project, either by word-of-mouth or “en masse” through articles, social media posts, videos, and other forms of influencer marketing.",
        "updated": 1629994461511
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "In a nutshell, you may earn Superalgos SA Tokens for every user you refer to the project and their descendants!",
            "updated": 1624698280534
        },
        {
            "style": "Text",
            "text": "Users may declare who referred them to Superalgos and pass on some Referral Power to their referrers. The more people you refer, the more Referral Power you may get!",
            "updated": 1630004903819
        },
        {
            "style": "Text",
            "text": "The Referral Power that you get determines the proportion of the tokens allocated to the Referrals Rewards Pool that you may get on each release.",
            "updated": 1630004849661
        },
        {
            "style": "Title",
            "text": "Your Referrers"
        },
        {
            "style": "Text",
            "text": "You declare who your referrers are by establishing references from User Referrer nodes under the Referral Program node to the User Profile of the persons you learned about Superalgos from."
        },
        {
            "style": "Text",
            "text": "There is no hard definition of who or what a referrer is. It is up to you to decide. Maybe you learned about Superalgos from an article, a video, a comment on Reddit, a tweet, the official website, or someone told you about us!"
        },
        {
            "style": "Success",
            "text": "Declaring your referrers is the best way to thank the person that may have written that article or tweet, produced that video, maintained the website, or the friend who told you about Superalgos! Without them, you probably wouldn’t be here yet!"
        },
        {
            "style": "Title",
            "text": "Token Bonus"
        },
        {
            "style": "Text",
            "text": "The program features a Token Bonus. That is, simply by spawning the program and declaring your referrers, you earn tokens!",
            "updated": 1629996937677
        }
    ]
}