{
    "topic": "Introduction to Governance",
    "pageNumber": "1",
    "type": "Governance Overview",
    "definition": {
        "text": "Governance of the Superalgos Project is distributed among all members of the Superalgos Community willing to participate.  You may engage in multiple manners, help drive development in the desired directions, and contribute to nurturing a healthy community. ",
        "updated": 1624697432247
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "To participate in governance, community members leverage their Superalgos SA Token holdings, exerting influence proportional to their Token Power. The combined influence of all token holders participating in governance determines, among other things:",
            "updated": 1624697450404
        },
        {
            "style": "List",
            "text": "What Positions, Features, Assets, or project-development activities, in general, are incentivized and how."
        },
        {
            "style": "List",
            "text": "Which Contributors are compensated for which Contributions."
        },
        {
            "style": "List",
            "text": "What Programs are funded and how."
        },
        {
            "style": "Text",
            "text": "You may exert your influence dynamically, as you may redirect your Token Power at any moment. The distribution of Token Power upon each release of the software — tied to the corresponding Superalgos SA Token Distribution Event — determines how tokens allocated to the release are distributed."
        },
        {
            "style": "Text",
            "text": "The Governance Project is designed as a flexible system that allows the Community to dynamically direct influence in arbitrary directions. It allows governance to evolve with the project. It also encourages permissionless innovation, as Contributors may propose new areas of development and rally the Community to incentivize expansion along new lines."
        },
        {
            "style": "Note",
            "text": "A Community engaged in governance is crucial for the development of the project, therefore participation is incentivized. In other words, you will earn Superalgos SA Tokens if you take part in the governance of Superalgos."
        },
        {
            "style": "Title",
            "text": "Governance Infrastructure"
        },
        {
            "style": "Text",
            "text": "The governance system is implemented within Superalgos as the Governance Project, making use of the same visual scripting resources, hierarchical data structures, and concepts such as References that make up the Superalgos paradigm you are familiar with."
        },
        {
            "style": "Text",
            "text": "As such, governance does not require the use of smart contracts to enforce immutable rules. On the contrary, in Superalgos, governance is an ever-evolving notion, pretty much like the rest of the project."
        },
        {
            "style": "Callout",
            "text": "This flexibility is a crucial feature that will allow us to evolve the governance system, adapt the game theory behind it, and correct any exploits that people may find over time."
        },
        {
            "style": "Text",
            "text": "Governance is defined across multiple Plugin Workspaces that users may load and contribute to. These workspaces feature the definitions of several hierarchies that determine the relationship of all the concepts affecting governance."
        },
        {
            "style": "Text",
            "text": "To participate in governance, users must set up and submit a User Profile plugin defining how they intend to exert the influence conferred by their Superalgos SA Token holdings. The influence and participation is defined through different types of programs, votes, and claims.",
            "updated": 1629992750219
        },
        {
            "style": "Note",
            "text": "The system does all calculations dynamically, in real-time, with every change in the definitions, and computes all the hierarchies loaded in the Current Workspace.",
            "updated": 1629992786999
        },
        {
            "style": "Important",
            "text": "The above means that the calculations that you see from within any given Workspace is a partial calculation within the scope of the Current Workspace only. Definitions, claims, votes, and so on, existing on other workspaces or plugins are not computed.",
            "updated": 1629993191549
        },
        {
            "style": "Title",
            "text": "Transparency and Auditability"
        },
        {
            "style": "Text",
            "text": "Because all definitions affecting governance ship as plugins with the software, the process is transparent and auditable. "
        },
        {
            "style": "List",
            "text": "Any user may, at any point, load the corresponding Plugin Workspaces and visualize how influence is being exerted by all Superalgos SA Token holders participating.",
            "updated": 1629995410591
        },
        {
            "style": "List",
            "text": "Any user may verify all metrics managed by the Governance Project in the tables displayed in the Governace Tab."
        },
        {
            "style": "List",
            "text": "Any user may run a simulation of the Superalgos SA Token distribution process and verify how tokens allocated to the next release will be distributed."
        },
        {
            "style": "List",
            "text": "Any user may obtain (from GitHub) and load historical versions of the software, and run a simulation of the Superalgos SA Token Distribution Process to verify how tokens were distributed in past releases. Notice that, in this case, the absolute number of votes may not be valid as token holdings will have varied; however, any user may validate the relative distribution."
        }
    ]
}