{
    "topic": "Introduction to Governance",
    "pageNumber": "4",
    "type": "Support Program Overview",
    "definition": {
        "text": "At Superalgos, we take pride in the level of support we offer to newcomers and the Community in general. We get frequent compliments in that sense, and many users have expressed how impressed they are by the speedy and helpful responses in the Support Groups.",
        "updated": 1624705282082
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This is no accident. In fact, it is a crucial aspect of our culture, based above all on collaboration.",
            "updated": 1624705296139
        },
        {
            "style": "Text",
            "text": "Superalgos is a vast system and the learning curve is still quite steep. Many users need help, particularly during the early stages. "
        },
        {
            "style": "Text",
            "text": "While the broader community is always ready to help with typical support questions, we’ve noticed that it takes a certain level of experience and knowledge to provide effective support. This is why select Community Mods are in charge of Support."
        },
        {
            "style": "Text",
            "text": "The Support Program is designed to incentivize participating in support and to let the Community decide how to compensate Community Mods contributing to the project’s support efforts."
        },
        {
            "style": "Success",
            "text": "If you ever wish to become a Community Mod, you may start by participating in the various groups in Telegram, as well as in Discord Channels, helping other users and answering questions from newcomers. We’ll surely spot you and draft you into the team!"
        },
        {
            "style": "Title",
            "text": "Your Favorite Supporters"
        },
        {
            "style": "Text",
            "text": "To pick your favorite supporters, set up references from User Support nodes to their User Profiles."
        },
        {
            "style": "Text",
            "text": "Community Mods are awarded tokens from the Support Rewards Pool. How many depends on the Support Power they get from users pointing them as their favorite supporters."
        },
        {
            "style": "Success",
            "text": "If you seldom use the support groups, that may be thanks to the effort put in crafting and maintaining tutorials and documentation. If that is your case, then feel free to select the individuals or teams doing this work as your preferred supporters!"
        },
        {
            "style": "Title",
            "text": "Token Bonus"
        },
        {
            "style": "Text",
            "text": "You guessed right! You may earn tokens simply by declaring your favorite supporters!"
        }
    ]
}