{
    "topic": "Introduction to Governance",
    "pageNumber": "2",
    "type": "Participating in Governance",
    "definition": {
        "text": "To participate in governance, you must set up your User Profile — a hierarchy that defines how you intend to use the Token Power conferred by your token holdings.",
        "updated": 1624698139967,
        "translations": [
            {
                "language": "ES",
                "text": "Para participar en la gobernanza, debes configurar tu User Profile, una jerarquía que define cómo puede usar el Token Power conferido por tu tenencia de token.",
                "updated": 1682594070273
            },
            {
                "language": "RU",
                "text": "Чтобы участвовать в управлении, вы должны настроить свой профиль пользователя User Profile — иерархию, которая определяет, как вы собираетесь использовать полномочия токенов Token Power, предоставляемые вашими токенами.",
                "updated": 1638977517498
            },
            {
                "language": "TR",
                "text": "Yönetime katılmak için, token varlıklarınız tarafından verilen Token Gücünü (Token Power) nasıl kullanmayı düşündüğünüzü tanımlayan bir hiyerarşi olan Kullanıcı Profilinizi (User Profile) oluşturmalısınız.",
                "updated": 1645181761233
            },
            {
                "language": "DE",
                "text": "Um an der Governance teilzunehmen, müssen Sie Ihr Benutzerprofil (User Profile) einrichten - eine Hierarchie, die festlegt, wie Sie die Token-Macht (Token Power), die Ihnen durch Ihren Token-Besitz verliehen wird, zu nutzen gedenken.",
                "updated": 1676839442756
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "How you use your Token Power is defined in several programs within the hierarchy. For instance, the Claims Program lets you present claims for the work you’ve done. We’ll cover all programs in detail.",
            "updated": 1624698150117,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cómo uses tu Token Power está definido por diferentes programas incluídos en la jerarquía. Por ejemplo, los Claims Program te permiten presentar declaraciones por el trabajo qe hayas realizado. Cubriremos todos los programas en detalle.",
                    "updated": 1682594220380
                },
                {
                    "language": "RU",
                    "text": "То, как вы используете свои полномочия Token Power, определяется в нескольких программах в иерархии. Например, программа Claims Program позволяет вам подавать претензии в отношении проделанной вами работы. Мы подробно рассмотрим все программы.",
                    "updated": 1638978650858
                },
                {
                    "language": "TR",
                    "text": "Token Gücünüzü nasıl kullandığınız, hiyerarşi içindeki çeşitli programlarda tanımlanır. Örneğin, Talepler Programı (Claims Program), yaptığınız iş için talepler sunmanıza olanak tanır. Tüm programları ayrıntılı olarak ele alacağız.",
                    "updated": 1645181807885
                },
                {
                    "language": "DE",
                    "text": "Wie Sie Ihre Token Power einsetzen, wird in verschiedenen Programmen innerhalb der Hierarchie festgelegt. Mit dem Claims Program können Sie zum Beispiel Ansprüche für Ihre Arbeit geltend machen. Wir werden alle Programme im Detail behandeln.",
                    "updated": 1676839462314
                }
            ]
        },
        {
            "style": "Text",
            "text": "Your User Profile points to a Superalgos SA Token address you create from within Superalgos. You validate your address by signing a cryptographic proof, also from within Superalgos, so that the system becomes aware of the number of tokens in the address, and assigns your profile an equivalent amount of Token Power.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Tus puntos del User Profile marcan una dirección de Superalgos SA Token que creas desde dentro de Superalgos. Valida tu dirección confirmando una prueba de firma criptográfica, también desde Superalgos, entonces el sistema se da cuenta de la cantidad de tokens en tu dirección, y te asigna a tu profile el monto equivalente de Token Power.",
                    "updated": 1682594264020
                },
                {
                    "language": "RU",
                    "text": "Ваш профиль пользователя User Profile указывает на адрес Superalgos SA Token, который вы создаете в Superalgos. Вы подтверждаете свой адрес, подписывая криптографическое доказательство, также из Superalgos, чтобы система знала количество токенов в адресе и присваивала вашему профилю эквивалентное количество Token Power.",
                    "updated": 1638978834505
                },
                {
                    "language": "TR",
                    "text": "Kullanıcı Profiliniz (User Profile), Superalgos içinden oluşturduğunuz bir Superalgos SA Token adresini işaret eder. Sistemin adresteki jeton sayısından haberdar olması ve profilinize eşdeğer miktarda Token Gücü ataması için Superalgos içinden de bir kriptografik kanıt imzalayarak adresinizi doğrularsınız.",
                    "updated": 1645181863350
                },
                {
                    "language": "DE",
                    "text": "Ihr Benutzerprofil (User Profile) verweist auf eine Superalgos SA Token Adresse, die Sie innerhalb von Superalgos erstellen. Sie validieren Ihre Adresse, indem Sie einen kryptografischen Beweis unterschreiben, ebenfalls von Superalgos aus, so dass das System die Anzahl der Token in der Adresse erkennt und Ihrem Profil eine entsprechende Menge an Token Power zuweist.",
                    "updated": 1676839479796
                }
            ]
        },
        {
            "style": "Success",
            "text": "The address you generate is also the address to which the project will send the tokens you earn for your contributions. We call it you Governance Address.",
            "updated": 1629993655810,
            "translations": [
                {
                    "language": "ES",
                    "text": "TLa dirección que generes es también la dirección donde el proyecto te envie los tokens que hayas ganado por tus contribuciones. Nosotros la llamamos tu Governance Address ( dirección de gobernanza).",
                    "updated": 1682594318155
                },
                {
                    "language": "RU",
                    "text": "Сгенерированный вами адрес также является адресом, на который проект будет отправлять токены, которые вы зарабатываете за свои взносы. Мы называем это управленческим адресом Governance Address.",
                    "updated": 1638978932977
                },
                {
                    "language": "TR",
                    "text": "Oluşturduğunuz adres aynı zamanda projenin katkılarınız karşılığında kazandığınız jetonları göndereceği adrestir. Biz buna Yönetim Adresi (Governance Address) diyoruz.",
                    "updated": 1645181901663
                },
                {
                    "language": "DE",
                    "text": "Die von Ihnen erstellte Adresse ist auch die Adresse, an die das Projekt die Token sendet, die Sie für Ihre Beiträge erhalten. Wir nennen sie Ihre Governance-Adresse (Governance Adress).",
                    "updated": 1676839502282
                }
            ]
        }
    ]
}