{
    "topic": "Introduction to Governance",
    "pageNumber": "7",
    "type": "Voting Program Overview",
    "definition": {
        "text": "The Voting Program allows you to influence how tokens are distributed, effectively influencing the direction of development. You also use votes to vouch for other contributor’s claims, which is a clear expression of your influence in the project as well.",
        "updated": 1624705585070
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may deploy your votes in different manners:",
            "updated": 1624705603842
        },
        {
            "style": "List",
            "text": "Weight Votes allow you to influence which areas of development will be incentivized."
        },
        {
            "style": "List",
            "text": "Claim Votes allow you to support the Contribution Claims of other Contributors so that they may be compensated for their Contributions."
        },
        {
            "style": "List",
            "text": "User Profile Votes allow you to delegate your Voting Power to other users, so that people you trust may vote on topics you are not well versed on, using your power.",
            "updated": 1630055605861
        },
        {
            "style": "Text",
            "text": "You produce these definitions under the Voting Program section of the User Profile hierarchy. Because you define the distribution of votes in a hierarchical structure of nodes, votes flow down the Voting Program section in a cascading style. "
        },
        {
            "style": "Text",
            "text": "By default, each parent node sends an equal number of votes to each offspring. However, you may easily override the default behavior via the configuration of any given node."
        },
        {
            "style": "Title",
            "text": "Weight Votes"
        },
        {
            "style": "Text",
            "text": "Weight votes come in different flavors:"
        },
        {
            "style": "List",
            "text": "Pool Weight Vote"
        },
        {
            "style": "List",
            "text": "Position Weight Vote"
        },
        {
            "style": "List",
            "text": "Asset Weight Vote"
        },
        {
            "style": "List",
            "text": "Feature Weight Vote"
        },
        {
            "style": "Text",
            "text": "The above are the different concepts you may choose to incentivize with your votes. We’ll dive into each at a later time."
        },
        {
            "style": "Callout",
            "text": "The key underlying concept is that the project distributes more tokens to the concepts holding more Weight Votes. This is how you may influence the direction of development of the project, as Contributors are more prone to work on the areas that are more heavily incentivized."
        },
        {
            "style": "Title",
            "text": "Claim Votes"
        },
        {
            "style": "Text",
            "text": "You may set up Claim Votes for each of the types of Contribution Claims mentioned earlier. This is how you support Contributors that have worked close to you, or in areas of the project you are familiar with or active on, so that they may get compensated for their work."
        },
        {
            "style": "Title",
            "text": "Profile Votes"
        },
        {
            "style": "Text",
            "text": "You use Profile Votes to delegate your Voting Power on other users, in a liquid democracy style. This feature may be useful in many different instances. Let’s explore a few examples:"
        },
        {
            "style": "List",
            "text": "You lack expertise in a certain area and wish someone else to direct your Voting Power."
        },
        {
            "style": "List",
            "text": "You wish someone knowledgeable in certain areas of the Project to have more power to influence the direction of development."
        },
        {
            "style": "List",
            "text": "You trust someone and their judgement and want to get behind his or her ideas and support them."
        },
        {
            "style": "Title",
            "text": "Token Bonus"
        },
        {
            "style": "Text",
            "text": "Participating in the decision-making process around governance issues is an important civic duty, and therefore, it is incentivized. Your Voting Power earns you tokens too!"
        }
    ]
}