{
    "topic": "Introduction to Governance",
    "pageNumber": "1",
    "type": "Governance Overview",
    "definition": {
        "text": "Governance of the Superalgos Project is distributed among all members of the Community willing to participate. You may engage in multiple manners, help drive development in the desired directions, and contribute to nurturing a healthy community.",
        "updated": 1630424148804,
        "translations": [
            {
                "language": "ES",
                "text": "La gobernanza del proyecto de Superalgos está distribuída entre todos los miembros de la comunidad que estén dispuestos a participar. Puede comprometerse de múltiples maneras, ayudar a dirigir el desarrollo en las direcciones deseadas, y contribuir a nutrir una comunidad saludable.",
                "updated": 1633345029161,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Управление проектом Superalgos Project распределяется между всеми членами Community, желающими участвовать. Вы можете использовать разные манеры, помогать развитию в желаемых направлениях и способствовать формированию здорового сообщества.",
                "updated": 1638974998112
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "To participate in governance, community members leverage their Superalgos SA Token holdings, exerting influence proportional to their Token Power and their Reputation. The combined influence of all token holders participating in governance determines, among other things:",
            "updated": 1630065456504,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para participar en la gobernanza, los miembros de la comunidad apalancan su tenencia de  Superalgos SA Token, ejerciendo influencia proporcional a su Token Power y a su Reputation. La inlfuencia combinada de todos los tenedores de token que  participan en la gobernancia determinan, entre otras cosas:",
                    "updated": 1633345582953,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Для участия в управлении члены сообщества используют свои токены Superalgos SA, оказывая влияние, пропорциональное их силе токенов Token Power и их репутации Reputation. Совместное влияние всех держателей токенов, участвующих в управлении, среди прочего определяет:",
                    "updated": 1638975114183
                }
            ]
        },
        {
            "style": "List",
            "text": "What Positions, Features, Assets, or project-development activities, in general, are incentivized and how.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Que Positions, Features, Assets, o actividades de desarrollo de proyectos, en general, están incentivados y cómo.",
                    "updated": 1633348402852,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Какие Positions, Features, Assets или деятельность по разработке проектов в целом стимулируются и как.",
                    "updated": 1639029551142
                }
            ]
        },
        {
            "style": "List",
            "text": "Which Contributors are compensated for which Contributions.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Que contribuyentes son pagados por cuales contribuciones.",
                    "updated": 1633345751024,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Какие вкладчики получают компенсацию за какие вклады.",
                    "updated": 1638975506518
                }
            ]
        },
        {
            "style": "List",
            "text": "What Programs are funded and how.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Qué programas se financian y cómo",
                    "updated": 1633345784026,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Какие программы финансируются и как.",
                    "updated": 1638975522835
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may exert your influence dynamically, as you may redirect your Token Power at any moment. The distribution of Token Power upon each release of the software — tied to the corresponding Superalgos SA Token Distribution Event — determines how tokens allocated to the release are distributed.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Puede ejercer su influencia de forma dinámica, ya que puede redirigir su Token Power en cualquier momento. La distribución de Token Power en cada lanzamiento del software — atado al correspondiente Superalgos SA Token Distribution Event — determina cómo se distribuyen los tokens asignados al lanzamiento.",
                    "updated": 1633345986132,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Распределение сил Token Power при каждом выпуске программного обеспечения — привязанное к соответствующему событию распределения токенов Superalgos SA — определяет, как распределяются токены, выделенные для выпуска.",
                    "updated": 1638975766065
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Governance Project is designed as a flexible system that allows the Community to dynamically direct influence in arbitrary directions. It allows governance to evolve with the project. It also encourages permissionless innovation, as Contributors may propose new areas of development and rally the Community to incentivize expansion along new lines.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El Governance Project está diseñado como un sistema flexible que permite a la comunidad ejercer influencia en direcciones arbitrarias de manera dinámica. Permite que la gobernanza evolucione con el proyecto. también promueve la innovación sin permiso, ya que los Colaboradores pueden proponer nuevas áreas de desarrollo y conducir a la comunidad incentivar expansion a lo largo de lineas nuevas.",
                    "updated": 1633346387045,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Проект управления Governance Project разработан как гибкая система, которая позволяет cообществу Community динамически направлять влияние в произвольных направлениях. Это позволяет управлению развиваться вместе с проектом. Это также поощряет неразрешенные инновации, поскольку авторы могут предлагать новые области развития и сплотить Community, чтобы стимулировать расширение по новым направлениям.",
                    "updated": 1638975914629
                }
            ]
        },
        {
            "style": "Note",
            "text": "A Community engaged in governance is crucial for the development of the project, therefore participation is incentivized. In other words, you will earn Superalgos SA Tokens if you take part in the governance of Superalgos.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Una comunidad comprometida con la gobernanza es fundamental para el desarrollo del proyecto, por lo tanto se incentiva la participación, en otras palabras, ganará Superalgos SA Tokens si forma parte de la gobernanza de Superalgos.",
                    "updated": 1633346519203,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Сообщество, вовлеченное в управление, имеет решающее значение для развития проекта, поэтому участие поощряется. Другими словами, вы будете зарабатывать токены Superalgos SA, если примете участие в управлении Superalgos.",
                    "updated": 1638975941760
                }
            ]
        },
        {
            "style": "Title",
            "text": "Governance Infrastructure",
            "translations": [
                {
                    "language": "RU",
                    "text": "Инфраструктура управления",
                    "updated": 1638975956666
                }
            ]
        },
        {
            "style": "Text",
            "text": "The governance system is implemented within Superalgos as the Governance Project, making use of the same visual scripting resources, hierarchical data structures, and concepts such as References that make up the Superalgos paradigm you are familiar with.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El sistema de gobernanza se implementa con Superalgos, haciendo uso de los mismos recursos de secuencias de comandos visuale, estructuras de datos jerárquicos, y conceptos tales como referencias que conforman el paradigma de Superalgos con el que está familiarizado.",
                    "updated": 1633346787559,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Система управления реализована в Superalgos как проект управления с использованием тех же ресурсов визуальных сценариев, иерархических структур данных и таких концепций, как ссылки, которые составляют знакомую вам парадигму Superalgos.",
                    "updated": 1638975978383
                }
            ]
        },
        {
            "style": "Text",
            "text": "As such, governance does not require the use of smart contracts to enforce immutable rules. On the contrary, in Superalgos, governance is an ever-evolving notion, pretty much like the rest of the project.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Como tal, la gobernanza no requiere el uso de contratos inteligentes para hacer cumplir reglas inmutables. Por el contrario, en Superalgos, la gobernanza es una noción en constante evolución, muy parecida al resto del proyecto. ",
                    "updated": 1633346878247,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Таким образом, управление не требует использования смарт-контрактов для обеспечения неизменных правил. Напротив, в Superalgos управление - это постоянно развивающееся понятие, во многом как и в остальном проекте.",
                    "updated": 1638975997161
                }
            ]
        },
        {
            "style": "Callout",
            "text": "This flexibility is a crucial feature that will allow us to evolve the governance system, adapt the game theory behind it, and correct any exploits that bad actors may find over time.",
            "updated": 1630424896773,
            "translations": [
                {
                    "language": "ES",
                    "text": "Esta flexibilidad es una característica crucial que nos permitirá hacer evolucionar el sistema de gobernanza, adaptar la teoría del juego detrás de él y corregir cualquier vulnerabilidad que los malos actores puedan encontrar con el tiempo",
                    "updated": 1633346945113,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Эта гибкость является важной особенностью, которая позволит нам развивать систему управления, адаптировать лежащую в ее основе теорию игр и исправлять любые эксплойты, которые со временем могут обнаружить злоумышленники.",
                    "updated": 1638976297717
                }
            ]
        },
        {
            "style": "Text",
            "text": "Governance is defined across multiple Governance Workspaces that users may load and contribute to. These workspaces feature the definitions of several hierarchies that determine the relationship of all the concepts affecting governance.",
            "updated": 1630424913354,
            "translations": [
                {
                    "language": "ES",
                    "text": "La gobernanza está definida a través de múltiples Governance Workspaces que los usuarios pueden cargar y contribuir con. Estos espacios de trabajo presentan las definiciones de varias jerarquías que determinan la relación de todos los conceptos que afectan la gobernanza.",
                    "updated": 1633347120583,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Управление определяется несколькими рабочими пространствами управления Governance Workspaces, которые пользователи могут загружать и вносить в них. Эти рабочие пространства содержат определения нескольких иерархий, которые определяют взаимосвязь всех концепций, влияющих на управление.",
                    "updated": 1638976411661
                }
            ]
        },
        {
            "style": "Text",
            "text": "To participate in governance, users must set up and submit a User Profile plugin defining how they intend to exert the influence conferred by their Superalgos SA Token holdings. The influence and participation is defined through different types of programs, votes, and claims.",
            "updated": 1629992750219,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para participar en la gobernanaza, los usuarios deben configurar y enviar un User Profile plugin que define cómo pretenden ejercer la influencia conferida por sus tenencias de Superalgos SA Token. La inlfuencia y participación está definida mediante diferentes tipos de programas, votos y declaraciones.",
                    "updated": 1633347353982,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Чтобы участвовать в управлении, пользователи должны настроить и отправить плагин профиля пользователя User Profile, определяющий, как они намереваются оказывать влияние, предоставляемое их токенами Superalgos SA Token. Влияние и участие определяется через различные типы программ, голосований и требований.",
                    "updated": 1638976748865
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Governance System computes votes and claims in realtime, showing a preview of what the distribution may look like, on the UI.",
            "updated": 1630425053320,
            "translations": [
                {
                    "language": "ES",
                    "text": "El sistema de gobernanza computa los votos y las declaraciones en tiempo real, mostrando una vista previa de lo que la distribucion showing a preview of what the distribution puede parecer, en el UI.",
                    "updated": 1633347466937,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Система управления Governance System подсчитывает голоса и заявки в реальном времени, показывая предварительный просмотр того, как может выглядеть распределение, в пользовательском интерфейсе UI.",
                    "updated": 1638976562534
                }
            ]
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Computational Limitations",
            "updated": 1630091330176
        },
        {
            "style": "Block",
            "text": "Transparency and Auditability"
        },
        {
            "style": "Title",
            "text": "Transparency and Auditability",
            "translations": [
                {
                    "language": "RU",
                    "text": "Прозрачность и контролируемость",
                    "updated": 1638976613208
                }
            ]
        },
        {
            "style": "Text",
            "text": "Because all definitions affecting governance ship as plugins with the software, the process is transparent and auditable. ",
            "translations": [
                {
                    "language": "ES",
                    "text": "Porque las definiciones que afectan a la gobernanza envia como plugin con el software, el proceso es transparente y auditable.",
                    "updated": 1633347687363,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Поскольку все определения, влияющие на управление, поставляются в виде подключаемых модулей к программному обеспечению, этот процесс прозрачен и поддается проверке.",
                    "updated": 1638976631373
                }
            ]
        },
        {
            "style": "List",
            "text": "Any user may, at any point, load the corresponding Plugin Workspaces and visualize how influence is being exerted by all Superalgos SA Token holders participating.",
            "updated": 1629995410591,
            "translations": [
                {
                    "language": "ES",
                    "text": "cualquier usuario puede, en cualquier momento, cargar el correspondiente Plugin Workspaces y visualizar and visualizecómo la influencia está siendo ejercida por todos participantes titulares de Superalgos SA Token..",
                    "updated": 1633347841894,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Любой пользователь может в любой момент загрузить соответствующие рабочие области подключаемых модулей Plugin Workspaces и визуализировать влияние всех участвующих держателей токенов Superalgos SA Token.",
                    "updated": 1638976735618
                }
            ]
        },
        {
            "style": "List",
            "text": "Any user may verify all metrics managed by the Governance Project in the tables displayed in the Governace Tab.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Cualquier usuario puede verificar Any user may verify todas las métricas gestionadas por el  Governance Project en las tablas desplegadas en el Governace Tab.",
                    "updated": 1633347961533,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Любой пользователь может проверить все показатели, управляемые проектом Governance Project, в таблицах, отображаемых на вкладке Governance.",
                    "updated": 1638976978206
                }
            ]
        },
        {
            "style": "List",
            "text": "Any user may run a simulation of the Superalgos SA Token distribution process and verify how tokens allocated to the next release will be distributed.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Cualquier usuario puede hacer correr una simulación de el proceso de distribución de Superalgos SA Token y verificar verify cómo se distribuirán los tokens asignados a la próxima versión.",
                    "updated": 1633348037956,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Любой пользователь может запустить моделирование процесса распределения токенов Superalgos SA Token и проверить, как будут распределяться токены, выделенные для следующего выпуска.",
                    "updated": 1638977022872
                }
            ]
        },
        {
            "style": "List",
            "text": "Any user may obtain (from GitHub) and load historical versions of the software, and run a simulation of the Superalgos SA Token Distribution Event to verify how tokens were distributed in past releases. Notice that, in this case, the absolute number of votes may not be valid as token holdings will have varied; however, any user may validate the relative distribution.",
            "updated": 1630425087155,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cualquier usuario puede obtener (mediante GitHub) y cargar versiones históricas del software, y hacer correr una simulación de Superalgos SA Token Distribution Event para verificar como los tokens han sido distribuidos ten lanzamientos anteriores. Note quet, en este caso, el número absoluto de votos puede no ser válido ya que las tenencias de token habrán variado, de todas maneras, cualquier usuario puede validar la distribución relativa.",
                    "updated": 1633531601031,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Любой пользователь может получить (из GitHub) и загрузить исторические версии программного обеспечения, а также запустить моделирование события распределения токенов Superalgos SA Token, чтобы проверить, как токены были распределены в прошлых выпусках. Обратите внимание, что в этом случае абсолютное количество голосов может быть недействительным, поскольку владение токенами будет изменяться; тем не мение, любой пользователь может проверить относительное распределение.",
                    "updated": 1638977085559
                }
            ]
        }
    ]
}