{
    "topic": "Introduction to Governance",
    "pageNumber": "5",
    "type": "Mentorship Program Overview",
    "definition": {
        "text": "Superalgos is a community-driven project designed, nurtured, and incentivized to grow into a massive collaboration. One of the incentives to grow the collaboration is embodied in the Mentorship Program, designed to encourage the recruiting, nurturing, and mentoring of Contributors.",
        "updated": 1624705390084
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "In a nutshell, when you spawn the Mentorship Program and declare a User Mentor by referencing the User Profile of your mentor, you pass him or her 10% of the Mentorship Power you direct to the User Mentor node!",
            "updated": 1629998677982
        },
        {
            "style": "Text",
            "text": "The core idea is that mentors may earn a percentage of the tokens allocated to the Mentorship Rewards Pool on each release. How much of the pool they get depends on the Mentorship Power they get from their mentees.",
            "updated": 1630005807344
        },
        {
            "style": "Note",
            "text": "This incentive encourages power users to help newcomers with the initial learning curve, all the way until they get to the point in which they may contribute something of value."
        },
        {
            "style": "Title",
            "text": "Your Mentors"
        },
        {
            "style": "Text",
            "text": "You declare who your mentors are by establishing references from User Mentor nodes under the Mentorship Program node to the User Profile of the persons that:",
            "updated": 1629998973037
        },
        {
            "style": "List",
            "text": "helped you with your onboarding;"
        },
        {
            "style": "List",
            "text": "mentored you during the early stages;"
        },
        {
            "style": "List",
            "text": "helped you with your Contributions;"
        },
        {
            "style": "List",
            "text": "produced the educational material you used to learn the system..."
        },
        {
            "style": "Text",
            "text": "Notice that there is no hard definition of who or what a mentor is. It is up to you to decide. Also notice that you may assign arbitrary Mentorship Power to each of your mentors."
        },
        {
            "style": "Success",
            "text": "Declaring your mentors and participating in the program is the best way to thank the people that helped you succeed with Superalgos!"
        },
        {
            "style": "Title",
            "text": "Token Bonus"
        },
        {
            "style": "Text",
            "text": "Yes! This program has a bonus too! Declare your mentors and earn tokens!"
        }
    ]
}