{
    "type": "Dropout Layer",
    "definition": {
        "text": "Applies dropout to the input. Dropout consists in randomly setting a fraction rate of input units to 0 at each update during training time, which helps prevent overfitting.",
        "updated": 1613213791502,
        "translations": [
            {
                "language": "RU",
                "text": "Применяет отсев к входным данным. Отсев заключается в случайной установке доли входных единиц на 0 при каждом обновлении в течение времени обучения, что помогает предотвратить переподгонку.",
                "updated": 1645247457538
            },
            {
                "language": "TR",
                "text": "Girişe dropout uygular. Bırakma, eğitim süresi boyunca her güncellemede girdi birimlerinin bir kısmının rastgele 0 olarak ayarlanmasından oluşur ve bu da aşırı uyumu önlemeye yardımcı olur.",
                "updated": 1654396996133
            },
            {
                "language": "DE",
                "text": "Wendet Dropout auf die Eingabe an. Dropout besteht darin, dass bei jeder Aktualisierung während der Trainingszeit ein Bruchteil der Eingabeeinheiten zufällig auf 0 gesetzt wird, was dazu beiträgt, eine Überanpassung zu verhindern.  ",
                "updated": 1708629028744
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645247463220
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397002337,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1708460374144
                }
            ]
        }
    ]
}