{
    "type": "Market Sell Order",
    "definition": {
        "text": "A market sell order is an instruction sent to the exchange to sell the base asset, for immediate execution at current market prices.",
        "translations": [
            {
                "language": "ES",
                "text": "Un market sell orderes una instrucción enviada a la bolsa para vender el activo base, para su ejecución inmediata a los precios actuales del mercado.",
                "updated": 1629580936448
            },
            {
                "language": "RU",
                "text": "Market Sell Order - это распоряжение, отправленное на биржу для продажи базового актива с целью немедленного исполнения по текущим рыночным ценам.",
                "updated": 1639841489842
            },
            {
                "language": "TR",
                "text": "Piyasa satış emri, temel varlığı satmak için borsaya gönderilen ve cari piyasa fiyatlarından derhal gerçekleştirilecek bir talimattır.",
                "updated": 1701087701867
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Success",
            "text": "Please read the definition of Market Buy Order for relevant information about how orders in general—and market orders in particular—work.",
            "updated": 1609608966819,
            "translations": [
                {
                    "language": "RU",
                    "text": "Пожалуйста, прочитайте определение Market Buy Order для получения соответствующей информации о том, как работают ордера в целом и в частности рыночные ордера.",
                    "updated": 1639841738841
                },
                {
                    "language": "TR",
                    "text": "Genel olarak emirlerin, özel olarak da piyasa emirlerinin nasıl işlediği hakkında bilgi edinmek için lütfen Piyasa Alış Emri ( Market Buy Order  ) tanımını okuyun.",
                    "updated": 1701087721763
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Market Sell Order Configuration",
            "updated": 1609608299620,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Market Sell Order",
                    "updated": 1639841593496
                },
                {
                    "language": "TR",
                    "text": "Piyasa Satış Emri Yapılandırması",
                    "updated": 1701087726546
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609608307181,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1639841600484
                },
                {
                    "language": "TR",
                    "text": "Özellikler",
                    "updated": 1701087730971
                }
            ]
        },
        {
            "style": "List",
            "text": "percentageOfAlgorithmSize is the definition of how much of the size handled by the algorithm shall be allocated to this particular order. Posible values are real numbers between 0 and 100, including the extremes. If you set the value to 0, the order will not be executed.",
            "translations": [
                {
                    "language": "RU",
                    "text": "percentageOfAlgorithmSize - это определение того, какая часть размера, обрабатываемого алгоритмом, должна быть выделена для данного конкретного ордера. Возможные значения - вещественные числа от 0 до 100, включая крайние значения. Если вы установите значение 0, ордер не будет выполнен.",
                    "updated": 1639841631317
                },
                {
                    "language": "TR",
                    "text": "percentageOfAlgorithmSize, algoritma tarafından işlenen boyutun ne kadarının bu özel sıraya tahsis edileceğinin tanımıdır. Olası değerler, uç değerler de dahil olmak üzere 0 ile 100 arasındaki gerçek sayılardır. Değeri 0 olarak ayarlarsanız, emir yürütülmeyecektir.",
                    "updated": 1701087735858
                }
            ]
        },
        {
            "style": "List",
            "text": "spawnMultipleOrders is the parameter that indicates whether additional spawned orders are allowed (true) or not (false).",
            "translations": [
                {
                    "language": "RU",
                    "text": "spawnMultipleOrders - это параметр, который указывает, разрешены ли дополнительные порожденные ордера (true) или нет (false).",
                    "updated": 1639841649174
                },
                {
                    "language": "TR",
                    "text": "spawnMultipleOrders, ilave emirlerin oluşturulmasına izin verilip verilmediğini (true) veya izin verilmediğini (false) gösteren parametredir.",
                    "updated": 1701087739840
                }
            ]
        }
    ]
}