{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": 4,
    "type": "Tutorial Step - Points to Take Home...",
    "definition": {
        "icon": {
            "name": "Trading\\trading-system",
            "project": "Foundations"
        },
        "text": "There are some key learnings in the previous reading: multiple strategies, single positions, and precedence.",
        "translations": [
            {
                "language": "ES",
                "text": "Hay algunos aprendizajes clave en la lectura anterior: estrategias múltiples, posiciones únicas y precedencia.",
                "updated": 1629588118888
            },
            {
                "language": "DE",
                "text": "In der vorangegangenen Lektüre haben wir einige wichtige Dinge gelernt: mehrere Strategien, einzelne Positionen und Vorrang.",
                "updated": 1639147424807
            },
            {
                "language": "TR",
                "text": "Özet: Önceki okumada bazı temel dersler vardı: çoklu stratejiler, tek pozisyonlar ve öncelik.",
                "updated": 1640695041498
            },
            {
                "language": "RU",
                "text": "В предыдущем материале есть несколько ключевых выводов: разнообразные стратегии, одиночные позиции и приоритет.",
                "updated": 1640878901439
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Let's take some mental notes for what comes next:",
            "translations": [
                {
                    "language": "ES",
                    "text": "Tomemos algunas notas mentales para lo que viene a continuación:",
                    "updated": 1629588135560
                },
                {
                    "language": "DE",
                    "text": "Machen wir uns ein paar Notizen für das, was jetzt kommt:",
                    "updated": 1639147454816
                },
                {
                    "language": "TR",
                    "text": "Bundan sonra ne olacağına dair bazı zihinsel notlar alalım:",
                    "updated": 1640695075073
                },
                {
                    "language": "RU",
                    "text": "Давайте сделаем несколько мысленных заметок для того, что будет дальше:",
                    "updated": 1640878912690
                }
            ]
        },
        {
            "style": "List",
            "text": "Multiple strategies may coexist within a trading system&mdash;as many as you wish.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Pueden coexistir múltiples estrategias dentro de un sistema trading, tantas como desees.",
                    "updated": 1629588192365
                },
                {
                    "language": "DE",
                    "text": "In einem Trading System können mehrere Strategien nebeneinander bestehen - so viele, wie Sie möchten.",
                    "updated": 1639147465524
                },
                {
                    "language": "TR",
                    "text": "Bir ticaret sisteminde birden fazla strateji bir arada bulunabilir - istediğiniz kadar.",
                    "updated": 1640695353160
                },
                {
                    "language": "RU",
                    "text": "В рамках торговой системы могут сосуществовать несколько стратегий - столько, сколько вы пожелаете.",
                    "updated": 1640878924519
                }
            ]
        },
        {
            "style": "List",
            "text": "One active strategy with one open position at any given moment is allowed only.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Solo se permite una estrategia activa con una posición abierta en un momento dado.",
                    "updated": 1629588175743
                },
                {
                    "language": "DE",
                    "text": "Es ist jedoch nur eine aktive Strategie mit einer offenen Position zu einem bestimmten Zeitpunkt erlaubt.",
                    "updated": 1639147472356
                },
                {
                    "language": "TR",
                    "text": "Herhangi bir anda bir açık pozisyona sahip yalnızca bir aktif stratejiye izin verilir.",
                    "updated": 1640695386636
                },
                {
                    "language": "RU",
                    "text": "Разрешается только одна активная стратегия с одной открытой позицией в произвольный момент времени.",
                    "updated": 1640879010551
                }
            ]
        },
        {
            "style": "List",
            "text": "Precedence is given by the order in which strategies are defined around the Trading System node. You may change the order, of course!",
            "translations": [
                {
                    "language": "ES",
                    "text": "La precedencia viene dada por el orden en el que se definen las estrategias alrededor del nodo Trading System. ¡Puedes cambiar el orden!",
                    "updated": 1629588262008
                },
                {
                    "language": "DE",
                    "text": "Der Vorrang ergibt sich aus der Reihenfolge, in der die Strategien um den Knoten Trading System herum definiert sind. Sie können die Reihenfolge natürlich ändern!",
                    "updated": 1639147480926
                },
                {
                    "language": "TR",
                    "text": "Öncelik, Ticaret Sistemi ( Trading System ) düğümü etrafında stratejilerin tanımlandığı sırayla verilir. Elbette sırayı değiştirebilirsin!",
                    "updated": 1640695499601
                },
                {
                    "language": "RU",
                    "text": "Приоритет отдается порядку, в котором стратегии определены вокруг узла Trading System. Вы конечно же можете изменить этот порядок!",
                    "updated": 1640879040636
                }
            ]
        },
        {
            "style": "Note",
            "text": "You are probably asking why? Do these rules sound arbitrary? They are, for good reason!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Probablemente te estés preguntando.. ¿por qué estas reglas suenan arbitrarias? ¡Lo son!",
                    "updated": 1629588865354
                },
                {
                    "language": "DE",
                    "text": "Sie fragen sich wahrscheinlich, warum? Klingen diese Regeln willkürlich? Das sind sie, und zwar aus gutem Grund!",
                    "updated": 1639147490934
                },
                {
                    "language": "TR",
                    "text": "Not: Muhtemelen nedenini soruyorsundur? Bu kurallar, keyfi mi? İyi bir sebepten dolayı öyle!",
                    "updated": 1640695584520
                },
                {
                    "language": "RU",
                    "text": "Вы, наверное, спрашиваете, почему? Неужели эти правила звучат произвольно? Так и есть, и на то есть веские причины!",
                    "updated": 1640879082478
                }
            ]
        }
    ]
}
