{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": "1",
    "type": "Intro to Trading Systems Tutorial",
    "definition": {
        "text": "This tutorial is the first in a series of tutorials that teach you how to build trading systems. The series goes deep into multiple topics and takes you through a progression that intends to match basic trading knowledge with particular Superalgos implementations. This first tutorial covers theoretical concepts, explains how trading systems are structured in Superalgos, and highlights how you need to frame your strategies to make the most out of the trading framework built-in the system.",
        "updated": 1617114418610,
        "translations": [
            {
                "language": "ES",
                "text": "Este tutorial es el primero de una serie de tutoriales que te enseñarán a construir sistemas de trading (Trading System). La serie profundiza en múltiples temas y te llevará a través de una progresión que tiene la intención de hacer coincidir el conocimiento de trading básico con implementaciones particulares de Superalgos. Este primer tutorial cubre conceptos teóricos, explica cómo se estructuran los sistemas de trading en Superalgos y destaca cómo debes enmarcar tus estrategias para aprovechar al máximo el marco de trading integrado en el sistema.",
                "updated": 1675618604186
            },
            {
                "language": "DE",
                "text": "Dieses Tutorial ist das erste in einer Reihe von Tutorials, in denen Sie lernen, wie man Trading Systeme erstellt. Die Reihe vertieft mehrere Themen und führt Sie durch eine Progression, die darauf abzielt, grundlegende Handelskenntnisse mit bestimmten Superalgos-Implementierungen zu verbinden. Dieses erste Tutorial deckt theoretische Konzepte ab, erklärt, wie Handelssysteme in Superalgos strukturiert sind, und hebt hervor, wie Sie Ihre Strategien gestalten müssen, um das Beste aus dem in das System integrierten Handelsrahmen herauszuholen.",
                "updated": 1639147057219
            },
            {
                "language": "TR",
                "text": "Bu öğretici, size ticaret sistemlerinin nasıl oluşturulacağını öğreten bir dizi öğreticinin ilkidir. Seri, birden fazla konuyu derinlemesine ele alır ve temel ticaret bilgilerini belirli Superalgos uygulamalarıyla eşleştirmeyi amaçlayan bir ilerlemeye götürür. Bu ilk eğitim teorik kavramları kapsar, Superalgos'ta alım satım sistemlerinin nasıl yapılandırıldığını açıklar ve sistemde yerleşik alım satım çerçevesinden en iyi şekilde yararlanmak için stratejilerinizi nasıl çerçevelemeniz gerektiğini vurgular.",
                "updated": 1640690079795
            },
            {
                "language": "RU",
                "text": "Этот учебник является первым в серии учебников, которые научат вас создавать торговые системы. Серия углубляется во множество тем и проводит вас через последовательность, которая призвана соотнести базовые знания о торговле с конкретными реализациями Superalgos. В этом первом уроке рассматриваются теоретические концепции, объясняется, как построены торговые системы в Superalgos, и подчеркивается, как нужно строить свои стратегии, чтобы извлечь максимальную пользу из торговой платформы, встроенной в систему.",
                "updated": 1640878603688
            },
            {
                "language": "NL",
                "text": "Deze zelfstudie is de eerste in een reeks zelfstudies die u leren hoe u handelssystemen kunt bouwen. De serie gaat diep in op meerdere onderwerpen en neemt je mee door een progressie die bedoeld is om basiskennis van handelen te matchen met bepaalde Superalgos-implementaties. Deze eerste zelfstudie behandelt theoretische concepten, legt uit hoe handelssystemen zijn gestructureerd in Superalgos en laat zien hoe u uw strategieën moet omkaderen om het meeste uit het in het systeem ingebouwde handelsraamwerk te halen.",
                "updated": 1670790670019
            },
            {
                "language": "ID",
                "text": "Tutorial ini adalah yang pertama dari serangkaian tutorial yang mengajarkan kamu cara membangun trading system. Serial ini masuk jauh ke dalam berbagai topik dan membawa kamu melalui perkembangan yang bermaksud mencocokkan pengetahuan basic tradingmu dengan implementasi Superalgos tertentu. Tutorial pertama ini mencakup konsep teoretis, menjelaskan bagaimana struktur sistem trading di Superalgos, dan menyoroti bagaimana kamu perlu frame strategimu untuk memanfaatkan framework perdagangan yang ada di dalam sistem.",
                "updated": 1674461845687
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "About This Tutorial",
            "updated": 1617114477974,
            "translations": [
                {
                    "language": "DE",
                    "text": "Über dieses Tutorial:",
                    "updated": 1635726127122
                },
                {
                    "language": "RU",
                    "text": "Об этом учебнике",
                    "updated": 1640878612936
                },
                {
                    "language": "TR",
                    "text": "Bu Eğitim Hakkında",
                    "updated": 1654394067318,
                    "style": "Title"
                },
                {
                    "language": "ID",
                    "text": "Tentang Tutorial Ini",
                    "updated": 1674637804050
                },
                {
                    "language": "ES",
                    "text": "Acerca de este tutorial",
                    "updated": 1675620912854
                }
            ]
        },
        {
            "style": "List",
            "text": "Workspace: Trading System Design Tutorials Native Workspace.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Çalışma alanı: Ticaret Sistemi Tasarımı Eğitimleri Eklenti Çalışma Alanı.",
                    "updated": 1654394073347,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Maintainer: @julianmolina (Telegram).",
            "translations": [
                {
                    "language": "TR",
                    "text": "Bakımcı: @julianmolina (Telegram).",
                    "updated": 1654394079013,
                    "style": "List"
                },
                {
                    "language": "NL",
                    "text": "Beheerder: @julianmolina (Telegram).",
                    "updated": 1670790678945
                },
                {
                    "language": "ES",
                    "text": "Responsable: @julianmolina (Telegram).",
                    "updated": 1675618610296
                }
            ]
        }
    ]
}