{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": 11,
    "type": "Tutorial Step - Unpacking These Lessons",
    "definition": {
        "icon": {
            "name": "Trading\\trading-system",
            "project": "Foundations"
        },
        "text": "We've covered two examples of trading systems featuring multiple strategies... what can we learn from them?",
        "translations": [
            {
                "language": "ES",
                "text": "Hemos cubierto dos ejemplos de trading systems con múltiples estrategias ... ¿qué podemos aprender de ellos?",
                "updated": 1629679940921
            },
            {
                "language": "DE",
                "text": "Wir haben uns mit zwei Beispielen von Trading Systemen beschäftigt, die mehrere Strategien beinhalten... was können wir von ihnen lernen?",
                "updated": 1639148066353
            },
            {
                "language": "TR",
                "text": "Özet: Birden fazla strateji içeren ticaret sistemlerinin iki örneğini ele aldık... Onlardan ne öğrenebiliriz?",
                "updated": 1640781128057
            },
            {
                "language": "RU",
                "text": "Мы рассмотрели два примера торговых систем с несколькими стратегиями... чему мы можем у них научиться?",
                "updated": 1640885818372
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "In the case of Weak-hands Buster, each strategy represents a particular case of the same trading idea. In the case of BB Top Bounce, each strategy specializes in specific market conditions.",
            "translations": [
                {
                    "language": "ES",
                    "text": "En el caso de Weak-Hands Buster, cada estrategia representa un caso particular de la misma idea trading. En el caso de BB Top Bounce, cada estrategia se especializa en condiciones específicas del mercado.",
                    "updated": 1629680691160
                },
                {
                    "language": "DE",
                    "text": "Im Fall von Weak-hands Buster stellt jede Strategie einen besonderen Fall der gleichen Handelsidee dar. Im Fall von BB Top Bounce ist jede Strategie auf bestimmte Marktbedingungen spezialisiert.",
                    "updated": 1639148074263
                },
                {
                    "language": "TR",
                    "text": "Weak-hands Buster durumunda, her strateji aynı ticaret fikrinin belirli bir durumunu temsil eder. BB Top Bounce durumunda, her strateji belirli piyasa koşullarında uzmanlaşmıştır.",
                    "updated": 1640781585878
                },
                {
                    "language": "RU",
                    "text": "В случае с Weak-hands Buster каждая стратегия представляет собой частный случай одной и той же торговой идеи. В случае BB Top Bounce каждая стратегия специализируется на конкретных рыночных условиях.",
                    "updated": 1640885833211
                }
            ]
        },
        {
            "style": "Callout",
            "text": "In the next few steps, we will unpack the implications of using multiple strategies within the same trading system and&mdash;finally&mdash;answer the burning question: why would we want to use such a setup?",
            "translations": [
                {
                    "language": "ES",
                    "text": "En los próximos pasos, analizaremos las implicaciones de usar múltiples estrategias dentro del mismo trading system y, finalmente, responderemos la pregunta candente: ¿por qué querríamos usar una configuración de este tipo?",
                    "updated": 1629680767976
                },
                {
                    "language": "DE",
                    "text": "In den nächsten Schritten werden wir die Auswirkungen der Verwendung mehrerer Strategien innerhalb desselben Handelssystems erläutern und schließlich die brennende Frage beantworten: Warum sollten wir ein solches Setup verwenden?",
                    "updated": 1639148082982
                },
                {
                    "language": "TR",
                    "text": "Sonraki birkaç adımda, aynı ticaret sistemi içinde birden fazla strateji kullanmanın etkilerini ortaya çıkaracağız ve son olarak, can alıcı soruyu yanıtlayacağız: neden böyle bir kurulumu kullanmak isteyelim?",
                    "updated": 1640781381357
                },
                {
                    "language": "RU",
                    "text": "В следующих нескольких шагах мы расскажем о последствиях использования нескольких стратегий в рамках одной торговой системы и, наконец, ответим на животрепещущий вопрос: зачем нам нужна такая система?",
                    "updated": 1640885850270
                }
            ]
        }
    ]
}
