{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": 10,
    "type": "Tutorial Step - Time Frame Analysys",
    "definition": {
        "icon": {
            "name": "Time\\time-frame",
            "project": "Foundations"
        },
        "text": "Each strategy specializes in specific market conditions by analyzing the state of the market on different time frames!",
        "translations": [
            {
                "language": "ES",
                "text": "¡Cada estrategia se especializa en condiciones específicas del mercado analizando el estado del mercado en diferentes marcos de tiempo!",
                "updated": 1629598321603
            },
            {
                "language": "DE",
                "text": "Jede Strategie ist auf bestimmte Marktbedingungen spezialisiert, indem sie den Zustand des Marktes in verschiedenen Zeitrahmen analysiert!",
                "updated": 1639147994367
            },
            {
                "language": "TR",
                "text": "Özet: Her strateji, farklı zaman dilimlerinde piyasanın durumunu analiz ederek belirli piyasa koşullarında uzmanlaşmıştır!",
                "updated": 1640780494699
            },
            {
                "language": "RU",
                "text": "Каждая стратегия специализируется на конкретных рыночных условиях, анализируя состояние рынка на разных таймфреймах!",
                "updated": 1640885757836
            },
            {
                "language": "NL",
                "text": "Elke strategie is gespecialiseerd in specifieke marktomstandigheden door de toestand van de markt op verschillende tijdsbestekken te analyseren!",
                "updated": 1670791770689
            },
            {
                "language": "ID",
                "text": "Setiap strategi berspesialisasi dalam kondisi market tertentu dengan menganalisis keadaan market pada timeframe yang berbeda!",
                "updated": 1674625573277
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Take a look at the name of each strategy... 3H Down, 2H Down, 4H Up...",
            "translations": [
                {
                    "language": "ES",
                    "text": "Echa un vistazo al nombre de cada estrategia... 3H Down, 2H Down, 4H Up...",
                    "updated": 1629598582815
                },
                {
                    "language": "DE",
                    "text": "Werfen Sie einen Blick auf die Namen der einzelnen Strategien... 3H Down, 2H Down, 4H Up...",
                    "updated": 1639148002395
                },
                {
                    "language": "TR",
                    "text": "Her stratejinin adına bir göz atın... 3H Down, 2H Down, 4H Up...",
                    "updated": 1640780577332
                },
                {
                    "language": "RU",
                    "text": "Взгляните на название каждой стратегии... 3H Down, 2H Down, 4H Up...",
                    "updated": 1640885772414
                },
                {
                    "language": "NL",
                    "text": "Bekijk de naam van elke strategie... 3H Down, 2H Down, 4H Up...",
                    "updated": 1670791798012
                },
                {
                    "language": "ID",
                    "text": "Lihat nama pada setiap strategi... 3H Down, 2H Down, 4H Up...",
                    "updated": 1674625579073
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you study the conditions that define the trigger on event, you will notice that 3H Down refers to the fact that the particular strategy is triggered when the 3-hour time frame is in a downtrend.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si estudias las condiciones que definen el Trigger On Event, te darás cuenta de que 3H Down se refiere al hecho de que la estrategia en particular se activa cuando el marco temporal de 3 horas se encuentra en una tendencia bajista.",
                    "updated": 1675619672275
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie die Bedingungen studieren, die den Auslöser für das Event definieren, werden Sie feststellen, dass 3H Down sich auf die Tatsache bezieht, dass die spezielle Strategie ausgelöst wird, wenn sich der 3-Stunden-Zeitrahmen in einem Abwärtstrend befindet.",
                    "updated": 1639148015477
                },
                {
                    "language": "TR",
                    "text": "Olay tetikleyicisini (the trigger on event) tanımlayan koşulları incelerseniz, 3H Down, 3 saatlik zaman dilimi düşüş trendindeyken belirli stratejinin tetiklendiğini ifade ettiğini fark edeceksiniz.",
                    "updated": 1640780697748
                },
                {
                    "language": "RU",
                    "text": "Если вы изучите условия, определяющие событие срабатывания, вы заметите, что 3H Down означает, что данная стратегия срабатывает, когда 3-часовой временной интервал находится в нисходящем тренде.",
                    "updated": 1640885793199
                },
                {
                    "language": "NL",
                    "text": "Als je de voorwaarden bestudeert die de trigger bij een gebeurtenis definiëren, zul je merken dat 3H Down verwijst naar het feit dat de specifieke strategie wordt geactiveerd wanneer het tijdsbestek van 3 uur in een neerwaartse trend zit.",
                    "updated": 1670791823164
                },
                {
                    "language": "ID",
                    "text": "Jika kamu mempelajari conditions yang menentukan trigger on event, kamu akan melihat bahwa 3H Down mengacu pada fakta bahwa strategi tertentu dipicu ketika timeframe 3 jam berada dalam tren turun(downtrend).",
                    "updated": 1674625585971
                }
            ],
            "updated": 1640641128265
        },
        {
            "style": "Note",
            "text": "Each of the strategies specializes on a certain time frame and trend!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada una de las estrategias se especializa en un marco temporal y una tendencia determinados.",
                    "updated": 1675619587729
                },
                {
                    "language": "DE",
                    "text": "Jede der Strategien ist auf einen bestimmten Zeitrahmen und Trend spezialisiert!",
                    "updated": 1639148034333
                },
                {
                    "language": "TR",
                    "text": "Not: Stratejilerin her biri belirli bir zaman diliminde ve trendde uzmanlaşmıştır!",
                    "updated": 1640780716542
                },
                {
                    "language": "RU",
                    "text": "Каждая из стратегий специализируется на определенном таймфрейме и тренде!",
                    "updated": 1640885805445
                },
                {
                    "language": "NL",
                    "text": "Elk van de strategieën is gespecialiseerd in een bepaald tijdsbestek en een bepaalde trend!",
                    "updated": 1670791835731
                },
                {
                    "language": "ID",
                    "text": "Setiap strategi berspesialisasi pada timeframe dan tren tertentu!",
                    "updated": 1674625591922
                }
            ],
            "updated": 1640641202569
        }
    ]
}