{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": 13,
    "type": "Tutorial Step - Hyper Specialization!",
    "definition": {
        "icon": {
            "name": "Trading\\trading-system",
            "project": "Foundations"
        },
        "text": "Specialization is a very interesting concept that may lead to designing more efficient trading systems!",
        "translations": [
            {
                "language": "DE",
                "text": "Spezialisierung ist ein sehr interessantes Konzept, das zur Entwicklung effizienterer Handelssysteme führen kann!",
                "updated": 1639148192010
            },
            {
                "language": "TR",
                "text": "Özet: Uzmanlık, daha verimli ticaret sistemleri tasarlamaya yol açabilecek çok ilginç bir kavramdır!",
                "updated": 1640782402866
            },
            {
                "language": "RU",
                "text": "Специализация - это очень интересная концепция, которая может привести к созданию более эффективных торговых систем!",
                "updated": 1640885958098
            },
            {
                "language": "NL",
                "text": "Specialisatie is een zeer interessant concept dat kan leiden tot het ontwerpen van efficiëntere handelssystemen!",
                "updated": 1670792102299
            },
            {
                "language": "ID",
                "text": "Specialization adalah konsep yang sangat menarik yang dapat mengarah pada perancangan trading system yang lebih efisien!",
                "updated": 1674626352114
            },
            {
                "language": "ES",
                "text": "La especialización es un concepto muy interesante que puede llevar a diseñar sistemas de trading más eficientes.",
                "updated": 1675619843343
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "It is a well-known fact that most strategies perform better on certain market conditions.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Es ist eine bekannte Tatsache, dass die meisten Strategien unter bestimmten Marktbedingungen besser funktionieren.",
                    "updated": 1639148200807
                },
                {
                    "language": "TR",
                    "text": "Çoğu stratejinin belirli piyasa koşullarında daha iyi performans gösterdiği bilinen bir gerçektir.",
                    "updated": 1640782429429
                },
                {
                    "language": "RU",
                    "text": "Хорошо известно, что большинство стратегий лучше работают в определенных рыночных условиях.",
                    "updated": 1640885968020
                },
                {
                    "language": "NL",
                    "text": "Het is een bekend feit dat de meeste strategieën beter presteren onder bepaalde marktomstandigheden.",
                    "updated": 1670792113655
                },
                {
                    "language": "ID",
                    "text": "Sudah menjadi fakta umum bahwa sebagian besar strategi berkinerja lebih baik pada kondisi pasar tertentu.",
                    "updated": 1674626232133
                },
                {
                    "language": "ES",
                    "text": "Es un hecho bien conocido que la mayoría de las estrategias funcionan mejor en determinadas condiciones de mercado.",
                    "updated": 1675619864038
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Like with BB Top Bounce, a single trading system may feature multiple strategies, each specializing in specific trends, volatility ranges, or any other market parameter.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wie bei BB Top Bounce kann ein einziges Handelssystem mehrere Strategien enthalten, die jeweils auf bestimmte Trends, Volatilitätsbereiche oder andere Marktparameter spezialisiert sind.",
                    "updated": 1639148210238
                },
                {
                    "language": "TR",
                    "text": "BB Top Bounce'da olduğu gibi, tek bir ticaret sistemi, her biri belirli eğilimler, oynaklık aralıkları veya başka herhangi bir piyasa parametresi konusunda uzmanlaşmış birden fazla stratejiye sahip olabilir.",
                    "updated": 1640782461681
                },
                {
                    "language": "RU",
                    "text": "Как и в случае с BB Top Bounce, одна торговая система может включать в себя несколько стратегий, каждая из которых специализируется на определенных трендах, диапазонах волатильности или любых других параметрах рынка.",
                    "updated": 1640885984968
                },
                {
                    "language": "NL",
                    "text": "Net als bij BB Top Bounce kan een enkel handelssysteem meerdere strategieën bevatten, elk gespecialiseerd in specifieke trends, volatiliteitsbereiken of andere marktparameters.",
                    "updated": 1670792129677
                },
                {
                    "language": "ID",
                    "text": "Seperti halnya BB Top Bounce, satu trading system dapat menampilkan beberapa strategi, masing-masing mengkhususkan pada tren tertentu, rentang volatilitas, atau parameter market lainnya.",
                    "updated": 1674626219313
                },
                {
                    "language": "ES",
                    "text": "Al igual que con BB Top Bounce, un único sistema de trading puede incluir múltiples estrategias, cada una especializada en tendencias específicas, rangos de volatilidad o cualquier otro parámetro del mercado.",
                    "updated": 1675619885191
                }
            ]
        },
        {
            "style": "Success",
            "text": "Instead of designing a strategy to evaluate a range of market conditions, keep them focused!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Entwickeln Sie eine Strategie nicht, um eine Reihe von Marktbedingungen zu bewerten, sondern konzentrieren Sie sich auf diese!",
                    "updated": 1639148217709
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bir dizi piyasa koşulunu değerlendirmek için bir strateji tasarlamak yerine, odaklanmalarını sağlayın!",
                    "updated": 1640782482786
                },
                {
                    "language": "RU",
                    "text": "Вместо того чтобы разрабатывать стратегию для оценки целого ряда рыночных условий, сосредоточьтесь именно на них!",
                    "updated": 1640886033732
                },
                {
                    "language": "NL",
                    "text": "In plaats van een strategie te ontwerpen om een reeks marktomstandigheden te evalueren, houdt u ze gefocust!",
                    "updated": 1670792144088
                },
                {
                    "language": "ID",
                    "text": "Alih-alih merancang strategi untuk mengevaluasi berbagai kondisi dari market conditions, tetap fokus!",
                    "updated": 1674626225730
                },
                {
                    "language": "ES",
                    "text": "En lugar de diseñar una estrategia para evaluar una serie de condiciones de mercado, mantenlas concentradas.",
                    "updated": 1675619912295
                }
            ]
        }
    ]
}