{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": 9,
    "type": "Tutorial Step - At The Count of Three!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "condition"
        },
        "text": "BB Top Bounce features an interesting approach: it defines the trading idea with three simple conditions.",
        "translations": [
            {
                "language": "ES",
                "text": "BB Top Bounce presenta un enfoque interesante: define la idea de trading con tres condiciones simples.",
                "updated": 1675619327134
            },
            {
                "language": "DE",
                "text": "BB Top Bounce bietet einen interessanten Ansatz: Es definiert die Handelsidee mit drei einfachen Bedingungen.",
                "updated": 1639147933267
            },
            {
                "language": "TR",
                "text": "BB Top Bounce ilginç bir yaklaşıma sahiptir: ticaret fikrini üç basit koşulla tanımlar.",
                "updated": 1640780125207
            },
            {
                "language": "RU",
                "text": "BB Top Bounce отличается интересным подходом: он определяет торговую идею с помощью трех простых условий.",
                "updated": 1640885602935
            },
            {
                "language": "NL",
                "text": "BB Top Bounce heeft een interessante benadering: het definieert het handelsidee met drie eenvoudige voorwaarden.",
                "updated": 1670791644412
            },
            {
                "language": "ID",
                "text": "BB Top Bounce menampilkan pendekatan yang menarik: dia mendefinisikan ide trading dengan tiga conditions sederhana.",
                "updated": 1674625346345
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You are looking at the Trigger On Event of the first strategy. Notice the first three conditions defined...",
            "translations": [
                {
                    "language": "ES",
                    "text": "Estás mirando el Trigger On Event de la primera estrategia. Observa las tres primeras condiciones definidas...",
                    "updated": 1629591638723
                },
                {
                    "language": "DE",
                    "text": "Sie sehen hier das Trigger On Event der ersten Strategie. Beachten Sie die ersten drei definierten Bedingungen...",
                    "updated": 1639147944190
                },
                {
                    "language": "TR",
                    "text": "İlk stratejinin Tetikleyici Olayına ( Trigger On Event ) bakıyorsunuz. Tanımlanan ilk üç koşula dikkat edin...",
                    "updated": 1640780179138
                },
                {
                    "language": "RU",
                    "text": "Вы смотрите на событие Trigger On Event первой стратегии. Обратите внимание на первые три определенных условия...",
                    "updated": 1640885655595
                },
                {
                    "language": "NL",
                    "text": "U kijkt naar het Trigger On Event van de eerste strategie. Let op de eerste drie gedefinieerde voorwaarden...",
                    "updated": 1670791667613
                },
                {
                    "language": "ID",
                    "text": "Kamu sedang melihat Trigger On Event dari strategi pertama. Perhatikan tiga conditions pertama yang ditentukan...",
                    "updated": 1674625352962
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Now go and look at the trigger on event of any of the other strategies... What do you see?",
            "translations": [
                {
                    "language": "ES",
                    "text": "Ahora ve y mira el desencadenante de cualquiera de las otras estrategias ... ¿Qué ves?",
                    "updated": 1629591679346
                },
                {
                    "language": "DE",
                    "text": "Schauen Sie sich nun das Trigger On Event einer der anderen Strategien an... Was sehen Sie?",
                    "updated": 1639147953176
                },
                {
                    "language": "TR",
                    "text": "Şimdi git ve diğer stratejilerden herhangi birinin tetikleyicisine bak... Ne görüyorsun?",
                    "updated": 1640780228060
                },
                {
                    "language": "RU",
                    "text": "Теперь посмотрите на событие срабатывания любой из других стратегий... Что вы видите?",
                    "updated": 1640885671294
                },
                {
                    "language": "NL",
                    "text": "<b>Ga nu eens kijken naar het trigger on event van één van de andere strategieën... Wat zie je?</b>",
                    "updated": 1670791717385
                },
                {
                    "language": "ID",
                    "text": "Sekarang pergi dan lihat  trigger on event dari strategi lain... Apa yang kamu lihat?",
                    "updated": 1674625361724
                }
            ]
        },
        {
            "style": "Text",
            "text": "Exactly! All strategies feature the same first three conditions on the trigger on event. This shows that all strategies are based on the same trading idea. Now... how are they different?",
            "updated": 1610466052450,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Exactamente! Todas las estrategias presentan las mismas tres primeras condiciones en el desencadenante del evento. Esto muestra que todas las estrategias se basan en la misma idea de trading. Ahora... ¿en qué se diferencian?",
                    "updated": 1629591763135
                },
                {
                    "language": "DE",
                    "text": "Ganz genau! Alle Strategien weisen die gleichen ersten drei Bedingungen für das Trigger On Event auf. Das zeigt, dass alle Strategien auf der gleichen Handelsidee basieren. Wie unterscheiden sie sich nun?",
                    "updated": 1639147966445
                },
                {
                    "language": "TR",
                    "text": "Tam olarak! Tüm stratejiler, tetikleyici etkinliğinde aynı ilk üç koşulu içerir. Bu, tüm stratejilerin aynı ticaret fikrine dayandığını göstermektedir.Şimdi... Ne farkları var?",
                    "updated": 1640780354403
                },
                {
                    "language": "RU",
                    "text": "Именно так! Все стратегии имеют одни и те же первые три условия в событии срабатывания (Trigger On Event). Это показывает, что все стратегии основаны на одной и той же торговой идее. Теперь... чем же они отличаются?",
                    "updated": 1640885728698
                },
                {
                    "language": "NL",
                    "text": "Precies! Alle strategieën hebben dezelfde eerste drie voorwaarden voor de trigger bij een gebeurtenis. Dit laat zien dat alle strategieën gebaseerd zijn op hetzelfde handelsidee. Nu... hoe verschillen ze?",
                    "updated": 1670791742221
                },
                {
                    "language": "ID",
                    "text": "Tepat! Semua strategi menampilkan tiga kondisi pertama yang sama pada trigger on event. Ini menunjukkan bahwa semua strategi didasarkan pada ide trading yang sama. Sekarang... apa bedanya?",
                    "updated": 1674625368930
                }
            ]
        }
    ]
}