{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": 7,
    "type": "Tutorial Step - A Particular Case...",
    "definition": {
        "icon": {
            "name": "Trading\\trading-strategy",
            "project": "Foundations"
        },
        "text": "Both strategies are virtually the same in that they share the same base rules for triggering... with minor differences...",
        "translations": [
            {
                "language": "ES",
                "text": "Ambas estrategias son prácticamente iguales en el sentido de que comparten las mismas reglas básicas para la activación... ",
                "updated": 1629590239242
            },
            {
                "language": "DE",
                "text": "Beide Strategien sind praktisch identisch, da sie die gleichen Grundregeln für die Auslösung haben... mit kleinen Unterschieden...",
                "updated": 1639147801415
            },
            {
                "language": "TR",
                "text": "Özet: Her iki strateji de neredeyse aynıdır, çünkü tetikleme için aynı temel kuralları paylaşırlar... küçük farklılıklarla...",
                "updated": 1640698837719
            },
            {
                "language": "RU",
                "text": "Обе стратегии практически одинаковы, поскольку имеют одни и те же базовые правила срабатывания... с небольшими различиями...",
                "updated": 1640885230836
            },
            {
                "language": "NL",
                "text": "Beide strategieën zijn vrijwel hetzelfde in die zin dat ze dezelfde basisregels voor triggering delen... met kleine verschillen...",
                "updated": 1670791398099
            },
            {
                "language": "ID",
                "text": "Kedua strategi ini hampir sama karena memiliki aturan dasar yang sama untuk trigger... dengan sedikit perbedaan...",
                "updated": 1674624878045
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Beyond the seven conditions in common, the Steep strategy has one additional Condition while the Xtreme strategy has three. We won't analyze those differences one by one, although you may if you wish! Let's instead reveal the underlying concept behind the differences:",
            "translations": [
                {
                    "language": "ES",
                    "text": "Más allá de las siete condiciones en común, la <i>Steep</i> Strategy tiene una Condition adicional mientras que la estrategia <i>Xtreme</i> tiene tres. No analizaremos esas diferencias una a una, ¡aunque puedes hacerlo si lo deseas! En su lugar, veamos el concepto subyacente detrás de las diferencias:",
                    "updated": 1675619220513
                },
                {
                    "language": "DE",
                    "text": "Neben den sieben gemeinsamen Bedingungen hat die Steep-Strategie eine zusätzliche Bedingung, während die Xtreme-Strategie drei hat. Wir werden diese Unterschiede nicht einzeln analysieren, obwohl Sie das tun können, wenn Sie möchten! Stattdessen wollen wir das Konzept hinter den Unterschieden aufzeigen:",
                    "updated": 1639147816540
                },
                {
                    "language": "TR",
                    "text": "Yedi ortak koşulun ötesinde, Steep stratejisinde bir ek Koşul ( Condition )bulunurken Xtreme stratejisinde üç tane bulunur. Bu farklılıkları tek tek incelemeyeceğiz, isterseniz yapabilirsiniz! Bunun yerine, farklılıkların altında yatan kavramı ortaya çıkaralım:",
                    "updated": 1640698962240
                },
                {
                    "language": "RU",
                    "text": "Помимо семи общих условий, стратегия Steep имеет одно дополнительное условие, в то время как стратегия Xtreme - три. Мы не будем анализировать эти различия по одному, хотя вы можете это сделать, если захотите! Вместо этого давайте раскроем концепцию, лежащую в основе этих различий:",
                    "updated": 1640885262372
                },
                {
                    "language": "NL",
                    "text": "Naast de zeven gemeenschappelijke voorwaarden, heeft de Steep-strategie één extra voorwaarde, terwijl de Xtreme-strategie er drie heeft. We zullen die verschillen niet één voor één analyseren, hoewel u dat wel kunt doen als u dat wilt! Laten we in plaats daarvan het onderliggende concept achter de verschillen onthullen:",
                    "updated": 1670791418437
                },
                {
                    "language": "ID",
                    "text": "Di luar tujuh kondisi yang sama, strategi Steep memiliki satu condition tambahan sedangkan strategi Xtreme memiliki tiga. Kita tidak akan menganalisis perbedaan itu satu per satu, meskipun kamu boleh melakukannya jika kamu mau! Sebagai gantinya, mari kita ungkapkan konsep dasar di balik perbedaan tersebut:",
                    "updated": 1674624884259
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Within the market Situation defined by the first seven conditions, the Steep strategy deals with a certain type of price action&mdash;price falling on a steep curve&mdash;while the Xtreme strategy deals with price falling on an extremely steep curve!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Dentro de la situación de mercado definida por las primeras siete condiciones, la estrategia <i>Steep</i> se ocupa de un cierto tipo de acción del precio, el precio que cae en una curva pronunciada, mientras que la estrategia <i>Xtreme</i> se ocupa de la caída del precio en una curva extremadamente pronunciada.",
                    "updated": 1675619258149
                },
                {
                    "language": "DE",
                    "text": "Innerhalb der Marktsituation, die durch die ersten sieben Bedingungen definiert ist, befasst sich die Steep-Strategie mit einer bestimmten Art von Preisaktion - einem Preis, der auf einer steilen Kurve fällt -, während die Xtreme-Strategie sich mit einem Preis befasst, der auf einer extrem steilen Kurve fällt!",
                    "updated": 1639147826635
                },
                {
                    "language": "TR",
                    "text": "İlk yedi koşul tarafından tanımlanan piyasa Durumu ( Situation ) içinde, Steep stratejisi belirli bir fiyat hareketi türüyle (fiyatın dik bir eğri üzerine düşmesi) ile ilgilenir, Xtreme stratejisi ise fiyatın aşırı derecede dik bir eğri üzerine düşmesiyle ilgilenir!",
                    "updated": 1640699056295
                },
                {
                    "language": "RU",
                    "text": "В рамках рыночной ситуации, определенной первыми семью условиями, стратегия Steep имеет дело с определенным типом ценового движения - цена падает по крутой кривой - в то время как стратегия Xtreme имеет дело с ценой, падающей по чрезвычайно крутой кривой!",
                    "updated": 1640885532337
                },
                {
                    "language": "NL",
                    "text": "<b>Binnen de marktsituatie die wordt bepaald door de eerste zeven voorwaarden, houdt de Steep-strategie zich bezig met een bepaald type prijsactie - prijsdaling op een steile curve - terwijl de Xtreme-strategie zich bezighoudt met prijsdaling op een extreem steile curve!</b>",
                    "updated": 1670791460725
                },
                {
                    "language": "ID",
                    "text": "Dalam Situasi market yang ditentukan oleh tujuh kondisi pertama, strategi Steep berurusan dengan jenis price action tertentu—harga jatuh pada kurva yang curam—sementara strategi Xtreme berurusan dengan harga yang jatuh pada kurva yang sangat curam!",
                    "updated": 1674624890041
                }
            ]
        }
    ]
}