{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": 8,
    "type": "Tutorial Step - Another Example?",
    "definition": {
        "icon": {
            "name": "Trading\\trading-system",
            "project": "Foundations"
        },
        "text": "Let's take a look at another example! This is BB Top Bounce, a Trading System based on the bounce off the upper Bollinger Band trading idea.",
        "translations": [
            {
                "language": "ES",
                "text": "¡Echemos un vistazo a otro ejemplo! Este es BB Top Bounce, un Trading System basado en el rebote de la parte superior de la idea de trading Bollinger Band.",
                "updated": 1629590642973
            },
            {
                "language": "DE",
                "text": "Werfen wir einen Blick auf ein weiteres Beispiel! Dies ist BB Top Bounce, ein Trading System, das auf der Idee des Abprallens am oberen Bollinger Band basiert.",
                "updated": 1639147889445
            },
            {
                "language": "TR",
                "text": "Özet: Başka bir örneğe göz atalım! Bu BB Top Bounce, üst Bollinger Band ticaret fikrine dayalı bir Ticaret Sistemi ( Trading System ).",
                "updated": 1640700528996
            },
            {
                "language": "RU",
                "text": "Давайте рассмотрим еще один пример! Это BB Top Bounce, торговая система, основанная на торговой идее отскока от верхней полосы Боллинджера.",
                "updated": 1640885557009
            },
            {
                "language": "NL",
                "text": "Laten we een ander voorbeeld bekijken! Dit is BB Top Bounce, een handelssysteem gebaseerd op het idee van het botsen met de bovenste Bollinger Band.",
                "updated": 1670791546552
            },
            {
                "language": "ID",
                "text": "Mari kita lihat contoh lainnya! Ini adalah BB Top Bounce, Trading System berdasarkan pantulan ide trading diatas Bollinger Band.",
                "updated": 1674625087939
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Expand the trading system node... Let's see what it may teach us!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Expande el nodo del Trading System ... ¡Veamos qué nos puede enseñar!",
                    "updated": 1629590784815
                },
                {
                    "language": "DE",
                    "text": "Erweitern Sie den Knoten des Trading Systems... Mal sehen, was es uns lehren kann!",
                    "updated": 1639147897648
                },
                {
                    "language": "TR",
                    "text": "Ticaret sistemi düğümünü genişletin... Bakalım bize neler öğretecek!",
                    "updated": 1640700549413
                },
                {
                    "language": "RU",
                    "text": "Разверните узел торговой системы... Давайте посмотрим, чему она может нас научить!",
                    "updated": 1640885573510
                },
                {
                    "language": "NL",
                    "text": "Breid het knooppunt van het trading system uit... Laten we eens kijken wat het ons kan leren!",
                    "updated": 1670791571573
                },
                {
                    "language": "ID",
                    "text": "Expand node trading system... Mari kita lihat apa yang mungkin diajarkannya kepada kita!",
                    "updated": 1674625094209
                }
            ]
        },
        {
            "style": "Note",
            "text": "I told you! You may have as many strategies as you wish under the same trading system! Well... there you are!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Ya te lo he dicho. ¡Puedes tener tantas estrategias como desees bajo el mismo sistema de trading! Bueno... ¡ya está!",
                    "updated": 1675619312540
                },
                {
                    "language": "DE",
                    "text": "Ich habe es Ihnen gesagt! Sie können so viele Strategien unter demselben Trading System haben, wie Sie wollen! Nun... da haben Sie es!",
                    "updated": 1639147910142
                },
                {
                    "language": "TR",
                    "text": "Not: Söylemiştim! Aynı ticaret sistemi altında dilediğiniz kadar stratejiye sahip olabilirsiniz! Peki... işte buradasın!",
                    "updated": 1640700579767
                },
                {
                    "language": "RU",
                    "text": "Я же говорил! Вы можете иметь столько стратегий, сколько пожелаете, в рамках одной торговой системы! Ну... вот и все!",
                    "updated": 1640885589783
                },
                {
                    "language": "NL",
                    "text": "Ik zei het je! U kunt zoveel strategieën hebben als u wilt onder hetzelfde handelssysteem! Nou... daar heb je het!",
                    "updated": 1670791599004
                },
                {
                    "language": "ID",
                    "text": "Aku sudah bilang! Kamu mungkin memiliki strategi sebanyak yang kamu inginkan di bawah trading system yang sama! Yah... ini dia!",
                    "updated": 1674625100159
                }
            ],
            "updated": 1640641009638
        }
    ]
}