{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": 8,
    "type": "Tutorial Step - Another Example?",
    "definition": {
        "icon": {
            "name": "Trading\\trading-system",
            "project": "Foundations"
        },
        "text": "Let's take a look at another example! This is BB Top Bounce, a Trading System based on the bounce off the upper Bollinger Band trading idea.",
        "translations": [
            {
                "language": "ES",
                "text": "¡Echemos un vistazo a otro ejemplo! Este es BB Top Bounce, un Trading System basado en el rebote de la parte superior de la idea de trading Bollinger Band.",
                "updated": 1629590642973
            },
            {
                "language": "DE",
                "text": "Werfen wir einen Blick auf ein weiteres Beispiel! Dies ist BB Top Bounce, ein Trading System, das auf der Idee des Abprallens am oberen Bollinger Band basiert.",
                "updated": 1639147889445
            },
            {
                "language": "TR",
                "text": "Özet: Başka bir örneğe göz atalım! Bu BB Top Bounce, üst Bollinger Band ticaret fikrine dayalı bir Ticaret Sistemi ( Trading System ).",
                "updated": 1640700528996
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Expand the trading system node... Let's see what it may teach us!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Expande el nodo del Trading System ... ¡Veamos qué nos puede enseñar!",
                    "updated": 1629590784815
                },
                {
                    "language": "DE",
                    "text": "Erweitern Sie den Knoten des Trading Systems... Mal sehen, was es uns lehren kann!",
                    "updated": 1639147897648
                },
                {
                    "language": "TR",
                    "text": "Ticaret sistemi düğümünü genişletin... Bakalım bize neler öğretecek!",
                    "updated": 1640700549413
                }
            ]
        },
        {
            "style": "Note",
            "text": "I told you! You may have as many strategies as you wish under the same trading system! Well... there you are!",
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Te dije! ¡Puedes tener tantas estrategias como desees bajo el mismo Trading System! Bueno ... ¡ahí estás!",
                    "updated": 1629590821468
                },
                {
                    "language": "DE",
                    "text": "Ich habe es Ihnen gesagt! Sie können so viele Strategien unter demselben Trading System haben, wie Sie wollen! Nun... da haben Sie es!",
                    "updated": 1639147910142
                },
                {
                    "language": "TR",
                    "text": "Not: Söylemiştim! Aynı ticaret sistemi altında dilediğiniz kadar stratejiye sahip olabilirsiniz! Peki... işte buradasın!",
                    "updated": 1640700579767
                }
            ],
            "updated": 1640641009638
        }
    ]
}