{
    "tutorial": "Intro to Trading Systems",
    "pageNumber": 3,
    "type": "Tutorial Topic - Frame It Flexibly!",
    "definition": {
        "icon": {
            "name": "Trading\\trading-system",
            "project": "Foundations"
        },
        "text": "A Trading System governs trading strategies, and provides a flexible&mdash;but structured&mdash; framework to build them.",
        "translations": [
            {
                "language": "ES",
                "text": "Un Trading System rige las estrategias de trading y proporciona un marco flexible, pero estructurado, para construirlas.",
                "updated": 1675618756063
            },
            {
                "language": "DE",
                "text": "Ein Trading System regelt die Handelsstrategien und bietet einen flexiblen, aber strukturierten Rahmen, um sie aufzubauen.",
                "updated": 1639147285749
            },
            {
                "language": "TR",
                "text": "Özet: Bir Ticaret Sistemi ( Trading System ) , ticaret stratejilerini yönetir ve bunları oluşturmak için esnek, ancak yapılandırılmış bir çerçeve sağlar.",
                "updated": 1640692400531
            },
            {
                "language": "RU",
                "text": "Торговая система регулирует торговые стратегии и обеспечивает гибкую, но структурированную основу для их построения.",
                "updated": 1640878761889
            },
            {
                "language": "NL",
                "text": "Een Trading System regelt handelsstrategieën en biedt een flexibel maar gestructureerd raamwerk om ze op te bouwen.",
                "updated": 1670790929826
            },
            {
                "language": "ID",
                "text": "Trading System mengatur strategi trading, dan memberikan fleksibilitas—tapi terstruktur— framework untuk membuatnya.",
                "updated": 1674498941084
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Please, read this page to get up to speed with how trading systems work!",
            "updated": 1610367185240,
            "translations": [
                {
                    "language": "ES",
                    "text": "Por favor, lee esta página para ponerte al día con el funcionamiento de los sistemas de trading.",
                    "updated": 1675618773254
                },
                {
                    "language": "DE",
                    "text": "Bitte lesen Sie diese Seite, um zu erfahren, wie Trading Systeme funktionieren!",
                    "updated": 1639147295415
                },
                {
                    "language": "TR",
                    "text": "Lütfen, ticaret sistemlerinin nasıl çalıştığını hızlıca öğrenmen için bu sayfayı okuyun!",
                    "updated": 1640692866775
                },
                {
                    "language": "RU",
                    "text": "Пожалуйста, прочитайте страницу о торговых системах, чтобы узнать, как они работают!",
                    "updated": 1640878774285
                },
                {
                    "language": "NL",
                    "text": "Lees deze pagina om op de hoogte te blijven van hoe trading systems werken!",
                    "updated": 1670790953273
                },
                {
                    "language": "ID",
                    "text": "Tolong, baca halaman ini untuk mengetahui cara kerja trading system!",
                    "updated": 1674498947240
                }
            ]
        },
        {
            "style": "Success",
            "text": "There is no substitute for knowledge, so you will need to do some reading before I get your hands dirty with good ol' trading logic!",
            "translations": [
                {
                    "language": "ES",
                    "text": "¡No hay sustituto para el conocimiento, por lo que tendrás que leer un poco antes de que me ensucie las manos con la buena lógica del trading!",
                    "updated": 1629587618899
                },
                {
                    "language": "DE",
                    "text": "Es gibt keinen Ersatz für Wissen, also müssen Sie etwas lesen, bevor ich Ihre Hände mit der guten alten Handelslogik schmutzig mache!",
                    "updated": 1639147361194
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bilginin yerini tutamaz, bu yüzden mantığınızı iyi bir akıl yürütme ile kirletmeden önce biraz okuma yapmanız gerekecek!",
                    "updated": 1640693379485
                },
                {
                    "language": "RU",
                    "text": "Знания ничем не заменишь, поэтому вам придется немного почитать, прежде чем я запачкаю ваши руки старой доброй торговой логикой!",
                    "updated": 1640878792659
                },
                {
                    "language": "NL",
                    "text": "Er is geen vervanging voor kennis, dus je zult wat moeten lezen voordat ik je handen vuil maak met goede oude handelslogica!",
                    "updated": 1670790977608
                },
                {
                    "language": "ID",
                    "text": "Tidak ada pengganti untuk pengetahuan, jadi kamu perlu membaca beberapa sebelum aku membuatmu bekerja keras dengan logika trading yang baik!",
                    "updated": 1674498954082
                }
            ]
        },
        {
            "style": "Warning",
            "text": "Skipping the reading may result in permanent neurological impairment. Your call!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Saltarse la lectura puede resultar en un deterioro neurológico permanente. ¡Tú decides!",
                    "updated": 1675618803688
                },
                {
                    "language": "DE",
                    "text": "Das Überspringen der Lektüre kann zu dauerhaften neurologischen Beeinträchtigungen führen. Ihre Entscheidung!",
                    "updated": 1639147370087
                },
                {
                    "language": "TR",
                    "text": "Uyarı: Okumanın atlanması kalıcı nörolojik bozuklukla sonuçlanabilir. Yinede senin kararın!",
                    "updated": 1640693515242
                },
                {
                    "language": "RU",
                    "text": "Пропуск чтения может привести к необратимым неврологическим нарушениям. Ваш выбор!",
                    "updated": 1640878837334
                },
                {
                    "language": "NL",
                    "text": "Het overslaan van het lezen kan leiden tot permanente neurologische stoornissen. Jouw beslissing!",
                    "updated": 1670791010735
                },
                {
                    "language": "ID",
                    "text": "Melewatkan bacaan ini dapat mengakibatkan gangguan otak dan sistem saraf permanen. Pilihanmu!",
                    "updated": 1674498962752
                }
            ]
        }
    ]
}