{
    "type": "Outgoing Signals",
    "definition": {
        "text": "The Outgoing Signals node defines the location within a Trading System from which data can be gathered and composed into a Trading Signal. ",
        "updated": 1644029844037,
        "translations": [
            {
                "language": "RU",
                "text": "Узел Outgoing Signals определяет место в торговой системе, откуда данные могут быть собраны и скомпонованы в торговый сигнал.",
                "updated": 1645253241155
            },
            {
                "language": "TR",
                "text": "Giden Sinyaller düğümü, bir Alım Satım Sistemi içinde verilerin toplanıp bir Alım Satım Sinyali haline getirilebileceği konumu tanımlar.",
                "updated": 1654397874818
            },
            {
                "language": "DE",
                "text": "Vom Knoten Ausgehende Signale definiert den Ort innerhalb eines Handelssystems (Trading System), von dem Daten gesammelt und zu einem Handelssignal (Trading Signal)zusammengestellt werden können. ",
                "updated": 1705011837390
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1643406159352
        },
        {
            "style": "Text",
            "text": "What this means is that an Outgoing Signal node captures and then tells the system where to send signal information. This is achieved by adding a child Outgoing Signal Reference node.",
            "updated": 1643406587670,
            "translations": [
                {
                    "language": "RU",
                    "text": "Это означает, что узел Outgoing Signal захватывает и затем указывает системе, куда посылать сигнальную информацию. Это достигается путем добавления дочернего узла Outgoing Signal Reference.",
                    "updated": 1645253250788
                },
                {
                    "language": "TR",
                    "text": "Bunun anlamı, bir Giden Sinyal düğümünün sinyal bilgilerini yakalaması ve ardından sisteme nereye göndereceğini söylemesidir. Bu, bir alt Giden Sinyal Referansı düğümü eklenerek gerçekleştirilir.",
                    "updated": 1654397880903,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Das bedeutet, dass ein Knoten \"Ausgehendes Signal\" die Signalinformationen erfasst und dem System mitteilt, wohin es sie senden soll. Dies wird erreicht, indem ein untergeordneter Knoten Outgoing Signal Reference hinzugefügt wird.",
                    "updated": 1705010507351
                }
            ]
        },
        {
            "style": "Title",
            "text": "Types of Signals",
            "updated": 1643406148598,
            "translations": [
                {
                    "language": "RU",
                    "text": "Типы сигналов",
                    "updated": 1645253258331
                },
                {
                    "language": "TR",
                    "text": "Sinyal Türleri",
                    "updated": 1654397886682,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Arten von Signalen",
                    "updated": 1705010516725
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are three types of signals that can be sent:",
            "updated": 1644029880507,
            "translations": [
                {
                    "language": "RU",
                    "text": "Существует три типа сигналов, которые могут быть отправлены:",
                    "updated": 1645253266416
                },
                {
                    "language": "TR",
                    "text": "Gönderilebilecek üç tür sinyal vardır:",
                    "updated": 1654397895547,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Es gibt drei Arten von Signalen, die gesendet werden können:",
                    "updated": 1705010524598
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Subtitle",
            "text": "Candle Sync Signals",
            "updated": 1643425661140,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сигналы синхронизации свечей",
                    "updated": 1645253284268
                },
                {
                    "language": "TR",
                    "text": "Mum Senkronizasyon Sinyalleri",
                    "updated": 1654397901169,
                    "style": "Subtitle"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Keeping the bots of provider and recipient on the same candle is vital for trading signals to actually be useful. Therefore, Candle Sync signals are the foundational use of the Outgoing Signal node. It communicates the candle on which the current signal belongs. This allows the recipient’s bots to identify the exact same candle and stay in sync with the provider’s bots.",
            "updated": 1643425213425,
            "translations": [
                {
                    "language": "RU",
                    "text": "Удержание ботов поставщика и получателя на одной и той же свече является жизненно важным для того, чтобы торговые сигналы были действительно полезными. Поэтому сигналы Candle Sync являются основой использования узла Outgoing Signal. Он передает свечу, на которой находится текущий сигнал. Это позволяет ботам получателя идентифицировать точно такую же свечу и оставаться в синхронизации с ботами поставщика.",
                    "updated": 1645253304937
                },
                {
                    "language": "TR",
                    "text": "Sağlayıcı ve alıcı botlarını aynı mum üzerinde tutmak, alım satım sinyallerinin gerçekten yararlı olması için hayati önem taşır. Bu nedenle, Mum Senkronizasyonu sinyalleri Giden Sinyal düğümünün temel kullanımıdır. Mevcut sinyalin ait olduğu mumu iletir. Bu, alıcının botlarının tam olarak aynı mumu tanımlamasına ve sağlayıcının botlarıyla senkronize kalmasına olanak tanır.",
                    "updated": 1654397906974,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Damit Handelssignale tatsächlich nützlich sind, müssen die Bots des Anbieters und des Empfängers auf derselben Kerze stehen. Daher sind Candle -Sync-Signale die grundlegende Verwendung des Outgoing Signal-Knotens. Er teilt die Kerze mit, zu der das aktuelle Signal gehört. Dadurch können die Bots des Empfängers genau dieselbe Kerze identifizieren und mit den Bots des Anbieters synchron bleiben.",
                    "updated": 1705010546831
                }
            ]
        },
        {
            "style": "Text",
            "text": "Candle sync signals are established by attaching an Outgoing Signal node to a Trading System node. Then adding a child Outgoing Signal Reference node. Then establishing a reference from the Outgoing Signal Reference node to the Trading System Signal node held under the Social Trading Bot of the provider.",
            "updated": 1643425432904,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сигналы синхронизации свечей устанавливаются путем присоединения узла Outgoing Signal к узлу Trading System. Затем добавляется дочерний узел Outgoing Signal Reference. Затем устанавливается ссылка с узла Outgoing Signal Reference на узел Trading System Signal, находящийся под Social Trading Bot провайдера.",
                    "updated": 1645253320305
                },
                {
                    "language": "TR",
                    "text": "Mum senkronizasyon sinyalleri, bir Giden Sinyal düğümünün bir Ticaret Sistemi düğümüne bağlanmasıyla oluşturulur. Ardından bir alt Giden Sinyal Referans düğümü eklenir. Ardından Giden Sinyal Referans düğümünden sağlayıcının Sosyal Ticaret Botu altında tutulan Ticaret Sistemi Sinyal düğümüne bir referans oluşturulur.",
                    "updated": 1654397912793,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Kerzensynchronisationssignale (Candle sync signals) werden erstellt, indem ein Knoten Ausgehendes Signal an einen Knoten Handelssystem (Trading System) angehängt wird. Dann wird ein untergeordneter Knoten Ausgehendes Signal Referenz (Outgoing Signal Reference) hinzugefügt. Anschließend wird ein Verweis vom Knoten Ausgehendes Signal (Outgoing Signal Reference) auf den Knoten Handelssystemsignal (Trading System Signal) erstellt, der unter dem Social Trading Bot des Anbieters geführt wird.",
                    "updated": 1705010711884
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Event Signals",
            "updated": 1643425667662,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сигналы событий",
                    "updated": 1645253326187
                },
                {
                    "language": "TR",
                    "text": "Olay Sinyalleri",
                    "updated": 1654397918316,
                    "style": "Subtitle"
                },
                {
                    "language": "DE",
                    "text": "Event signals",
                    "updated": 1705010844926
                }
            ]
        },
        {
            "style": "Text",
            "text": "Event signals allow the signal provider to send information concerning trading system events. Examples of such events are the Trigger On Event, Trigger Off Event, Take Position Event, etc.",
            "updated": 1643426918248,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сигналы событий позволяют поставщику сигналов отправлять информацию о событиях торговой системы. Примерами таких событий являются событие включения триггера, событие отключения триггера, событие взятия позиции и т.д.",
                    "updated": 1645253334141
                },
                {
                    "language": "TR",
                    "text": "Olay sinyalleri, sinyal sağlayıcının ticaret sistemi olaylarıyla ilgili bilgi göndermesine olanak tanır. Bu tür olaylara örnek olarak Tetik Açma Olayı, Tetik Kapatma Olayı, Pozisyon Alma Olayı vb. verilebilir.",
                    "updated": 1654397927409,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Ereignissignale (Event signals) ermöglichen es dem Signalanbieter, Informationen über Ereignisse im Handelssystem zu senden. Beispiele für solche Ereignisse sind das Trigger On Event, das Trigger Off Event, das Take Position Event, etc.",
                    "updated": 1705010851831
                }
            ]
        },
        {
            "style": "Text",
            "text": "Creating event signals is very straightforward. First find the event which you would like to include in your signal. Then add an Outgoing Signal node to the Event node. After that attach a child Outgoing Signal Reference node. Finally establish a reference from the Outgoing Signal Reference node to the appropriate Trading Strategy Signals node.",
            "updated": 1643426717064,
            "translations": [
                {
                    "language": "RU",
                    "text": "Создание сигналов событий очень простое. Сначала найдите событие, которое вы хотите включить в сигнал. Затем добавьте узел Outgoing Signal к узлу Event. После этого добавьте дочерний узел Outgoing Signal Reference. И наконец, установите ссылку от узла Outgoing Signal Reference на соответствующий узел Trading Strategy Signals.",
                    "updated": 1645253344183
                },
                {
                    "language": "TR",
                    "text": "Olay sinyalleri oluşturmak çok basittir. Önce sinyalinize dahil etmek istediğiniz olayı bulun. Ardından Olay düğümüne bir Giden Sinyal düğümü ekleyin. Bundan sonra bir alt Giden Sinyal Referans düğümü ekleyin. Son olarak, Giden Sinyal Referansı düğümünden uygun Ticaret Stratejisi Sinyalleri düğümüne bir referans oluşturun.",
                    "updated": 1654397933648,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Formula Signals",
            "updated": 1643426795012,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сигналы формул",
                    "updated": 1645253355738
                },
                {
                    "language": "TR",
                    "text": "Formül Sinyalleri",
                    "updated": 1654397939134,
                    "style": "Subtitle"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Formula signals allow the signal provider to send information coming out of trading system formulas. Examples of such formulas are, Target Rate, Order Rate, Target Size In Base Asset, etc.",
            "updated": 1643427806063,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сигналы по формулам позволяют поставщику сигналов передавать информацию, исходящую из формул торговой системы. Примерами таких формул являются: Target Rate, Order Rate, Target Size In Base Asset и т.д.",
                    "updated": 1645253375863
                },
                {
                    "language": "TR",
                    "text": "Formül sinyalleri, sinyal sağlayıcının ticaret sistemi formüllerinden çıkan bilgileri göndermesine olanak tanır. Bu tür formüllere örnek olarak Hedef Oran, Emir Oranı, Temel Varlıktaki Hedef Büyüklük vb. verilebilir.",
                    "updated": 1654397944963,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Formelsignale (Formula signals) ermöglichen es dem Signalanbieter, Informationen zu senden, die aus Formeln des Handelssystems stammen. Beispiele für solche Formeln sind: Zielkurs, Auftragskurs, Zielgröße im Basiswert (Target Rate, Order Rate, Target Size In Base Asset) usw. ",
                    "updated": 1705011119088
                }
            ]
        },
        {
            "style": "Text",
            "text": "Creating a formula signal is the same as establishing an event signal.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Создание сигнала по формуле - это то же самое, что и создание сигнала события.",
                    "updated": 1645253398469
                },
                {
                    "language": "TR",
                    "text": "Bir formül sinyali oluşturmak, bir olay sinyali oluşturmakla aynıdır.",
                    "updated": 1654397950421,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die Erstellung eines Formelsignals ist dasselbe wie die Erstellung eines Ereignissignals.",
                    "updated": 1705011127648
                }
            ]
        },
        {
            "style": "Include",
            "text": "Trading-Signals->Node->Signal Context Formula->Content",
            "translations": [
                {
                    "language": "TR",
                    "text": "İşlem-Sinyalleri->Düğüm->Sinyal Bağlamı Formülü->İçerik",
                    "updated": 1654397956085,
                    "style": "Include"
                }
            ]
        },
        {
            "style": "Success",
            "text": "You may place as many Outgoing Signals nodes at any particular spot in a Trading System. This allows the user to send the same signal to any number of places.",
            "updated": 1647052659035,
            "translations": [
                {
                    "language": "TR",
                    "text": "Bir Ticaret Sistemindeki herhangi bir noktaya istediğiniz kadar Giden Sinyal düğümü yerleştirebilirsiniz. Bu, kullanıcının aynı sinyali istediği sayıda yere göndermesine olanak tanır.",
                    "updated": 1654397962031,
                    "style": "Success"
                }
            ]
        }
    ]
}