{
    "type": "Trigger Stage",
    "definition": {
        "text": "The trigger stage deals with monitoring the market in search of trading opportunities with the corresponding strategy.",
        "translations": [
            {
                "language": "ES",
                "text": "El  trigger stage se ocupa del seguimiento del mercado en busca de oportunidades de trading con la estrategia correspondiente.",
                "updated": 1624459676185
            },
            {
                "language": "RU",
                "text": "Trigger Stage занимается мониторингом рынка в поисках торговых возможностей с соответствующей стратегией.",
                "updated": 1639734184235
            },
            {
                "language": "TR",
                "text": "Tetik aşaması, ilgili strateji ile ticaret fırsatlarını araştırmak için piyasayı izlemekle ilgilenir.",
                "updated": 1642500142465
            },
            {
                "language": "DE",
                "text": "In der Triggerphase geht es um die Beobachtung des Marktes auf der Suche nach Handelsmöglichkeiten mit der entsprechenden Strategie.",
                "updated": 1641635238635
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "A trading system may have multiple strategies designed for the same market.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Торговая система может иметь несколько стратегий, разработанных для одного и того же рынка.",
                    "updated": 1639734210373
                },
                {
                    "language": "TR",
                    "text": "Bir ticaret sistemi, aynı pazar için tasarlanmış birden fazla stratejiye sahip olabilir.",
                    "updated": 1642500202182
                },
                {
                    "language": "DE",
                    "text": "Ein Handelssystem kann mehrere Strategien enthalten, die für denselben Markt entwickelt wurden.",
                    "updated": 1641635293521
                }
            ]
        },
        {
            "style": "Text",
            "text": "An important aspect of trading systems is that they are allocated a certain amount of capital (see the base asset parameter of the trading session). As a consequence, strategies within a trading system share a certain capital allocation.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Важным аспектом торговых систем является то, что им выделяется определенный объем капитала (см. параметр Session Base Asset торговой сессии). Как следствие, стратегии в рамках торговой системы разделяют определенное распределение капитала.",
                    "updated": 1639734394068
                },
                {
                    "language": "TR",
                    "text": "Alım satım sistemlerinin önemli bir yönü, kendilerine belirli bir miktarda sermaye tahsis edilmiş olmalarıdır (ticaret seansının temel varlık parametresine bakın). Sonuç olarak, bir ticaret sistemi içindeki stratejiler, belirli bir sermaye tahsisini paylaşır.",
                    "updated": 1642500186374
                },
                {
                    "language": "DE",
                    "text": "Ein wichtiger Aspekt von Handelssystemen ist, dass ihnen eine bestimmte Menge an Kapital zugewiesen wird (siehe den Parameter für den Basiswert der Handelssitzung). Infolgedessen teilen sich die Strategien innerhalb eines Handelssystems eine bestimmte Kapitalzuweisung.",
                    "updated": 1641635330768
                }
            ]
        },
        {
            "style": "Text",
            "text": "The logic behind the concept of the trigger stage assumes that different strategies within a trading system may be specialized for trading in different market situations. The trigger stage in each strategy is, therefore, the mechanism by which any particular strategy within the trading system may be selected to trade, given any particular market situation.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Логика, лежащая в основе концепции стадии запуска, предполагает, что различные стратегии в рамках торговой системы могут быть специализированы для торговли в различных рыночных ситуациях. Таким образом, стадия запуска в каждой стратегии является механизмом, с помощью которого любая конкретная стратегия в рамках торговой системы может быть выбрана для торговли, учитывая любую конкретную рыночную ситуацию.",
                    "updated": 1639734636959
                },
                {
                    "language": "TR",
                    "text": "Tetik aşaması kavramının arkasındaki mantık, bir ticaret sistemi içindeki farklı stratejilerin, farklı piyasa durumlarında ticaret için özelleşebileceğini varsayar. Bu nedenle, her stratejideki tetikleme aşaması, belirli bir piyasa durumu göz önüne alındığında, ticaret sistemi içindeki herhangi bir belirli stratejinin ticaret için seçilebileceği mekanizmadır.",
                    "updated": 1642500228916
                },
                {
                    "language": "DE",
                    "text": "Die Logik hinter dem Konzept der Auslösestufe geht davon aus, dass verschiedene Strategien innerhalb eines Handelssystems auf den Handel in unterschiedlichen Marktsituationen spezialisiert sein können. Die Auslösestufe in jeder Strategie ist daher der Mechanismus, durch den eine bestimmte Strategie innerhalb des Handelssystems für den Handel in einer bestimmten Marktsituation ausgewählt werden kann.",
                    "updated": 1641635356462
                }
            ]
        },
        {
            "style": "Text",
            "text": "The triggering-on of a strategy effectively blocks the selection of any other strategy in the trading system and reserves the whole capital allocation for the one strategy selected, until the strategy is triggered-off.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Включение стратегии эффективно блокирует выбор любой другой стратегии в торговой системе и резервирует все распределение капитала для одной выбранной стратегии, пока стратегия не будет отключена.",
                    "updated": 1639734689481
                },
                {
                    "language": "TR",
                    "text": "Bir stratejinin tetiklenmesi, ticaret sistemindeki diğer herhangi bir stratejinin seçimini etkili bir şekilde engeller ve strateji tetiklenene kadar seçilen bir strateji için tüm sermaye tahsisini rezerve eder.",
                    "updated": 1642500267920
                },
                {
                    "language": "DE",
                    "text": "Das Auslösen einer Strategie blockiert effektiv die Auswahl jeder anderen Strategie im Handelssystem und reserviert die gesamte Kapitalalzuweisung für die ausgewählte Strategie, bis die Strategie ausgelöst wird.",
                    "updated": 1641635408892
                }
            ]
        },
        {
            "style": "Text",
            "text": "Therefore, if certain strategies are meant to trade under the same market situations and open trades concurrently, then those strategies should be deployed in separate trading systems.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Поэтому, если определенные стратегии предназначены для торговли в одинаковых рыночных ситуациях и одновременного открытия сделок, то эти стратегии должны быть развернуты в отдельных торговых системах.",
                    "updated": 1639734728360
                },
                {
                    "language": "TR",
                    "text": "Bu nedenle, belirli stratejiler aynı piyasa koşulları altında alım satım yapmak ve aynı anda alım satım yapmak için tasarlanmışsa, bu stratejiler ayrı alım satım sistemlerinde konuşlandırılmalıdır.",
                    "updated": 1642500318933
                },
                {
                    "language": "DE",
                    "text": "Wenn also bestimmte Strategien in denselben Marktsituationen handeln und gleichzeitig Geschäfte eröffnen sollen, müssen diese Strategien in separaten Handelssystemen eingesetzt werden.",
                    "updated": 1641635488817
                }
            ]
        },
        {
            "style": "Text",
            "text": "Once a strategy is triggered, the strategy may decide&mdash;or not&mdash;to take a position. If a position is taken, then the rest of the stages eventually become active.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Как только стратегия срабатывает, она может принять или не принять решение о занятии позиции. Если позиция занята, то остальные этапы в конечном итоге становятся активными.",
                    "updated": 1639734845915
                },
                {
                    "language": "TR",
                    "text": "Bir strateji tetiklendiğinde, strateji bir pozisyon almaya karar verebilir veya vermeyebilir. Bir pozisyon alınırsa, geri kalan aşamalar sonunda aktif hale gelir.",
                    "updated": 1642500347909
                },
                {
                    "language": "DE",
                    "text": "Sobald eine Strategie ausgelöst wird, kann die Strategie entscheiden, ob sie eine Position einnimmt oder nicht. Wird eine Position eingenommen, werden die übrigen Phasen schließlich aktiv.",
                    "updated": 1641635506634
                }
            ]
        },
        {
            "style": "Text",
            "text": "However, the strategy may also be triggered off without taking a position. When a strategy is triggered off, the trading system goes back to monitoring the trigger-on definitions for all strategies, and capital is released to be used by whatever strategy is triggered-on next.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Однако стратегия может быть отключена и без занятия позиции. Когда стратегия отключается, торговая система возвращается к мониторингу определений включения для всех стратегий, и капитал высвобождается для использования той стратегией, которая включается следующей.",
                    "updated": 1639734881478
                },
                {
                    "language": "TR",
                    "text": "Ancak, strateji pozisyon almadan da tetiklenebilir. Bir strateji tetiklendiğinde, ticaret sistemi tüm stratejiler için tetikleme tanımlarını izlemeye geri döner ve bir sonraki tetiklenen strateji tarafından kullanılmak üzere sermaye serbest bırakılır.",
                    "updated": 1642500370042
                },
                {
                    "language": "DE",
                    "text": "Die Strategie kann jedoch auch ausgelöst werden, ohne eine Position einzugehen. Wenn eine Strategie ausgeschaltet wird, kehrt das Handelssystem zur Überwachung der Trigger-On-Definitionen für alle Strategien zurück, und das Kapital wird freigegeben, um von der Strategie verwendet zu werden, die als nächstes ausgelöst wird.",
                    "updated": 1641635523773
                }
            ]
        }
    ]
}