{
    "type": "API Map",
    "definition": {
        "text": "An API Map represents the mapping of an API so that is can be consumed by bots within Superalgos. API Maps are created by users and shared as Plugins so that any other community member can use them with their bots. ",
        "updated": 1621016177698
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The way to create an API Map is to read the API's documentation and for each command and their responses, generate the node structure that represents it.",
            "updated": 1621016234649
        },
        {
            "style": "Subtitle",
            "text": "How is it used?"
        },
        {
            "style": "Text",
            "text": "To use an API Map users need to setup a Task for an API Data Fetcher Bot. This set up is done automatically as part of the Install New Market procedure if an API Map is detected at the Worksapce. From within that Task, a reference to an API Map is established. "
        },
        {
            "style": "Text",
            "text": "When the Task is run, the UI will send to the Task Server all the definitions inside the API Map so that the API Data Fetcher Bot can use them to connect to the API Server, fetch data from it, and correctly interpret the responses."
        },
        {
            "style": "Include",
            "text": "Superalgos->Topic->Data Mining - Fetching Data From APIs->Main Workflow",
            "updated": 1621951793419
        },
        {
            "style": "Title",
            "text": "Configuration"
        },
        {
            "style": "List",
            "text": "protocol: the protocol to be used to access the API. For now either http or https."
        },
        {
            "style": "List",
            "text": "portNumber: the port at which the API server is listening."
        },
        {
            "style": "List",
            "text": "hostName: the domain name or IP address of the API server."
        },
        {
            "style": "List",
            "text": "path: the URL path to where the API is located within the remote server.",
            "updated": 1621016495461
        },
        {
            "style": "List",
            "text": "millisecondsBetweenCalls: [Optional] the number of milliseconds to wait before calling the remote host. This is particuary usefull if there is pagination, so that there is a delay before requesting each page."
        }
    ]
}