{
    "type": "Data Dependency",
    "definition": "Data dependencies are references established with dataset definitions of other bots, determining which datasets the process establishing the reference uses as input.",
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Most bots consume data other bots have produced. Because bots need the data as input for their calculations, processes establish a data dependency with the dataset definitions of other bots. The reference provides the process with all the information needed to decode the dataset, enabling it to perform the required calculations."
        },
        {
            "style": "Gif",
            "text": "GIFs/Superalgos/Docs/inner-foder/indicators-process-dependencies-02.gif"
        },
        {
            "style": "Text",
            "text": "The image above shows data dependencies in one bot referencing dataset definitions of another bot."
        },
        {
            "style": "Title",
            "text": "Adding a Data Dependency"
        },
        {
            "style": "Text",
            "text": "To add a single data dependency, select Add Data Dependency on the process dependencies, bot data dependencies, or data dependency folder node menus."
        },
        {
            "style": "Text",
            "text": "{% include tip.html content=\"Remember that a data dependency must establish a reference to the appropriate dataset definition. When adding data dependencies manually, you also need to manually establish the reference.\" %}"
        },
        {
            "style": "Text",
            "text": "In cases in which multiple data dependencies must be established, you may use the option to create data dependencies in bulk:"
        },
        {
            "style": "Text",
            "text": " The Add All Data Dependencies* option on the data mine data dependencies node menu adds a bot data dependency for each bot in the data mine, and a data dependency for each dataset definition or each product of each bot. You may use this option after manually adding a data mine data dependencies node and manually establishing the reference with the desired data mine, or after adding all data mine data dependencies, by which the references with data mines are established automatically."
        },
        {
            "style": "Text",
            "text": "It is unlikely that a bot requires numerous data dependencies, thus, the most common scenario is setting up individual data dependencies and establishing references manually. However, if your bot requires multiple data dependencies, the bulk features may be quite useful, as you may create all data dependencies for any given data mine, and simply delete those that are not required."
        }
    ]
}