{
    "type": "Data Storage",
    "definition": {
        "text": "The data storage node holds the definitions as to what data is stored in the corresponding network node."
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Bot instances running on the data mining and trading sections of a network node produce data products that need to be stored somewhere, specifically. The data storage node and its chain of offspring determine which data is to be stored where; that is, in what network node."
        },
        {
            "style": "Text",
            "text": "Like with the data mining section and the sections referring to trading operations (testing and production environments), the data storage section is too organized by exchange, market, and data or trading mines. See the sorting of tasks page for the details."
        },
        {
            "style": "Callout",
            "text": "The storage of data is split between Data Mines Data and Trading Mines Data. This is to facilitate the management of data storage definitions in trading farms, on which data mining operations may be separate from trading operations.",
            "updated": 1610122343175
        },
        {
            "style": "Text",
            "text": "The data stored on each node of the network may be accessed by others, including the Charting Space, to visualize information via plotters defined in data mines, by trading systems to make trading decisions, and even by third-party systems. The information regarding trading mine data is explained in length in the trading engine section of the documentation.",
            "updated": 1610122379029
        },
        {
            "style": "Text",
            "text": "The setup of data storage definitions is done automatically when the install market function under the exchange markets node of the Crypto Ecosystem hierarchy is used. However, when data mining or trading tasks are created manually, the data storage definitions must be created manually as well, using the tools available in each of the data structures below this node."
        },
        {
            "style": "Include",
            "text": "Superalgos->Concept->Reusable Snippets->Deleting Node Warning",
            "updated": 1610122776605
        }
    ]
}