{
    "type": "Episode",
    "definition": {
        "text": "Episode is the object that handles the information corresponding to the whole run of the trading bot&mdash;beginning to end&mdash;between the specified initial datetime and final datetime, in the time range parameter of the trading session."
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "In other words, episode is the context framed between the datetimes that make up the whole trading session, as per the session's configuration. As such, an episode keeps track of&mdash;and accumulates&mdash;the results of all positions entered throughout a complete run of a trading session."
        },
        {
            "style": "Text",
            "text": "In this section of the hierarchy, you have access to:"
        },
        {
            "style": "List",
            "text": " running balances and overall performance metrics denominated in both the base and quoted assets;"
        },
        {
            "style": "List",
            "text": "counters, such as the number of positions taken, orders placed, hits, fails, and so on;"
        },
        {
            "style": "List",
            "text": "statistics, such as performance metrics consolidating both assets, number of days in the episode, or user-defined statistics;"
        },
        {
            "style": "List",
            "text": "the distance to certain events, such as the number of candles to the last  take position event, or the last create order event;"
        },
        {
            "style": "List",
            "text": "rates describing each candle in the episode, such as the open, close, min and max rates;"
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609873831169
        },
        {
            "style": "Title",
            "text": "Serial Number Configuration",
            "updated": 1609873971454
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609873980538
        },
        {
            "style": "List",
            "text": "initialValue allows resetting the initial state of the node to an arbitrary value.",
            "updated": 1609875415147
        }
    ]
}