{
    "type": "Open Stage",
    "definition": {
        "text": "The open stage deals with the definitions that make up the logic to enter a position, including the target rate and size, and order execution."
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The open stage comes into play once the take position event is triggered."
        },
        {
            "style": "Text",
            "text": "Conceptually, the open stage deals with the details concerning how the position shall be opened once the decision to take a position has been made. That is, the open stage does not participate in the process of deciding whether a position should be open or not."
        },
        {
            "style": "Text",
            "text": "To take a position, several definitions are required. In particular, those concerning targets, such as the rate and size of the position, and the logic of the execution strategy, that is, how many of which orders shall be placed at the exchange&mdash;and when&mdash;to enter the position."
        },
        {
            "style": "Text",
            "text": "The open stage closes as soon as one of the following events happen:"
        },
        {
            "style": "List",
            "text": "the target size gets filled,"
        },
        {
            "style": "List",
            "text": "the close stage event is triggered,"
        },
        {
            "style": "List",
            "text": "the take profit or stop loss targets are hit."
        },
        {
            "style": "Subtitle",
            "text": "The Stage Does Not Close"
        },
        {
            "style": "Text",
            "text": "One common issue users have while dealing with stages is that they do not get closed after their orders get filled. This usually happens because there are several adjustments on rate that happens during trading, specially if trading live. The reason a Stage does not get closed automatically is because the total filled for the whole stage is not close enough to the Stage Target Size defined by users. In order to avoid this situation there is a configurable factor that can be applied to the stage filled at runtime in order to force it to reach the Stage Target Size. The default value for this factor is:",
            "updated": 1615031649791
        },
        {
            "style": "Json",
            "text": "const ROUNDING_ERROR_CORRECTION_FACTOR = 1.001",
            "updated": 1615031657820
        },
        {
            "style": "Text",
            "text": "This value is overwritted by whatever users config at the Stage node under the roundingErrorCorrectionFactor property.",
            "updated": 1615031668876
        }
    ]
}