{
    "type": "Session Base Asset",
    "definition": "The base asset is the asset whose price is determined by the market. It is usually the first asset in the pair, as listed by the exchange.",
    "paragraphs": [
        {
            "style": "Title",
            "text": "How the Session Base Asset Works"
        },
        {
            "style": "Text",
            "text": "Among other things, the parameter allows defining an initial balance of the corresponding asset, which may be used for trading with the corresponding trading system and trading session. Please see the configuration."
        },
        {
            "style": "Title",
            "text": "Adding a Session Base Asset"
        },
        {
            "style": "Text",
            "text": "To add a parameter that may be missing, select Add Missing Params on the parameters node menu."
        },
        {
            "style": "Note",
            "text": "After adding a base asset node, make sure you establish a reference to the asset in a specific market of a specific exchange in the Crypto Ecosystem hierarchy."
        },
        {
            "style": "Title",
            "text": "Configuring Session Base Asset"
        },
        {
            "style": "Text",
            "text": "Select Configure Base Asset on the menu to access the configuration."
        },
        {
            "style": "Text",
            "text": "{"
        },
        {
            "style": "Text",
            "text": "\"initialBalance\": 0.001,"
        },
        {
            "style": "Text",
            "text": "\"minimumBalance\": 0.0001,"
        },
        {
            "style": "Text",
            "text": "\"maximumBalance\": 0.1"
        },
        {
            "style": "Text",
            "text": "}"
        },
        {
            "style": "List",
            "text": "initialBalance is the amount of capital you wish to allocate to the trading system."
        },
        {
            "style": "List",
            "text": "minimumBalance is the threshold of accummulated losses that switches off the session; when your overall balance (balanceAssetA + balanceAssetB) drops to this value, all trading stops; think of the minimumBalance as a general safety switch."
        },
        {
            "style": "List",
            "text": "maximumBalance is a similar concept as with the minimumBalance but on the high side of the initialBalance."
        }
    ]
}