{
    "type": "Simulated Partial Fill",
    "definition": "The simulated partial fill parameter allows simulating the partial fill of orders.",
    "paragraphs": [
        {
            "style": "Title",
            "text": "How the Simulated Partial Fill Works"
        },
        {
            "style": "Text",
            "text": "Upon each execution, the simulation verifies if the current candle intersects the rate set for the order. If it does, it uses the value in this parameter as a factor to determine and keep track of what percentage of the order is filled."
        },
        {
            "style": "Text",
            "text": "The same process repeats for each subsequent candle, until the order is filled."
        },
        {
            "style": "Text",
            "text": "When the parameter is not present or undefined, the simulation assumes the order is filled as soon as the rate is hit."
        },
        {
            "style": "Title",
            "text": "Adding a Simulated Partial Fill"
        },
        {
            "style": "Text",
            "text": "To add the simulated partial fill node, select Add Missing Items on the parent node menu."
        },
        {
            "style": "Title",
            "text": "Configuring Simulated Partial Fill"
        },
        {
            "style": "Text",
            "text": "To configure the simulated partial fill node, select Configure on the menu."
        },
        {
            "style": "Text",
            "text": "{"
        },
        {
            "style": "Text",
            "text": "     \"fillProbability\": 1"
        },
        {
            "style": "Text",
            "text": "}"
        },
        {
            "style": "List",
            "text": "fillProbability indicates the probability of an order getting filled upon each tag of the price. Values may range from 0 to 1. The value 0 indicates that there are 0% chances of the order getting filled. With such a setting, the order will never get filled in the simulation.  The value 1 indicates that there is a 100% probability of the order getting filled. With such a setting, the order is filled upon the first tag of the price. A value of 0.5 indicates a 50% probability, thus, it takes two tags of the price for the order to fill completely with such a setting."
        }
    ]
}