{
    "type": "Space Settings",
    "definition": "The space settings node features controls over the phisics, proportions, and positioning of icons representing node, and their menus.",
    "paragraphs": [
        {
            "style": "Title",
            "text": "Adding a Space Settings node"
        },
        {
            "style": "Text",
            "text": "To add the space settings node, select Add Space Settings on the parent node menu."
        },
        {
            "style": "Title",
            "text": "Configuring a Space Settings node"
        },
        {
            "style": "Text",
            "text": "Select Configure on the menu to access the configuration."
        },
        {
            "style": "Text",
            "text": "{"
        },
        {
            "style": "Text",
            "text": "    \"node\": {"
        },
        {
            "style": "Text",
            "text": "        \"distancePercentage\": 60,"
        },
        {
            "style": "Text",
            "text": "        \"radiusPercentage\": 85,"
        },
        {
            "style": "Text",
            "text": "        \"massPercentage\": 100,"
        },
        {
            "style": "Text",
            "text": "        \"menuItem\": {"
        },
        {
            "style": "Text",
            "text": "            \"widthPercentage\": 100,"
        },
        {
            "style": "Text",
            "text": "            \"heightPercentage\": 60,"
        },
        {
            "style": "Text",
            "text": "            \"radiusPercentage\": 90"
        },
        {
            "style": "Text",
            "text": "        }"
        },
        {
            "style": "Text",
            "text": "    },"
        },
        {
            "style": "Text",
            "text": "    \"physics\": false"
        },
        {
            "style": "Text",
            "text": "}"
        },
        {
            "style": "List",
            "text": "node refers to every node in the design space."
        },
        {
            "style": "Text",
            "text": "  * radiusPercentage is the radius of the circular nodes' menu applied as a percentage of an arbitrary default radius."
        },
        {
            "style": "Text",
            "text": "  * massPercentage is the refernce mass of nodes that affect the attraction and repulsion of the environment's pysics whe the physics setting is set to true."
        },
        {
            "style": "Text",
            "text": "  * menuItem refers to the items on the right-hand side of nodes' menus."
        },
        {
            "style": "Text",
            "text": "    * widthPercentage is the reference width of an item applied as a percentage of an arbitrary default width."
        },
        {
            "style": "Text",
            "text": "    * heightPercentage is the reference height of an item applied as a percentage of an arbitrary default height."
        },
        {
            "style": "Text",
            "text": "    * radiusPercentage is the reference radious of the circular matrix that governs the distribution of items in the circular menu. Larger numbers cause items to spread appart while smaller numbers makes items lie closer to each other."
        },
        {
            "style": "List",
            "text": "physics determines wether the environment is static (false) or dynamic (true). When physics is set to true, nodes in the design space are affected by th gravitational pull and repulsion of other nodes."
        }
    ]
}