{
    "type": "Status Dependency",
    "definition": "Status dependencies are references to a status report that define which process the process establishing the reference depends on.",
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The reference is established to acquire the information relative to what the target process is doing. For example, by reading a status report a process may learn when was the last time the referenced process ran, and what was the last file processed."
        },
        {
            "style": "Text",
            "text": "The status report referenced may belong to the same process&mdash; which is called a self-reference. In such a case, the process is learning what it did the last time it ran. Also, the status report referenced may belong to another process&mdash;another bot. In that case, the dependency may be of the Market Starting Point or Market Ending Point types."
        },
        {
            "style": "List",
            "text": "Self Reference is mandatory, as a process needs to read its own status report every time it wakes up."
        },
        {
            "style": "List",
            "text": "Market Starting Point is a status dependency existing on Multi-Period-Daily processes so that the process establishing the reference learns the datetime of the start of the market. Usually, the reference is established with the sensor's Historic-OHLCVs process status report. Multi-Period-Market processes do not have this type of status dependency as the date of the start of the market is implied in their dataset (a single file with all market data)."
        },
        {
            "style": "List",
            "text": "Market Ending Point is a status dependency existing both in Multi-Period-Market and Multi-Period-Daily processes so that the process establishing the reference knows the datetime of the end of the market."
        },
        {
            "style": "Text",
            "text": "The image above shows a case of a self-reference status dependency as well as a market ending point status dependency."
        },
        {
            "style": "Title",
            "text": "Adding a Status Dependency"
        },
        {
            "style": "Text",
            "text": "To add a status dependency, select Add Status Dependency on the process dependencies node menu."
        },
        {
            "style": "Text",
            "text": "{% include tip.html content=\"Remember that a status dependency must be configured, and must establish a reference to the appropriate status report.\" %}"
        },
        {
            "style": "Title",
            "text": "Configuring Status Dependency"
        },
        {
            "style": "Text",
            "text": "Select Configure Status Dependency on the menu to access the configuration."
        },
        {
            "style": "Text",
            "text": "{"
        },
        {
            "style": "Text",
            "text": "\"mainUtility\": \"Self Reference|Market Starting Point|Market Ending Point\""
        },
        {
            "style": "Text",
            "text": "}"
        },
        {
            "style": "List",
            "text": "mainUtility determines the type of status dependency, with possible values being Self Reference, Market Starting Point, or Market Ending Point."
        }
    ]
}