{
    "type": "Time Scale",
    "definition": "The time scale controls the scale of the horizontal axis, that is, the timeline of the corresponding time machine, and of all of the timeline charts within it.",
    "paragraphs": [
        {
            "style": "Title",
            "text": "How the Time Scale node works"
        },
        {
            "style": "Subtitle",
            "text": "Scale Minimum and Maximum Values"
        },
        {
            "style": "Text",
            "text": "A time scale has a minimum and a maximum value. The minimum value is the value at the left border of the chart. The maximum, is the value at the right border of the chart."
        },
        {
            "style": "Text",
            "text": "In technical terms, the minimum and maximum scale values are constantly changing as, whenever you pan across the charts, you are directly affecting the minimum and maximum scale values. That said, the actual scale doesn't change when panning across a chart."
        },
        {
            "style": "Subtitle",
            "text": "Automatic Scale"
        },
        {
            "style": "Text",
            "text": "The system features an automatic adjustment of the scale, which is turned on by default in our shared workspaces. The scale may be automatic in its minimum value, in its maximum value, or both."
        },
        {
            "style": "Text",
            "text": "When the scale is automatic in the minimum value, the scale is adjusted so that the chart shows all data from the beginning of the market. Panning the charts under such setting has the effect of compressing and decompressing the data against the left border of the chart."
        },
        {
            "style": "Text",
            "text": "When the scale is automatic in the maximum value, the scale is adjusted so that the chart shows all data until the end of the market. In such case, panning the charts has the effect of compressing and decompressing the data against the right border of the chart."
        },
        {
            "style": "Text",
            "text": "When the scale is automatic in both the minimum and maximum value, the scale is adjusted so that the chart shows the whole market. In such case, when you click and drag to pan the charts, the settings turns back to manual on both ends of the chart."
        },
        {
            "style": "Note",
            "text": "Having the time scale set to automatic by default helps finding the data as soon as it starts being processed the first time you run the Masters bot instances."
        },
        {
            "style": "Subtitle",
            "text": "Manual Scale"
        },
        {
            "style": "Text",
            "text": "The scale features a manual mode. When in manual mode the scale does not change, even if the minimum and maximum values change while panning through a chart. This is the natural state of the time scale."
        },
        {
            "style": "Title",
            "text": "Adding a Time Scale node"
        },
        {
            "style": "Text",
            "text": "To add a time scale, select Add Time Scale on the time machine node menu."
        },
        {
            "style": "Title",
            "text": "Configuring a Time Scale node"
        },
        {
            "style": "Text",
            "text": "Select Configure Rate Scale on the menu to access the configuration."
        },
        {
            "style": "Text",
            "text": "{"
        },
        {
            "style": "Text",
            "text": "    \"fromDate\": \"2019-05-02T20:07:50.872Z\","
        },
        {
            "style": "Text",
            "text": "    \"toDate\": \"2019-05-22T20:28:21.515Z\","
        },
        {
            "style": "Text",
            "text": "    \"autoMinScale\": false,"
        },
        {
            "style": "Text",
            "text": "    \"autoMaxScale\": false"
        },
        {
            "style": "Text",
            "text": "}"
        },
        {
            "style": "List",
            "text": "minValue is a date in the Epoch time format that represents the value of the scale at the left border of the chart."
        },
        {
            "style": "List",
            "text": "maxValue is a date in the Epoch time format that represents the value of the scale at the right border of the chart."
        },
        {
            "style": "List",
            "text": "autoMinScale sets the mode of the scale for the minimum value; true sets the value to automatic, false sets the value to manual."
        },
        {
            "style": "List",
            "text": "autoMaxScale sets the mode of the scale for the maximum value; true sets the value to automatic, false sets the value to manual."
        },
        {
            "style": "Title",
            "text": "Time Scale at the Charts"
        },
        {
            "style": "Text",
            "text": "<H4>Automatic Scale</H4>"
        },
        {
            "style": "Text",
            "text": "<b>1. To change the automatic scale settings</b>, place the mouse pointer over the corresponding time box, press the <kbd>Shift</kbd> key and slowly scroll the wheel of the mouse. The action cycles through different possible scale automation settings. Notice a tiny green triangle to the sides of the time scale icon."
        },
        {
            "style": "List",
            "text": "A triangle pointing right means that the maximum value of the scale is automatic."
        },
        {
            "style": "List",
            "text": "A triangle pointing left means that the minimum value of the scale is automatic."
        },
        {
            "style": "List",
            "text": "Both triangles present at the same time means that both minimum and maximum values are automatic."
        },
        {
            "style": "List",
            "text": "No triangle means that both minimum and maximum values are in manual mode."
        },
        {
            "style": "Text",
            "text": "<H4>Manual Scale</H4>"
        },
        {
            "style": "Text",
            "text": "<b>2. To adjust the scale</b>, make sure either or both minimum and maximum values are in manual mode. Place the mouse pointer over the time box and scroll the wheel of the mouse. The scale will increase or decrease accordingly, depending on which values are set to manual."
        },
        {
            "style": "Text",
            "text": "{% include image.html file='interface/time-scale-01.gif' url='yes' max-width='100' caption='When the scale is set to manual, scrolling the mouse wheel on top of the time scale box changes the scale.' %}"
        },
        {
            "style": "Text",
            "text": "Notice that, while changing the scale, a number is displayed replacing the actual datetime. This is a reference value of the scale, that may serve for comparison purposes, with scales in other charts."
        },
        {
            "style": "Note",
            "text": "This action has no effect when both minimum and maximum values are set to automatic mode."
        }
    ]
}