{
    "type": "Time Frame",
    "definition": "The time frame determines the collection of candles to be analyzed during a backtesting session, and the frequency with which the trading bot runs on paper trading, forward testing, and live trading sessions.",
    "paragraphs": [
        {
            "style": "Title",
            "text": "How the Time Frame Works"
        },
        {
            "style": "Text",
            "text": "In the context of backtesting sessions, what time frame you decide to run the session depends on the trading system being tested. If the trading system makes decisions based on the 1-hour candle and above, then 01-hs may be the best choice. However, if decisions are influenced by sub-hour candles then you should match the time frame accordingly."
        },
        {
            "style": "Text",
            "text": "In other words, in backtesting sessions, you should match the time frame to the smallest period on which the trading system makes decisions."
        },
        {
            "style": "Text",
            "text": "In the context of live sessions, that is, paper trading, forward testing, and live trading, you should run the session on the 01-min time frame so that the trading bot reacts fast when the price tags the take profit or stop loss targets. Remember that stop and take profit orders are not placed at the exchange after the take position event, that is, once you enter the position. Instead, the trading bot checks the current price upon each execution cycle and determines whether targets have been hit or not. If targets are hit, only then orders are placed. That is why running live trading sessions at the 01-min time frame is recommended. Learn more about the management of take profit and stop loss targets."
        },
        {
            "style": "Text",
            "text": "If for whatever reason you don't need to minimize the potential for slippage when hitting stop or take profit targets, you may choose whatever time frame you like, taking into account the explanations below."
        },
        {
            "style": "Text",
            "text": "<H4>Why the Time Frame Matters</H4>"
        },
        {
            "style": "Success",
            "text": "Running trading sessions of any given trading system on different time frames may produce different results. This is because the behavior of a trading session may vary depending on how well the time frame on which the session is run matches the logic of the strategy."
        },
        {
            "style": "Text",
            "text": "This is why:"
        },
        {
            "style": "Text",
            "text": "The trading bot evaluates closed candles only. At any given point in time, the current candle in each time frame is the candle that closed last."
        },
        {
            "style": "Text",
            "text": "For example:"
        },
        {
            "style": "Text",
            "text": "Let's say it's 2020-06-11T11:39:30:00.000Z, that is, 11 hours, 39 minutes and 30 seconds of June 11th, 2020."
        },
        {
            "style": "List",
            "text": "The current 1-minute candle is the one which closed at 11:38:59.999."
        },
        {
            "style": "List",
            "text": "The current 5-minute candle is the one which closed at 11:34:59.999."
        },
        {
            "style": "List",
            "text": "The current 30-minute candle is the one which closed at 11:29:59.999."
        },
        {
            "style": "List",
            "text": "The current 1-hour candle is the one which closed at 10:59:59.999."
        },
        {
            "style": "List",
            "text": "The current 2-hour candle is the one which closed at 09:59:59.999."
        },
        {
            "style": "List",
            "text": "The current 6-hour candle is the one which closed at 05:59:59.999."
        },
        {
            "style": "List",
            "text": "The current 24-hour candle is the one which closed at 23:59:59.999 of June 10th!"
        },
        {
            "style": "Text",
            "text": "Let's say the trading system implements conditions that evaluate 30-minute and 1-hour candles."
        },
        {
            "style": "Text",
            "text": "If a session is run at the 30-minutes time frame, all 30-minutes candles are evaluated. Also, all 1-hour candles are evaluated twice."
        },
        {
            "style": "Text",
            "text": "However, if the session is run at the 1-hour time frame, only one out of two 30-minute candles are evaluated."
        },
        {
            "style": "Text",
            "text": "And if the session is run at the 2-hour time frame, only one out of four 30-minute candles and one out of two 1-hour candles are evaluated."
        },
        {
            "style": "Text",
            "text": "This means that running the session (for this particular trading system) at the 30-minute time frame has higher probabilities of conditions evaluating 30-minute candles to be true during the session."
        },
        {
            "style": "Success",
            "text": "In other words, when running the session on time frames higher than the time frame on which decisions are made, chances are the bot will eventually skip candles on which conditions would have evaluated true, potentially skipping trading opportunities."
        },
        {
            "style": "Text",
            "text": "The above is true for all types of trading sessions."
        },
        {
            "style": "Text",
            "text": "<H4>Backtesting Vs. Live Sessions</H4>"
        },
        {
            "style": "Text",
            "text": "In a backtesting session, the collection of candles evaluated is determined by the time frame selected to better simulate what would happen if the live trading session was run in the same time frame."
        },
        {
            "style": "Title",
            "text": "Adding a Time Frame"
        },
        {
            "style": "Text",
            "text": "To add a parameter that may be missing, select Add Missing Params on the parameters node menu."
        },
        {
            "style": "Title",
            "text": "Configuring Time Frame"
        },
        {
            "style": "Text",
            "text": "Select Configure Time Frame on the menu to access the configuration."
        },
        {
            "style": "Text",
            "text": "{"
        },
        {
            "style": "Text",
            "text": "\"value\": \"01-min\""
        },
        {
            "style": "Text",
            "text": "}"
        },
        {
            "style": "List",
            "text": "value is the setting for the time frame. You may use any of the values below."
        },
        {
            "style": "Text",
            "text": "01-min"
        },
        {
            "style": "Text",
            "text": "02-min"
        },
        {
            "style": "Text",
            "text": "03-min"
        },
        {
            "style": "Text",
            "text": "04-min"
        },
        {
            "style": "Text",
            "text": "05-min"
        },
        {
            "style": "Text",
            "text": "10-min"
        },
        {
            "style": "Text",
            "text": "15-min"
        },
        {
            "style": "Text",
            "text": "20-min"
        },
        {
            "style": "Text",
            "text": "30-min"
        },
        {
            "style": "Text",
            "text": "45-min"
        },
        {
            "style": "Text",
            "text": "Available options at larger time frames are:"
        },
        {
            "style": "Text",
            "text": "01-hs"
        },
        {
            "style": "Text",
            "text": "02-hs"
        },
        {
            "style": "Text",
            "text": "03-hs"
        },
        {
            "style": "Text",
            "text": "04-hs"
        },
        {
            "style": "Text",
            "text": "06-hs"
        },
        {
            "style": "Text",
            "text": "08-hs"
        },
        {
            "style": "Text",
            "text": "12-hs"
        },
        {
            "style": "Text",
            "text": "24-hs"
        }
    ]
}