{
    "type": "Time Frame",
    "definition": {
        "text": "The time frame determines the collection of candles to be analyzed during a backtesting session, and the frequency with which the trading bot runs on paper trading, forward testing, and live trading sessions."
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Title",
            "text": "In Live Sessions"
        },
        {
            "style": "Text",
            "text": "In the context of live sessions, that is, paper trading, forward testing, and live trading, you may want to run the session on the 01-min time frame so that the trading bot reacts fast when the price tags the take profit or stop loss targets.",
            "updated": 1611866615974
        },
        {
            "style": "Important",
            "text": "Remember that Superalgos does not place stop or take profit orders at the time of entering the position. Instead, the trading bot checks the current price upon each execution Cycle and determines whether Managed Stop Loss or Managed Take Profit targets have been hit or not. If targets are hit, the Close Stage opens and orders are placed on the next cycle, which happens to be on the next candle."
        },
        {
            "style": "Text",
            "text": "If for whatever reason you don't need to minimize the potential for slippage when hitting stop or take profit targets, you may choose whatever time frame you like, taking into account the explanations below."
        },
        {
            "style": "Title",
            "text": "In Backtesting Sessions",
            "updated": 1611864433090
        },
        {
            "style": "Text",
            "text": "In the context of backtesting sessions, what time frame you decide to run the session depends on the trading system being tested. If the trading system makes decisions based on the 1-hour candle and above, then 01-hs may be the best choice. However, if decisions are influenced by sub-hour candles then you should match the time frame accordingly."
        },
        {
            "style": "Text",
            "text": "In other words, in backtesting sessions, you should match the time frame to the smallest period on which the trading system makes decisions."
        },
        {
            "style": "Important",
            "text": "The above, however, is only partially correct. Setting the time frame to match the decision-making criteria of the Trading System is desirable to save time in backtests. You save time because the smallest reasonable collection of candles is evaluated. However, the time-saving may come at the cost of precision!",
            "updated": 1611864503880
        },
        {
            "style": "Text",
            "text": "Remember what was said about stop loss and take profit orders earlier: they do not exist in Superalgos. When a target is hit, orders are placed in the following Cycle, which happens to be on the next candle!",
            "updated": 1611867434260
        },
        {
            "style": "Callout",
            "text": "Let's take a minute to reflect on the implications of the above! If targets are hit on one candle and orders are placed on the next candle, there is the potential for huge Slippage if the session is run on higher time frames! This is the cost in precision mentioned earlier.",
            "updated": 1611867460626
        },
        {
            "style": "Text",
            "text": "The above explanation seems to point in the following direction: if you want backtesting simulations to be comparable to live sessions run on the 01-min time frame, then you should run the backtesting session on the 01-min time frame as well. There is, however, a workaround.",
            "updated": 1611865962360
        },
        {
            "style": "Subtitle",
            "text": "Workaround",
            "updated": 1611865696092
        },
        {
            "style": "Text",
            "text": "You may use the Simulated Exchange Events structure of nodes to arbitrarily define the exit rate of the position.",
            "updated": 1611866026489
        },
        {
            "style": "Text",
            "text": "For example, you may use the following formula in the Simulated Actual Rate node as well as in the Target Rate of the Close Stage:",
            "updated": 1611866230721
        },
        {
            "style": "Javascript",
            "text": "targetRate()\n\nfunction targetRate() {\n    switch (tradingEngine.tradingCurrent.position.exitType.value) {\n        case 'No Exit': {\n            return tradingEngine.tradingCurrent.tradingEpisode.candle.close.value\n            break\n        }\n        case 'Take Profit': {\n            return tradingEngine.tradingCurrent.position.takeProfit.finalValue.value\n            break\n        }\n        case 'Stop Loss': {\n            return tradingEngine.tradingCurrent.position.stopLoss.finalValue.value\n            break\n        }\n    }\n}",
            "updated": 1611866140829
        },
        {
            "style": "Text",
            "text": "The formula sets the Simulated Actual Rate to be the last known takeProfit rate if the exit was triggered by hitting of the Managed Take Profit, or the last known stopLoss in case it was the Managed Stop Loss target.",
            "updated": 1611866508554
        },
        {
            "style": "Title",
            "text": "Why the Time Frame Matters",
            "updated": 1609675221484
        },
        {
            "style": "Callout",
            "text": "Running trading sessions of any given trading system on different time frames may produce different results. This is because the behavior of a trading session may vary depending on how well the time frame matches the logic of the strategy.",
            "updated": 1611867546138
        },
        {
            "style": "Text",
            "text": "The trading bot evaluates closed candles only. At any given point in time, the current candle in each time frame is the candle that closed last."
        },
        {
            "style": "Text",
            "text": "For example, let's say it's 11 hours, 39 minutes and 30 seconds of June 11th, 2020. This is how the system determines which is the current candle:",
            "updated": 1609676164831
        },
        {
            "style": "List",
            "text": "1-minute candle: it is the one that closed at 11:38:59.999.",
            "updated": 1609675822811
        },
        {
            "style": "List",
            "text": "5-minute candle: it is the one that closed at 11:34:59.999.",
            "updated": 1609675843830
        },
        {
            "style": "List",
            "text": "30-minute candle: it is the one that closed at 11:29:59.999.",
            "updated": 1609675857707
        },
        {
            "style": "List",
            "text": "1-hour candle: it is the one that closed at 10:59:59.999.",
            "updated": 1609675872973
        },
        {
            "style": "List",
            "text": "2-hour candle: it is the one that closed at 09:59:59.999.",
            "updated": 1609675887917
        },
        {
            "style": "List",
            "text": "6-hour candle: it is the one that closed at 05:59:59.999.",
            "updated": 1609675901312
        },
        {
            "style": "List",
            "text": "24-hour candle: it is the one that closed at 23:59:59.999 of June 10th!",
            "updated": 1609675923840
        },
        {
            "style": "Text",
            "text": "Let's say the trading system implements conditions that evaluate 30-minute and 1-hour candles."
        },
        {
            "style": "Text",
            "text": "If a session is run at the 30-minutes time frame, all 30-minutes candles are evaluated. Also, all 1-hour candles are evaluated twice."
        },
        {
            "style": "Text",
            "text": "However, if the session is run at the 1-hour time frame, only one out of two 30-minute candles are evaluated."
        },
        {
            "style": "Text",
            "text": "And if the session is run at the 2-hour time frame, only one out of four 30-minute candles and one out of two 1-hour candles are evaluated."
        },
        {
            "style": "Text",
            "text": "This means that running the session (for this particular trading system) at the 30-minute time frame has higher probabilities of conditions evaluating 30-minute candles to be true during the session."
        },
        {
            "style": "Callout",
            "text": "In other words, when running the session on time frames higher than the time frame on which decisions are made, chances are the bot will eventually skip candles on which conditions would have evaluated true, potentially skipping trading opportunities."
        },
        {
            "style": "Text",
            "text": "The above is true for all types of trading sessions."
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Time Frame Configuration",
            "updated": 1609676252035
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609676263152
        },
        {
            "style": "List",
            "text": "value is the setting for the time frame. You may use any of the values below."
        },
        {
            "style": "Javascript",
            "text": "01-min\n02-min\n03-min\n04-min\n05-min\n10-min\n15-min\n20-min\n30-min\n45-min",
            "updated": 1609676325072
        },
        {
            "style": "Text",
            "text": "Available options at larger time frames are:"
        },
        {
            "style": "Javascript",
            "text": "01-hs\n02-hs\n03-hs\n04-hs\n06-hs\n08-hs\n12-hs\n24-hs",
            "updated": 1609676376826
        }
    ]
}