{
    "type": "Time Frame Scale",
    "definition": "The time frame scale controls the time frame setting, that is, the period represented by each candle, either of the time machine or of the timeline chart, depending on where the node is located.",
    "paragraphs": [
        {
            "style": "Title",
            "text": "How the Time Frame Scale node works"
        },
        {
            "style": "Text",
            "text": "When the time frame scale is set at the level of the time machine, the scale setting affects all charts within the time machine. When set at the level of the timeline chart, the setting overrides the time frame scale at the time machine level. This allows comparing charts in different time frames, but still synchronized at the datetime level."
        },
        {
            "style": "Title",
            "text": "Adding a Time Frame Scale node"
        },
        {
            "style": "Text",
            "text": "To add a time frame scale, select Add Time Frame Scale on the time machine or the timeline chart node menu."
        },
        {
            "style": "Title",
            "text": "Configuring a Time Frame Scale node"
        },
        {
            "style": "Text",
            "text": "Select Configure Frame Scale on the menu to access the configuration."
        },
        {
            "style": "Text",
            "text": "{"
        },
        {
            "style": "Text",
            "text": "    \"value\":\"06-hs\""
        },
        {
            "style": "Text",
            "text": "}"
        },
        {
            "style": "List",
            "text": "value can be any of the time frames supported by the system:"
        },
        {
            "style": "Text",
            "text": "  * 01-hs, 02-hs, 03-hs, 04-hs, 06-hs, 08-hs, 12-hs, and 24-hs."
        },
        {
            "style": "Note",
            "text": "  The values entered via the design space and the charts are synchronized and stored in the node."
        },
        {
            "style": "Title",
            "text": "Time Frame Scale at the Charts"
        },
        {
            "style": "Text",
            "text": "1. To set a time frame value, place the mouse pointer over the corresponding time machine or timeline chart time frame box and scroll the mouse wheel."
        },
        {
            "style": "Text",
            "text": "{% include image.html file='interface/time-frame-scale-00.gif' url='yes' max-width='100' caption='To set a time frame, scroll the wheel of the mouse over the time frame scale box.' %}"
        }
    ]
}