{
    "type": "Trading Mine Products",
    "definition": "Trading mine products are references established with trading mines to facilitate establishing data product references with multiple products in the given mine.",
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "At this point, Superalgos ships with a single trading mine, featuring a single low frequency trading bot. However, developers may create their own trading bots or fork the existing one."
        },
        {
            "style": "Text",
            "text": "The node may be used as an organizational device, simply to arrange bot products. However, the smart use of the node involves automating the deployment of multiple data products."
        },
        {
            "style": "Text",
            "text": "The use of the trading mine products node is optional, as data products may also exist outside of trading mine products nodes."
        },
        {
            "style": "Title",
            "text": "Adding a Trading Mine Products"
        },
        {
            "style": "Text",
            "text": "To add a trading mine products node, select Add Trading Mine Products on the parent node menu. This action adds the node but does not establish a reference with any trading mine."
        },
        {
            "style": "Text",
            "text": "The smarter use of the node involves using the Add All Trading Mine Products option on the parent node menu. This action creates a trading mine products node for each trading mine in the workspace, establishing a reference with the corresponding trading mines. This is the first step in the direction of quickly setting up multiple data products when needed."
        },
        {
            "style": "Note",
            "text": "See the data product node definition and the Adding a Data Product Node section for all the details."
        },
        {
            "style": "Title",
            "text": "Configuring Trading Mine Products"
        },
        {
            "style": "Text",
            "text": "Select Configure on the menu to access the configuration."
        }
    ]
}