{
    "type": "Superalgos Network",
    "definition": {
        "text": "The Superalgos Network is an open, peer-to-peer network, currently in the making. The network will enable users to set up their Clients to interact with other Clients. Such connectivity enables the exchange and dissemination of products and services from and to users.",
        "updated": 1630096650321,
        "translations": [
            {
                "language": "RU",
                "text": "Superalgos Network - это открытая одноранговая сеть, которая в настоящее время находится в процессе создания. Сеть позволит пользователям настраивать свой клиент (Client) для взаимодействия с другими клентами. Такая сеть обеспечивает обмен и распространение продуктов и услуг между пользователями.",
                "updated": 1638298458130
            },
            {
                "language": "TR",
                "text": "Superalgos Ağı, şu anda yapım aşamasında olan açık, eşler arası bir ağdır. Ağ, kullanıcıların Müşterilerini diğer Müşterilerle etkileşime girecek şekilde kurmalarını sağlayacaktır. Bu tür bir bağlantı, ürün ve hizmetlerin kullanıcılardan kullanıcılara değiş tokuş edilmesini ve yayılmasını sağlar.",
                "updated": 1666900386580
            },
            {
                "language": "DE",
                "text": "Das Superalgos-Netzwerk ist ein offenes Peer-to-Peer-Netzwerk, das sich derzeit im Aufbau befindet. Das Netzwerk wird es Nutzern ermöglichen, ihre Clients einzurichten, um mit anderen Clients zu interagieren. Diese Konnektivität ermöglicht den Austausch und die Verbreitung von Produkten und Dienstleistungen von und für Nutzer.",
                "updated": 1701031191809
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Superalgos Network is on the project's roadmap, expected to be implemented in 2022.",
            "updated": 1621955515063,
            "translations": [
                {
                    "language": "RU",
                    "text": "Superalgos Network входит в дорожную карту проекта, реализация которого ожидается в 2022 году.",
                    "updated": 1638298505591
                },
                {
                    "language": "TR",
                    "text": "Superalgos Ağı, 2022 yılında hayata geçirilmesi beklenen projenin yol haritasında yer alıyor.",
                    "updated": 1666900471494
                },
                {
                    "language": "DE",
                    "text": "Das Superalgos-Netz steht auf dem Fahrplan des Projekts, das voraussichtlich im Jahr 2022 umgesetzt wird.",
                    "updated": 1701031200090
                }
            ]
        }
    ]
}