{
    "type": "Position Claim Vote",
    "definition": {
        "text": "Use this node to establish a reference with a Position Contribution Claim placed by your colleague in the Claims Program section of their User Profile. This vote means that you support your colleague's claim with the Claim Support Power you drive into the Claim Votes node!",
        "updated": 1630356265895,
        "translations": [
            {
                "language": "ES",
                "text": "Use este nodo para establecer una referencia con una Position Contribution Claim (solicitud de contribución de posición) colocada por un colega en la sección  Claims Program de su User Profile. Este voto significa que apoya la solicitud de su colega con el Claim Support Power que dirija a su nodo de Claim Votes!",
                "updated": 1636112479494
            },
            {
                "language": "RU",
                "text": "Используйте этот узел, чтобы установить ссылку на Position Contribution Claim, размещенное вашим коллегой в разделе «Claims Program» своего профиля пользователя. Это голосование означает, что вы поддерживаете утверждение своего коллеги с помощью Claim Support Power, которую вы вводите в узел Claim Votes!",
                "updated": 1639138239034
            },
            {
                "language": "TR",
                "text": "Bu düğümü, çalışma arkadaşınız tarafından Kullanıcı Profilinin ( User Profile ) Talep Programı ( Claims Program ) bölümüne yerleştirilen bir Pozisyon Katkı Talebi ( Position Contribution Claim ) ile referans oluşturmak için kullanın. Bu oy, Çalışma arkadaşınızın talebini Talep Oyları ( Claim Votes ) düğümüne sürdüğünüz Talep Destek Gücü ( Claim Support Power ) ile desteklediğiniz anlamına gelir!",
                "updated": 1672064838724
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1630350078214
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Claim Votes Content",
            "updated": 1630350813522
        },
        {
            "style": "Subtitle",
            "text": "Working on Multiple Workspaces"
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Deep in Governance"
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Computational Limitations 2"
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1639138254998
                }
            ]
        }
    ]
}