{
    "topic": "Troubleshooting",
    "pageNumber": "16",
    "type": "Browser Compatibility",
    "definition": {
        "text": "There is no recommended browser to use!",
        "updated": 1618298878638,
        "translations": [
            {
                "language": "RU",
                "text": "Не существует рекомендуемого браузера для использования!",
                "updated": 1640540446990
            },
            {
                "language": "TR",
                "text": "Özet: Kullanmak için önerilen bir tarayıcı yok!",
                "updated": 1647871803851
            },
            {
                "language": "DE",
                "text": "Es gibt keinen empfohlenen Browser für die Anwendung!",
                "updated": 1678649611406
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "While there is no recommended browser to use with Superalgos, there is the need to use a common base for developers and users to develop SA and troubleshoot possible errors. As of today Chrome is one of the most used browser worldwide and that's why it's suggested to use it. Some users reported that Edge and Brave browser both based on chromium project are working with no (or minor) issues.",
            "updated": 1618299516232,
            "translations": [
                {
                    "language": "RU",
                    "text": "Хотя не существует рекомендованного браузера для использования с Superalgos, существует необходимость использования общей базы для разработчиков и пользователей для разработки SA и устранения возможных ошибок. На сегодняшний день Chrome является одним из самых используемых браузеров во всем мире, поэтому рекомендуется использовать именно его. Некоторые пользователи сообщили, что браузеры Edge и Brave, оба основанные на проекте chromium, работают без проблем (или с незначительными проблемами).",
                    "updated": 1640540501562
                },
                {
                    "language": "TR",
                    "text": "Superalgos ile kullanılması önerilen bir tarayıcı bulunmamakla birlikte, geliştiriciler ve kullanıcılar için SA geliştirmek ve olası hataları gidermek için ortak bir temel kullanma ihtiyacı vardır. Bugün itibariyle Chrome, dünya çapında en çok kullanılan tarayıcılardan biridir ve bu yüzden kullanılması önerilir. Bazı kullanıcılar, krom projesine dayalı Edge ve Brave tarayıcısının hiç (veya küçük) sorunla çalıştığını bildirdi.",
                    "updated": 1647871822305
                },
                {
                    "language": "DE",
                    "text": "Es gibt zwar keinen empfohlenen Browser für Superalgos, aber es ist notwendig, eine gemeinsame Basis für Entwickler und Benutzer zu verwenden, um SA zu entwickeln und mögliche Fehler zu beheben. Heutzutage ist Chrome einer der meistgenutzten Browser weltweit und deshalb wird seine Verwendung empfohlen. Einige Benutzer berichteten, dass Edge und Brave, die beide auf dem Chromium-Projekt basieren, ohne (oder mit nur geringen) Problemen funktionieren.",
                    "updated": 1678649621815
                }
            ]
        },
        {
            "style": "List",
            "text": "Chrome -> Common base browser used by devs to develop SA and troubleshoot issues",
            "translations": [
                {
                    "language": "RU",
                    "text": "Chrome -> Общий базовый браузер, используемый разработчиками для разработки SA и устранения неполадок",
                    "updated": 1640540516430
                },
                {
                    "language": "TR",
                    "text": "Chrome -> Geliştiriciler tarafından SA geliştirmek ve sorunları gidermek için kullanılan ortak temel tarayıcı",
                    "updated": 1647871841636
                },
                {
                    "language": "DE",
                    "text": "Chrome -> Gemeinsamer Basisbrowser, der von Entwicklern zur Entwicklung von SA und zur Fehlerbehebung verwendet wird",
                    "updated": 1678649630725
                }
            ]
        },
        {
            "style": "List",
            "text": "Edge -> Based on chromium, unknown issues",
            "translations": [
                {
                    "language": "RU",
                    "text": "Edge -> Основан на chromium, проблем не выявлено",
                    "updated": 1640540564825
                },
                {
                    "language": "TR",
                    "text": "Edge -> Kroma dayalı, bilinmeyen sorunlar",
                    "updated": 1647871852239
                },
                {
                    "language": "DE",
                    "text": "Edge -> Basiert auf Chromium, unbekannte Probleme",
                    "updated": 1678649638421
                }
            ]
        },
        {
            "style": "List",
            "text": "Brave -> Based on chromium, unknown issues. Shields should be set down",
            "updated": 1618300294258,
            "translations": [
                {
                    "language": "RU",
                    "text": "Brave -> Основан на chromium, проблемы не выявлены. Функция блокировки Brave Shields должен быть отключен",
                    "updated": 1640540725622
                },
                {
                    "language": "TR",
                    "text": "Brave -> Kroma dayalı, bilinmeyen sorunlar. Shields kurulmalıdır",
                    "updated": 1647871900544
                },
                {
                    "language": "DE",
                    "text": "Brave -> Basiert auf Chromium, unbekannte Probleme. Schilde sollten abgestellt werden",
                    "updated": 1678649647167
                }
            ]
        },
        {
            "style": "List",
            "text": "Firefox -> No reports, unknown",
            "translations": [
                {
                    "language": "RU",
                    "text": "Firefox -> Нет отчетов, неизвестно",
                    "updated": 1640540739526
                },
                {
                    "language": "TR",
                    "text": "Firefox -> Rapor yok, bilinmiyor",
                    "updated": 1647871909138
                },
                {
                    "language": "DE",
                    "text": "Firefox -> Keine Berichte, unbekannt",
                    "updated": 1678649655933
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}