{
    "topic": "Troubleshooting",
    "pageNumber": "6",
    "type": "Perception Issues - My System Gets Slow",
    "definition": {
        "text": "Understand how the system uses the available hardware so that you may implement workarounds and best practices.",
        "updated": 1611513348468,
        "translations": [
            {
                "language": "RU",
                "text": "Поймите, как система использует имеющееся оборудование, чтобы вы могли реализовать обходные пути и применить оптимальные решения.",
                "updated": 1640457727438
            },
            {
                "language": "TR",
                "text": "Özet: Geçici çözümleri ve en iyi uygulamaları uygulayabilmeniz için sistemin kullanılabilir donanımı nasıl kullandığını anlayın.",
                "updated": 1647864020724
            },
            {
                "language": "DE",
                "text": "Sie werden erfahren, wie das System die verfügbare Hardware nutzt, so dass Sie alternative Lösungen und bewährte Methoden anwenden können.",
                "updated": 1678645092149
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Dynamically rendering all the visual features in the system puts a significant load on the machine’s graphics processing unit (GPU). Running multiple tasks at the same time is demanding on the central processing unit (CPU). Depending on your machine’s capacity, this may result in the system getting slow and sometimes even unresponsive.",
            "updated": 1611513372759,
            "translations": [
                {
                    "language": "RU",
                    "text": "Динамический рендеринг всех визуальных функций в системе создает значительную нагрузку на графический процессор (GPU) машины. Одновременное выполнение нескольких задач предъявляет высокие требования к центральному процессору (CPU). В зависимости от мощности вашего компьютера это может привести к тому, что система будет работать медленно, а иногда даже не реагировать на запросы.",
                    "updated": 1640457764216
                },
                {
                    "language": "TR",
                    "text": "Sistemdeki tüm görsel özellikleri dinamik olarak oluşturmak, makinenin grafik işleme birimine (GPU) önemli bir yük getirir. Aynı anda birden fazla görevi yürütmek, merkezi işlem birimi (CPU) için zorludur. Makinenizin kapasitesine bağlı olarak bu, sistemin yavaşlamasına ve hatta bazen yanıt vermemesine neden olabilir.",
                    "updated": 1647864059316
                },
                {
                    "language": "DE",
                    "text": "Das dynamische Rendering aller visuellen Funktionen im System belastet den Grafikprozessor (GPU) des Computers erheblich. Die gleichzeitige Ausführung mehrerer Aufgaben stellt hohe Anforderungen an die zentrale Verarbeitungseinheit (CPU). Je nach Kapazität Ihres Rechners kann dies dazu führen, dass das System langsamer wird und zum Teil nicht mehr reagiert.",
                    "updated": 1678645102672
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you experience such symptoms, there are several actions you may take to mitigate them.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы испытываете такие симптомы, есть несколько действий, которые вы можете предпринять для их смягчения.",
                    "updated": 1640457780655
                },
                {
                    "language": "TR",
                    "text": "Bu tür belirtilerle karşılaşırsanız, bunları azaltmak için yapabileceğiniz birkaç işlem vardır.",
                    "updated": 1647864070623
                },
                {
                    "language": "DE",
                    "text": "Wenn solche Symptome auftreten, gibt es mehrere Maßnahmen, die Sie ergreifen können, um dies zu verbessern.",
                    "updated": 1678645113491
                }
            ]
        },
        {
            "style": "Note",
            "text": "Learn about the system requirements to better understand what to expect in terms of the performance of your hardware.",
            "updated": 1611513387104,
            "translations": [
                {
                    "language": "RU",
                    "text": "Ознакомьтесь с системными требованиями, чтобы лучше понять, чего ожидать от производительности вашего оборудования.",
                    "updated": 1640457792798
                },
                {
                    "language": "TR",
                    "text": "Not: Donanımınızın performansı açısından ne bekleyeceğinizi daha iyi anlamak için sistem gereksinimleri hakkında bilgi edinin.",
                    "updated": 1647864113104
                },
                {
                    "language": "DE",
                    "text": "Informieren Sie sich über die Systemanforderungen, um besser zu verstehen, was für die Leistung Ihrer wichtig ist.",
                    "updated": 1678645126751
                }
            ]
        },
        {
            "style": "Title",
            "text": "Close The Browser’s Developer Tools",
            "translations": [
                {
                    "language": "RU",
                    "text": "Закройте инструменты разработчика браузера",
                    "updated": 1640457804406
                },
                {
                    "language": "TR",
                    "text": "Tarayıcı Geliştirici Araçlarını Kapatın",
                    "updated": 1647864138400
                },
                {
                    "language": "DE",
                    "text": "Schließen Sie die Entwicklertools des Browsers",
                    "updated": 1678645137849
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may have opened Developer Tools at some point. Developer Tools may slow animation renderings to a crawl, as slow as one frame per second. In case it is open, make sure you close Developer Tools.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Возможно, в какой-то момент вы открывали Developer Tools (\"Инструменты разработчика\"). Инструменты разработчика могут замедлить рендеринг анимации до одного кадра в секунду. Если он открыт, убедитесь, что вы закрыли Developer Tools.",
                    "updated": 1640457867837
                },
                {
                    "language": "TR",
                    "text": "Bir noktada Geliştirici Araçlarını açmış olabilirsiniz. Geliştirici Araçları, animasyon oluşturma işlemlerini saniyede bir kare kadar yavaş bir taramaya kadar yavaşlatabilir. Açık olması durumunda, Geliştirici Araçlarını kapattığınızdan emin olun.",
                    "updated": 1647864177922
                },
                {
                    "language": "DE",
                    "text": "Möglicherweise haben Sie irgendwann einmal die Entwicklertools geöffnet. Die Entwicklertools können das Rendern von Animationen verlangsamen, und zwar bis zu einem Bild pro Sekunde. Falls sie geöffnet sind, schließen Sie die Entwicklertools.",
                    "updated": 1678645145786
                }
            ]
        },
        {
            "style": "Title",
            "text": "Stop Data Mining Tasks That You May Not Need Running",
            "translations": [
                {
                    "language": "RU",
                    "text": "Прекратите выполнение задач по добыче данных, которые вам, возможно, не нужны",
                    "updated": 1640457885701
                },
                {
                    "language": "TR",
                    "text": "Çalışması Gerekmeyen Veri Madenciliği Görevlerini Durdurun",
                    "updated": 1647864214772
                },
                {
                    "language": "DE",
                    "text": "Stoppen Sie Data-Mining-Aufgaben, die Sie vielleicht nicht ausführen müssen",
                    "updated": 1678645159090
                }
            ]
        },
        {
            "style": "Text",
            "text": "Data mining is a CPU-intensive activity. If you are designing a strategy, you probably don’t need to have a live stream of information being processed in realtime. Learn to segment your activities and only start the tasks that you need for the work you are doing.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Добыча данных является процессороемкой деятельностью. Если вы разрабатываете стратегию, вам, вероятно, не нужен живой поток информации, обрабатываемой в режиме реального времени. Научитесь сегментировать свою деятельность и запускать только те задачи, которые необходимы для выполняемой работы.",
                    "updated": 1640457937453
                },
                {
                    "language": "TR",
                    "text": "Veri madenciliği, CPU için yoğun bir faaliyettir. Bir strateji tasarlıyorsanız, muhtemelen gerçek zamanlı olarak işlenen canlı bir bilgi akışına ihtiyacınız yoktur. Faaliyetlerinizi bölümlere ayırmayı öğrenin ve yalnızca yaptığınız iş için ihtiyaç duyduğunuz görevleri başlatın.",
                    "updated": 1647864266946
                },
                {
                    "language": "DE",
                    "text": "Data Mining ist eine CPU-intensive Tätigkeit. Wenn Sie eine Strategie entwerfen, brauchen Sie wahrscheinlich keinen Live-Stream von Informationen, die in Echtzeit verarbeitet werden. Lernen Sie, Ihre Aktivitäten zu segmentieren und nur die Aufgaben zu starten, die Sie für Ihre Arbeit benötigen.",
                    "updated": 1678645176972
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may also consider applying a Time Frames Filter to process the ones you require only.",
            "updated": 1611513521057,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы также можете рассмотреть возможность применения фильтра таймфреймов для обработки только тех, которые вам нужны.",
                    "updated": 1640457959818
                },
                {
                    "language": "TR",
                    "text": "Ayrıca, yalnızca ihtiyaç duyduklarınızı işlemek için bir Zaman Çerçevesi Filtresi ( Time Frames Filter ) uygulamayı da düşünebilirsiniz.",
                    "updated": 1647864311455
                },
                {
                    "language": "DE",
                    "text": "Sie können auch einen Zeitrahmenfilter (Time Frames Filter) anwenden, um nur die von Ihnen benötigten Daten zu verarbeiten.",
                    "updated": 1678645185803
                }
            ]
        },
        {
            "style": "Title",
            "text": "Open Either the Design Space or the Charting Space",
            "translations": [
                {
                    "language": "RU",
                    "text": "Откройте либо пространство проектирования (Design Space), либо пространство построения диаграмм (Charting Space).",
                    "updated": 1640458004186
                },
                {
                    "language": "TR",
                    "text": "Tasarım Alanını veya Grafik Alanını Açın",
                    "updated": 1647864336763
                },
                {
                    "language": "DE",
                    "text": "Öffnen Sie entweder den Design-Bereich oder den Charting-Bereich",
                    "updated": 1678645195011
                }
            ]
        },
        {
            "style": "Text",
            "text": "Leaving the slider halfway up or down the screen causes both the design space and the charting space to consume resources. Make sure the slider is either fully up or down.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если оставить ползунок на полпути вверх или вниз по экрану, это приведет к расходованию ресурсов как пространства проектирования, так и пространства построения диаграмм. Убедитесь, что ползунок полностью поднят или опущен.",
                    "updated": 1640458035435
                },
                {
                    "language": "TR",
                    "text": "Kaydırıcıyı ekranın yarısında yukarı veya aşağı bırakmak, hem tasarım alanının hem de grafik alanının kaynakları tüketmesine neden olur. Kaydırıcının tamamen yukarı veya aşağı olduğundan emin olun.",
                    "updated": 1647864528970
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie den Schieberegler auf halber Höhe des Bildschirms belassen, verbrauchen sowohl der Designbereich als auch der Diagrammbereich Ressourcen. Stellen Sie sicher, dass der Schieberegler entweder ganz oben oder ganz unten ist.",
                    "updated": 1678645203862
                }
            ]
        },
        {
            "style": "Title",
            "text": "Display Less Data on the Charts",
            "translations": [
                {
                    "language": "RU",
                    "text": "Отображение меньшего количества данных на графиках",
                    "updated": 1640458050493
                },
                {
                    "language": "TR",
                    "text": "Grafiklerde Daha Az Veri Görüntüle",
                    "updated": 1647864547877
                },
                {
                    "language": "DE",
                    "text": "Weniger Daten in den Diagrammen anzeigen",
                    "updated": 1678645213314
                }
            ]
        },
        {
            "style": "Text",
            "text": "Make sure you set the Time Scale to manual mode and adjust it so that fewer candles are displayed on the screen. Try switching the time frame box to the higher time frames so that candle density decreases.",
            "updated": 1615810255059,
            "translations": [
                {
                    "language": "RU",
                    "text": "Убедитесь, что вы установили шкалу времени Time Scale в ручной режим и настроили ее так, чтобы на экране отображалось меньше свечей. Попробуйте переключить блок таймфреймов на более высокие таймфреймы, чтобы плотность свечей уменьшилась.",
                    "updated": 1640458142695
                },
                {
                    "language": "TR",
                    "text": "Zaman Ölçeğini ( Time Scale ) manuel moda ayarladığınızdan emin olun ve ekranda daha az mum görüntülenecek şekilde ayarlayın. Mum yoğunluğunu azaltmak için zaman çerçevesi kutusunu daha yüksek zaman çerçevelerine geçirmeyi deneyin.",
                    "updated": 1647864606251
                },
                {
                    "language": "DE",
                    "text": "Vergewissern Sie sich, dass Sie die Zeitskala (Time Scale) auf den manuellen Modus eingestellt haben, und stellen Sie sie so ein, dass weniger Kerzen auf dem Bildschirm angezeigt werden. Versuchen Sie, das Zeitrahmenfeld auf die höheren Zeitrahmen umzustellen, damit die Kerzendichte abnimmt.",
                    "updated": 1678645333567
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may also want to switch off the layers you may not be using. Remember, every piece of graphical information you see on the screen represents data your system is reading from your disk and processing to display in a graphical form.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы также можете отключить слои, которые вы, возможно, не используете. Помните, что каждый фрагмент графической информации, который вы видите на экране, представляет собой данные, которые ваша система считывает с диска и обрабатывает для отображения в графической форме.",
                    "updated": 1640458200380
                },
                {
                    "language": "TR",
                    "text": "Ayrıca kullanmadığınız katmanları kapatmak isteyebilirsiniz. Unutmayın, ekranda gördüğünüz her grafik bilgi parçası, sisteminizin diskinizden okuduğu ve grafik biçiminde görüntülemek için işlediği verileri temsil eder.",
                    "updated": 1647864641336
                },
                {
                    "language": "DE",
                    "text": "Vielleicht möchten Sie auch die Ebenen ausschalten, die Sie nicht benötigen. Denken Sie daran, dass jede grafische Information, die Sie auf dem Bildschirm sehen, Daten darstellt, die Ihr System von der Festplatte liest und verarbeitet, um sie in grafischer Form anzuzeigen.",
                    "updated": 1678645644028
                }
            ]
        },
        {
            "style": "Text",
            "text": "Also turn off the layers in the Trading Engine and Trading System layer managers. Those layers interact with the design space to show information in realtime over the trading engine and trading system hierarchies.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Также отключите слои в менеджерах слоев торгового движка и торговой системы. Эти слои взаимодействуют с пространством проектирования для отображения информации в реальном времени об иерархиях торгового движка и торговой системы.",
                    "updated": 1640458255908
                },
                {
                    "language": "TR",
                    "text": "Ayrıca Ticaret Motoru ( Trading Engine ) ve Ticaret Sistemi ( Trading System ) katman yöneticilerindeki katmanları kapatın. Bu katmanlar, ticaret motoru ve ticaret sistemi hiyerarşileri üzerindeki bilgileri gerçek zamanlı olarak göstermek için tasarım alanıyla etkileşime girer.",
                    "updated": 1647864688154
                },
                {
                    "language": "DE",
                    "text": "Deaktivieren Sie auch die Ebenen in den Ebenenmanagern von Trading Engine und Trading System. Diese Ebenen interagieren mit dem Designbereich, um Informationen in Echtzeit über die Trading Engine- und Trading System-Hierarchien anzuzeigen.",
                    "updated": 1678645655608
                }
            ]
        },
        {
            "style": "Title",
            "text": "Collapse Unused Hierarchies",
            "updated": 1611513572645,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сворачивание неиспользуемых иерархий",
                    "updated": 1640458369982
                },
                {
                    "language": "TR",
                    "text": "Kullanılmayan Hiyerarşileri Daralt",
                    "updated": 1647864709996
                },
                {
                    "language": "DE",
                    "text": "Unbenutzte Hierarchien einklappen",
                    "updated": 1678645662205
                }
            ]
        },
        {
            "style": "Text",
            "text": "The physics that govern nodes in the design space help structures of nodes to self-organize. This comes at a cost in terms of GPU processing power.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Физика, управляющая узлами в пространстве проектирования, помогает структурам узлов самоорганизовываться. За это приходится расплачиваться вычислительной мощностью GPU.",
                    "updated": 1640458420081
                },
                {
                    "language": "TR",
                    "text": "Tasarım alanındaki düğümleri yöneten fizik, düğüm yapılarının kendi kendine organize olmasına yardımcı olur. Bunun GPU işlem gücü açısından bir maliyeti vardır.",
                    "updated": 1647864731208
                },
                {
                    "language": "DE",
                    "text": "Die Physik, die die Knoten im Entwurfsraum regelt, hilft den Strukturen der Knoten, sich selbst zu organisieren. Dies hat seinen Preis in Form von GPU-Verarbeitungsleistung.",
                    "updated": 1678645679787
                }
            ]
        },
        {
            "style": "Text",
            "text": "Make sure all hierarchies you are not using are collapsed.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Убедитесь, что все иерархии, которые вы не используете, свернуты.",
                    "updated": 1640458431029
                },
                {
                    "language": "TR",
                    "text": "Kullanmadığınız tüm hiyerarşilerin daraltıldığından emin olun.",
                    "updated": 1647864749960
                },
                {
                    "language": "DE",
                    "text": "Stellen Sie sicher, dass alle Hierarchien, die Sie nicht verwenden, eingeklappt bzw. (Symbol: +/-) sind.",
                    "updated": 1678645689493
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may also want to close any of the structures of nodes that you may not be using within the hierarchy that you may need to expand.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы также можете закрыть все структуры узлов, которые вы, возможно, не используете в иерархии, которую вам, возможно, придется расширять.",
                    "updated": 1640458521682
                },
                {
                    "language": "TR",
                    "text": "Ayrıca, genişletmeniz gerekebilecek hiyerarşi içinde kullanmadığınız düğüm yapılarından herhangi birini kapatmak isteyebilirsiniz.",
                    "updated": 1647864767188
                },
                {
                    "language": "DE",
                    "text": "Sie können auch alle Strukturen von Knoten schließen, die Sie innerhalb der Hierarchie nicht verwenden und die Sie eventuell erweitern müssen.",
                    "updated": 1678645696224
                }
            ]
        },
        {
            "style": "Important",
            "text": "If these workarounds do not solve your problem and you often experience slowness or unresponsiveness when using your computer, you may want to consider upgrading your equipment. You shouldn’t risk your capital with an insufficient trading infrastructure.",
            "updated": 1611513583937,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если эти обходные пути не решили вашу проблему и вы часто сталкиваетесь с медлительностью или неотзывчивостью при работе с компьютером, возможно, вам стоит подумать о модернизации оборудования. Не стоит рисковать своим капиталом, используя недостаточно мощную торговую инфраструктуру.",
                    "updated": 1640458562032
                },
                {
                    "language": "TR",
                    "text": "Önemli: Bu geçici çözümler sorununuzu çözmüyorsa ve bilgisayarınızı kullanırken sık sık yavaşlama veya yanıt vermeme sorunu yaşıyorsanız, donanımınızı yükseltmeyi düşünebilirsiniz. Yetersiz bir ticaret altyapısı ile sermayenizi riske atmamalısınız.",
                    "updated": 1647864790024
                },
                {
                    "language": "DE",
                    "text": "Wenn diese Abhilfemaßnahmen Ihr Problem nicht lösen und Sie bei der Verwendung Ihres Computers häufig mit Langsamkeit oder Unempfindlichkeit zu kämpfen haben, sollten Sie eine Aufrüstung Ihrer Ausrüstung in Betracht ziehen. Sie sollten Ihr Kapital nicht mit einer unzureichenden Handelsinfrastruktur riskieren.",
                    "updated": 1678645750006
                }
            ]
        },
        {
            "style": "Title",
            "text": "See the Effects of Your Actions",
            "translations": [
                {
                    "language": "RU",
                    "text": "Наблюдайте за эффективностью своих действий",
                    "updated": 1640458594809
                },
                {
                    "language": "TR",
                    "text": "Eylemlerinizin Etkilerini Görün",
                    "updated": 1647864811040
                },
                {
                    "language": "DE",
                    "text": "Sehen Sie die Auswirkungen Ihrer Handlungen",
                    "updated": 1678645768667
                }
            ]
        },
        {
            "style": "Text",
            "text": "There’s a handy built-in tool to measure the performance of the animation that you may use to see the effects of turning off layers, lowering the density of information and so on.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Имеется удобный встроенный инструмент для измерения производительности анимации, который можно использовать, чтобы увидеть эффект от отключения слоев, снижения плотности информации и так далее.",
                    "updated": 1640458616372
                },
                {
                    "language": "TR",
                    "text": "Katmanları kapatmanın, bilgi yoğunluğunu düşürmenin vb. etkilerini görmek için kullanabileceğiniz, animasyonun performansını ölçmek için kullanışlı bir yerleşik araç vardır.",
                    "updated": 1647864827802
                },
                {
                    "language": "DE",
                    "text": "Es gibt ein praktisches integriertes Tool zur Messung der Leistung der Anwendung, mit dem Sie die Auswirkungen des Ausschaltens von Ebenen, der Verringerung der Informationsdichte usw. überprüfen können.",
                    "updated": 1678645778228
                }
            ]
        },
        {
            "style": "Text",
            "text": "Click Ctrl + Shift + Alt + F11 and the following performance readings will show up on your screen:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Нажмите Ctrl + Shift + Alt + F11, и на экране появятся следующие показания производительности:",
                    "updated": 1640458631180
                },
                {
                    "language": "TR",
                    "text": "Ctrl + Shift + Alt + F11'i tıkladığınızda ekranınızda aşağıdaki performans değerleri görünecektir:",
                    "updated": 1647864853212
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf Ctrl + Shift + Alt + F11 und die folgenden Leistungswerte werden auf Ihrem Bildschirm angezeigt:",
                    "updated": 1678645877512
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/charts/frames-per-second-tool.png",
            "updated": 1611513729958
        },
        {
            "style": "Text",
            "text": "The frame rate displayed at the bottom should increase the more of the actions suggested here you implement.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Частота кадров, отображаемая внизу, должна увеличиваться по мере выполнения предложенных здесь действий.",
                    "updated": 1640458738903
                },
                {
                    "language": "TR",
                    "text": "Altta görüntülenen kare hızı, burada önerilen eylemlerin daha fazlasını uyguladığınızda artacaktır.",
                    "updated": 1647864896188
                },
                {
                    "language": "DE",
                    "text": "Die unten angezeigte Bildrate sollte sich erhöhen, je mehr der hier vorgeschlagenen Maßnahmen Sie durchführen.",
                    "updated": 1678645895526
                }
            ]
        }
    ]
}