{
    "topic": "Troubleshooting",
    "pageNumber": "18",
    "type": "Problems With Computer Time",
    "definition": {
        "text": "Some exchanges force the computer that is running your bot to be highly synchronized with their servers, and to achieve that you need that machine's time to keep itself synchronized with an Internet Time Server.",
        "updated": 1622140103759,
        "translations": [
            {
                "language": "RU",
                "text": "Некоторые биржи заставляют компьютер, на котором запущен ваш бот, быть строго синхронизированным с их серверами, и для этого вам нужно, чтобы время на этом компьютере синхронизировалось с сервером времени в интернете.",
                "updated": 1640542919725
            },
            {
                "language": "TR",
                "text": "Özet: Bazı exchanges'ler, botunuzu çalıştıran bilgisayarı sunucularıyla yüksek düzeyde senkronize olmaya zorlar ve bunu başarmak için, o makinenin zamanının kendisini bir İnternet Zaman Sunucusu ile senkronize halde tutmasına ihtiyacınız vardır.",
                "updated": 1647875340345
            },
            {
                "language": "DE",
                "text": "Einige Börsen verlangen, dass der Computer, auf dem Ihr Bot läuft, in hohem Maße mit ihren Servern synchronisiert ist. Um dies zu erreichen, muss die Zeit dieses Rechners mit einem Internet-Zeitserver synchronisiert werden.",
                "updated": 1678650899255
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "How to identify this problem?",
            "updated": 1622140152661,
            "translations": [
                {
                    "language": "RU",
                    "text": "Как распознать эту проблему?",
                    "updated": 1640542935353
                },
                {
                    "language": "TR",
                    "text": "Bu problem nasıl tanımlanır?",
                    "updated": 1647875357390
                },
                {
                    "language": "DE",
                    "text": "Wie lässt sich dieses Problem erkennen?",
                    "updated": 1678650911304
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you receive an error like this, you are having this type of problem:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы получите ошибку, подобную этой, у вас проблема такого типа:",
                    "updated": 1640542958794
                },
                {
                    "language": "TR",
                    "text": "Böyle bir hata alırsanız, şu tür bir sorun yaşıyorsunuz:",
                    "updated": 1647875381071
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie eine solche Fehlermeldung erhalten, liegt ein solches Problem vor:",
                    "updated": 1678650921266
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "['2021-05-27T15:24:15.339Z',246,'Exchange API','[ERROR] createOrder -> \nError = binance {\"code\":-1021,\n\"msg\":\"Timestamp for this request is outside of the recvWindow.\"}'] \n@ Masters-Low-Frequency-Trading",
            "updated": 1622140198558
        },
        {
            "style": "Title",
            "text": "How to solve this problem?",
            "updated": 1622140378812,
            "translations": [
                {
                    "language": "RU",
                    "text": "Как решить эту проблему?",
                    "updated": 1640542972361
                },
                {
                    "language": "TR",
                    "text": "Bu sorun nasıl çözülür?",
                    "updated": 1647875402151
                },
                {
                    "language": "DE",
                    "text": "Wie lässt sich dieses Problem lösen?",
                    "updated": 1678650931718
                }
            ]
        },
        {
            "style": "Text",
            "text": "You can use the server time.nist.gov that has proven to work in this situation. Look for the place at your OS where you can change the Internet Time Settings and use that server there.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете использовать сервер time.nist.gov, который хорошо зарекомендовал себя в этой ситуации. Найдите в вашей ОС место, где можно изменить настройки времени через интернет, и используйте этот сервер там.",
                    "updated": 1640543022681
                },
                {
                    "language": "TR",
                    "text": "Bu durumda çalıştığı kanıtlanmış olan time.nist.gov sunucusunu kullanabilirsiniz. İşletim sisteminizde İnternet Saati Ayarlarını değiştirebileceğiniz yeri arayın ve o sunucuyu orada kullanın.",
                    "updated": 1647875415434
                },
                {
                    "language": "DE",
                    "text": "Sie können den Server time.nist.gov verwenden, der sich in dieser Situation bewährt hat. Suchen Sie in Ihrem Betriebssystem die Stelle, an der Sie die Internet-Zeiteinstellungen ändern können, und verwenden Sie dort diesen Server.",
                    "updated": 1678650952740
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Docker Users",
            "translations": [
                {
                    "language": "RU",
                    "text": "Пользователи Docker",
                    "updated": 1640543030616
                },
                {
                    "language": "TR",
                    "text": "Docker Kullanıcıları",
                    "updated": 1647875427038
                }
            ]
        },
        {
            "style": "Text",
            "text": "Sometimes Docker might not be in sync even though the underlying OS it is. To fix this, you can run this command, which will force Docker to restart and wsl to pickup the correct time from the OS.",
            "updated": 1622140496709,
            "translations": [
                {
                    "language": "RU",
                    "text": "Иногда Docker может быть не синхронизирован, хотя в базовой ОС он синхронизирован. Чтобы исправить это, вы можете выполнить эту команду, которая заставит Docker перезагрузиться, а wsl - получить правильное время из ОС.",
                    "updated": 1640543051123
                },
                {
                    "language": "TR",
                    "text": "Bazen Docker, temel işletim sistemi olmasına rağmen senkronize olmayabilir. Bunu düzeltmek için, Docker'ı yeniden başlatmaya ve wsl'yi işletim sisteminden doğru zamanı almaya zorlayacak olan bu komutu çalıştırabilirsiniz.",
                    "updated": 1647875438490
                },
                {
                    "language": "DE",
                    "text": "Manchmal kann es vorkommen, dass Docker nicht synchron ist, obwohl das zugrunde liegende Betriebssystem es ist. Um dies zu beheben, können Sie diesen Befehl ausführen, der einen Neustart von Docker erzwingt und wsl dazu bringt, die korrekte Zeit vom Betriebssystem zu übernehmen.",
                    "updated": 1678650967514
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "wsl --shutdown",
            "updated": 1622140514881
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}