{
    "topic": "Troubleshooting",
    "pageNumber": "1",
    "type": "How to Troubleshoot an Issue",
    "definition": {
        "text": "This Troubleshooting Guide teaches you the logical steps that will help you better understand the system and find solutions to most of the issues you may run into.",
        "updated": 1612874252158,
        "translations": [
            {
                "language": "RU",
                "text": "Это руководство по устранению неполадок научит вас логическим шагам, которые помогут вам лучше понять систему и найти решение большинства проблем, с которыми вы можете столкнуться.",
                "updated": 1640438728271
            },
            {
                "language": "TR",
                "text": "Özet: Bu Sorun Giderme Kılavuzu, sistemi daha iyi anlamanıza ve karşılaşabileceğiniz sorunların çoğuna çözümler bulmanıza yardımcı olacak mantıklı adımları öğretir.",
                "updated": 1647852036703
            },
            {
                "language": "DE",
                "text": "In dieser Anleitung zur Fehlerbehebung lernen Sie die logischen Schritte kennen, die Ihnen helfen, das System besser zu verstehen und Lösungen für die meisten Probleme zu finden, auf die Sie treffen könnten.",
                "updated": 1678640389706
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "There are several reasons why you may experience issues while using Superalgos. It may be due to a lack of understanding of how the system works, because you may be skipping a step or two in the process you are trying to engage with, or because something may not be working as it should.",
            "updated": 1611509396717,
            "translations": [
                {
                    "language": "RU",
                    "text": "Существует несколько причин, по которым вы можете столкнуться с проблемами при использовании Superalgos. Это может быть связано с непониманием того, как работает система, с тем, что вы пропускаете пару шагов в процессе, который вы пытаетесь осуществить, или с тем, что что-то может работать не так, как должно.",
                    "updated": 1640438814988
                },
                {
                    "language": "TR",
                    "text": "Superalgos'u kullanırken sorun yaşamanızın birkaç nedeni olabilir. Sistemin nasıl çalıştığını anlamamanızdan kaynaklanıyor olabilir, katılmaya çalıştığınız süreçte bir veya iki adımı atlıyor olabilirsiniz veya bir şey olması gerektiği gibi çalışmıyor olabilir.",
                    "updated": 1647852076876
                },
                {
                    "language": "DE",
                    "text": "Es gibt verschiedene Gründe, warum Sie bei der Verwendung von Superalgos Probleme haben können. Es kann daran liegen, dass Sie nicht verstehen, wie das System funktioniert, dass Sie einen oder zwei Schritte in dem Prozess, den Sie versuchen, zu nutzen, übersehen haben oder dass etwas nicht so funktioniert, wie es sollte.",
                    "updated": 1678640398666
                }
            ]
        },
        {
            "style": "Text",
            "text": "Whatever the reason may be, this page provides a step-by-step process that will help you understand what is going on so that your issue may be resolved in the most efficient possible way.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Какой бы ни была причина, на этой странице представлен пошаговый процесс, который поможет вам понять, что происходит, и решить вашу проблему наиболее эффективным способом.",
                    "updated": 1640438846074
                },
                {
                    "language": "TR",
                    "text": "Sebep ne olursa olsun, bu sayfa, sorununuzu mümkün olan en verimli şekilde çözebilmeniz için neler olup bittiğini anlamanıza yardımcı olacak adım adım bir süreç sunar.",
                    "updated": 1647852100004
                },
                {
                    "language": "DE",
                    "text": "Was auch immer der Grund sein mag, auf dieser Seite finden Sie eine Schritt-für-Schritt-Anleitung, die Ihnen helfen wird, die Vorgänge zu verstehen, damit Ihr Problem auf die effizienteste Weise gelöst werden kann.",
                    "updated": 1678640418985
                }
            ]
        },
        {
            "style": "Text",
            "text": "In other words, following this step-by-step troubleshooting guide will either lead you to discovering what you may be doing wrong so that you may fix your issue and move on, or to gathering all the relevant information required for the Team to investigate the issue.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Другими словами, следуя этому руководству по устранению неисправностей, вы либо узнаете, что вы делаете неправильно, чтобы устранить проблему и двигаться дальше, либо соберете всю необходимую информацию, необходимую команде для изучения проблемы.",
                    "updated": 1640438880663
                },
                {
                    "language": "TR",
                    "text": "Başka bir deyişle, bu adım adım sorun giderme kılavuzunu takip etmek, sizi ya sorununuzu düzeltip devam edebilmeniz için neyi yanlış yaptığınızı keşfetmenize ya da Ekibin sorunu araştırması için gereken tüm ilgili bilgileri toplamanıza yol açacaktır.",
                    "updated": 1647852188986
                },
                {
                    "language": "DE",
                    "text": "Mit anderen Worten: Wenn Sie diese Schritt-für-Schritt-Anleitung zur Fehlerbehebung befolgen, werden Sie entweder herausfinden, was Sie falsch gemacht haben, so dass Sie Ihr Problem beheben und weitermachen können, oder Sie werden alle relevanten Informationen sammeln, die das Team benötigt, um das Problem zu untersuchen.",
                    "updated": 1678640432237
                }
            ]
        },
        {
            "style": "Important",
            "text": "Thoroughly following this troubleshooting guide—step by step—is a requirement for reporting an issue or asking for help in the Support Group. We can not afford to investigate issues that you may solve on your own, or without the appropriate information. Doing so would rob the project of valuable resources.",
            "updated": 1612875019106,
            "translations": [
                {
                    "language": "RU",
                    "text": "Тщательное следование этому руководству по устранению неполадок - шаг за шагом - является обязательным условием для сообщения о проблеме или обращения за помощью в группу поддержки. Мы не можем позволить себе изучать проблемы, которые вы можете решить самостоятельно или без соответствующей информации. Это лишит проект полезных ресурсов.",
                    "updated": 1640438963788
                },
                {
                    "language": "TR",
                    "text": "Önemli: Bu sorun giderme kılavuzunu adım adım takip etmek, bir sorunu bildirmek veya Destek Grubundan ( Support Group ) yardım istemek için bir gerekliliktir. Kendi başınıza veya uygun bilgiler olmadan çözebileceğiniz sorunları araştırma lüksümüz yoktur. Bunu yapmak, projeyi değerli kaynaklardan yoksun bırakacaktır.",
                    "updated": 1647852280409
                },
                {
                    "language": "DE",
                    "text": "Die gründliche Befolgung dieser Anleitung zur Fehlerbehebung - Schritt für Schritt - ist Voraussetzung dafür, dass Sie ein Problem melden oder in der Support-Gruppe (Support Group) um Hilfe bitten können. Wir können es uns nicht leisten, Probleme zu untersuchen, die Sie selbst oder ohne die entsprechenden Informationen lösen könnten. Dadurch würden dem Projekt wertvolle Ressourcen entzogen.",
                    "updated": 1678640460067
                }
            ]
        },
        {
            "style": "Success",
            "text": "Before you even start troubleshooting, you should do all the tutorials available. This is the single best piece of advice you may get, as tutorials will teach you all the basic operations and will clarify most of the questions that derive from a lack of understanding of how the system works. Please, go to the First Steps Tutorials book and do some learning! Please do not ask for help before you do all tutorials!",
            "updated": 1612874358930,
            "translations": [
                {
                    "language": "RU",
                    "text": "Прежде чем приступать к устранению неполадок, необходимо изучить все доступные учебники. Это самый лучший совет, который вы можете получить, поскольку учебники научат вас всем основным операциям и прояснят большинство вопросов, которые возникают из-за непонимания того, как работает система. Пожалуйста, обратитесь к книге First Steps Tutorials и немного поучитесь! Пожалуйста, не обращайтесь за помощью до того, как вы изучите все учебники!",
                    "updated": 1640439035460
                },
                {
                    "language": "TR",
                    "text": "İpucu: Sorun gidermeye başlamadan önce, mevcut tüm öğreticileri yapmalısınız. Bu, alabileceğiniz en iyi tavsiyedir, çünkü öğreticiler size tüm temel işlemleri öğretecek ve sistemin nasıl çalıştığını anlama eksikliğinden kaynaklanan soruların çoğunu netleştirecektir. Lütfen İlk Adım Eğitimleri kitabına ( First Steps Tutorials ) gidin ve biraz öğrenin! Lütfen tüm dersleri yapmadan önce yardım istemeyin!",
                    "updated": 1647852388881
                },
                {
                    "language": "DE",
                    "text": "Bevor Sie mit der Fehlersuche beginnen, sollten Sie alle verfügbaren Tutorials durcharbeiten. Das ist der beste Ratschlag, den Sie bekommen können, denn in den Tutorials lernen Sie alle grundlegenden Vorgänge und können die meisten Fragen klären, die sich aus einem mangelnden Verständnis der Funktionsweise des Systems ergeben. Bitte schauen Sie sich das Buch Erste Schritte Tutorials (First Steps Tutorials) an und lernen Sie! Bitten Sie nicht um Hilfe, bevor Sie alle Tutorials gemacht haben!",
                    "updated": 1678640475133
                }
            ]
        },
        {
            "style": "Title",
            "text": "Start Here",
            "translations": [
                {
                    "language": "RU",
                    "text": "Начните здесь",
                    "updated": 1640439051077
                },
                {
                    "language": "TR",
                    "text": "Buradan başlayın",
                    "updated": 1647852412176
                },
                {
                    "language": "DE",
                    "text": "Hier beginnen",
                    "updated": 1678640481978
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "1. Understand what you are doing and how the feature works",
            "translations": [
                {
                    "language": "RU",
                    "text": "1. Разберитесь в том, что вы делаете и как работает функция",
                    "updated": 1640439094931
                },
                {
                    "language": "TR",
                    "text": "1. Ne yaptığınızı ve bu özelliğin nasıl çalıştığını anlayın.",
                    "updated": 1647852430336
                },
                {
                    "language": "DE",
                    "text": "1. Wie es funktioniert",
                    "updated": 1678640494637
                }
            ]
        },
        {
            "style": "List",
            "text": "If you are following the Welcome tutorial, read carefully and make sure you haven’t skipped any steps. Go back a few steps and try again.",
            "updated": 1612876297808,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы следуете руководству Welcome, прочитайте внимательно и убедитесь, что вы не пропустили ни одного шага. Вернитесь на несколько шагов назад и попробуйте еще раз.",
                    "updated": 1640439121889
                },
                {
                    "language": "TR",
                    "text": "Hoş Geldiniz eğitimindeyseniz, dikkatlice okuyun ve hiçbir adımı atlamadığınızdan emin olun. Birkaç adım geri gidin ve tekrar deneyin.",
                    "updated": 1647852574442
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie dem Willkommens-Tutorial folgen, lesen Sie es sorgfältig durch und stellen Sie sicher, dass Sie keine Schritte übersprungen haben. Gehen Sie nach Bedarf ein paar Schritte zurück und versuchen Sie es erneut.",
                    "updated": 1678640505884
                }
            ]
        },
        {
            "style": "List",
            "text": "If you are already using the system, take some time to search the Docs and read the topics related to the matters you are working with. Use the search box to search for the specific matter (backtesting, data mining, etc.)",
            "updated": 1612875081868,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы уже пользуетесь системой, уделите время поиску в документации и прочтите темы, относящиеся к вопросам, с которыми вы работаете. Используйте поисковую строку для поиска конкретного вопроса (бэктестинг, добыча данных и т.д.)",
                    "updated": 1640439152939
                },
                {
                    "language": "TR",
                    "text": "Halihazırda sistemi kullanıyorsanız, biraz zaman ayırarak Dokümanlar'da arama yapın ve üzerinde çalıştığınız konularla ilgili konuları okuyun. Belirli bir konuyu aramak için arama kutusunu kullanın, geriye dönük test, veri madenciliği vb.(backtesting, data mining, etc.)",
                    "updated": 1647852633275
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie das System bereits nutzen, nehmen Sie sich etwas Zeit, um die Dokumente zu durchsuchen und die Themen zu lesen, die mit den Themen, mit denen Sie arbeiten, zusammenhängen. Verwenden Sie das Suchfeld, um nach einem bestimmten Thema zu suchen (Backtesting, Data Mining usw.)",
                    "updated": 1678640525102
                }
            ]
        },
        {
            "style": "List",
            "text": "If you are having trouble with a specific node on the Design Space, open the menu and click the help button. The Docs will open with a description of what the node is and how it works. Read about the node, its parent node, and its offspring.",
            "updated": 1612876337693,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если у вас возникли проблемы с определенным узлом в Design Space, откройте меню и нажмите кнопку помощи. Откроются документы с описанием того, что это за узел и как он работает. Прочитайте об узле, его родительском узле и его потомках.",
                    "updated": 1640439179685
                },
                {
                    "language": "TR",
                    "text": "Tasarım Alanında ( Design Space ) belirli bir düğümle ilgili sorun yaşıyorsanız menüyü açın ve yardım düğmesine tıklayın. Dokümanlar, düğümün ne olduğuna ve nasıl çalıştığına ilişkin bir açıklamayla açılır. Düğüm, onun üst düğümü ve onun alt düğümleri hakkında bilgi edinin.",
                    "updated": 1647852730871
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie Probleme mit einem bestimmten Knoten im Designbereich (Design Space) haben, öffnen Sie das Menü und klicken Sie auf die Schaltfläche Hilfe. Die Docs werden mit einer Beschreibung des Knotens und seiner Funktionsweise geöffnet. Lesen Sie mehr über den Knoten, seinen übergeordneten Knoten und seine Folgeknoten.",
                    "updated": 1678640535669
                }
            ]
        },
        {
            "style": "List",
            "text": "If you are having trouble operating the charts, make sure you revisit the Welcome tutorial and the pages on Time Machines and Timeline Charts, and Scales.",
            "updated": 1612874724546,
            "translations": [
                {
                    "language": "RU",
                    "text": "If you are having trouble operating the charts, make sure you revisit the Welcome tutorial and the pages on Если у вас возникли трудности в работе с диаграммами, обязательно просмотрите учебник Welcome и страницы, посвященные Time Machines и Timeline Charts, а также Scales. and Timeline Charts, and Scales.",
                    "updated": 1640439270500
                },
                {
                    "language": "TR",
                    "text": "Çizelgeleri kullanmakta sorun yaşıyorsanız, Hoş Geldiniz eğitimini ( Welcome Tutorial ) ve Zaman Makineleri ve Zaman Çizelgesi Grafikleri ( Time Machines and Timeline Charts ) ve Ölçekler ( Scales ) sayfalarını tekrar ziyaret ettiğinizden emin olun.",
                    "updated": 1647853432621
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie Probleme mit der Bedienung der Diagramme haben, sollten Sie das Willkommens-Tutorial und die Seiten über Zeitleisten, Zeitleisten-Diagramme und Skalen (Time Machines and Timeline Charts, and Scales) noch einmal lesen. ",
                    "updated": 1678640549997
                }
            ]
        },
        {
            "style": "List",
            "text": "If you are not sure what you should search for, go to the User Manual book and scan the topics covered there. If you are serious about learning Superalgos, reading the whole User Manual will put you at the top of the food chain.",
            "updated": 1612874813098,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы не уверены в том, что вам следует искать, обратитесь к книге User Manual и просмотрите темы, затронутые в ней. Если вы серьезно относитесь к изучению Superalgos, прочтение всего руководства пользователя поставит вас на вершину пищевой цепочки.",
                    "updated": 1640439429836
                },
                {
                    "language": "TR",
                    "text": "Ne aramanız gerektiğinden emin değilseniz, Kullanım Kılavuzu ( User Manual ) kitabına gidin ve orada ele alınan konuları tarayın. Superalgos'u öğrenmek konusunda ciddiyseniz, Kullanım Kılavuzunun ( User Manual ) tamamını okumak sizi besin zincirinin en üstüne yerleştirecektir.",
                    "updated": 1647852877661
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie nicht sicher sind, wonach Sie suchen sollen, gehen Sie zum Benutzerhandbuch (User Manual) und lesen Sie die dort behandelten Themen. Wenn Sie Superalgos erlernen wollen, werden Sie sich durch das Lesen des gesamten Benutzerhandbuchs (User Manual) viel Wissen aneignen.",
                    "updated": 1678640560927
                }
            ]
        },
        {
            "style": "Success",
            "text": "There is no substitute for knowledge. The more you understand, the less time and effort you will waste with issues related to a lack of understanding, and the more focused your questions will be when asking for help. You may be inclined to take a shortcut and ask the community before doing your research. This may save you some time occasionally and may be appropriate in cases in which you need a little guidance or need to clear a quick doubt. However, the problem with lack of understanding is that it is a persistent condition until you deal with the root cause. The way to deal with the root cause is to take the time to do all the First Steps Tutorials and read the User Manual. Otherwise, you will find yourself dealing with the same constraints over and over again. Acquiring knowledge while being mindful of the Team’s time is the first step towards becoming a valuable member of the community.",
            "updated": 1612876358894,
            "translations": [
                {
                    "language": "RU",
                    "text": "Знания ничем не заменить. Чем больше вы понимаете, тем меньше времени и усилий вы потратите на решение проблем, связанных с непониманием, и тем более целенаправленными будут ваши вопросы при обращении за помощью. Вы можете быть склонны пойти коротким путем и спросить у сообщества, прежде чем проводить свои исследования. Это может сэкономить вам время и может быть уместно в случаях, когда вам нужно небольшое руководство или нужно быстро развеять сомнения. Однако проблема отсутствия понимания заключается в том, что это состояние сохраняется до тех пор, пока вы не разберетесь с его первопричиной. Способ устранения первопричины заключается в том, чтобы потратить время на прохождение всех уроков \"Первых шагов\" и чтение руководства пользователя. В противном случае вы будете сталкиваться с одними и теми же проблемами снова и снова. Приобретение знаний и бережное отношение к времени команды - это первый шаг к тому, чтобы стать ценным членом сообщества.",
                    "updated": 1640439496090
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bilginin yerini hiçbir şey tutamaz. Ne kadar çok anlarsanız, anlama eksikliği ile ilgili sorunlarla o kadar az zaman ve çaba harcarsınız ve yardım isterken sorularınız o kadar odaklanmış olur. Araştırmanızı yapmadan önce kısa yoldan gidip topluluğa sormaya meyilli olabilirsiniz. Bu, ara sıra size biraz zaman kazandırabilir ve küçük bir rehberliğe ihtiyaç duyduğunuz veya hızlı bir şüpheyi ortadan kaldırmanız gereken durumlarda uygun olabilir. Bununla birlikte, anlama eksikliği ile ilgili sorun, kök neden ile ilgilenene kadar kalıcı bir durum olmasıdır. Kök neden ile başa çıkmanın yolu, tüm İlk Adım Eğitimlerini yapmak ( First Steps Tutorials ) ve Kullanım Kılavuzunu ( User Manual ) okumak için zaman ayırmaktır. Aksi takdirde, kendinizi tekrar tekrar aynı kısıtlamalarla uğraşırken bulacaksınız. Ekibin zamanını göz önünde bulundurarak bilgi edinmek, topluluğun değerli bir üyesi olma yolundaki ilk adımdır.",
                    "updated": 1647853562529
                },
                {
                    "language": "DE",
                    "text": "Es gibt keinen Ersatz für das Wissen. Je mehr Sie verstehen, desto weniger Zeit und Mühe werden Sie mit Problemen verschwenden, die auf mangelndes Verständnis zurückzuführen sind, und desto gezielter werden Ihre Fragen sein, wenn Sie um Hilfe bitten. Vielleicht neigen Sie dazu, eine Abkürzung zu nehmen und die Community zu fragen, bevor Sie Nachforschungen anstellen. Dies kann Ihnen gelegentlich etwas Zeit sparen und in Fällen, in denen Sie eine kleine Hilfestellung benötigen oder einen schnellen Zweifel ausräumen müssen, durchaus angebracht sein. Das Problem mit dem mangelnden Verständnis ist jedoch, dass es ein dauerhafter Zustand ist, bis man die Ursache beseitigt hat. Um die Ursache zu beseitigen, müssen Sie sich die Zeit nehmen, alle Lernprogramme der ersten Schritte (First Steps Tutorials) zu absolvieren und das Benutzerhandbuch (User Manual) zu lesen. Andernfalls werden Sie immer wieder mit den gleichen Problemen konfrontiert. Sich Wissen anzueignen und gleichzeitig auf die Zeit des Teams Rücksicht zu nehmen, ist der erste Schritt, um ein wertvolles Mitglied der Gemeinschaft zu werden.",
                    "updated": 1678640576089
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "2. Scan the Troubleshooting topic",
            "updated": 1612875503760,
            "translations": [
                {
                    "language": "RU",
                    "text": "2. Просмотрите тему Troubleshooting (Устранение неполадок)",
                    "updated": 1640439551179
                },
                {
                    "language": "TR",
                    "text": "2. Sorun Giderme başlığını tarayın",
                    "updated": 1647853621936
                },
                {
                    "language": "DE",
                    "text": "2. Lesen Sie das Thema Fehlerbehebung",
                    "updated": 1678640585761
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": ""
        },
        {
            "style": "Text",
            "text": "Chances are someone else has experienced a similar issue as you may be experiencing now. We do our best to compile common issues into specific troubleshooting pages, so make sure you take a look there before moving on. This page is the first on the Troubleshooting topic. Find the rest in the TOC at the bottom of this page.",
            "updated": 1612876381614,
            "translations": [
                {
                    "language": "RU",
                    "text": "Возможно, кто-то уже сталкивался с подобной проблемой, с которой вы столкнулись сейчас. Мы делаем все возможное, чтобы собрать общие проблемы на специальных страницах по устранению неполадок, поэтому обязательно загляните туда, прежде чем двигаться дальше. Эта страница - первая в теме \"Устранение неполадок\". Остальные страницы находятся в TOC внизу этой страницы.",
                    "updated": 1640439585683
                },
                {
                    "language": "DE",
                    "text": "Es ist gut möglich, dass jemand anderes ein ähnliches Problem hatte, wie Sie es jetzt vielleicht haben. Wir tun unser Bestes, um häufige Probleme auf speziellen Seiten zur Fehlerbehebung zusammenzustellen, also schauen Sie dort nach, bevor Sie fortfahren. Diese Seite ist die erste zum Thema Fehlerbehebung. Die übrigen Seiten finden Sie im Inhaltsverzeichnis am Ende dieser Seite.",
                    "updated": 1678640596123
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "3. Is your processor stuck at 100%?",
            "translations": [
                {
                    "language": "RU",
                    "text": "3. Ваш процессор завис на 100%?",
                    "updated": 1640439729565
                },
                {
                    "language": "TR",
                    "text": "3. İşlemciniz %100'de mi?",
                    "updated": 1647853778811
                },
                {
                    "language": "DE",
                    "text": "3. Steht Ihr Prozessor auf 100%?",
                    "updated": 1678640604330
                }
            ]
        },
        {
            "style": "Text",
            "text": "Open your operating system’s task manager application and verify the CPU load while you reproduce the issue you are experiencing. If your CPU is running at 100% for more than 30 to 60 seconds, all sorts of problems may arise, as your hardware may not able to cope with what you may be trying to do.",
            "updated": 1612875430945,
            "translations": [
                {
                    "language": "RU",
                    "text": "Откройте приложение диспетчера задач вашей операционной системы и проверьте загрузку процессора, пока вы воспроизводите проблему, с которой вы столкнулись. Если ваш процессор работает на 100% в течение более 30-60 секунд, могут возникнуть всевозможные проблемы, так как ваше оборудование может не справиться с тем, что вы пытаетесь сделать.",
                    "updated": 1640439809065
                },
                {
                    "language": "TR",
                    "text": "İşletim sisteminizin görev yöneticisi uygulamasını açın ve yaşadığınız sorunu yeniden oluştururken CPU yükünü doğrulayın. CPU'nuz 30 ila 60 saniyeden fazla %100'de çalışıyorsa, donanımınız yapmaya çalıştığınız şeyle baş edemeyebileceğinden her türlü sorun ortaya çıkabilir.",
                    "updated": 1647853832475
                },
                {
                    "language": "DE",
                    "text": "Öffnen Sie die Task-Manager-Anwendung Ihres Betriebssystems und überprüfen Sie die CPU-Auslastung, während Sie das Problem reproduzieren, das bei Ihnen auftritt. Wenn Ihre CPU länger als 30 bis 60 Sekunden zu 100 % ausgelastet ist, können alle möglichen Probleme auftreten, da Ihre Hardware möglicherweise nicht in der Lage ist, das zu bewältigen, was Sie zu tun versuchen.",
                    "updated": 1678640613044
                }
            ]
        },
        {
            "style": "Text",
            "text": "If this is the case, try closing other applications that may be demanding CPU time, and follow the guidelines proposed in the Perception Issues - My System Gets Slow page to lower the demands on the processor.",
            "updated": 1612875476873,
            "translations": [
                {
                    "language": "RU",
                    "text": "В этом случае попробуйте закрыть другие приложения, которые могут требовать процессорного времени, и следуйте рекомендациям, предложенным на странице Perception Issues - My System Gets Slow, чтобы снизить нагрузку на процессор.",
                    "updated": 1640439836188
                },
                {
                    "language": "TR",
                    "text": "Bu durumda, CPU zamanı gerektirebilecek diğer uygulamaları kapatmayı deneyin ve işlemci üzerindeki talepleri azaltmak için Algılama Sorunları - Sistemim Yavaşlıyor ( Perception Issues - My System Gets Slow  ) sayfasında önerilen yönergeleri izleyin.",
                    "updated": 1647853911321
                },
                {
                    "language": "DE",
                    "text": "Wenn dies der Fall ist, versuchen Sie, andere Anwendungen zu schließen, die möglicherweise CPU-Zeit beanspruchen, und befolgen Sie die auf der Seite Störungen der Leistung - Mein System wird langsam (Perception Issues - My System Gets Slow), um die Anforderungen an den Prozessor zu senken.",
                    "updated": 1678640621881
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you may not reproduce the issue while your CPU is working at less than 100%, then that may have been the cause of the problem.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы не можете воспроизвести проблему, пока ваш процессор работает менее чем на 100%, то, возможно, причина проблемы в этом.",
                    "updated": 1640439891951
                },
                {
                    "language": "TR",
                    "text": "CPU'nuz %100'den daha düşük bir hızda çalışırken sorunu yeniden oluşturamazsanız, sorunun nedeni bu olabilir.",
                    "updated": 1647853944290
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie das Problem nicht finden können, während Ihre CPU mit weniger als 100 % arbeitet, kann dies die Ursache des Problems sein.",
                    "updated": 1678640636904
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "4. Does the issue persist when using the latest version of the software?",
            "translations": [
                {
                    "language": "RU",
                    "text": "4. Сохраняется ли проблема при использовании последней версии программного обеспечения?",
                    "updated": 1640439901423
                },
                {
                    "language": "TR",
                    "text": "4. Yazılımın en son sürümü kullanıldığında sorun devam ediyor mu?",
                    "updated": 1647853980176
                },
                {
                    "language": "DE",
                    "text": "4. Besteht das Problem auch bei Verwendung der neuesten Version der Software?",
                    "updated": 1678640658122
                }
            ]
        },
        {
            "style": "Text",
            "text": "Running the latest version of the software is virtually mandatory, as bugs affecting you may have already been solved. Make sure you are running the latest stable software version in the master branch of the Superalgos repository, or the latest software in the develop branch.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Запуск последней версии программного обеспечения практически обязателен, так как ошибки, затрагивающие вас, могут быть уже решены. Убедитесь, что вы используете последнюю стабильную версию ПО в ветке master репозитория Superalgos или последнюю версию ПО в ветке develop.",
                    "updated": 1640439927102
                },
                {
                    "language": "TR",
                    "text": "Sizi etkileyen hatalar zaten çözülmüş olabileceğinden, yazılımın en son sürümünü çalıştırmak neredeyse zorunludur. Superalgos deposunun ana dalında en son kararlı yazılım sürümünü veya geliştirme dalında en son yazılımı çalıştırdığınızdan emin olun.",
                    "updated": 1647854007066
                },
                {
                    "language": "DE",
                    "text": "Die Verwendung der neuesten Version der Software ist praktisch obligatorisch, da Fehler, die Sie betreffen, möglicherweise bereits behoben wurden. Stellen Sie sicher, dass Sie die neueste stabile Softwareversion im Master-Zweig des Superalgos-Repositorys oder die neueste Software im Entwicklungszweig verwenden.",
                    "updated": 1678640665653
                }
            ]
        },
        {
            "style": "Note",
            "text": "Making sure means installing the latest version, right now. You may run the App Update Command.",
            "updated": 1612875559806,
            "translations": [
                {
                    "language": "RU",
                    "text": "Убедиться в этом означает установить последнюю версию прямо сейчас. Вы можете запустить команду обновления приложения App Update Command.",
                    "updated": 1640439957268
                },
                {
                    "language": "TR",
                    "text": "Not: Emin olmak için, en son sürümü hemen şimdi yükleyin. Uygulama Güncelleme Komutunu ( App Update Command ) çalıştırabilirsiniz.",
                    "updated": 1647854096698
                },
                {
                    "language": "DE",
                    "text": "Um sicher zu gehen, dass die aktuelle Version installiert ist, führen Sie im Fenster \"Docs\" den Befehl \"app.update\" (App Update Command) durch.",
                    "updated": 1678640675834
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "5. Does the issue persist when using one of the Native Workspaces?",
            "updated": 1612875632190,
            "translations": [
                {
                    "language": "RU",
                    "text": "5. Сохраняется ли проблема при использовании одного из рабочих пространств плагина?",
                    "updated": 1640439969486
                },
                {
                    "language": "TR",
                    "text": "5. Eklenti çalışma alanlarından biri kullanıldığında sorun devammı ediyor?",
                    "updated": 1647854147663
                },
                {
                    "language": "DE",
                    "text": "5. Besteht das Problem auch bei Verwendung eines der Plugin-Arbeitsbereiche?",
                    "updated": 1678640684884
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the issue may not be reproduced using one of the Native Workspaces, that likely means that modifications you may have introduced may be playing a role in the issue. In and of itself, this is a crucial piece of information that helps start the process of isolating the issue.",
            "updated": 1612875627341,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если проблема не воспроизводится с помощью одного из рабочих пространств плагина, это, скорее всего, означает, что модификации, которые вы ввели, могут играть роль в проблеме. Сама по себе это важная информация, которая поможет начать процесс выявления проблемы.",
                    "updated": 1640440082099
                },
                {
                    "language": "TR",
                    "text": "Sorun, eklenti çalışma alanlarından biri kullanılarak yeniden oluşturulamıyorsa, bu, yapmış olabileceğiniz değişikliklerin sorunda rol oynuyor olabileceği anlamına gelir. Kendi içinde, bu, sorunu izole etme sürecini başlatmaya yardımcı olan önemli bir bilgi parçasıdır.",
                    "updated": 1647854227903
                },
                {
                    "language": "DE",
                    "text": "Wenn das Problem mit einem der Plugin-Arbeitsbereiche nicht reproduziert werden kann, bedeutet dies wahrscheinlich, dass von Ihnen vorgenommene Änderungen eine Rolle bei dem Problem spielen. Dies ist an sich schon eine wichtige Information, die hilft, das Problem einzugrenzen.",
                    "updated": 1678640693210
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the issue happens in a modified workspace only, take some time going through the modifications you introduced.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если проблема возникает только в измененном рабочем пространстве, потратьте некоторое время на то, чтобы просмотреть внесенные изменения.",
                    "updated": 1640440096152
                },
                {
                    "language": "TR",
                    "text": "Sorun yalnızca değiştirilmiş bir çalışma alanında ortaya çıkıyorsa, tanıttığınız değişiklikleri gözden geçirmek için biraz zaman ayırın.",
                    "updated": 1647854249106
                },
                {
                    "language": "DE",
                    "text": "Wenn das Problem nur in einem geänderten Arbeitsbereich auftritt, nehmen Sie sich etwas Zeit, um die von Ihnen vorgenommenen Änderungen zu überprüfen.",
                    "updated": 1678640703381
                }
            ]
        },
        {
            "style": "Text",
            "text": "Start over and reproduce the modifications on the Native Workspace, one at a time, and make a quick test after each mod is applied. This process done right should lead you to the exact node, structure of nodes, configuration, parameter, or—in general—the modification that may be involved in the cause of the issue.",
            "updated": 1612875667631,
            "translations": [
                {
                    "language": "RU",
                    "text": "Начните сначала и воспроизведите модификации на рабочем пространстве плагина, по одной за раз, и проведите быстрый тест после применения каждой модификации. Этот процесс, выполненный правильно, должен привести вас к тому, что вы найдете точный узел, структуру узлов, конфигурацию, параметр или - в общем - модификацию, которая может быть связана с причиной проблемы.",
                    "updated": 1640440158926
                },
                {
                    "language": "TR",
                    "text": "Eklenti çalışma alanındaki değişiklikleri birer birer yeniden başlatın ve yeniden oluşturun ve her mod uygulandıktan sonra hızlı bir test yapın. Doğru yapılan bu işlem sizi tam düğüme, düğümlerin yapısına, konfigürasyona, parametreye veya genel olarak sorunun nedenine dahil olabilecek değişikliğe yönlendirmelidir.",
                    "updated": 1647854291723
                },
                {
                    "language": "DE",
                    "text": "Beginnen Sie von vorne und reproduzieren Sie die Änderungen im Plugin-Arbeitsbereich, eine nach der anderen, und führen Sie nach jeder Änderung einen kurzen Test durch. Wenn Sie diesen Prozess richtig durchführen, sollten Sie den genauen Knoten, die Struktur der Knoten, die Konfiguration, den Parameter oder - ganz allgemein - die Änderung finden, die die Ursache für das Problem sein könnte.",
                    "updated": 1678640712801
                }
            ]
        },
        {
            "style": "Note",
            "text": "This doesn’t necessarily mean that you made a mistake when modifying the official workspace. It simply pinpoints where the problem may be, and it’s a crucial part of the investigation that you should conduct before going any further.",
            "updated": 1611509652152,
            "translations": [
                {
                    "language": "RU",
                    "text": "Это не обязательно означает, что вы допустили ошибку при модификации официального рабочего пространства. Это просто указывает на то, где может быть проблема, и является важной частью расследования, которое вы должны провести, прежде чем двигаться дальше.",
                    "updated": 1640440189688
                },
                {
                    "language": "TR",
                    "text": "Not: Bu, resmi çalışma alanını değiştirirken mutlaka bir hata yaptığınız anlamına gelmez. Sadece sorunun nerede olabileceğini tam olarak belirler ve daha ileri gitmeden önce yürütmeniz gereken soruşturmanın çok önemli bir parçasıdır.",
                    "updated": 1647854326601
                },
                {
                    "language": "DE",
                    "text": "Dies bedeutet nicht unbedingt, dass Sie bei der Änderung des offiziellen Arbeitsbereichs einen Fehler gemacht haben. Es zeigt lediglich, wo das Problem liegen könnte, und ist ein wichtiger Teil der Untersuchung, die Sie durchführen sollten, bevor Sie weitermachen.",
                    "updated": 1678640749324
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "6. Simplify the context and isolate the issue",
            "translations": [
                {
                    "language": "RU",
                    "text": "6. Упростите контекст и изолируйте проблему",
                    "updated": 1640440202305
                },
                {
                    "language": "TR",
                    "text": "6. Bağlamı basitleştirin ve sorunu izole edin",
                    "updated": 1647854369350
                },
                {
                    "language": "DE",
                    "text": "6. Vereinfachen Sie den Kontext und isolieren Sie das Problem",
                    "updated": 1678640783633
                }
            ]
        },
        {
            "style": "Text",
            "text": "When you are doing several things at the same time and something goes wrong, it is sometimes hard to identify what is it that may be causing the issue. The next logical step to take is to further isolate the issue. You do this by removing pieces from the context so that you may focus on the core of the matter.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда вы делаете несколько дел одновременно и что-то идет не так, иногда трудно определить, что именно может быть причиной проблемы. Следующим логичным шагом будет дальнейшая изоляция проблемы. Для этого нужно удалить части из контекста, чтобы сосредоточиться на сути вопроса.",
                    "updated": 1640440222900
                },
                {
                    "language": "TR",
                    "text": "Aynı anda birkaç şey yaptığınızda ve bir şeyler ters gittiğinde, soruna neyin neden olabileceğini belirlemek bazen zor olabilir. Atılacak bir sonraki mantıklı adım, sorunu daha da izole etmektir. Bunu, konunun özüne odaklanabilmeniz için bağlamdan parçaları çıkararak yaparsınız.",
                    "updated": 1647854399604
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie mehrere Dinge gleichzeitig tun und etwas schief geht, ist es manchmal schwer zu erkennen, was die Ursache des Problems ist. Der nächste logische Schritt besteht dann darin, das Problem weiter zu isolieren. Dazu werden Teile aus dem Zusammenhang gerissen, so dass man sich auf den Kern des Problems konzentrieren kann.",
                    "updated": 1678640791451
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Например:",
                    "updated": 1640440230662
                },
                {
                    "language": "TR",
                    "text": "Örnek:",
                    "updated": 1647854413983
                },
                {
                    "language": "DE",
                    "text": "Zum Beispiel:",
                    "updated": 1678640797421
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you are having an issue while backtesting a strategy, you do not need your data mining operation to be running. In such a case, stop the data mining operation and everything else you may be doing, and run the backtest only.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если у вас возникла проблема во время бэктестирования стратегии, вам не нужно, чтобы операция по добыче данных была запущена. В этом случае остановите операцию добычи данных и все остальное, что вы можете делать, и запустите только бэктест.",
                    "updated": 1640440269656
                },
                {
                    "language": "TR",
                    "text": "Bir stratejiyi geriye dönük test ederken bir sorun yaşıyorsanız, veri madenciliği operasyonunuzun çalışıyor olması gerekmez. Böyle bir durumda, veri madenciliği işlemini ve yaptığınız diğer her şeyi durdurun ve yalnızca geriye dönük testi çalıştırın.",
                    "updated": 1647854443299
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie beim Backtesting einer Strategie ein Problem haben, brauchen Sie Ihre Data-Mining-Operation nicht laufen zu lassen. Beenden Sie in einem solchen Fall die Data-Mining-Operation und alle anderen Aktivitäten und führen Sie nur den Backtest durch.",
                    "updated": 1678640810429
                }
            ]
        },
        {
            "style": "List",
            "text": "If you are having an issue running one of the Masters indicators, you do not need all indicators to be running at the same time. Make sure the said indicator dependencies are running, and stop the rest of the indicators.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если у вас возникла проблема с запуском одного из индикаторов Masters, вам не нужно, чтобы все индикаторы были запущены одновременно. Убедитесь, что указанные зависимости индикатора запущены, и остановите остальные индикаторы.",
                    "updated": 1640440295959
                },
                {
                    "language": "TR",
                    "text": "Ana göstergelerden birini çalıştırırken sorun yaşıyorsanız, tüm göstergelerin aynı anda çalışıyor olması gerekmez. Söz konusu gösterge bağımlılıklarının çalıştığından emin olun ve geri kalan göstergeleri durdurun.",
                    "updated": 1647854471218
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie Probleme bei der Ausführung eines der Master-Indikatoren haben, müssen nicht alle Indikatoren gleichzeitig ausgeführt werden. Vergewissern Sie sich, dass die genannten Indikatorabhängigkeiten ausgeführt werden, und stoppen Sie die übrigen Indikatoren.",
                    "updated": 1678640844472
                }
            ]
        },
        {
            "style": "List",
            "text": "If you are having an issue with a chart and you have three other charts on the screen at the same time, try zooming-in the chart and see if you still experience the issue. Or turn all layers off and leave on only the layer you may be having difficulties with.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если у вас возникла проблема с графиком, а на экране одновременно находятся три других графика, попробуйте приблизить график и посмотреть, сохранится ли проблема. Или отключите все слои и оставьте только тот слой, с которым у вас возникли проблемы.",
                    "updated": 1640440325573
                },
                {
                    "language": "TR",
                    "text": "Bir grafikle ilgili bir sorununuz varsa ve aynı anda ekranda üç grafiğiniz daha varsa, grafiği yakınlaştırmayı deneyin ve sorunla karşılaşmaya devam edip etmediğinizi görün. Veya tüm katmanları kapatın ve yalnızca zorluk yaşayabileceğiniz katmanı bırakın.",
                    "updated": 1647854506142
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie ein Problem mit einem Diagramm haben und gleichzeitig drei andere Diagramme auf dem Bildschirm angezeigt werden, zoomen Sie das Diagramm heran und sehen Sie, ob das Problem weiterhin besteht. Oder schalten Sie alle Ebenen aus und lassen Sie nur die Ebene, mit der Sie Probleme haben, eingeschaltet.",
                    "updated": 1678640858776
                }
            ]
        },
        {
            "style": "List",
            "text": "If you are running multiple live trading sessions and experience an issue with one of them, stop the rest of the sessions and try to reproduce the issue with the first one.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы проводите несколько торговых сессий в реальном времени и столкнулись с проблемой в одной из них, остановите остальные сессии и попытайтесь воспроизвести проблему в первой сессии.",
                    "updated": 1640440344166
                },
                {
                    "language": "TR",
                    "text": "Birden fazla canlı ticaret seansı yürütüyorsanız ve bunlardan birinde sorun yaşıyorsanız, kalan seansları durdurun ve sorunu ilkinde yeniden oluşturmaya çalışın.",
                    "updated": 1647854574212
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie mehrere Live-Handelssitzungen durchführen und bei einer von ihnen ein Problem auftritt, beenden Sie die übrigen Sitzungen und versuchen Sie, das Problem mit der ersten Sitzung zu reproduzieren.",
                    "updated": 1678640869979
                }
            ]
        },
        {
            "style": "Note",
            "text": "The point to take home is that the narrower the scope of the investigation, the easier it is to find the cause of the problem.",
            "updated": 1611509672765,
            "translations": [
                {
                    "language": "RU",
                    "text": "Главное, что следует уяснить: чем меньше масштаб расследования, тем легче найти причину проблемы.",
                    "updated": 1640440356085
                },
                {
                    "language": "TR",
                    "text": "Not: Dikkate alınması gereken nokta, soruşturmanın kapsamı ne kadar dar olursa, sorunun nedenini bulmanın o kadar kolay olduğudur.",
                    "updated": 1647854621052
                },
                {
                    "language": "DE",
                    "text": "Je enger der Untersuchungsrahmen gefasst ist, desto einfacher ist es, die Ursache des Problems zu finden.",
                    "updated": 1678640882563
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "7. May this be an issue with data?",
            "translations": [
                {
                    "language": "RU",
                    "text": "7. Может ли это быть проблемой с данными?",
                    "updated": 1640440367797
                },
                {
                    "language": "TR",
                    "text": "7. Bu bir veri sorunu olabilir mi?",
                    "updated": 1647854674514
                },
                {
                    "language": "DE",
                    "text": "7. Kann dies ein Problem mit den Daten sein?",
                    "updated": 1678640890555
                }
            ]
        },
        {
            "style": "Text",
            "text": "If your machine shut down unexpectedly or you closed the backend servers running in the console application without first stopping your data mining tasks, chances are some of your data may have been corrupted. If you suspect this may have something to do with your issue, then you should read Investigating Issues - Check the Integrity of Your Data.",
            "updated": 1612875847548,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если ваша машина неожиданно выключилась или вы закрыли внутренние серверы, запущенные в консольном приложении, не остановив предварительно задачи по добыче данных, есть вероятность, что некоторые из ваших данных были повреждены. Если вы подозреваете, что это может иметь отношение к вашей проблеме, то вам следует прочитать статью Investigating Issues - Check the Integrity of Your Data.",
                    "updated": 1640440501511
                },
                {
                    "language": "TR",
                    "text": "Makineniz beklenmedik bir şekilde kapandıysa veya veri madenciliği görevlerinizi durdurmadan konsol uygulamasında çalışan arka uç sunucularını kapattıysanız, verilerinizin bir kısmı bozulmuş olabilir. Bunun sorununuzla ilgili olabileceğinden şüpheleniyorsanız, Sorunların İncelenmesi - Verilerinizin Bütünlüğünü Kontrol Edin ( Investigating Issues - Check the Integrity of Your Data ) bölümünü okumalısınız.",
                    "updated": 1647854729747
                },
                {
                    "language": "DE",
                    "text": "Wenn Ihr Rechner unerwartet heruntergefahren wurde oder Sie die in der Konsolenanwendung laufenden Backend-Server geschlossen haben, ohne zuvor Ihre Data-Mining-Aufgaben zu beenden, sind möglicherweise einige Ihrer Daten beschädigt worden. Wenn Sie vermuten, dass dies etwas mit Ihrem Problem zu tun haben könnte, sollten Sie im Abschnitt Probleme danach suchen - Überprüfen Sie die Integrität Ihrer Daten (Investigating Issues - Check the Integrity of Your Data).",
                    "updated": 1678640899113
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "8. May this be an issue with the GUI?",
            "updated": 1612875863222,
            "translations": [
                {
                    "language": "RU",
                    "text": "8. Может ли это быть проблемой с графическим интерфейсом?",
                    "updated": 1640440513629
                },
                {
                    "language": "TR",
                    "text": "8. Grafiksel Kullanıcı Arayüzü ( GUI ) ile ilgili bir sorun olabilir mi?",
                    "updated": 1647854836938
                },
                {
                    "language": "DE",
                    "text": "8. Kann dies ein Problem mit der grafischen Benutzeroberfläche sein?",
                    "updated": 1678640910047
                }
            ]
        },
        {
            "style": "Text",
            "text": "If your issue happens within the GUI, then you should either be getting an on-screen error or an error on your browser console application.",
            "updated": 1612875875780,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если проблема возникает в графическом интерфейсе, то вы должны получить либо ошибку на экране, либо ошибку в консольном приложении браузера.",
                    "updated": 1640440530738
                },
                {
                    "language": "TR",
                    "text": "Sorununuz GUI'de ortaya çıkıyorsa, ekranda bir hata veya tarayıcı konsolu uygulamanızda bir hata alıyor olmalısınız.",
                    "updated": 1647854857784
                },
                {
                    "language": "DE",
                    "text": "Wenn Ihr Problem innerhalb der grafischen Benutzeroberfläche auftritt, sollten Sie entweder eine Fehlermeldung auf dem Bildschirm oder eine Fehlermeldung in der Browser-Konsole erhalten.",
                    "updated": 1678641335659
                }
            ]
        },
        {
            "style": "Text",
            "text": "The error on-screen or logged at the browser console may give you a hint of what may be going on. If you are a technical person, this may help solve your issue on your own.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Ошибка на экране или в журнале консоли браузера может дать вам подсказку о том, что может происходить. Если вы технический специалист, это может помочь решить проблему самостоятельно.",
                    "updated": 1640440552891
                },
                {
                    "language": "TR",
                    "text": "Ekrandaki veya tarayıcı konsolunda kaydedilen hata, neler olabileceğine dair bir ipucu verebilir. Teknik bir kişiyseniz, bu sorununuzu kendi başınıza çözmenize yardımcı olabilir.",
                    "updated": 1647854877326
                },
                {
                    "language": "DE",
                    "text": "Die Fehlermeldung auf dem Bildschirm oder in der Browser-Konsole kann Ihnen einen Hinweis auf das Problem geben. Wenn Sie technisch versiert sind, kann dies helfen, Ihr Problem selbst zu lösen.",
                    "updated": 1678641341085
                }
            ]
        },
        {
            "style": "Note",
            "text": "Make sure you grab the screen showing these errors so that you may report them later.",
            "updated": 1611509685850,
            "translations": [
                {
                    "language": "RU",
                    "text": "Обязательно захватите экран с этими ошибками, чтобы потом сообщить о них.",
                    "updated": 1640440588809
                },
                {
                    "language": "TR",
                    "text": "Not: Daha sonra rapor edebilmek için bu hataları gösteren ekranı aldığınızdan emin olun.",
                    "updated": 1647854891374
                },
                {
                    "language": "DE",
                    "text": "Zeichnen Sie unbedingt den Bildschirm auf, auf dem diese Fehler angezeigt werden, damit Sie sie später melden können.",
                    "updated": 1678641354664
                }
            ]
        },
        {
            "style": "Important",
            "text": "Remember that Chrome and Safari on Mac are the only supported browsers. If you are using any other browsers and have GUI issues, we may not be able to reproduce them. Do not report an issue with the GUI unless you are using Chrome or Safari.",
            "updated": 1612876423477,
            "translations": [
                {
                    "language": "RU",
                    "text": "Помните, что Chrome и Safari на Mac являются единственными поддерживаемыми браузерами. Если вы используете другие браузеры и у вас возникли проблемы с графическим интерфейсом, мы не сможем их воспроизвести. Не сообщайте о проблемах с графическим интерфейсом, если вы не используете Chrome или Safari.",
                    "updated": 1640440693840
                },
                {
                    "language": "TR",
                    "text": "Önemli: Yalnızca Mac'te Chrome ve Safari'nin desteklenen tarayıcılar olduğunu unutmayın. Başka bir tarayıcı kullanıyorsanız ve GUI sorunlarınız varsa, bunları yeniden oluşturamayabiliriz. Chrome veya Safari kullanmıyorsanız GUI ile ilgili bir sorunu rapor etmeyin.",
                    "updated": 1647854942564
                },
                {
                    "language": "DE",
                    "text": "Denken Sie daran, dass Chrome und Safari auf dem Mac die einzigen unterstützten Browser sind. Wenn Sie einen anderen Browser verwenden und Probleme mit der Benutzeroberfläche haben, können wir diese möglicherweise nicht reproduzieren. Melden Sie keine Probleme mit der grafischen Benutzeroberfläche, wenn Sie nicht Chrome oder Safari verwenden.",
                    "updated": 1678641376932
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "9. May this be an issue with the Client application?",
            "updated": 1612875983271,
            "translations": [
                {
                    "language": "RU",
                    "text": "9. Может ли это быть проблемой клиентского приложения?",
                    "updated": 1640440717814
                },
                {
                    "language": "TR",
                    "text": "9. Bu, İstemci ( Client ) uygulamasıyla ilgili bir sorun olabilir mi?",
                    "updated": 1647854986851
                },
                {
                    "language": "DE",
                    "text": "9. Kann dies ein Problem mit der Client-Anwendung sein?",
                    "updated": 1678641389629
                }
            ]
        },
        {
            "style": "Text",
            "text": "If there are issues with the Client application, then errors must be logged at the console where you are running the backend. The same errors are logged in the Log-Files folder and the specific sub-folders corresponding to the processes involved in the matter.",
            "updated": 1612875992279,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если возникают проблемы с приложением Client, то ошибки должны регистрироваться на консоли, на которой запущен бэкэнд. Эти же ошибки регистрируются в папке Log-Files и в конкретных подпапках, соответствующих процессам, вовлеченным в это дело.",
                    "updated": 1640440746785
                },
                {
                    "language": "TR",
                    "text": "İstemci ( Client ) uygulamasıyla ilgili sorunlar varsa, hataların arka ucu çalıştırdığınız konsolda günlüğe kaydedilmesi gerekir. Aynı hatalar, Günlük Dosyaları klasörüne ve konuyla ilgili işlemlere karşılık gelen belirli alt klasörlere kaydedilir.",
                    "updated": 1647855040692
                },
                {
                    "language": "DE",
                    "text": "Wenn es Probleme mit der Client -Anwendung gibt, müssen die Fehler auf der Konsole protokolliert werden, auf der Sie das Backend ausführen. Die gleichen Fehler werden im Ordner \"Log-Files\" und in den spezifischen Unterordnern, die den betroffenen Prozessen entsprechen, protokolliert.",
                    "updated": 1678641408927
                }
            ]
        },
        {
            "style": "Note",
            "text": "Make sure you check the logs for the specific processes involved in the mater, and save the corresponding log files with these errors so that you may report them later.",
            "updated": 1612876447343,
            "translations": [
                {
                    "language": "RU",
                    "text": "Обязательно проверьте журналы регистрации конкретных процессов, связанных с этим вопросом, и сохраните соответствующие файлы журналов с этими ошибками, чтобы впоследствии сообщить о них.",
                    "updated": 1640440882329
                },
                {
                    "language": "TR",
                    "text": "Not: Materyalle ilgili belirli işlemler için günlükleri kontrol ettiğinizden emin olun ve daha sonra rapor edebilmek için ilgili günlük dosyalarını bu hatalarla birlikte kaydedin.",
                    "updated": 1647855067263
                },
                {
                    "language": "DE",
                    "text": "Überprüfen Sie unbedingt die Protokolle für die spezifischen Prozesse, die an der Datenübertragung beteiligt sind, und speichern Sie die entsprechenden Protokolldateien mit diesen Fehlern, damit Sie sie später melden können.",
                    "updated": 1678641419086
                }
            ]
        },
        {
            "style": "Success",
            "text": "If you are a developer, remember that you may easily debug a task to find the root cause of the issue. Read Debugging a Task.",
            "updated": 1612876057032,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы разработчик, помните, что вы можете легко провести отладку задачи, чтобы найти первопричину проблемы. Читайте статью Debugging a Task.",
                    "updated": 1640440945042
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bir geliştiriciyseniz, sorunun temel nedenini bulmak için bir görevde kolaylıkla hata ayıklayabileceğinizi unutmayın. Bir Görevde Hata Ayıklama'yı ( Debugging a Task ) okuyun.",
                    "updated": 1647855123616
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie ein Entwickler sind, denken Sie daran, dass Sie eine Aufgabe leicht überprüfen können, um die Grundursache des Problems zu finden. Lesen Sie Debugging einer Aufgabe (Debugging a Task).",
                    "updated": 1678641442629
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "10. May this be an issue related to your particular setup?",
            "translations": [
                {
                    "language": "RU",
                    "text": "10. Может ли это быть проблемой, связанной с вашей конкретной установкой?",
                    "updated": 1640440957598
                },
                {
                    "language": "TR",
                    "text": "10. Bu sizin özel kurulumunuzla ilgili bir sorun olabilir mi?",
                    "updated": 1647855177278
                },
                {
                    "language": "DE",
                    "text": "10. Könnte es sich um ein Problem handeln, das mit Ihrer speziellen Arbeitsweise zusammenhängt?",
                    "updated": 1678641473150
                }
            ]
        },
        {
            "style": "Text",
            "text": "Deploying and running Superalgos in complex or very particular setups augments the probability of issues related to the setup itself, which may be very hard or even impossible for the Team to reproduce. The team will investigate issues that happen while running Superalgos in your local machine, or while running in a classic trading farm setup as described in the documentation. We can not investigate issues unrelated to the software itself.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Развертывание и запуск Superalgos в сложных или очень специфических установках увеличивает вероятность возникновения проблем, связанных с самой установкой, которые команде может быть очень сложно или даже невозможно воспроизвести. Команда будет исследовать проблемы, возникающие при запуске Superalgos на вашей локальной машине или при работе в классической конфигурации торговой фермы, как описано в документации. Мы не можем исследовать проблемы, не связанные с самим программным обеспечением.",
                    "updated": 1640440994472
                },
                {
                    "language": "TR",
                    "text": "Superalgos'u karmaşık veya çok özel kurulumlarda dağıtmak ve çalıştırmak, kurulumun kendisiyle ilgili, Ekibin yeniden oluşturması çok zor veya hatta imkansız olabilecek sorunların olasılığını artırır. Ekip, yerel makinenizde Superalgos çalıştırırken veya belgelerde açıklandığı gibi klasik bir ticaret çiftliği kurulumunda çalışırken meydana gelen sorunları araştıracaktır. Yazılımın kendisiyle ilgili olmayan sorunları araştıramayız.",
                    "updated": 1647855222411
                },
                {
                    "language": "DE",
                    "text": "Der Einsatz und Betrieb von Superalgos in komplexen oder sehr speziellen Setups erhöht die Wahrscheinlichkeit von Problemen, die mit dem Setup selbst zusammenhängen und die für das Team sehr schwer oder sogar unmöglich zu reproduzieren sind. Das Team wird Probleme untersuchen, die beim Betrieb von Superalgos auf Ihrem lokalen Rechner oder in einer klassischen Handelsfarm auftreten, wie in der Dokumentation beschrieben. Wir können keine Probleme untersuchen, die nicht mit der Software selbst zusammenhängen.",
                    "updated": 1678641493108
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you have issues with a particular setup, feel free to ask for help from other users in the community, but do not open an issue for the Team to look into.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если у вас возникли проблемы с конкретной настройкой, не стесняйтесь просить помощи у других пользователей сообщества, но не открывайте проблему для рассмотрения командой.",
                    "updated": 1640441017785
                },
                {
                    "language": "TR",
                    "text": "Belirli bir kurulumla ilgili sorunlarınız varsa, topluluktaki diğer kullanıcılardan yardım istemekten çekinmeyin, ancak Ekibin incelemesi için bir sorun açmayın.",
                    "updated": 1647855252086
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie Probleme mit einer bestimmten Einrichtung haben, können Sie andere Benutzer in der Community um Hilfe bitten, aber öffnen Sie kein Problem, das das Team untersuchen kann.",
                    "updated": 1678641518917
                }
            ]
        },
        {
            "style": "Title",
            "text": "Has Your Issue Not Been Resolved?",
            "translations": [
                {
                    "language": "RU",
                    "text": "Ваш вопрос не был решен?",
                    "updated": 1640441027788
                },
                {
                    "language": "TR",
                    "text": "Sorununuz Çözülmedi mi?",
                    "updated": 1647855273950
                },
                {
                    "language": "DE",
                    "text": "Wurde Ihr Problem noch nicht gelöst?",
                    "updated": 1678641525066
                }
            ]
        },
        {
            "style": "Text",
            "text": "If following this guide didn’t solve your issue, do not worry… your efforts shall not go in vain!",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если это руководство не помогло решить вашу проблему, не волнуйтесь... ваши усилия не пропадут даром!",
                    "updated": 1640441039564
                },
                {
                    "language": "TR",
                    "text": "Bu kılavuzu takip etmek sorununuzu çözmediyse endişelenmeyin… çabalarınız boşa gitmeyecek!",
                    "updated": 1647855287565
                },
                {
                    "language": "DE",
                    "text": "Wenn diese Anleitung Ihr Problem nicht gelöst hat, machen Sie sich keine Sorgen... Ihre Bemühungen werden nicht umsonst gewesen sein!",
                    "updated": 1678641533935
                }
            ]
        },
        {
            "style": "Text",
            "text": "Investigating your issue must have taught you a lot about how the system works, and it’s a requisite for reporting an issue so that the Team may investigate it. So, please, go ahead and do just that. Make sure you follow the instructions on How to Report an Issue and provide all the valuable information you have gathered while following this guide.",
            "updated": 1611509744676,
            "translations": [
                {
                    "language": "RU",
                    "text": "Изучение вашей проблемы должно было многому научить вас о том, как работает система, а это обязательное условие для сообщения о проблеме, чтобы команда могла ее изучить. Поэтому, пожалуйста, сделайте это. Обязательно следуйте инструкциям раздела How to Report an Issue (\"Как сообщить о проблеме\") и предоставьте всю полезную информацию, которую вы собрали, следуя этому руководству.",
                    "updated": 1640441099531
                },
                {
                    "language": "TR",
                    "text": "Sorununuzu araştırmak, sistemin nasıl çalıştığı hakkında size çok şey öğretmiş olmalı ve Ekibin bunu araştırabilmesi için bir sorunu bildirmeniz şarttır. O yüzden lütfen devam edin ve bunu yapın. Bir Sorun Nasıl Bildirilir ( How to Report an Issue ) konusundaki talimatları uyguladığınızdan ve bu kılavuzu takip ederken topladığınız tüm değerli bilgileri sağladığınızdan emin olun.",
                    "updated": 1647855398429
                },
                {
                    "language": "DE",
                    "text": "Durch die Untersuchung Ihres Problems haben Sie sicher viel über die Funktionsweise des Systems gelernt, und das ist eine Voraussetzung für die Meldung eines Problems, damit das Team es untersuchen kann. Machen Sie also bitte weiter und tun Sie genau das. Befolgen Sie die Anweisungen zum Melden eines Problems    (How to Report an Issue) und geben Sie alle wertvollen Informationen an, die Sie während der Lektüre dieser Anleitung gesammelt haben.",
                    "updated": 1678641560925
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}