{
    "topic": "Troubleshooting",
    "pageNumber": "8",
    "type": "Perception Issues - Market Data or Indicators Seem to be Outdated",
    "definition": {
        "text": "For data to be up to date, the Masters and Sparta task managers need to be running.",
        "updated": 1611514061066,
        "translations": [
            {
                "language": "RU",
                "text": "Для того чтобы данные были актуальными, необходимо, чтобы были запущены менеджеры задач Masters и Sparta.",
                "updated": 1640460435041
            },
            {
                "language": "TR",
                "text": "Özet: Verilerin güncel olması için Masters ve Sparta görev yöneticilerinin çalışıyor olması gerekir.",
                "updated": 1647865906200
            },
            {
                "language": "DE",
                "text": "Damit die Daten auf dem neuesten Stand sind, müssen die Aufgabenmanager Masters und Sparta laufen.",
                "updated": 1678647246081
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If you are running the system for the first time or you stopped running the system for some time, data will not be up to date. Every time you start the system, it will take some time for data to catch up with the present time.",
            "updated": 1611514064800,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы запускаете систему впервые или на некоторое время прекратили ее работу, данные будут неактуальны. Каждый раз, когда вы запускаете систему, потребуется некоторое время, чтобы данные соответствовали текущему времени.",
                    "updated": 1640460453589
                },
                {
                    "language": "TR",
                    "text": "Sistemi ilk kez çalıştırıyorsanız veya sistemi çalıştırmayı bir süreliğine durdurduysanız, veriler güncel olmayacaktır. Sistemi her başlattığınızda, verilerin şimdiki zamana yetişmesi biraz zaman alacaktır.",
                    "updated": 1647865936787
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie das System zum ersten Mal in Betrieb nehmen oder das System eine Zeit lang nicht benutzt haben, sind die Daten nicht auf dem neuesten Stand. Jedes Mal, wenn Sie das System starten, dauert es einige Zeit, bis die Daten mit der aktuellen Zeit übereinstimmen.",
                    "updated": 1678647258218
                }
            ]
        },
        {
            "style": "Text",
            "text": "To update your datasets until the present time you need to Run All Tasks in your Masters and Sparta task managers for the exchanges and markets you wish to work with, and allow enough time for the processes to go through the missing data.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы обновить свои наборы данных до настоящего времени, вам необходимо в менеджерах задач Masters и Sparta запустить все задачи для бирж и рынков, с которыми вы хотите работать, и предоставить процессам достаточно времени, чтобы обработать недостающие данные.",
                    "updated": 1640460596079
                },
                {
                    "language": "TR",
                    "text": "Veri kümelerinizi bugüne kadar güncellemek için, çalışmak istediğiniz borsalar, pazarlar, Masters ve Sparta görev yöneticilerinizde Tüm Görevleri Çalıştırmanız işlemlerin eksik verileri geçmesi için yeterli zaman ayırmanız gerekir.",
                    "updated": 1647866003649
                },
                {
                    "language": "DE",
                    "text": "Um Ihre Datensätze bis zum jetzigen Zeitpunkt zu aktualisieren, müssen Sie alle Aufgaben in Ihren Masters- und Sparta-Aufgabenmanagern für die Börsen und Märkte, mit denen Sie arbeiten möchten, ausführen und genügend Zeit einplanen, damit die Prozesse die fehlenden Daten durchgehen können.",
                    "updated": 1678647265980
                }
            ]
        }
    ]
}