{
    "topic": "Troubleshooting",
    "pageNumber": "7",
    "type": "Perception Issues - There Are No Candles on The Charts",
    "definition": {
        "text": "It takes time for your data mining operation to download data from the exchange and process the raw data to build candles. Check the progress of your data mining operation in the network hierarchy.",
        "updated": 1611513813893,
        "translations": [
            {
                "language": "ES",
                "text": "\nSu operación de minería de datos necesita tiempo para descargar datos del exchange \ny procesar los datos sin procesar para construir velas. Verifique el progreso de su operación de minería de datos en la jerarquía de la red.",
                "updated": 1636726546715
            },
            {
                "language": "RU",
                "text": "Операции по поиску данных требуется время для загрузки данных с биржи и обработки исходных данных для построения свечей. Проверьте ход выполнения операции по поиску данных в сетевой иерархии.",
                "updated": 1640458784246
            },
            {
                "language": "TR",
                "text": "Özet: Veri madenciliği operasyonunuzun borsadan veri indirmesi ve mum oluşturmak için ham verileri işlemesi zaman alır. Ağ hiyerarşisinde veri madenciliği operasyonunuzun ilerlemesini kontrol edin.",
                "updated": 1647864920795
            },
            {
                "language": "DE",
                "text": "Es dauert einige Zeit, bis Ihre Data-Mining-Operation Daten von der Börse heruntergeladen und die Rohdaten für die Erstellung von Kerzen verarbeitet hat. Überprüfen Sie den Fortschritt Ihres Data-Mining-Vorgangs in der Netzhierarchie.",
                "updated": 1678646049176
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "There are a few reasons why you may be having issues finding candles on the charts. Please, consider the following…",
            "updated": 1611513833239,
            "translations": [
                {
                    "language": "ES",
                    "text": "Hay algunas razones por las que puede tener problemas para encontrar velas en los gráficos. Por favor, considere lo siguiente ...",
                    "updated": 1636726572622
                },
                {
                    "language": "RU",
                    "text": "Есть несколько причин, по которым у вас могут возникнуть проблемы с выводом свечей на графики. Пожалуйста, рассмотрите следующие...",
                    "updated": 1640458865231
                },
                {
                    "language": "TR",
                    "text": "Tablolarda mum bulmakta sorun yaşamanızın birkaç nedeni olabilir. Lütfen aşağıdakileri göz önünde bulundurun…",
                    "updated": 1647864986869
                },
                {
                    "language": "DE",
                    "text": "Es gibt einige Gründe, warum Sie Probleme haben könnten, die Kerzen in den Charts zu finden. Bitte beachten Sie die folgenden Punkte...",
                    "updated": 1678646059812
                }
            ]
        },
        {
            "style": "Title",
            "text": "Check the Progress of the Data Mining Operation",
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверка хода выполнения операции по сбору данных",
                    "updated": 1640458892502
                },
                {
                    "language": "TR",
                    "text": "Veri Madenciliği Operasyonunun İlerlemesini Kontrol Edin",
                    "updated": 1647865001343
                },
                {
                    "language": "DE",
                    "text": "Überprüfen Sie den Fortschritt des Data-Mining-Vorgangs",
                    "updated": 1678646068205
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you are just getting started with Superalgos, still following the getting started guide, bear in mind it takes time for data to be downloaded from the exchange. Depending on the power of your hardware and the speed of your internet connection, it may take anything from half an hour to several hours to see the first few candles, particularly those of the Binance exchange, as the market spans back to September 2017.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы только начинаете работать с Superalgos, продолжая следовать руководству по началу работы, имейте в виду, что для загрузки данных с биржи требуется время. В зависимости от мощности вашего оборудования и скорости вашего интернет-соединения может потребоваться от получаса до нескольких часов, чтобы увидеть несколько первых свечей, особенно на бирже Binance, поскольку рынок охватывает период с сентября 2017 года.",
                    "updated": 1640458949104
                },
                {
                    "language": "TR",
                    "text": "Superalgos'a yeni başlıyorsanız ve hala başlangıç kılavuzunu takip ediyorsanız, borsadan verilerin indirilmesinin zaman aldığını unutmayın. Donanımınızın gücüne ve internet bağlantınızın hızına bağlı olarak, Market'in Eylül 2017'ye kadar uzanması nedeniyle ilk birkaç mumun, özellikle Binance borsasının mumlarının görülmesi yarım saatten birkaç saate kadar sürebilir.",
                    "updated": 1647865085193
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie gerade erst mit Superalgos anfangen und immer noch der Anleitung zum Einstieg folgen, bedenken Sie, dass es einige Zeit dauert, bis die Daten von der Börse heruntergeladen werden. Je nach Leistung Ihrer Hardware und der Geschwindigkeit Ihrer Internetverbindung kann es zwischen einer halben Stunde und mehreren Stunden dauern, bis Sie die ersten Kerzen sehen, insbesondere die der Binance-Börse, da der Markt bis September 2017 zurückreicht.",
                    "updated": 1678646381473
                }
            ]
        },
        {
            "style": "Text",
            "text": "Check the data mining operation on the network hierarchy. You will be able to see candles on the screen only after the OHLCV Sensor Bot and the Candles Volumes indicator in the Masters task manager of the corresponding exchange data tasks node and market have both reached 100% progress.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Verifique la operación de minería de datos en la jerarquía de la red. Podrá ver velas en la pantalla solo después del OHLCV Sensor Bot y el indicador de Volúmenes de Velas en el administrador de tareas del Masters del exhange correspondiente del nodo de intercambio de datos y el mercado han alcanzado un avance del 100%..",
                    "updated": 1636726918060
                },
                {
                    "language": "RU",
                    "text": "Проверьте работу добычи данных на сетевой иерархии. Вы сможете увидеть свечи на экране только после того, как бот датчика OHLCV и индикатор Candles Volumes в менеджере задач Masters соответствующего узла задач биржевых данных и рынка достигнут 100% прогресса.",
                    "updated": 1640459034546
                },
                {
                    "language": "TR",
                    "text": "Ağ hiyerarşisinde veri madenciliği işlemini kontrol edin. Mumları ekranda ancak ilgili değişim verileri görevleri düğümünün ve pazarın Masters görev yöneticisindeki OHLCV Sensör Botu ( Sensor Bot ) ve Mum Hacimleri göstergesi %100 ilerlemeye ulaştıktan sonra görebileceksiniz.",
                    "updated": 1647865139037
                },
                {
                    "language": "DE",
                    "text": "Überprüfen Sie die Data-Mining-Operation in der Netzwerkhierarchie. Sie können erst dann Kerzen auf dem Bildschirm sehen, wenn der OHLCV- Sensor Bot und der Indikator für das Kerzenvolumen im Master-Task-Manager des entsprechenden Knotens für die Datenaustauschaufgaben und des Marktes beide 100 % Fortschritt erreicht haben.",
                    "updated": 1678646391417
                }
            ]
        },
        {
            "style": "Success",
            "text": "If you are not sure what the above paragraph refers to, go back to the Welcome tutorial as a refresher.",
            "updated": 1611513856516,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si no está seguro de a qué se refiere el párrafo anterior, vuelva al Welcome tutorial como recordatorio.",
                    "updated": 1636726967868
                },
                {
                    "language": "RU",
                    "text": "Если вы не знаете, о чем идет речь в приведенном выше абзаце, вернитесь к учебнику Welcome (\"Добро пожаловать\") в качестве справочного материала.",
                    "updated": 1640459122047
                },
                {
                    "language": "TR",
                    "text": "İpucu: Yukarıdaki paragrafın ne anlama geldiğinden emin değilseniz, tazeleyici olarak Hoş Geldiniz öğreticisine geri dönün.",
                    "updated": 1647865169011
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie sich nicht sicher sind, worauf sich der obige Absatz bezieht, gehen Sie zur Auffrischung zum Tutorial \"Willkommen\" zurück.",
                    "updated": 1678646449911
                }
            ]
        },
        {
            "style": "Title",
            "text": "Switch Candles Layer Off and Back On and Refresh the Page",
            "translations": [
                {
                    "language": "RU",
                    "text": "Выключите и снова включите слой свечей и обновите страницу",
                    "updated": 1640459138567
                },
                {
                    "language": "TR",
                    "text": "Mum Katmanını Kapatın ,Tekrar Açın ve Sayfayı Yenileyin",
                    "updated": 1647865189269
                },
                {
                    "language": "DE",
                    "text": "Kerzenschicht aus- und wieder einschalten und die Seite aktualisieren",
                    "updated": 1678646465505
                }
            ]
        },
        {
            "style": "Text",
            "text": "Zoom into the chart until you see the layer manager featuring the candles layer. Turn off the candles layer and turn it back on. This forces to candles layer to reload.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Amplíe el gráfico hasta que vea el administrador de capas con la capa de velas. Apaga la capa de velas y vuelve a encenderla. Esto obliga a la capa de velas a recargarse.",
                    "updated": 1636726991858
                },
                {
                    "language": "RU",
                    "text": "Увеличьте масштаб графика, пока не увидите в менеджере слоев слой со свечами. Выключите слой свечей и включите его снова. Это заставит слой свечей перезагрузиться.",
                    "updated": 1640459184769
                },
                {
                    "language": "TR",
                    "text": "Mum katmanını içeren katman yöneticisini görene kadar grafiği yakınlaştırın. Mum katmanını kapatın ve tekrar açın. Bu, mum katmanını yeniden yüklemeye zorlar.",
                    "updated": 1647865210769
                },
                {
                    "language": "DE",
                    "text": "Zoomen Sie in das Diagramm, bis Sie den Ebenenmanager mit der Ebene Kerzen sehen. Deaktivieren Sie die Kerzenebene und schalten Sie sie wieder ein. Dadurch wird die Kerzenebene neu geladen.",
                    "updated": 1678646480356
                }
            ]
        },
        {
            "style": "Title",
            "text": "Check the Time, Rate and Time Frame Scales",
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверьте Time Scale, Rate Scale и Time Frame Scale",
                    "updated": 1640459484899
                },
                {
                    "language": "TR",
                    "text": "Zaman, Oran ve Zaman Çerçevesi Ölçeklerini Kontrol Edin",
                    "updated": 1647865239593
                },
                {
                    "language": "DE",
                    "text": "Prüfen Sie die Skalen Zeit, Rate und Zeitrahmen",
                    "updated": 1678646493527
                }
            ]
        },
        {
            "style": "Text",
            "text": "It may happen that you attempted to manipulate the charts and something went wrong in the process.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Puede suceder que haya intentado manipular los gráficos y algo salió mal en el proceso.",
                    "updated": 1636727008862
                },
                {
                    "language": "RU",
                    "text": "Может случиться так, что вы пытались манипулировать графиками и в процессе что-то пошло не так.",
                    "updated": 1640459411529
                },
                {
                    "language": "TR",
                    "text": "Çizelgeleri manipüle etmeye çalışmış olabilirsiniz ve bu süreçte bir şeyler ters gitmiş olabilir.",
                    "updated": 1647865272073
                },
                {
                    "language": "DE",
                    "text": "Es kann vorkommen, dass Sie versucht haben, die Diagramme zu manipulieren und dabei etwas schief gegangen ist.",
                    "updated": 1678646556353
                }
            ]
        },
        {
            "style": "Text",
            "text": "Try setting the time frame scale to 24 hours, and both the time scale and rate scale to automatic mode. Setting the time scale to automatic mode brings the whole span of the market in focus on the chart. Setting the rate scale to automatic mode sets the scale to fit the entire range of prices in the market. The goal is to make sure that all scales are set in a way in which—if there is any data to show—it will show.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Intente establecer la escala del marco de tiempo en 24 horas, y tanto la escala de tiempo como la escala de tasa en modo automático. Al establecer la escala de tiempo en modo automático, todo el mercado se enfoca en el gráfico. Al establecer la escala de tarifas en modo automático, la escala se ajusta a toda la gama de precios del mercado. El objetivo es asegurarse de que todas las escalas estén configuradas de manera que, si hay algún dato que mostrar, se muestre.",
                    "updated": 1636727044497
                },
                {
                    "language": "RU",
                    "text": "Попробуйте установить масштаб таймфрейма на 24 часа, а шкалу времени и шкалу курса - в автоматический режим. При установке шкалы времени в автоматический режим в фокус графика попадает весь диапазон рынка. Установив шкалу курса в автоматический режим, установите шкалу так, чтобы она соответствовала всему диапазону цен на рынке. Цель состоит в том, чтобы убедиться, что все шкалы установлены таким образом, что если есть данные, которые нужно показать, то они будут показаны.",
                    "updated": 1640459465739
                },
                {
                    "language": "TR",
                    "text": "Zaman çerçevesi ölçeğini 24 saate ve hem zaman ölçeğini hem de hız ölçeğini otomatik moda ayarlamayı deneyin. Zaman ölçeğini otomatik moda ayarlamak, piyasanın tüm aralığını grafiğe odaklar. Oran ölçeğini otomatik moda ayarlamak, ölçeği piyasadaki tüm fiyat aralığına uyacak şekilde ayarlar. Amaç, tüm ölçeklerin - gösterilecek herhangi bir veri varsa - gösterileceği şekilde ayarlandığından emin olmaktır.",
                    "updated": 1647865291803
                },
                {
                    "language": "DE",
                    "text": "Versuchen Sie, die Zeitskala auf 24 Stunden und sowohl die Zeitskala als auch die Kursskala auf den automatischen Modus einzustellen. Wenn Sie die Zeitskala auf den automatischen Modus einstellen, wird die gesamte Marktspanne auf dem Diagramm angezeigt. Wenn Sie die Kursskala auf den automatischen Modus einstellen, passt sich die Skala der gesamten Preisspanne des Marktes an. Ziel ist es, sicherzustellen, dass alle Skalen so eingestellt sind, dass sie - wenn Daten angezeigt werden sollen - auch angezeigt werden.",
                    "updated": 1678646568270
                }
            ]
        },
        {
            "style": "Title",
            "text": "Check the Integrity of Your Data",
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверьте целостность ваших данных",
                    "updated": 1640459524367
                },
                {
                    "language": "TR",
                    "text": "Verilerinizin Bütünlüğünü Kontrol Edin",
                    "updated": 1647865311930
                },
                {
                    "language": "DE",
                    "text": "Überprüfen Sie die Integrität Ihrer Daten",
                    "updated": 1678646576437
                }
            ]
        },
        {
            "style": "Text",
            "text": "Your PC may have been forcefully shut down or you may have closed the console running the Superalgos backend while running a data-mining operation. Such situations may cause some data to become corrupt.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Es posible que su PC se haya apagado a la fuerza o que haya cerrado la consola que ejecuta el backend de Superalgos mientras se ejecuta una operación de extracción de datos. Tales situaciones pueden hacer que algunos datos se corrompan.",
                    "updated": 1636727077473
                },
                {
                    "language": "RU",
                    "text": "Возможно, ваш компьютер был принудительно выключен или вы закрыли консоль, на которой был запущен бэкэнд Superalgos, во время выполнения операции по добыче данных. Такие ситуации могут привести к повреждению некоторых данных.",
                    "updated": 1640459632599
                },
                {
                    "language": "TR",
                    "text": "Bilgisayarınız zorla kapatılmış olabilir veya bir veri madenciliği işlemi yürütürken Superalgos arka ucunu çalıştıran konsolu kapatmış olabilirsiniz. Bu tür durumlar bazı verilerin bozulmasına neden olabilir.",
                    "updated": 1647865336423
                },
                {
                    "language": "DE",
                    "text": "Möglicherweise wurde Ihr PC während der Ausführung eines Data-Mining-Vorgangs unfreiwillig heruntergefahren oder Sie haben die Konsole, auf der das Superalgos-Backend läuft, geschlossen. Solche Situationen können dazu führen, dass einige Daten beschädigt werden.",
                    "updated": 1678646591607
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "1. Check the integrity of the sensor bot data",
            "translations": [
                {
                    "language": "RU",
                    "text": "1. Проверьте целостность данных бота датчика",
                    "updated": 1640459675766
                },
                {
                    "language": "TR",
                    "text": "1. Sensör bot verilerinin bütünlüğünü kontrol edin",
                    "updated": 1647865357663
                },
                {
                    "language": "DE",
                    "text": "1. Prüfen Sie die Integrität der Sensor-Bot-Daten",
                    "updated": 1678646599129
                }
            ]
        },
        {
            "style": "Text",
            "text": "Go to the Exchange-Raw-Data folder under Data-Storage > Exchange > Market > Masters and keep opening the subfolders to get to the last day available, and open the Data.json file. If the file opens fine, this may mean that the data you downloaded from the exchange is safe.",
            "translations": [
                {
                    "language": "ES",
                    "text": "vaya a la carpeta de Exchange-Raw-Data debajo de Data-Storage > Exchange > Market > Masters y siga abriendo las subcarpetas para llegar al último día disponible, y abra el rchivo Data.json. Si el archivo se abre bien, esto puede significar que los datos que descargó del intercambio están seguros.",
                    "updated": 1636727202383
                },
                {
                    "language": "RU",
                    "text": "Перейдите в папку Exchange-Raw-Data в разделе Data-Storage > Exchange > Market > Masters и продолжайте открывать вложенные папки, чтобы добраться до последнего доступного дня, и откройте файл Data.json. Если файл открывается нормально, это может означать, что данные, которые вы загрузили с биржи, безопасны.",
                    "updated": 1640459706827
                },
                {
                    "language": "TR",
                    "text": "Data-Storage > Exchange > Market > Masters altında Exchange-Raw-Data klasörüne gidin ve mevcut son güne gitmek için alt klasörleri açmaya devam edin ve Data.json dosyasını açın. Dosya düzgün açılırsa, bu borsadan indirdiğiniz verilerin güvenli olduğu anlamına gelebilir.",
                    "updated": 1647865384691
                },
                {
                    "language": "DE",
                    "text": "Gehen Sie zum Ordner Exchange-Raw-Data unter Data-Storage > Exchange > Market > Masters und öffnen Sie die Unterordner, bis Sie den letzten verfügbaren Tag erreicht haben, und öffnen Sie die Datei Data.json. Wenn sich die Datei problemlos öffnen lässt, kann dies bedeuten, dass die Daten, die Sie von der Börse heruntergeladen haben, sicher sind.",
                    "updated": 1678646606190
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the last file in Exchange-Raw-Data does not open properly then delete the whole Data-Storage > Exchange > Market and run the data mining operation. This will have the OHLCV sensor bot download all the data from the exchange again, and all indicators calculated from scratch.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si el último archivo en Exchange-Raw-Data no se abre correctamente, luego borre todo Data-Storage > Exchange > Market y ejecutar la operación de minería de datos. Esto hará que el robot sensor OHLCV descargue todos los datos del exchange de nuevo y todos los indicadores calculados desde cero.",
                    "updated": 1636727332248
                },
                {
                    "language": "RU",
                    "text": "Если последний файл в Exchange-Raw-Data не открывается должным образом, удалите весь Data-Storage > Exchange > Market и запустите операцию добычи данных. В результате бот датчик OHLCV снова загрузит все данные с биржи, и все индикаторы будут рассчитаны заново.",
                    "updated": 1640459788929
                },
                {
                    "language": "TR",
                    "text": "Exchange-Raw-Data'daki son dosya düzgün açılmazsa, Data-Storage > Exchange > Market'in tamamını silin ve veri madenciliği işlemini çalıştırın. Bu, OHLCV sensör botunun borsadaki tüm verileri tekrar indirmesini ve tüm göstergelerin sıfırdan hesaplanmasını sağlayacaktır.",
                    "updated": 1647865414424
                },
                {
                    "language": "DE",
                    "text": "Wenn die letzte Datei in Exchange-Raw-Data nicht richtig geöffnet wird, löschen Sie den gesamten Data-Storage > Exchange > Market und führen Sie die Data-Mining-Operation aus. Dadurch wird der OHLCV-Sensor-Bot alle Daten von der Börse erneut herunterladen und alle Indikatoren von Grund auf neu berechnen.",
                    "updated": 1678646614917
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the sensor data seems fine, then proceed with the next step.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si los datos del sensor parecen correctos, continúe con el siguiente paso.",
                    "updated": 1636727349782
                },
                {
                    "language": "RU",
                    "text": "Если данные датчика в порядке, перейдите к следующему шагу.",
                    "updated": 1640459807036
                },
                {
                    "language": "DE",
                    "text": "Wenn die Sensordaten in Ordnung zu sein scheinen, fahren Sie mit dem nächsten Schritt fort.",
                    "updated": 1678646622988
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "2. Check the integrity of indicator’s data",
            "translations": [
                {
                    "language": "RU",
                    "text": "2. Проверьте целостность данных индикатора",
                    "updated": 1640459824783
                },
                {
                    "language": "DE",
                    "text": "2. Überprüfung der Integrität der Daten des Indikators",
                    "updated": 1678646645912
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you are having issues with candles you need to check the data of the Candles Volumes indicator of the Masters Data Mine located deep in Multi-Time-Frame-Daily and Multi-Time-Frame-Market folders under Data-Storage > Exchange > Market > Masters > Candles-Volumes > Output > Candles.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si tiene problemas con las velas, debe verificar los datos del indicador de Volúmenes de velas del Masters Data Mine ubicado en lo profundo de Multi-Time-Frame-Daily y archivos  Multi-Time-Frame-Market debajo de Data-Storage > Exchange > Market > Masters > Candles-Volumes > Output > Candles.",
                    "updated": 1636727469722
                },
                {
                    "language": "RU",
                    "text": "Если у вас возникли проблемы со свечами, вам необходимо проверить данные индикатора Candles Volumes инструмента Masters Data Mine, расположенного глубоко в папках Multi-Time-Frame-Daily и Multi-Time-Frame-Market в разделе Data-Storage > Exchange > Market > Masters > Candles-Volumes > Output > Candles.",
                    "updated": 1640459879218
                },
                {
                    "language": "TR",
                    "text": "Mumlarla ilgili sorun yaşıyorsanız, Data-Storage > Exchange > Market > Masters > Candles-Volumes > Output > Candles altındaki Multi-Time-Frame-Daily and Multi-Time-Frame-Market  klasörlerinin derinliklerinde bulunan Masters Data Mine Mum Hacimleri göstergesinin verilerini kontrol etmeniz gerekir.",
                    "updated": 1647865675795
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie Probleme mit Kerzen haben, müssen Sie die Daten des Candles-Volumen-Indikators der Masters Data Mine überprüfen, die sich tief in den Ordnern Multi Time Frame Daily und Multi Time Frame Market unter Data-Storage > Exchange > Market > Masters > Candles-Volumes > Output > Candles befinden.",
                    "updated": 1678646754373
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you find any .tmp files or you can’t open some of the latest Data.json files in a regular text editor, or some files are empty, chances are the files have been corrupted.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si encuentra archivos .tmp o no puede abrir algunos de los archivos Data.json más recientes en un editor de texto normal, o si algunos archivos están vacíos, es probable que los archivos estén dañados.",
                    "updated": 1636727490907
                },
                {
                    "language": "RU",
                    "text": "Если вы обнаружили какие-либо файлы типа \".tmp\" или не можете открыть некоторые из последних файлов Data.json в обычном текстовом редакторе, или некоторые файлы пусты, есть вероятность, что файлы были повреждены.",
                    "updated": 1640459931494
                },
                {
                    "language": "TR",
                    "text": "Herhangi bir.tmp dosyası bulursanız veya en son Data.json dosyalarından bazılarını normal bir metin düzenleyicide açamıyorsanız veya bazı dosyalar boşsa, dosyalar bozulmuş olabilir.",
                    "updated": 1647865702292
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie irgendwelche.tmp-Dateien finden oder einige der neuesten Data.json-Dateien nicht in einem normalen Texteditor öffnen können oder einige Dateien leer sind, sind die Dateien wahrscheinlich beschädigt.",
                    "updated": 1678646672467
                }
            ]
        },
        {
            "style": "Note",
            "text": "Something similar may have happened with other indicators as well, so make sure you check the data storage folders of indicators that may not be working or that you may be experiencing issues with.",
            "updated": 1611513920939,
            "translations": [
                {
                    "language": "ES",
                    "text": "Algo similar también puede haber sucedido con otros indicadores, así que asegúrese de revisar las carpetas de almacenamiento de datos de los indicadores que pueden no estar funcionando o con los que puede estar experimentando problemas.",
                    "updated": 1636727534325
                },
                {
                    "language": "RU",
                    "text": "Нечто подобное могло произойти и с другими индикаторами, поэтому обязательно проверьте папки хранения данных индикаторов, которые могут не работать или с которыми у вас возникли проблемы.",
                    "updated": 1640459953146
                },
                {
                    "language": "TR",
                    "text": "Not: Diğer göstergelerde de benzer bir şey olmuş olabilir, bu nedenle çalışmayan veya sorun yaşıyor olabileceğiniz göstergelerin veri depolama klasörlerini kontrol ettiğinizden emin olun.",
                    "updated": 1647865733569
                },
                {
                    "language": "DE",
                    "text": "Etwas Ähnliches kann auch mit anderen Indikatoren passiert sein, also überprüfen Sie die Datenspeicherordner der Indikatoren, die möglicherweise nicht funktionieren oder mit denen Sie Probleme haben.",
                    "updated": 1678646788051
                }
            ]
        },
        {
            "style": "Text",
            "text": "If that is the case, then you will delete the folder for each data mine within Data-Storage > Exchange > Market, but will leave Exchange-Raw-Data intact, and get the data mining operation running afterward. This will regenerate all indicators data products, including Candles Volumes.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si ese es el caso, eliminará la carpeta de cada mina de datos dentro de Data-Storage > Exchange > Market, pero dejará Exchange-Raw-Data intacto, ay conseguir que la operación de minería de datos se ejecute después. Esto regenerará todos los productos de datos de indicadores, incluidos los volúmenes de velas.",
                    "updated": 1636727614377
                },
                {
                    "language": "RU",
                    "text": "Если это так, то удалите папку для каждого источника данных в Data-Storage > Exchange > Market, но оставьте Exchange-Raw-Data нетронутой, и затем запустите операцию по сбору данных. Это приведет к регенерации всех продуктов данных индикаторов, включая Candles Volumes.",
                    "updated": 1640460118299
                },
                {
                    "language": "TR",
                    "text": "Bu durumda, Data-Storage > Exchange > Market içindeki her bir veri madeni için klasörü silecek, ancak Exchange-Raw-Data'yı olduğu gibi bırakacak ve daha sonra veri madenciliği operasyonunu çalıştıracaksınız. Bu, Mum Hacimleri de dahil olmak üzere tüm gösterge veri ürünlerini yeniden oluşturacaktır.",
                    "updated": 1647865755614
                },
                {
                    "language": "DE",
                    "text": "Wenn das der Fall ist, löschen Sie den Ordner für jede Data-Mine unter Data-Storage > Exchange > Market, aber lassen Sie Exchange-Raw-Data intakt, und starten Sie die Data-Mining-Operation danach. Dadurch werden alle Indikator-Datenprodukte, einschließlich Candles Volumes, neu generiert.",
                    "updated": 1678647071802
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "3. Remember that there is a proper way to close the system!",
            "translations": [
                {
                    "language": "ES",
                    "text": "3. Remember that there is a proper way to close the system! ( ¡Recuerde que existe una forma adecuada de cerrar el sistema!)",
                    "updated": 1636727644457
                },
                {
                    "language": "RU",
                    "text": "3. Помните, что существует правильный способ закрытия системы!",
                    "updated": 1640460154536
                },
                {
                    "language": "TR",
                    "text": "3. Sistemi kapatmanın uygun bir yolu olduğunu unutmayın!",
                    "updated": 1647865824391
                },
                {
                    "language": "DE",
                    "text": "3. Denken Sie daran, dass es eine richtige Art und Weise gibt, das System zu schließen!",
                    "updated": 1678647080503
                }
            ]
        },
        {
            "style": "Title",
            "text": "Check for Errors at the Browser",
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверка наличия ошибок в браузере",
                    "updated": 1640460319785
                },
                {
                    "language": "TR",
                    "text": "Tarayıcıdaki Hataları Kontrol Edin",
                    "updated": 1647865827435
                },
                {
                    "language": "DE",
                    "text": "Prüfen auf Fehler im Browser",
                    "updated": 1678647089669
                }
            ]
        },
        {
            "style": "Text",
            "text": "Open Chrome’s DevTools with the F12 key (when the browser is in focus) and click the Console tab. Then go back to Superalgos and reproduce the issue. The console may display network errors and warnings of different sorts. Those are not important and you may safely ignore them.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Open Chrome’s DevTools con la tecla F12  (cuando el navegador está en foco) y clickee el tab de la consola. Luego regrese a Superalgos y reproduzca el problema. La consola puede mostrar errores de red y advertencias de diferentes tipos. Esos no son importantes y puede ignorarlos con seguridad.",
                    "updated": 1636727744906
                },
                {
                    "language": "RU",
                    "text": "Откройте DevTools в Chrome с помощью клавиши F12 (когда браузер находится в фокусе) и перейдите на вкладку Console. Затем вернитесь в Superalgos и воспроизведите проблему. В консоли могут отображаться сетевые ошибки и предупреждения различного рода. Они не важны, и вы можете смело игнорировать их.",
                    "updated": 1640460354719
                },
                {
                    "language": "TR",
                    "text": "F12 tuşuyla Chrome'un DevTools'unu açın (tarayıcı odaktayken) ve Konsol sekmesini tıklayın. Ardından Superalgos'a geri dönün ve sorunu yeniden oluşturun. Konsol, ağ hatalarını ve farklı türden uyarıları görüntüleyebilir. Bunlar önemli değildir ve bunları güvenle görmezden gelebilirsiniz.",
                    "updated": 1647865862421
                },
                {
                    "language": "DE",
                    "text": "Öffnen (Open) Sie die DevTools von Chrome mit der Taste F12 (wenn der Browser im Vordergrund ist) und klicken Sie auf die Registerkarte Konsole. Gehen Sie dann zurück zu Superalgos und reproduzieren Sie das Problem. Die Konsole kann Netzwerkfehler und Warnungen verschiedener Art anzeigen. Diese sind nicht wichtig und Sie können sie getrost ignorieren.",
                    "updated": 1678647114540
                }
            ]
        },
        {
            "style": "Text",
            "text": "Do pay attention to other kinds of errors, such as files that can not be loaded, or errors in specific system components.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Preste atención a otros tipos de errores, como archivos que no se pueden cargar o errores en componentes específicos del sistema.",
                    "updated": 1636727766726
                },
                {
                    "language": "RU",
                    "text": "Обратите внимание на другие виды ошибок, такие как файлы, которые не могут быть загружены, или ошибки в определенных компонентах системы.",
                    "updated": 1640460372526
                },
                {
                    "language": "TR",
                    "text": "Yüklenemeyen dosyalar veya belirli sistem bileşenlerindeki hatalar gibi diğer türdeki hatalara dikkat edin.",
                    "updated": 1647865878767
                },
                {
                    "language": "DE",
                    "text": "Achten Sie auf andere Arten von Fehlern, z. B. Dateien, die nicht geladen werden können, oder Fehler in bestimmten Systemkomponenten.",
                    "updated": 1678647176283
                }
            ]
        }
    ]
}