{
    "topic": "Troubleshooting",
    "pageNumber": "9",
    "type": "Perception Issues - Indicator Data Seems Wrong",
    "definition": {
        "text": "Make sure you compare with the actual source of the raw data and research the raw data before reporting an issue.",
        "updated": 1611514878598,
        "translations": [
            {
                "language": "RU",
                "text": "Убедитесь, что вы сравниваете с фактическим источником исходных данных и изучили исходные данные, прежде чем сообщать о проблеме.",
                "updated": 1640537215694
            },
            {
                "language": "TR",
                "text": "Özet: Bir sorunu bildirmeden önce ham verilerin gerçek kaynağıyla karşılaştırdığınızdan ve ham verileri araştırdığınızdan emin olun.",
                "updated": 1647866028008
            },
            {
                "language": "DE",
                "text": "Stellen Sie sicher, dass Sie mit der tatsächlichen Quelle der Rohdaten vergleichen und die Rohdaten untersuchen, bevor Sie ein Problem melden.",
                "updated": 1678647290446
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may be comparing one of Superalgos’ indicators with indicators produced by other sources like TradingView, Sierra Chart, or any other provider. You may have found some differences, probably minor, in some of the indicator properties for certain candles, or maybe even throughout the data set.",
            "updated": 1611514888972,
            "translations": [
                {
                    "language": "RU",
                    "text": "Возможно, вы сравниваете один из индикаторов Superalgos с индикаторами из других источников, таких как TradingView, Sierra Chart или любого другого поставщика. Возможно, вы обнаружили некоторые различия, возможно, незначительные, в свойствах индикатора для определенных свечей, а может быть, и во всем наборе данных.",
                    "updated": 1640537279053
                },
                {
                    "language": "TR",
                    "text": "Superalgos'un göstergelerinden birini TradingView, Sierra Chart veya başka bir sağlayıcı gibi diğer kaynaklar tarafından üretilen göstergelerle karşılaştırıyor olabilirsiniz. Belirli mumların bazı gösterge özelliklerinde veya hatta veri seti boyunca muhtemelen küçük bazı farklılıklar bulmuş olabilirsiniz.",
                    "updated": 1647866152880
                },
                {
                    "language": "DE",
                    "text": "Vielleicht vergleichen Sie einen der Superalgos-Indikatoren mit Indikatoren, die von anderen Quellen wie TradingView, Sierra Chart oder einem anderen Anbieter stammen. Möglicherweise haben Sie einige - wahrscheinlich geringfügige - Unterschiede in den Indikatoreigenschaften für bestimmte Kerzen oder vielleicht sogar im gesamten Datensatz festgestellt.",
                    "updated": 1678647315874
                }
            ]
        },
        {
            "style": "Text",
            "text": "One of the most likely reasons for these mostly minor discrepancies is that the raw data exchanges provide is not always consistent. For example, occasionally a one-minute candle may be missing in the data set. Or some candles may not start exactly at the zero-seconds mark.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Одна из наиболее вероятных причин этих, в основном, незначительных расхождений связана с тем, что исходные данные, предоставляемые биржами, не всегда соответствуют друг другу. Например, иногда в наборе данных может отсутствовать минутная свеча. Или некоторые свечи могут начинаться не строго с отметки ноль секунд.",
                    "updated": 1640537446069
                },
                {
                    "language": "TR",
                    "text": "Bu çoğunlukla küçük tutarsızlıkların en olası nedenlerinden biri, sağladığı ham veri alışverişlerinin her zaman tutarlı olmamasıdır. Örneğin, bazen veri setinde bir dakikalık mum eksik olabilir. Veya bazı mumlar tam olarak sıfır saniye işaretiyle başlamayabilir.",
                    "updated": 1647866182511
                },
                {
                    "language": "DE",
                    "text": "Einer der wahrscheinlichsten Gründe für diese meist geringfügigen Unterschiede ist, dass die von der Börse gelieferten Rohdaten nicht immer konsistent sind. So kann es beispielsweise vorkommen, dass eine einminütige Kerze im Datensatz fehlt. Oder einige Kerzen beginnen nicht genau bei der Null-Sekunden-Marke.",
                    "updated": 1678647324300
                }
            ]
        },
        {
            "style": "Text",
            "text": "Our OHLCVs sensor bot fetching data from exchanges works recursively to ensure no data is missed, however, we have no control over the data the exchange delivers at any point.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Наш сенсорный бот OHLCV, получающий данные с бирж, работает рекурсивно, чтобы не пропустить ни одной информации, однако мы не контролируем данные, которые предоставляет биржа в каждый момент времени.",
                    "updated": 1640537526859
                },
                {
                    "language": "TR",
                    "text": "Borsalardan veri getiren OHLCV sensör botumuz, hiçbir verinin kaçırılmamasını sağlamak için tekrarlı olarak çalışır, ancak borsanın herhangi bir noktada sağladığı veriler üzerinde hiçbir kontrolümüz yoktur.",
                    "updated": 1647866211182
                },
                {
                    "language": "DE",
                    "text": "Unser OHLCVs-Sensor-Bot, der Daten von Börsen abruft, arbeitet rekursiv, um sicherzustellen, dass keine Daten übersehen werden, allerdings haben wir keine Kontrolle über die Daten, die die Börse zu irgendeinem Zeitpunkt liefert.",
                    "updated": 1678647335279
                }
            ]
        },
        {
            "style": "Text",
            "text": "Furthermore, there is no information as to how third-parties obtain the data they serve, or what measures they may be taking when they detect inconsistencies in the datasets.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Кроме того, нет информации о том, как третьи стороны получают данные, которые они обслуживают, и какие меры они могут принимать при обнаружении несоответствий в наборах данных.",
                    "updated": 1640537624852
                },
                {
                    "language": "TR",
                    "text": "Ayrıca, üçüncü tarafların hizmet ettikleri verileri nasıl elde ettikleri veya veri kümelerinde tutarsızlıkları tespit ettiklerinde ne gibi önlemler alabilecekleri konusunda herhangi bir bilgi bulunmamaktadır.",
                    "updated": 1647866239267
                },
                {
                    "language": "DE",
                    "text": "Außerdem gibt es keine Informationen darüber, wie Dritte die von ihnen bereitgestellten Daten erhalten oder welche Maßnahmen sie ergreifen, wenn sie Unstimmigkeiten in den Datensätzen feststellen.",
                    "updated": 1678647362621
                }
            ]
        },
        {
            "style": "Text",
            "text": "It is reasonable to conclude that minor differences with third-party providers are to be expected.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Поэтому стоит сделать вывод, что незначительные различия со сторонними провайдерами вполне ожидаемы.",
                    "updated": 1640537712531
                },
                {
                    "language": "TR",
                    "text": "Üçüncü taraf sağlayıcılarla küçük farklılıkların beklendiği sonucuna varmak mantıklıdır.",
                    "updated": 1647866260930
                },
                {
                    "language": "DE",
                    "text": "Es ist davon auszugehen, dass geringfügige Unterschiede zu Drittanbietern zu erwarten sind.",
                    "updated": 1678647375343
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you worry about the quality of the data of any of the indicators running on Superalgos, the first thing to do is to compare the data with the source, not a third-party—that is, the actual exchange.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы беспокоитесь о качестве данных любого из индикаторов, работающих на Superalgos, первое, что нужно сделать, это сравнить данные с источником, а не со сторонним поставщиком - то есть с реальной биржей.",
                    "updated": 1640537762843
                },
                {
                    "language": "TR",
                    "text": "Superalgos'ta çalışan herhangi bir göstergenin veri kalitesi hakkında endişeleniyorsanız, yapılacak ilk şey, verileri üçüncü bir tarafla değil, kaynakla, yani gerçek değişimle karşılaştırmaktır.",
                    "updated": 1647866289821
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie sich über die Qualität der Daten eines der auf Superalgos laufenden Indikatoren Sorgen machen, sollten Sie die Daten zunächst mit der Quelle vergleichen, nicht mit einem Dritten, d. h. mit der tatsächlichen Börse.",
                    "updated": 1678647388568
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you find inconsistencies in some of our data with the data provided by the exchange, then, the second step to investigate what the issue may be is to compare the raw data, that is, one-minute candles. If you find differences in the one-minute candles provided by Superalgos and the one-minute candles provided by the exchange, then we may have a case in which the sensor bot requires some debugging to find out what the problem may be. In such a case, please open an issue pointing us to the specific candles that you found to be wrong.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы обнаружили несоответствия в некоторых наших данных с данными, предоставленными биржей, то вторым шагом для изучения того, в чем может быть проблема, является сравнение необработанных данных, то есть одноминутных свечей. Если вы обнаружите различия в одноминутных свечах, предоставленных Superalgos, и одноминутных свечах, предоставленных биржей, то, возможно, у нас есть случай, когда сенсорный бот требует отладки, чтобы выяснить, в чем может быть проблема. В таком случае, пожалуйста, откройте проблему, указав нам на конкретные свечи, которые вы сочли неправильными.",
                    "updated": 1640537811697
                },
                {
                    "language": "TR",
                    "text": "Bazı verilerimizde borsa tarafından sağlanan verilerle tutarsızlıklar bulursanız, sorunun ne olabileceğini araştırmak için ikinci adım, ham verileri, yani bir dakikalık mumları karşılaştırmaktır. Superalgos tarafından sağlanan bir dakikalık mumlar ile borsa tarafından sağlanan bir dakikalık mumlar arasında farklılıklar bulursanız, sensör botunun sorunun ne olabileceğini bulmak için biraz hata ayıklaması gerektirdiği bir durumla karşılaşabiliriz. Böyle bir durumda, lütfen bizi yanlış bulduğunuz belirli mumlara yönlendiren bir konu açın.",
                    "updated": 1647866334594
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie bei einigen unserer Daten Unstimmigkeiten mit den von der Börse bereitgestellten Daten feststellen, besteht der zweite Schritt zur Untersuchung des Problems darin, die Rohdaten, d. h. die Ein-Minuten-Kerzen, zu vergleichen. Wenn Sie Unterschiede zwischen den von Superalgos gelieferten Ein-Minuten-Kerzen und den von der Börse gelieferten Ein-Minuten-Kerzen feststellen, dann kann es sein, dass der Sensor-Bot eine Fehlersuche benötigt, um das Problem zu finden. In einem solchen Fall öffnen Sie bitte eine Meldung, in der Sie uns auf die Kerzen hinweisen, die Sie für falsch halten.",
                    "updated": 1678647410946
                }
            ]
        },
        {
            "style": "Text",
            "text": "If one-minute candles seem to be correct and there is an inconsistency in the data provided by a Superalgos indicator, first, make sure that candles are correct throughout the period required to calculate the indicator. For example, in the case of a 50-periods moving average, you need to check the last 50 candles from the point in which you find a discrepancy in the indicator. If such is the case, please open an issue indicating the process you went through to determine that there is something wrong with the said indicator and point us to the specific point in time where the indicator is wrong.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если минутные свечи выглядят правильными, а в данных, предоставляемых индикатором Superalgos, есть несоответствие, сначала убедитесь, что свечи правильные на протяжении всего периода, необходимого для расчета индикатора. Например, в случае 50-периодной скользящей средней необходимо проверить последние 50 свечей от точки, в которой вы обнаружили несоответствие в индикаторе. Если это так, пожалуйста, откройте проблему, указав процесс, через который вы прошли, чтобы определить, что с указанным индикатором что-то не так, и укажите нам на конкретный момент времени, когда индикатор показывает неверные показания.",
                    "updated": 1640537986183
                },
                {
                    "language": "TR",
                    "text": "Bir dakikalık mumlar doğru görünüyorsa ve bir Superalgos göstergesi tarafından sağlanan verilerde bir tutarsızlık varsa, önce göstergeyi hesaplamak için gereken süre boyunca mumların doğru olduğundan emin olun. Örneğin 50 dönemlik bir hareketli ortalama söz konusu olduğunda, göstergede tutarsızlık bulduğunuz noktadan itibaren son 50 mumu kontrol etmeniz gerekir. Böyle bir durumda, lütfen söz konusu göstergede bir sorun olup olmadığını belirlemek için yaşadığınız süreci belirten bir konu açın ve göstergenin yanlış olduğu belirli bir noktaya bizi yönlendirin.",
                    "updated": 1647866403697
                },
                {
                    "language": "DE",
                    "text": "Wenn die Ein-Minuten-Kerzen korrekt zu sein scheinen und eine Unstimmigkeit in den von einem Superalgos-Indikator gelieferten Daten besteht, vergewissern Sie sich zunächst, dass die Kerzen über den gesamten für die Berechnung des Indikators erforderlichen Zeitraum korrekt sind. Im Falle eines gleitenden Durchschnitts von 50 Perioden müssen Sie beispielsweise die letzten 50 Kerzen ab dem Punkt prüfen, an dem Sie eine Abweichung im Indikator feststellen. Wenn dies der Fall ist, öffnen Sie bitte eine Meldung, in der Sie angeben, wie Sie festgestellt haben, dass mit dem Indikator etwas nicht stimmt, und geben Sie uns den genauen Zeitpunkt an, an dem der Indikator falsch ist.",
                    "updated": 1678647422592
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}