{
    "topic": "Troubleshooting",
    "pageNumber": "12",
    "type": "Investigating Issues - Check for Errors at the Browser",
    "definition": {
        "text": "When errors occur in the frontend application, you should either get an on-screen error, or an error should be logged in the browser console.",
        "updated": 1611515570461,
        "translations": [
            {
                "language": "RU",
                "text": "При возникновении ошибок в фронтенд-приложении вы должны либо получить сообщение об ошибке на экране, либо ошибка должна быть зарегистрирована в консоли браузера.",
                "updated": 1640538935996
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Open Chrome’s DevTools with the F12 key (when the browser is in focus) and click the Console tab. Then go back to Superalgos and reproduce the issue. The console may display network errors and warnings of different sorts. Those are not important and you may safely ignore them.",
            "updated": 1611515578715,
            "translations": [
                {
                    "language": "RU",
                    "text": "Откройте DevTools в Chrome с помощью клавиши F12 (когда браузер находится в фокусе) и перейдите на вкладку Console. Затем вернитесь в Superalgos и воспроизведите проблему. В консоли могут отображаться сетевые ошибки и предупреждения различного рода. Они не важны, и вы можете смело игнорировать их.",
                    "updated": 1640538962295
                }
            ]
        },
        {
            "style": "Text",
            "text": "Do pay attention to other kinds of errors, such as files that can not be loaded, or errors in specific system components.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Обратите внимание на другие виды ошибок, такие как файлы, которые не могут быть загружены, или ошибки в определенных компонентах системы.",
                    "updated": 1640538983259
                }
            ]
        }
    ]
}