{
    "topic": "Troubleshooting",
    "pageNumber": "14",
    "type": "Debugging a Task",
    "definition": {
        "text": "Run the TaskManager project in your preferred IDE and use the Debug button on the task's menu.",
        "updated": 1611648881024,
        "translations": [
            {
                "language": "RU",
                "text": "Запустите проект TaskServer в предпочитаемой вами IDE и используйте кнопку Debug в меню задачи.",
                "updated": 1640539883923
            },
            {
                "language": "TR",
                "text": "Özet: TaskManager projesini tercih ettiğiniz IDE'de çalıştırın ve görev menüsündeki Hata Ayıkla düğmesini kullanın.",
                "updated": 1647870854493
            },
            {
                "language": "DE",
                "text": "Führen Sie das TaskManager-Projekt in Ihrer bevorzugten IDE aus und verwenden Sie die Schaltfläche Debuggen im Menü der Aufgabe.",
                "updated": 1678649114125
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may debug any task, either a data mining task or a trading task by following these steps.",
            "updated": 1611648894746,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете выполнить отладку любой задачи, будь то задача добычи данных или торговая задача, выполнив следующие шаги.",
                    "updated": 1640539797777
                },
                {
                    "language": "TR",
                    "text": "Bu adımları izleyerek ister veri madenciliği görevi ister ticaret görevi olsun herhangi bir görevde hata ayıklayabilirsiniz.",
                    "updated": 1647870866331
                },
                {
                    "language": "DE",
                    "text": "Sie können jede Aufgabe überprüfen, entweder eine Data-Mining-Aufgabe oder eine Handelsaufgabe, indem Sie diese Schritte ausführen.",
                    "updated": 1678649124580
                }
            ]
        },
        {
            "style": "Text",
            "text": "1. Run the Superalgos Client In the usual manner.",
            "updated": 1611648991679,
            "translations": [
                {
                    "language": "RU",
                    "text": "1. Запустите Superalgos Client обычным способом.",
                    "updated": 1640539809338
                },
                {
                    "language": "TR",
                    "text": "1. Superalgos İstemcisini ( Client ) her zamanki gibi çalıştırın.",
                    "updated": 1647870886592
                },
                {
                    "language": "DE",
                    "text": "1. Führen Sie den Superalgos- Client auf die übliche Weise aus.",
                    "updated": 1678649142854
                }
            ]
        },
        {
            "style": "Text",
            "text": "2. Open the TaskServer project in your preferred IDE, place a breakpoint in the part of the code you wish to debug, and run the TaskServer.",
            "translations": [
                {
                    "language": "RU",
                    "text": "2. Откройте проект TaskServer в предпочитаемой вами IDE, установите точку останова в той части кода, которую вы хотите отладить, и запустите TaskServer.",
                    "updated": 1640539840914
                },
                {
                    "language": "TR",
                    "text": "2. Tercih ettiğiniz IDE'de TaskServer projesini açın, kodun hata ayıklamak istediğiniz kısmına bir kesme noktası yerleştirin ve TaskServer'ı çalıştırın.",
                    "updated": 1647870902194
                },
                {
                    "language": "DE",
                    "text": "2. Öffnen (Open) Sie das TaskServer-Projekt in Ihrer bevorzugten IDE, setzen Sie einen Haltepunkt in dem Teil des Codes, den Sie prüfen möchten, und starten Sie den TaskServer.",
                    "updated": 1678649162315
                }
            ]
        },
        {
            "style": "Text",
            "text": "3. Click the Debug button on the menu of the task you wish to debug. The request will be routed to the TaskServer running in your IDE.",
            "translations": [
                {
                    "language": "RU",
                    "text": "3. Нажмите кнопку Debug (Отладка) в меню задачи, которую вы хотите отладить. Запрос будет направлен на TaskServer, запущенный в вашей IDE.",
                    "updated": 1640539872415
                },
                {
                    "language": "TR",
                    "text": "3. Hata ayıklamak istediğiniz görevin menüsünde Hata Ayıkla düğmesine tıklayın. İstek, IDE'nizde çalışan TaskServer'a yönlendirilecektir.",
                    "updated": 1647870925205
                },
                {
                    "language": "DE",
                    "text": "3. Klicken Sie auf die Schaltfläche Debuggen im Menü der Task, die Sie überprüfen möchten. Die Anfrage wird an den TaskServer weitergeleitet, der in Ihrer IDE läuft.",
                    "updated": 1678649175663
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/troubleshooting/debugging-tasks.png",
            "updated": 1611649086110
        },
        {
            "style": "Text",
            "text": "4. Run the trading session in case it is a trading task.",
            "translations": [
                {
                    "language": "RU",
                    "text": "4. Запустите торговую сессию в случае, если это торговая задача.",
                    "updated": 1640539906857
                },
                {
                    "language": "TR",
                    "text": "4. Bir ticaret görevi olması durumunda ticaret oturumunu çalıştırın.",
                    "updated": 1647870943983
                },
                {
                    "language": "DE",
                    "text": "4. Starten Sie die Handelssitzung, sofern es sich um eine Handelsaufgabe handelt.",
                    "updated": 1678649227792
                }
            ]
        },
        {
            "style": "Text",
            "text": "After a few seconds, execution should pause in the line where you put the breakpoint. Bear in mind the system runs slower in debug mode, thus, it may take a little while for the session to start processing, after loading all dependencies.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Через несколько секунд выполнение должно приостановиться в той строке, где вы поставили точку останова. Помните, что в режиме отладки система работает медленнее, поэтому после загрузки всех зависимостей может потребоваться некоторое время для начала обработки сессии.",
                    "updated": 1640539931599
                },
                {
                    "language": "TR",
                    "text": "Birkaç saniye sonra, kesme noktasını koyduğunuz satırda yürütme durmalıdır. Sistemin hata ayıklama modunda daha yavaş çalıştığını unutmayın; bu nedenle, tüm bağımlılıkları yükledikten sonra oturumun işlemeye başlaması biraz zaman alabilir.",
                    "updated": 1647870959764
                },
                {
                    "language": "DE",
                    "text": "Nach ein paar Sekunden sollte die Ausführung in der Zeile anhalten, in der Sie den Haltepunkt gesetzt haben. Beachten Sie, dass das System im Debug-Modus langsamer läuft und es daher eine Weile dauern kann, bis die Sitzung nach dem Laden aller Zuordnungen mit der Verarbeitung beginnt.",
                    "updated": 1678649235586
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}