{
    "topic": "Troubleshooting",
    "pageNumber": "2",
    "type": "How to Report an Issue",
    "definition": {
        "text": "Reporting an issue is a process that entails doing some basic research, carefully describing how to reproduce the issue, and gathering crucial information.",
        "updated": 1611510213732,
        "translations": [
            {
                "language": "RU",
                "text": "Освещение проблемы - это процесс, который подразумевает проведение базового исследования, тщательное описание способа воспроизведения проблемы и сбор важной информации.",
                "updated": 1640441131334
            },
            {
                "language": "TR",
                "text": "Özet: Bir sorunu bildirmek, bazı temel araştırmalar yapmayı, sorunun nasıl yeniden oluşturulacağını dikkatlice açıklamayı ve önemli bilgileri toplamayı gerektiren bir süreçtir.",
                "updated": 1647857099712
            },
            {
                "language": "DE",
                "text": "Die Berichterstattung über ein Problem ist ein Prozess, der einige grundlegende Recherchen, eine sorgfältige Beschreibung der Reproduktion des Problems und das Sammeln wichtiger Informationen erfordert.",
                "updated": 1678643131918
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Before you consider reporting an issue, make sure you do everything within your reach to investigate the problem. In most cases, you will find that there is no issue at all and that you were making a mistake, skipping a step in the process, or not fulfilling a requirement.",
            "updated": 1611510227112,
            "translations": [
                {
                    "language": "RU",
                    "text": "Прежде чем сообщать о проблеме, убедитесь, что вы сделали все возможное для ее изучения. В большинстве случаев вы обнаружите, что проблемы вообще нет, а вы допустили ошибку, пропустили шаг в процессе или не выполнили требование.",
                    "updated": 1640441151323
                },
                {
                    "language": "TR",
                    "text": "Bir sorunu bildirmeyi düşünmeden önce, sorunu araştırmak için ulaşabileceğiniz her şeyi yaptığınızdan emin olun. Çoğu durumda, hiçbir sorun olmadığını ve bir hata yaptığınızı, süreçte bir adımı atladığınızı veya bir şartı yerine getirmediğinizi göreceksiniz.",
                    "updated": 1647857133975
                },
                {
                    "language": "DE",
                    "text": "Bevor Sie die Meldung eines Problems in Erwägung ziehen, sollten Sie alles Mögliche tun, um das Problem zu untersuchen. In den meisten Fällen werden Sie feststellen, dass es gar kein Problem gibt und dass Sie einen Fehler gemacht, einen Arbeitsschritt übersprungen oder eine Anforderung nicht erfüllt haben.",
                    "updated": 1678643148805
                }
            ]
        },
        {
            "style": "Important",
            "text": "The How to Troubleshoot an Issue guide takes you through a step-by-step process to investigate your issue and gather all relevant information. Carefully following the guide is a requirement for reporting an issue. If the very act of going through the troubleshooting steps does not solve your issue, then come back here once you have finished gathering the required information, as instructed in the guide. Remember, reporting an issue requires understanding what the issue is about, being able to explain how to reproduce it, and providing all relevant information.",
            "updated": 1611510328837,
            "translations": [
                {
                    "language": "RU",
                    "text": "Руководство How to Troubleshoot an Issue (''Как устранить неполадки'') представляет собой пошаговый процесс изучения проблемы и сбора всей необходимой информации. Четкое следование этому руководству является обязательным условием для сообщения о проблеме. Если само прохождение шагов по устранению неполадок не решит вашу проблему, вернитесь сюда, когда закончите сбор необходимой информации, как указано в руководстве. Помните, что для сообщения о проблеме необходимо понимать, в чем она заключается, уметь объяснить, как ее воспроизвести, и предоставить всю необходимую информацию.",
                    "updated": 1640443316402
                },
                {
                    "language": "TR",
                    "text": "Önemli: Bir Sorun Nasıl Giderilir kılavuzu ( How to Troubleshoot an Issue ), sorununuzu araştırmak ve ilgili tüm bilgileri toplamak için sizi adım adım bir süreçten geçirir. Kılavuzu dikkatli bir şekilde takip etmek, bir sorunu bildirmek için bir gerekliliktir. Sorun giderme adımlarını uygulamanız bile sorununuzu çözmezse, kılavuzda belirtildiği gibi gerekli bilgileri toplamayı bitirdikten sonra buraya geri dönün. Bir sorunu bildirmenin, sorunun neyle ilgili olduğunu anlamayı, sorunun nasıl yeniden üretileceğini açıklayabilmeyi ve ilgili tüm bilgileri sağlamayı gerektirdiğini unutmayın.",
                    "updated": 1647857230000
                },
                {
                    "language": "DE",
                    "text": "Der Leitfaden zur Problembehandlung (How to Troubleshoot an Issue) führt Sie Schritt für Schritt durch die Untersuchung Ihres Problems und die Sammlung aller relevanten Informationen. Die sorgfältige Befolgung des Leitfadens ist eine Voraussetzung für die Meldung des Problems. Wenn das Durchlaufen der Schritte zur Fehlerbehebung Ihr Problem nicht löst, kommen Sie hierher zurück, sobald Sie die erforderlichen Informationen gesammelt haben, wie in der Anleitung beschrieben. Denken Sie daran, dass Sie ein Problem nur dann melden können, wenn Sie verstehen, worum es geht, wenn Sie erklären können, wie Sie das Problem reproduzieren können, und dass Sie alle relevanten Informationen bereitstellen können.",
                    "updated": 1678643161189
                }
            ]
        },
        {
            "style": "Title",
            "text": "1. Search for Similar Issues",
            "updated": 1611511273179,
            "translations": [
                {
                    "language": "RU",
                    "text": "1. Поиск похожих вопросов",
                    "updated": 1640443325327
                },
                {
                    "language": "TR",
                    "text": "1. Benzer Sorunları Arayın",
                    "updated": 1647857289388
                },
                {
                    "language": "DE",
                    "text": "1. Suche nach ähnlichen Themen",
                    "updated": 1678643170312
                }
            ]
        },
        {
            "style": "Text",
            "text": "Go to the Issues page in the Superalgos repository and use the search box to find issues that may be similar to yours.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Перейдите на страницу Issues в репозитории Superalgos в GitHub.com и используйте поле поиска, чтобы найти проблемы, которые могут быть похожи на вашу.",
                    "updated": 1640443410845
                },
                {
                    "language": "TR",
                    "text": "Superalgos deposundaki Sorunlar sayfasına gidin ve sizinkine benzer olabilecek sorunları bulmak için arama kutusunu kullanın.",
                    "updated": 1647857323801
                },
                {
                    "language": "DE",
                    "text": "Gehen Sie auf die Seite \"Issues\" im Superalgos-Repository und verwenden Sie das Suchfeld, um Fehler zu finden, die Ihrem ähnlich sind. ",
                    "updated": 1678643208983
                }
            ]
        },
        {
            "style": "List",
            "text": "Search for open and closed issues (remove the is open tag).",
            "updated": 1611510615215,
            "translations": [
                {
                    "language": "RU",
                    "text": "Поиск открытых и закрытых вопросов (удалите тег is open).",
                    "updated": 1640443381134
                },
                {
                    "language": "TR",
                    "text": "Açık ve kapalı sorunları arayın ( is open etiketini kaldırın).",
                    "updated": 1647857336635
                },
                {
                    "language": "DE",
                    "text": "Suchen Sie nach offenen und geschlossenen Fehlern (entfernen Sie das Tag \"is open\").",
                    "updated": 1678643213358
                }
            ]
        },
        {
            "style": "List",
            "text": "Try different keywords you would use to describe the issue.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Попробуйте использовать различные ключевые слова, которые вы бы использовали для описания проблемы.",
                    "updated": 1640443440728
                },
                {
                    "language": "TR",
                    "text": "Sorunu açıklamak için kullanacağınız farklı anahtar kelimeleri deneyin.",
                    "updated": 1647857349960
                },
                {
                    "language": "DE",
                    "text": "Probieren Sie verschiedene Schlüsselwörter aus, die Sie zur Beschreibung des Problems verwenden würden.",
                    "updated": 1678643220112
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you find an issue that is similar to yours, read the whole thread. You may find information conducive to solving the issue, proposed workarounds, or reports on the status of the solution to the issue.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы нашли проблему, похожую на вашу, прочитайте всю тему. Вы можете найти информацию, способствующую решению проблемы, предлагаемые обходные пути или отчеты о состоянии решения проблемы.",
                    "updated": 1640443468500
                },
                {
                    "language": "TR",
                    "text": "Sizinkine benzer bir sorun bulursanız, tüm ileti dizisini okuyun. Sorunu çözmeye yardımcı olacak bilgiler, önerilen geçici çözümler veya sorunun çözümünün durumu hakkında raporlar bulabilirsiniz.",
                    "updated": 1647857594347
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie ein Problem finden, das dem Ihren ähnlich ist, lesen Sie den ganzen Thread. Möglicherweise finden Sie Informationen, die zur Lösung des Problems beitragen, Vorschläge für Umgehungslösungen oder Berichte über den Stand der Lösung des Problems.",
                    "updated": 1678643236458
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you believe you have information relevant to the issue that has not yet been offered by other users, then go ahead and reply to the issue with everything you know about your case.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы считаете, что у вас есть информация, относящаяся к данному вопросу, которая еще не была предложена другими пользователями, тогда продолжайте отвечать на вопрос, указав все, что вы знаете о вашем случае.",
                    "updated": 1640443486318
                },
                {
                    "language": "TR",
                    "text": "Sorunla ilgili diğer kullanıcılar tarafından henüz sunulmamış bilgilere sahip olduğunuzu düşünüyorsanız, devam edin ve davanız hakkında bildiğiniz her şeyle soruna yanıt verin.",
                    "updated": 1647857650021
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie der Meinung sind, dass Sie Informationen haben, die für das Problem relevant sind und die noch nicht von anderen Nutzern angeboten wurden, dann antworten Sie auf die Frage mit allem, was Sie über Ihren Fall wissen.",
                    "updated": 1678643249038
                }
            ]
        },
        {
            "style": "Text",
            "text": "If there are no issues similar to yours, or your issue happens in a different context not addressed in the issues you’ve found, then go on with the next few steps.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если проблем, похожих на вашу, нет, или ваша проблема возникает в другом контексте, который не рассматривается в найденных вами проблемах, переходите к следующим шагам.",
                    "updated": 1640443505524
                },
                {
                    "language": "TR",
                    "text": "Sizinkine benzer bir sorun yoksa veya sorununuz, bulduğunuz sorunlarda ele alınmayan farklı bir bağlamda ortaya çıkıyorsa, sonraki birkaç adıma geçin.",
                    "updated": 1647857675901
                },
                {
                    "language": "DE",
                    "text": "Wenn es keine Probleme gibt, die mit Ihrem Problem vergleichbar sind, oder wenn Ihr Problem in einem anderen Zusammenhang auftritt, der in den gefundenen Problemen nicht angesprochen wird, dann fahren Sie mit den nächsten Schritten fort.",
                    "updated": 1678643263966
                }
            ]
        },
        {
            "style": "Title",
            "text": "2. Are you Ready to Report an Issue?",
            "updated": 1611511264814,
            "translations": [
                {
                    "language": "RU",
                    "text": "2. Готовы ли вы сообщить о проблеме?",
                    "updated": 1640443512376
                },
                {
                    "language": "TR",
                    "text": "2. Bir Sorun Bildirmeye Hazır mısınız?",
                    "updated": 1647857700296
                },
                {
                    "language": "DE",
                    "text": "2. Sind Sie bereit, ein Problem zu melden?",
                    "updated": 1678643274606
                }
            ]
        },
        {
            "style": "Text",
            "text": "Please, make an honest assessment of the following questions:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Пожалуйста, честно ответьте на следующие вопросы:",
                    "updated": 1640443520702
                },
                {
                    "language": "TR",
                    "text": "Lütfen aşağıdaki sorular hakkında dürüst bir değerlendirme yapın:",
                    "updated": 1647857740283
                },
                {
                    "language": "DE",
                    "text": "Bitte nehmen Sie eine ehrliche Bewertung der folgenden Fragen vor:",
                    "updated": 1678643285179
                }
            ]
        },
        {
            "style": "List",
            "text": "Have you followed the How to Troubleshoot an Issue guide to the best of your abilities?",
            "updated": 1611510652729,
            "translations": [
                {
                    "language": "RU",
                    "text": "Выполнили ли вы руководство How to Troubleshoot an Issue в меру своих возможностей?",
                    "updated": 1640443572626
                },
                {
                    "language": "TR",
                    "text": "Yetenekleriniz doğrultusunda Sorun Giderme ( How to Troubleshoot an Issue ) kılavuzunu izlediniz mi?",
                    "updated": 1647857841480
                },
                {
                    "language": "DE",
                    "text": "Haben Sie die Anleitung zur Fehlerbehebung (How to Troubleshoot an Issue) nach bestem Wissen und Gewissen befolgt?",
                    "updated": 1678643297801
                }
            ]
        },
        {
            "style": "List",
            "text": "Have you tested your issue with today’s version of the software?",
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверили ли вы свою проблему с текущей версией программного обеспечения?",
                    "updated": 1640443692791
                },
                {
                    "language": "TR",
                    "text": "Sorununuzu yazılımın bugünkü sürümüyle test ettiniz mi?",
                    "updated": 1647857893209
                },
                {
                    "language": "DE",
                    "text": "Haben Sie Ihr Problem mit der aktuellen Version der Software getestet?",
                    "updated": 1678643314893
                }
            ]
        },
        {
            "style": "List",
            "text": "Have you verified that none of the troubleshooting pages in the documentation addresses and solves your issue?",
            "translations": [
                {
                    "language": "RU",
                    "text": "Убедились ли вы, что ни одна из страниц документации по устранению неполадок не рассматривает и не решает вашу проблему?",
                    "updated": 1640443706463
                },
                {
                    "language": "TR",
                    "text": "Belgelerdeki sorun giderme sayfalarından hiçbirinin sorununuzu ele almadığını ve çözmediğini doğruladınız mı?",
                    "updated": 1647857907546
                },
                {
                    "language": "DE",
                    "text": "Haben Sie überprüft, dass keine der Seiten zur Fehlerbehebung in der Dokumentation Ihr Problem anspricht und löst?",
                    "updated": 1678643403576
                }
            ]
        },
        {
            "style": "List",
            "text": "Have you captured and saved the associated errors in the browser console or the Log-Files folder?",
            "translations": [
                {
                    "language": "RU",
                    "text": "Отлавливали ли вы и сохраняли ли соответствующие ошибки в консоли браузера или в папке Log-Files?",
                    "updated": 1640443796568
                },
                {
                    "language": "TR",
                    "text": "Tarayıcı konsolunda veya Günlük Dosyaları klasöründe ilişkili hataları yakalayıp kaydettiniz mi?",
                    "updated": 1647857935291
                },
                {
                    "language": "DE",
                    "text": "Haben Sie die zugehörigen Fehler in der Browserkonsole oder im Ordner \"Log-Files\" erfasst und gespeichert?",
                    "updated": 1678643412872
                }
            ]
        },
        {
            "style": "List",
            "text": "In case your issue is related to the frontend… are you using Chrome or Safari to test the issue?",
            "updated": 1611510679400,
            "translations": [
                {
                    "language": "RU",
                    "text": "В случае, если ваша проблема связана с фронтендом... вы используете Chrome или Safari для проверки проблемы?",
                    "updated": 1640443819348
                },
                {
                    "language": "TR",
                    "text": "Sorununuzun ön uçla ilgili olması durumunda… sorunu test etmek için Chrome veya Safari kullanıyor musunuz?",
                    "updated": 1647857959970
                },
                {
                    "language": "DE",
                    "text": "Falls Ihr Problem mit dem Frontend zusammenhängt... verwenden Sie Chrome oder Safari, um das Problem zu testen?",
                    "updated": 1678643425184
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you answer no to any of the above, then you are not ready to open an issue. If you may confidently answer yes to all questions, then please proceed.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы ответили \"нет\" на любой из вышеперечисленных вопросов, значит, вы не готовы к открытию проблемы. Если вы можете с уверенностью ответить \"да\" на все вопросы, то, пожалуйста, продолжайте.",
                    "updated": 1640443835611
                },
                {
                    "language": "TR",
                    "text": "Yukarıdakilerden herhangi birine hayır cevabı verirseniz, bir konu açmaya hazır değilsiniz. Tüm sorulara güvenle evet yanıtı veriyorsanız, lütfen devam edin.",
                    "updated": 1647857980459
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie eine der obigen Fragen mit Nein beantworten können, sind Sie nicht bereit, ein Problem zu eröffnen. Wenn Sie alle Fragen mit Ja beantworten können, fahren Sie bitte fort.",
                    "updated": 1678643436359
                }
            ]
        },
        {
            "style": "Title",
            "text": "3. Consider the Following",
            "updated": 1611511254512,
            "translations": [
                {
                    "language": "RU",
                    "text": "3. Рассмотрите следующие вопросы",
                    "updated": 1640443847141
                },
                {
                    "language": "TR",
                    "text": "3. Aşağıdakileri Göz önünde bulundurun",
                    "updated": 1647858003497
                },
                {
                    "language": "DE",
                    "text": "3. Berücksichtigen Sie Folgendes",
                    "updated": 1678643443807
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the issue may be reproduced on one of the official workspaces, then report the issue as such. Issues occurring on custom workspaces have a lower priority.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если проблема может быть воспроизведена на одном из официальных рабочих пространств, сообщите об этом. Проблемы, возникающие на пользовательских рабочих пространствах, имеют более низкий приоритет.",
                    "updated": 1640443865326
                },
                {
                    "language": "TR",
                    "text": "Sorun resmi çalışma alanlarından birinde tekrar ediliyorsa, sorunu bu şekilde bildirin. Özel çalışma alanlarında meydana gelen sorunlar daha düşük önceliğe sahiptir.",
                    "updated": 1647858029714
                },
                {
                    "language": "DE",
                    "text": "Wenn das Problem in einem der offiziellen Arbeitsbereiche reproduziert werden kann, melden Sie es als solches. Probleme, die in benutzerdefinierten Arbeitsbereichen auftreten, haben eine niedrigere Priorität.",
                    "updated": 1678643459630
                }
            ]
        },
        {
            "style": "Text",
            "text": "Issues that may not be reproduced have lower priority than those that may be reproduced.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Вопросы, которые не могут быть воспроизведены, имеют более низкий приоритет, чем те, которые могут быть воспроизведены.",
                    "updated": 1640443883412
                },
                {
                    "language": "TR",
                    "text": "Çoğaltılamayan konular, çoğaltılabilenlerden daha düşük önceliğe sahiptir.",
                    "updated": 1647858054227
                },
                {
                    "language": "DE",
                    "text": "Fragen, die nicht reproduziert werden können, haben eine geringere Priorität als solche, die reproduziert werden können.",
                    "updated": 1678643471136
                }
            ]
        },
        {
            "style": "Title",
            "text": "4. Open a New Issue",
            "updated": 1611511249720,
            "translations": [
                {
                    "language": "RU",
                    "text": "4. Откройте новую проблему",
                    "updated": 1640444097759
                },
                {
                    "language": "TR",
                    "text": "4. Yeni Bir Sayı Açın",
                    "updated": 1647858095272
                },
                {
                    "language": "DE",
                    "text": "4. Eine neue Ausgabe öffnen",
                    "updated": 1678643479461
                }
            ]
        },
        {
            "style": "Text",
            "text": "Click the New Issue button and select Get Started on the Bug report item. The following form will open:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Нажмите кнопку New Issue и выберите Get Started в пункте Bug report. Откроется следующая форма:",
                    "updated": 1640444108801
                },
                {
                    "language": "TR",
                    "text": "Yeni Sorun düğmesini tıklayın ve Hata raporu öğesinde Başlayın'ı seçin. Aşağıdaki form açılacaktır:",
                    "updated": 1647858110097
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf die Schaltfläche Neues Problem und wählen Sie im Feld Fehlerbericht die Option Starten. Das folgende Formular wird geöffnet:",
                    "updated": 1678643498567
                }
            ]
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/third-parties/report-an-issue-01.png",
            "updated": 1611510882221
        },
        {
            "style": "Text",
            "text": "Carefully complete the form following the below guidelines:",
            "updated": 1611510902570,
            "translations": [
                {
                    "language": "RU",
                    "text": "Внимательно заполните форму, следуя приведенным ниже указаниям:",
                    "updated": 1640444119940
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki yönergeleri izleyerek formu dikkatlice doldurun:",
                    "updated": 1647858240703
                },
                {
                    "language": "DE",
                    "text": "Füllen Sie das Formular sorgfältig aus und beachten Sie dabei die folgenden Hinweise:",
                    "updated": 1678643503628
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Title",
            "translations": [
                {
                    "language": "RU",
                    "text": "Заголовок",
                    "updated": 1640444147011
                },
                {
                    "language": "TR",
                    "text": "Başlık",
                    "updated": 1647858245974
                },
                {
                    "language": "DE",
                    "text": "Titel",
                    "updated": 1678643511175
                }
            ]
        },
        {
            "style": "Text",
            "text": "Do your best to describe the issue in a single, short sentence. Take your time. A good practice is describing what happens and in which context. For example: “WHB backtest stops short of finalDatetime”.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Сделайте все возможное, чтобы описать проблему в одном коротком предложении. Не торопитесь. Хорошей практикой является описание того, что происходит и в каком контексте. Например: \"Бэктест WHB останавливается перед finalDatetime\".",
                    "updated": 1640444187811
                },
                {
                    "language": "TR",
                    "text": "Sorunu tek ve kısa bir cümleyle açıklamak için elinizden gelenin en iyisini yapın. Acele etmeyin. İyi bir uygulama, ne olduğunu ve hangi bağlamda olduğunu açıklamaktır. Örneğin: \"WHB geriye dönük testi, finalDatetime süresinden kısa süre sonra durur\".",
                    "updated": 1647858324551
                },
                {
                    "language": "DE",
                    "text": "Geben Sie Ihr Bestes, um das Problem in einem einzigen, kurzen Satz zu beschreiben. Nehmen Sie sich Zeit. Eine gute Praxis ist es, zu beschreiben, was passiert und in welchem Zusammenhang. Zum Beispiel: \"WHB-Backtest stoppt kurz vor finalDatetime\".",
                    "updated": 1678643521067
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Context",
            "translations": [
                {
                    "language": "RU",
                    "text": "Содержание",
                    "updated": 1640444212972
                },
                {
                    "language": "TR",
                    "text": "Bağlam",
                    "updated": 1647858346453
                },
                {
                    "language": "DE",
                    "text": "Kontext",
                    "updated": 1678643531262
                }
            ]
        },
        {
            "style": "Text",
            "text": "Complete and adjust the contents leaving the information that fits your case and deleting the information that doesn’t.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Заполните и скорректируйте содержание, оставив информацию, которая подходит к вашей ситуации, и удалив ту, которая не подходит.",
                    "updated": 1640444280420
                },
                {
                    "language": "TR",
                    "text": "Durumunuza uyan bilgileri bırakarak ve uymayan bilgileri silerek içeriği tamamlayın ve ayarlayın.",
                    "updated": 1647858350021
                },
                {
                    "language": "DE",
                    "text": "Vervollständigen Sie den Inhalt und passen Sie ihn an, indem Sie die Informationen, die zu Ihrem Fall passen, belassen und die Informationen, die nicht passen, löschen.",
                    "updated": 1678643541656
                }
            ]
        },
        {
            "style": "List",
            "text": "Operating System: Windows / MacOs / Linux / Other (include the version on either case)",
            "translations": [
                {
                    "language": "RU",
                    "text": "Operating System (Операционная система): Windows / MacOs / Linux / Другая (укажите версию в любом случае)",
                    "updated": 1640444423027
                },
                {
                    "language": "TR",
                    "text": "İşletim Sistemi: Windows / MacOs / Linux / Diğer (her iki durumda da sürümü dahil edin)",
                    "updated": 1647858403145
                },
                {
                    "language": "DE",
                    "text": "Betriebssystem: Windows / MacOs / Linux / Andere (geben Sie in jedem Fall die Version an)",
                    "updated": 1678643556822
                }
            ]
        },
        {
            "style": "List",
            "text": "Software version: today’s master branch / today’s develop branch",
            "translations": [
                {
                    "language": "RU",
                    "text": "Software version (Версия программного обеспечения): сегодняшняя ветвь master / сегодняшняя ветвь develop",
                    "updated": 1640444368539
                },
                {
                    "language": "TR",
                    "text": "Yazılım versiyonu: bugünün ana dalı / bugünün geliştirme dalı",
                    "updated": 1647858424290
                },
                {
                    "language": "DE",
                    "text": "Software-Version: heutiger Master-Zweig / heutiger Entwicklungszweig",
                    "updated": 1678643566090
                }
            ]
        },
        {
            "style": "List",
            "text": "Workspace version: default Workspace.json (Getting Started Guide) / Simple Workspace.json / Workspace - Binance - WHB - BBTB.json / My custom workspace",
            "translations": [
                {
                    "language": "RU",
                    "text": "Workspace version (Версия рабочего пространства): Workspace.json по умолчанию (Getting Started Guide) / Simple Workspace.json / Workspace - Binance - WHB - BBTB.json / My custom workspace (Мое пользовательское рабочее пространство)",
                    "updated": 1640444480961
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanı sürümü: varsayılan Workspace.json (Başlangıç Kılavuzu) / Simple Workspace.json / Çalışma Alanı - Binance - WHB - BBTB.json / Özel çalışma alanım",
                    "updated": 1647858520962
                },
                {
                    "language": "DE",
                    "text": "Arbeitsbereich (Workspace) -Version: Standard-Workspace.json (Anleitung für den Einstieg) / Einfacher Workspace.json / Workspace - Binance - WHB - BBTB.json / Mein eigener Arbeitsbereich",
                    "updated": 1678643595027
                }
            ]
        },
        {
            "style": "List",
            "text": "Reproducible: the issue may / may not be reproduced.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Reproducible (Воспроизводимая): проблема может / не может быть воспроизведена.",
                    "updated": 1640444525920
                },
                {
                    "language": "TR",
                    "text": "Tekrarlanabilir: sorun yeniden üretilebilir / üretilemez.",
                    "updated": 1647858533991
                },
                {
                    "language": "DE",
                    "text": "Nachvollziehbarkeit: Das Problem kann / darf nicht vervielfältigt werden.",
                    "updated": 1678643770497
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Explain Your Issue",
            "updated": 1611511238751,
            "translations": [
                {
                    "language": "RU",
                    "text": "Объясните свою проблему",
                    "updated": 1640444535046
                },
                {
                    "language": "TR",
                    "text": "Sorununuzu Açıklayın",
                    "updated": 1647858569177
                },
                {
                    "language": "DE",
                    "text": "Erklären Sie Ihr Problem",
                    "updated": 1678643780576
                }
            ]
        },
        {
            "style": "List",
            "text": "Explain what the problem seems to be.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Объясните, в чем, на первый взгляд, заключается проблема.",
                    "updated": 1640444555557
                },
                {
                    "language": "TR",
                    "text": "Problemin ne olduğunu açıklayın.",
                    "updated": 1647858582291
                },
                {
                    "language": "DE",
                    "text": "Erklären Sie, worin das Problem zu bestehen scheint.",
                    "updated": 1678643788775
                }
            ]
        },
        {
            "style": "List",
            "text": "Clearly explain what you wish to accomplish.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Четко объясните, чего вы хотите добиться.",
                    "updated": 1640444565412
                },
                {
                    "language": "TR",
                    "text": "Neyi başarmak istediğinizi açıkça belirtin.",
                    "updated": 1647858594967
                },
                {
                    "language": "DE",
                    "text": "Erklären Sie klar und deutlich, was Sie erreichen wollen.",
                    "updated": 1678643797214
                }
            ]
        },
        {
            "style": "List",
            "text": "Explain, step by step, what you’ve done to achieve the goal. The Team will follow these steps to reproduce the issue, so be precise.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Объясните, шаг за шагом, что вы сделали для достижения цели. Команда будет следовать этим шагам, чтобы воспроизвести проблему, поэтому будьте точны.",
                    "updated": 1640444578963
                },
                {
                    "language": "TR",
                    "text": "Hedefe ulaşmak için ne yaptığınızı adım adım açıklayın. Ekip, sorunu yeniden oluşturmak için bu adımları izleyecektir, bu nedenle kesin olun.",
                    "updated": 1647858614578
                },
                {
                    "language": "DE",
                    "text": "Erklären Sie Schritt für Schritt, was Sie getan haben, um das Ziel zu erreichen. Das Team wird diese Schritte befolgen, um das Problem zu reproduzieren, also seien Sie genau.",
                    "updated": 1678643806268
                }
            ]
        },
        {
            "style": "List",
            "text": "Explain what is the result you expect from your actions.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Объясните, какого результата вы ожидаете от своих действий.",
                    "updated": 1640444588360
                },
                {
                    "language": "TR",
                    "text": "Eylemlerinizden beklediğiniz sonucun ne olduğunu açıklayın.",
                    "updated": 1647858631504
                },
                {
                    "language": "DE",
                    "text": "Erklären Sie, welches Ergebnis Sie von Ihrem Handeln erwarten.",
                    "updated": 1678643818813
                }
            ]
        },
        {
            "style": "List",
            "text": "Explain what happens instead of the expected results.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Объясните, что происходит вместо ожидаемых результатов.",
                    "updated": 1640444597078
                },
                {
                    "language": "TR",
                    "text": "Beklenen sonuçlar yerine ne olacağını açıklayın.",
                    "updated": 1647858650595
                },
                {
                    "language": "DE",
                    "text": "Erklären Sie, was anstelle der erwarteten Ergebnisse geschieht.",
                    "updated": 1678643829363
                }
            ]
        },
        {
            "style": "List",
            "text": "Explain what errors you have found on-screen, on the browser console application, or in the Log-Files folder.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Объясните, какие ошибки вы обнаружили на экране, в консольном приложении браузера или в папке Log-Files.",
                    "updated": 1640444607693
                },
                {
                    "language": "TR",
                    "text": "Ekranda, tarayıcı konsolu uygulamasında veya Günlük Dosyaları klasöründe bulduğunuz hataları açıklayın.",
                    "updated": 1647858667176
                },
                {
                    "language": "DE",
                    "text": "Erklären Sie, welche Fehler Sie auf dem Bildschirm, in der Konsolenanwendung des Browsers oder im Ordner Log-Files gefunden haben.",
                    "updated": 1678643838860
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Reproduce the Issue on Video",
            "updated": 1611511228776,
            "translations": [
                {
                    "language": "RU",
                    "text": "Воспроизведите проблему на видео",
                    "updated": 1640444628473
                },
                {
                    "language": "TR",
                    "text": "Videoda Sorunu Yeniden Oluşturun",
                    "updated": 1647858720902
                },
                {
                    "language": "DE",
                    "text": "Reproduzieren Sie das Problem auf Video",
                    "updated": 1678643852872
                }
            ]
        },
        {
            "style": "Text",
            "text": "The most important aspect of investigating an issue is being able to reproduce it. Capturing a video showing the steps that lead to the issue would be of great help.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Самый важный аспект исследования проблемы - это возможность воспроизвести ее. Запись видеоролика, показывающего шаги, которые привели к возникновению проблемы, будет очень полезна.",
                    "updated": 1640444656309
                },
                {
                    "language": "TR",
                    "text": "Bir sorunu incelemenin en önemli yönü, onu yeniden üretebilmektir. Soruna yol açan adımları gösteren bir video çekmek çok yardımcı olacaktır.",
                    "updated": 1647858716045
                },
                {
                    "language": "DE",
                    "text": "Der wichtigste Aspekt bei der Untersuchung eines Problems ist die Möglichkeit, es zu reproduzieren. Die Aufnahme eines Videos, das die Schritte zeigt, die zu dem Problem führen, wäre eine große Hilfe.",
                    "updated": 1678643862006
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the issue happens within the browser, you may use the systems’ video capture feature:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если проблема возникает в браузере, вы можете воспользоваться функцией захвата видео в системе:",
                    "updated": 1640444675912
                },
                {
                    "language": "TR",
                    "text": "Sorun tarayıcıda meydana gelirse, sistemlerin video yakalama özelliğini kullanabilirsiniz:",
                    "updated": 1647858742148
                },
                {
                    "language": "DE",
                    "text": "Wenn das Problem innerhalb des Browsers auftritt, können Sie die Videoaufnahmefunktion des Systems verwenden:",
                    "updated": 1678643874190
                }
            ]
        },
        {
            "style": "List",
            "text": "Hit Ctrl + F8 to capture a static PNG image.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Нажмите Ctrl + F8, чтобы захватить статическое изображение PNG.",
                    "updated": 1640444684230
                },
                {
                    "language": "TR",
                    "text": "Statik bir PNG görüntüsü yakalamak için Ctrl + F8 tuşlarına basın.",
                    "updated": 1647858800959
                },
                {
                    "language": "DE",
                    "text": "Drücken Sie Ctrl + F8, um ein statisches PNG-Bild zu erfassen.",
                    "updated": 1678643901675
                }
            ]
        },
        {
            "style": "List",
            "text": "Hit Ctrl + F9 to start capturing a GIF video, and hit the same key combination again to end the capture. Once the capture ends, it takes some time to process the capture and generate the final file.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Нажмите Ctrl + F9, чтобы начать захват GIF-видео, и нажмите ту же комбинацию клавиш еще раз, чтобы завершить захват. После завершения захвата потребуется некоторое время для его обработки и создания конечного файла.",
                    "updated": 1640444711080
                },
                {
                    "language": "TR",
                    "text": "Bir GIF videosu çekmeye başlamak için Ctrl + F9 tuşlarına basın ve yakalamayı bitirmek için aynı tuş kombinasyonuna tekrar basın. Yakalama sona erdiğinde, yakalamayı işlemek ve son dosyayı oluşturmak biraz zaman alır.",
                    "updated": 1647858819550
                },
                {
                    "language": "DE",
                    "text": "Drücken Sie Ctrl + F9, um die Aufnahme eines GIF-Videos zu starten, und drücken Sie die gleiche Tastenkombination erneut, um die Aufnahme zu beenden. Sobald die Aufnahme beendet ist, dauert es einige Zeit, bis die Aufnahme verarbeitet und die endgültige Datei erstellt ist.",
                    "updated": 1678643998954
                }
            ]
        },
        {
            "style": "List",
            "text": "Hit Ctrl + F10 to start capturing a WEBM video, and hit the same key combination again to end the capture. WEBM videos are processed instantly.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Нажмите Ctrl + F10, чтобы начать захват WEBM-видео, и нажмите ту же комбинацию клавиш еще раз, чтобы завершить захват. WEBM-видео обрабатываются мгновенно.",
                    "updated": 1640444721869
                },
                {
                    "language": "TR",
                    "text": "Bir WEBM videosunu çekmeye başlamak için Ctrl + F10 tuşlarına basın ve yakalamayı bitirmek için aynı tuş kombinasyonuna tekrar basın. WEBM videoları anında işlenir.",
                    "updated": 1647858836417
                },
                {
                    "language": "DE",
                    "text": "Drücken Sie Ctrl + F10, um die Aufnahme eines WEBM-Videos zu starten, und drücken Sie die gleiche Tastenkombination erneut, um die Aufnahme zu beenden. WEBM-Videos werden sofort verarbeitet.",
                    "updated": 1678644021297
                }
            ]
        },
        {
            "style": "Text",
            "text": "In all three cases, the browser downloads the resulting file and makes it available in the downloads folder.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Во всех трех случаях браузер загружает полученный файл и делает его доступным в папке загрузок.",
                    "updated": 1640444735250
                },
                {
                    "language": "TR",
                    "text": "Her üç durumda da, tarayıcı ortaya çıkan dosyayı indirir ve onu indirilenler klasöründe kullanılabilir hale getirir.",
                    "updated": 1647859050477
                },
                {
                    "language": "DE",
                    "text": "In allen drei Fällen lädt der Browser die resultierende Datei herunter und stellt sie im Ordner \"Downloads\" zur Verfügung.",
                    "updated": 1678644032565
                }
            ]
        },
        {
            "style": "Note",
            "text": "GIF files tend to grow a lot in long captures, but are more universal, thus more devices can display them properly. WEBM files are a lot more efficient, but do not work in Apple and, potentially, other platforms or devices.",
            "updated": 1611511119973,
            "translations": [
                {
                    "language": "RU",
                    "text": "Файлы GIF имеют тенденцию сильно увеличиваться при длительном захвате, но они более универсальны, поэтому больше устройств могут их правильно отображать. Файлы WEBM намного эффективнее, но не работают в Apple и, вероятно, на других платформах и устройствах.",
                    "updated": 1640444765471
                },
                {
                    "language": "TR",
                    "text": "Not: GIF dosyaları, uzun çekimlerde çok fazla büyüme eğilimindedir, ancak daha evrenseldir, bu nedenle daha fazla cihaz bunları düzgün bir şekilde görüntüleyebilir. WEBM dosyaları çok daha verimlidir, ancak Apple'da ve potansiyel olarak diğer platformlarda veya cihazlarda çalışmaz.",
                    "updated": 1647859117606
                },
                {
                    "language": "DE",
                    "text": "GIF-Dateien neigen dazu, bei langen Aufnahmen sehr groß zu werden, sind aber universeller, so dass mehr Geräte sie richtig anzeigen können. WEBM-Dateien sind viel effizienter, funktionieren aber nicht auf Apple und möglicherweise auf anderen Plattformen oder Geräten.",
                    "updated": 1678644043760
                }
            ]
        },
        {
            "style": "Text",
            "text": "In case the issue does not happen at the browser, for example, if it happens at the console, LICEcap is a lightweight, simple system that can help you capture GIF videos outside of Superalgos.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В случае если проблема возникает не в браузере, а, например, в консоли, LICEcap - это легкая и простая система, которая поможет вам захватить GIF-видео вне Superalgos.",
                    "updated": 1640444797164
                },
                {
                    "language": "TR",
                    "text": "Sorunun tarayıcıda olmaması durumunda, örneğin konsolda olması durumunda LICEcap, Superalgos dışında GIF videoları çekmenize yardımcı olabilecek hafif ve basit bir sistemdir.",
                    "updated": 1647859151780
                },
                {
                    "language": "DE",
                    "text": "Falls das Problem nicht im Browser auftritt, sondern z. B. an der Konsole, ist LICEcap ein leichtes, einfaches System, mit dem Sie GIF-Videos außerhalb von Superalgos aufnehmen können.",
                    "updated": 1678644057687
                }
            ]
        },
        {
            "style": "Note",
            "text": "Bear in mind that GitHub issues accept files 10MB and lighter only.",
            "updated": 1611511131091,
            "translations": [
                {
                    "language": "RU",
                    "text": "Имейте в виду, что GitHub Issues принимает только файлы размером 10 МБ и меньше.",
                    "updated": 1640445473515
                },
                {
                    "language": "TR",
                    "text": "Not: GitHub sorunlarının yalnızca 10 MB ve daha hafif dosyaları kabul ettiğini unutmayın.",
                    "updated": 1647859182029
                },
                {
                    "language": "DE",
                    "text": "Beachten Sie, dass GitHub-Projekte nur Dateien mit einer Größe von 10 MB und weniger akzeptieren.",
                    "updated": 1678644076900
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Attach Relevant Log Files",
            "updated": 1611511219274,
            "translations": [
                {
                    "language": "RU",
                    "text": "Прикрепите соответствующие файлы логов",
                    "updated": 1640445271601
                },
                {
                    "language": "TR",
                    "text": "İlgili Günlük Dosyalarını Ekleyin",
                    "updated": 1647859206224
                },
                {
                    "language": "DE",
                    "text": "Relevante Protokolldateien anhängen",
                    "updated": 1678644083938
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you have on-screen errors or errors at the browser console, screen captures are fine.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если у вас есть отображаемые на экране ошибки или ошибки в консоли браузера, скриншоты - они тоже подойдут.",
                    "updated": 1640445344672
                },
                {
                    "language": "TR",
                    "text": "Tarayıcı konsolunda ekran hataları veya hatalarınız varsa, ekran yakalamaları iyidir.",
                    "updated": 1647859228286
                },
                {
                    "language": "DE",
                    "text": "Bei Bildschirmfehlern oder Fehlern in der Browserkonsole sind Bildschirmabzüge in Ordnung.",
                    "updated": 1678644092284
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you have errors in the backend, attach the logs you have collected while following the troubleshooting guide.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если у вас возникли ошибки в бэкенде, приложите журналы, которые вы собрали, следуя руководству по устранению неполадок.",
                    "updated": 1640445370144
                },
                {
                    "language": "TR",
                    "text": "Arka uçta hatalar varsa, sorun giderme kılavuzunu takip ederek topladığınız günlükleri ekleyin.",
                    "updated": 1647859242530
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie Fehler im Backend haben, fügen Sie die Protokolle bei, die Sie im Rahmen der Fehlerbehebung gesammelt haben.",
                    "updated": 1678644107179
                }
            ]
        },
        {
            "style": "Note",
            "text": "GitHub issues do not allow uploading JSON files. Make a ZIP file with all relevant logs instead.",
            "updated": 1611511170225,
            "translations": [
                {
                    "language": "RU",
                    "text": "GitHub Issues не позволяет загружать JSON-файлы. Вместо этого создайте ZIP-файл со всеми соответствующими журналами.",
                    "updated": 1640445464394
                },
                {
                    "language": "TR",
                    "text": "Not: GitHub sorunları, JSON dosyalarının yüklenmesine izin vermez. Bunun yerine tüm ilgili günlükleri içeren bir ZIP dosyası oluşturun.",
                    "updated": 1647859282473
                },
                {
                    "language": "DE",
                    "text": "GitHub-Probleme erlauben das Hochladen von JSON-Dateien nicht. Erstellen Sie stattdessen eine ZIP-Datei mit allen relevanten Protokollen.",
                    "updated": 1678644118474
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Custom Workspace?",
            "updated": 1611511208878,
            "translations": [
                {
                    "language": "RU",
                    "text": "Пользовательское рабочее пространство?",
                    "updated": 1640445505525
                },
                {
                    "language": "TR",
                    "text": "Özel Çalışma Alanı?",
                    "updated": 1647859292030
                },
                {
                    "language": "DE",
                    "text": "Benutzerdefinierter Arbeitsbereich?",
                    "updated": 1678644125946
                }
            ]
        },
        {
            "style": "Text",
            "text": "If the issue happens under specific conditions on a custom workspace, attach a share of the workspace. Do not attach backups as those may contain personal information such as API Keys.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если проблема возникает при определенных условиях на пользовательском рабочем пространстве, прикрепите общий ресурс рабочего пространства. Не прикрепляйте резервные копии, так как они могут содержать личную информацию, например ключи API.",
                    "updated": 1640445522021
                },
                {
                    "language": "TR",
                    "text": "Sorun, özel bir çalışma alanında belirli koşullar altında ortaya çıkarsa, çalışma alanının bir paylaşımını ekleyin. API Anahtarları gibi kişisel bilgiler içerebileceğinden yedekler eklemeyin.",
                    "updated": 1647859312954
                },
                {
                    "language": "DE",
                    "text": "Wenn das Problem unter bestimmten Bedingungen in einem benutzerdefinierten Arbeitsbereich auftritt, hängen Sie eine Freigabe des Arbeitsbereichs an. Hängen Sie keine Sicherungskopien an, da diese persönliche Informationen wie API-Schlüssel enthalten können.",
                    "updated": 1678644135875
                }
            ]
        },
        {
            "style": "Important",
            "text": "Upload your workspace to the issue only if you feel comfortable with sharing it openly. If there are data structures that you prefer not to share, consider removing them so that you may share the non-sensitive bits only. If the issue happens precisely with the sensitive data structures in your workspace, then clearly explain the matter and wait for further instructions.",
            "updated": 1611511186403,
            "translations": [
                {
                    "language": "RU",
                    "text": "Загружайте свое рабочее пространство в GitHub Issue, только если вам не страшно открыто поделиться им. Если есть структуры данных, которыми вы предпочитаете не делиться, подумайте об их удалении, чтобы вы могли поделиться только несекретной частью. Если проблема возникает именно с конфиденциальными структурами данных в вашем рабочем пространстве, то четко объясните суть вопроса и ждите дальнейших инструкций.",
                    "updated": 1640445656462
                },
                {
                    "language": "TR",
                    "text": "Önemli: Çalışma alanınızı yalnızca açık bir şekilde paylaşma konusunda kendinizi rahat hissediyorsanız soruna yükleyin. Paylaşmamayı tercih ettiğiniz veri yapıları varsa, yalnızca hassas olmayan bitleri paylaşabilmeniz için bunları kaldırmayı düşünün. Sorun tam olarak çalışma alanınızdaki hassas veri yapılarında meydana geliyorsa, konuyu net bir şekilde açıklayın ve sonraki talimatları bekleyin.",
                    "updated": 1647859356654
                },
                {
                    "language": "DE",
                    "text": "Laden Sie Ihren Arbeitsbereich nur dann in die Ausgabe hoch, wenn Sie sich wohl dabei fühlen, ihn offen zu teilen. Wenn es Datenstrukturen gibt, die Sie lieber nicht freigeben möchten, sollten Sie diese entfernen, damit Sie nur die nicht sensiblen Teile freigeben können. Wenn das Problem gerade mit den sensiblen Datenstrukturen in Ihrem Arbeitsbereich auftritt, erklären Sie die Angelegenheit deutlich und warten Sie auf weitere Anweisungen.",
                    "updated": 1678644151489
                }
            ]
        },
        {
            "style": "Title",
            "text": "5. Enable Github Notifications",
            "updated": 1611511204195,
            "translations": [
                {
                    "language": "RU",
                    "text": "5. Включите уведомления Github",
                    "updated": 1640445669916
                },
                {
                    "language": "TR",
                    "text": "5. Github Bildirimlerini Etkinleştirin",
                    "updated": 1647859373334
                },
                {
                    "language": "DE",
                    "text": "5. Github-Benachrichtigungen aktivieren",
                    "updated": 1678644161114
                }
            ]
        },
        {
            "style": "Text",
            "text": "Make sure you enable GitHub notifications when someone responds to the issue, as developers may want to ask for more information.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Обязательно включите уведомления GitHub, чтобы узнать, кто отвечает на проблему, поскольку разработчики могут захотеть запросить дополнительную информацию.",
                    "updated": 1640445763352
                },
                {
                    "language": "TR",
                    "text": "Geliştiriciler daha fazla bilgi isteyebileceğinden, birisi soruna yanıt verdiğinde GitHub bildirimlerini etkinleştirdiğinizden emin olun.",
                    "updated": 1647859410092
                },
                {
                    "language": "DE",
                    "text": "Stellen Sie sicher, dass Sie GitHub-Benachrichtigungen aktivieren, wenn jemand auf das Problem antwortet, da die Entwickler möglicherweise nach weiteren Informationen fragen möchten.",
                    "updated": 1678644169273
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}