{
    "topic": "Troubleshooting",
    "pageNumber": "6",
    "type": "Perception Issues - My System Gets Slow",
    "definition": {
        "text": "Understand how the system uses the available hardware so that you may implement workarounds and best practices.",
        "updated": 1611513348468
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Dynamically rendering all the visual features in the system puts a significant load on the machine’s graphics processing unit (GPU). Running multiple tasks at the same time is demanding on the central processing unit (CPU). Depending on your machine’s capacity, this may result in the system getting slow and sometimes even unresponsive.",
            "updated": 1611513372759
        },
        {
            "style": "Text",
            "text": "If you experience such symptoms, there are several actions you may take to mitigate them."
        },
        {
            "style": "Note",
            "text": "Learn about the system requirements to better understand what to expect in terms of the performance of your hardware.",
            "updated": 1611513387104
        },
        {
            "style": "Title",
            "text": "Close The Browser’s Developer Tools"
        },
        {
            "style": "Text",
            "text": "You may have opened Developer Tools at some point. Developer Tools may slow animation renderings to a crawl, as slow as one frame per second. In case it is open, make sure you close Developer Tools."
        },
        {
            "style": "Title",
            "text": "Stop Data Mining Tasks That You May Not Need Running"
        },
        {
            "style": "Text",
            "text": "Data mining is a CPU-intensive activity. If you are designing a strategy, you probably don’t need to have a live stream of information being processed in realtime. Learn to segment your activities and only start the tasks that you need for the work you are doing."
        },
        {
            "style": "Text",
            "text": "You may also consider applying a Time Frames Filter to process the ones you require only.",
            "updated": 1611513521057
        },
        {
            "style": "Title",
            "text": "Open Either the Design Space or the Charting Space"
        },
        {
            "style": "Text",
            "text": "Leaving the slider halfway up or down the screen causes both the design space and the charting space to consume resources. Make sure the slider is either fully up or down."
        },
        {
            "style": "Title",
            "text": "Display Less Data on the Charts"
        },
        {
            "style": "Text",
            "text": "Make sure you set the Time Scale to manual mode and adjust it so that fewer candles are displayed on the screen. Try switching the time frame box to the higher time frames so that candle density decreases.",
            "updated": 1615810255059
        },
        {
            "style": "Text",
            "text": "You may also want to switch off the layers you may not be using. Remember, every piece of graphical information you see on the screen represents data your system is reading from your disk and processing to display in a graphical form."
        },
        {
            "style": "Text",
            "text": "Also turn off the layers in the Trading Engine and Trading System layer managers. Those layers interact with the design space to show information in realtime over the trading engine and trading system hierarchies."
        },
        {
            "style": "Title",
            "text": "Collapse Unused Hierarchies",
            "updated": 1611513572645
        },
        {
            "style": "Text",
            "text": "The physics that govern nodes in the design space help structures of nodes to self-organize. This comes at a cost in terms of GPU processing power."
        },
        {
            "style": "Text",
            "text": "Make sure all hierarchies you are not using are collapsed."
        },
        {
            "style": "Text",
            "text": "You may also want to close any of the structures of nodes that you may not be using within the hierarchy that you may need to expand."
        },
        {
            "style": "Important",
            "text": "If these workarounds do not solve your problem and you often experience slowness or unresponsiveness when using your computer, you may want to consider upgrading your equipment. You shouldn’t risk your capital with an insufficient trading infrastructure.",
            "updated": 1611513583937
        },
        {
            "style": "Title",
            "text": "See the Effects of Your Actions"
        },
        {
            "style": "Text",
            "text": "There’s a handy built-in tool to measure the performance of the animation that you may use to see the effects of turning off layers, lowering the density of information and so on."
        },
        {
            "style": "Text",
            "text": "Click Ctrl + Shift + Alt + F11 and the following performance readings will show up on your screen:"
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/charts/frames-per-second-tool.png",
            "updated": 1611513729958
        },
        {
            "style": "Text",
            "text": "The frame rate displayed at the bottom should increase the more of the actions suggested here you implement."
        }
    ]
}