{
    "type": "Fees Paid",
    "definition": {
        "text": "Fees paid is the amount paid in fees.",
        "translations": [
            {
                "language": "RU",
                "text": "Fees paid - это сумма, уплаченная в виде комиссий.",
                "updated": 1638963664549
            },
            {
                "language": "TR",
                "text": "Ödenen ücretler, ücret olarak ödenen tutardır.",
                "updated": 1654419023241
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The exchange does not explicitly indicate how much has been paid in fees for a given transaction. Instead, when Superalgos verifies if an order has been filled or not, the exchange reports the size filled and the actual rate only.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Биржа явно не указывает, сколько было уплачено в виде комиссионных за данную транзакцию. Вместо этого, когда Superalgos проверяет, был ли заказ заполнен или нет, биржа сообщает только заполненный размер и фактический курс.",
                    "updated": 1638963729275
                },
                {
                    "language": "TR",
                    "text": "Borsa, belirli bir işlem için ücret olarak ne kadar ödendiğini açıkça belirtmez. Bunun yerine, Superalgos bir emrin yerine getirilip getirilmediğini doğruladığında, borsa yalnızca yerine getirilen boyutu ve gerçek oranı bildirir.",
                    "updated": 1654419031172,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Success",
            "text": "Exchange fees are estimated using the fee structure parameter set for the trading session. It is, therefore, important to set the correct values for that parameter.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Биржевые комиссии рассчитываются с использованием параметра структуры комиссий Fee Structure, установленного для торговой сессии. Поэтому важно установить правильные значения для этого параметра.",
                    "updated": 1638963830205
                },
                {
                    "language": "TR",
                    "text": "Borsa ücretleri, işlem seansı için belirlenen ücret yapısı parametresi kullanılarak tahmin edilir. Bu nedenle, bu parametre için doğru değerlerin ayarlanması önemlidir.",
                    "updated": 1654419041094,
                    "style": "Success"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Exchanges deduct fees from the asset you are receiving. For instance, if you are selling BTC in the BTC-USDT market, then you are receiving USDT, and the exchange will deduct the fees directly from the amount of USDT you are receiving.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Биржи вычитают комиссию из получаемого вами актива. Например, если вы продаете BTC на рынке BTC-USDT, вы получаете USDT, и биржа вычитает комиссию непосредственно из суммы получаемого вами USDT.",
                    "updated": 1638963850679
                },
                {
                    "language": "TR",
                    "text": "Borsalar, aldığınız varlıktan ücret keser. Örneğin, BTC-USDT piyasasında BTC satıyorsanız, USDT alırsınız ve borsa ücretleri doğrudan aldığınız USDT miktarından düşer.",
                    "updated": 1654419048623,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609873831169
        },
        {
            "style": "Title",
            "text": "Fees Paid Configuration",
            "updated": 1609926807448,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Fees Paid",
                    "updated": 1638963872245
                },
                {
                    "language": "TR",
                    "text": "Ödenen Ücretler Konfigürasyon",
                    "updated": 1654419054673,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "updated": 1609873980538,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1638963879686
                },
                {
                    "language": "TR",
                    "text": "Özellikler",
                    "updated": 1654419060909,
                    "style": "Subtitle"
                }
            ]
        },
        {
            "style": "List",
            "text": "initialValue allows resetting the initial state of the node to an arbitrary value.",
            "updated": 1609875415147,
            "translations": [
                {
                    "language": "RU",
                    "text": "initialValue позволяет сбросить начальное состояние узла на произвольное значение.",
                    "updated": 1638963888395
                },
                {
                    "language": "TR",
                    "text": "initialValue düğümün ilk durumunun rastgele bir değere sıfırlanmasını sağlar.",
                    "updated": 1654419067144,
                    "style": "List"
                }
            ]
        }
    ]
}