{
    "type": "Detach Node",
    "definition": {
        "text": "Breaks the parent-offspring relationship that keeps the node attached to its parent. Once detached, the node is no longer computed as part of the hierarchy it was attached to. ",
        "updated": 1610032559190,
        "translations": [
            {
                "language": "ES",
                "text": "Rompe la relación entre padres e hijos que mantiene el nodo unido a su padre. Una vez desconectado, el nodo ya no se calcula como parte de la jerarquía a la que estaba adjunto.",
                "updated": 1628035974832
            },
            {
                "language": "RU",
                "text": "Разрывает отношения родитель-потомок, которые удерживают узел привязанным к своему родителю. После отсоединения узел больше не вычисляется как часть иерархии, к которой он был присоединен.",
                "updated": 1638282948759
            },
            {
                "language": "TR",
                "text": "Düğümü ana düğüme bağlı tutan ana düğüm-yavru düğüm ilişkisini keser. Ayrıldıktan sonra, düğüm artık bağlı olduğu hiyerarşinin bir parçası olarak hesaplanmaz.",
                "updated": 1671218326505
            },
            {
                "language": "DE",
                "text": "Unterbricht die Eltern-Nachkommen-Beziehung, durch die der Knoten mit seinem Elternteil verbunden bleibt. Nach der Abtrennung wird der Knoten nicht mehr als Teil der Hierarchie berechnet, mit der er verbunden war.",
                "updated": 1696955467814
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования.",
                    "updated": 1638282966323
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle deyin. Yeni paragraflar yazmak için ENTER tuşuna basın. Düzenleme modundan çıkmak için ESC.",
                    "updated": 1654391103739,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen.",
                    "updated": 1696955467972,
                    "style": "Text"
                }
            ]
        }
    ]
}