{
    "topic": "Divergences Data Mine",
    "pageNumber": "12",
    "type": "CCI Stochastic Divergence",
    "definition": {
        "text": "The CCI Stochastic Oscillator - this indicator is based on the Commodity Channel Index (CCI) instead of RSI to produce its output. It analyses highs and lows of a 28 period Stochastic Oscillator indicator with smoothing values K and D set to 3. The 'slow line', D is then compared to the price action and produces any divergence data found.",
        "updated": 1649651163746
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "CCI Stochastic Oscillator Divergence on the Charts"
        },
        {
            "style": "Text",
            "text": "According to investopedia: Momentum indicators are commonly used to smooth out the price action and give a clearer picture. They allow the trader to compare the indicator swings to price swings, rather than having to compare price to price. Momentum is a study of the strength of the price action, it simply checks whether the price and momentum agree or disagree."
        },
        {
            "style": "Text",
            "text": "Disagreement between the indicator and price is called divergence, and it can have significant implications for trade management. The amount of agreement/disagreement is relative, so there can be several different patterns that develop in the relationship between price and the indicator."
        },
        {
            "style": "Link",
            "text": "Understanding momentum - (investopedia)->www.investopedia.com/trading/trading-divergence-and-understanding-momentum/#toc-momentum-divergence"
        },
        {
            "style": "Text",
            "text": "The indicator shows four types of divergences, as well as an approximate strength prediction and percent value:"
        },
        {
            "style": "List",
            "text": "Bullish (Solid Green line): the momentum indicator makes a higher low, while the price action makes a lower low."
        },
        {
            "style": "List",
            "text": "Bearish (Solid Red line): the momentum indicator makes a lower high, while the price action makes a higher high."
        },
        {
            "style": "List",
            "text": "Hidden Bullish Continuation(Dashed Green line): the momentum indicator makes a lower high, while the price action makes a higher low."
        },
        {
            "style": "List",
            "text": "Hidden Bearish Continuation(Dashed Red line): the momentum indicator makes a higher high, while the price action makes a lower high."
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Divergences-CCI-Stoch-1.png"
        },
        {
            "style": "Text",
            "text": "Above: a hidden continuation (dotted green), a bearish divergence (red), a hidden bearish (dotted red) and two two bullish divergences (green).",
            "updated": 1649651183412
        },
        {
            "style": "Text",
            "text": "The length of the divergence finder, the pivot length, as well as the threshold for strong and weak divergences can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Loop under ’CCI Stoch Divergence’ Procedure Loop.",
            "updated": 1649651216132
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Divergences-RSI-params-1.png"
        },
        {
            "style": "Note",
            "text": "Keep in mind that the longer the pivot length, the greater the accuracy but the longer the lag for confirming the pivot peak/low."
        },
        {
            "style": "Text",
            "text": "The upper and lower cutoff for divergence detection can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Initialization under ’CCI Stochastic Divergence’ Procedure Initialization.",
            "updated": 1649651236050
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Divergences-CCI-Stoch-params.png"
        },
        {
            "style": "Text",
            "text": "The length of the Stochastic Oscillator can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Loop under ’Stochastic’ Procedure Loop."
        },
        {
            "style": "Title",
            "text": "Products & Properties"
        },
        {
            "style": "Text",
            "text": "The following properties are available to access:"
        },
        {
            "style": "Table",
            "text": "| Product Name | Product Variable | Properties |\n| CciStoch | CciStoch | cci, value|\n| cciStochDiv | cciStochDiv | status, strength, divPerc |",
            "updated": 1667785870770
        },
        {
            "style": "List",
            "text": "status: returns a string with the following possible values: bullish, bearish, bull continuation, bear continuation"
        },
        {
            "style": "List",
            "text": "strength: returns a string with the following possible values: weak, medium, strong"
        },
        {
            "style": "List",
            "text": "divPerc: returns a number that corresponds to the percent change between peaks or lows of an identified divergence"
        },
        {
            "style": "Text",
            "text": "Examples:"
        },
        {
            "style": "Javascript",
            "text": "chart.at01hs.cciStochDiv.status == \"bullish\"",
            "updated": 1667786491327
        },
        {
            "style": "Javascript",
            "text": "chart.at15min.cciStochDiv.strength == \"strong\"",
            "updated": 1667786498543
        },
        {
            "style": "Javascript",
            "text": "chart.at15min.cciStochDiv.divPerc > 20",
            "updated": 1667786505144
        },
        {
            "style": "Text",
            "text": "To increase confirmation confidence, find a suitable Stochastic Oscillator value to enter the trade after the divergence is found, for example, stochastic > 50 after a bullish detection."
        },
        {
            "style": "Title",
            "text": "Maintainer:"
        },
        {
            "style": "Link",
            "text": "@quantum8 (github)->github.com/quantum8/Superalgos"
        }
    ]
}