{
    "topic": "Divergences Data Mine Data Mine",
    "pageNumber": "2",
    "type": "RSI Divergence",
    "definition": {
        "text": "The RSI Divergence - this indicator analyses highs and lows of a 14 period RSI indicator and compares it to the price action and produces any divergence data found.",
        "updated": 1622686933380
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "RSI Divergence on the Charts"
        },
        {
            "style": "Text",
            "text": "According to investopedia: Momentum indicators are commonly used to smooth out the price action and give a clearer picture. They allow the trader to compare the indicator swings to price swings, rather than having to compare price to price. Momentum is a study of the strength of the price action, it simply checks whether the price and momentum agree or disagree."
        },        
		{
            "style": "Text",
            "text": "Disagreement between the indicator and price is called divergence, and it can have significant implications for trade management. The amount of agreement/disagreement is relative, so there can be several different patterns that develop in the relationship between price and the indicator."
        },
        {
            "style": "Link",
            "text": "Understanding momentum - (investopedia)->www.investopedia.com/trading/trading-divergence-and-understanding-momentum/#toc-momentum-divergence"
        },
		{
            "style": "Text",
            "text": "The indicator shows four types of divergences, as well as an approximate strength prediction and percent value:"
        },
		{
            "style": "List",
            "text": "Bullish (Solid Green line): the momentum indicator makes a higher low, while the price action makes a lower low."
        },
		{
            "style": "List",
            "text": "Bearish (Solid Red line): the momentum indicator makes a lower high, while the price action makes a higher high."
        },
		{
            "style": "List",
            "text": "Hidden Bullish Continuation(Dashed Green line): the momentum indicator makes a lower high, while the price action makes a higher low."
        },
		{
            "style": "List",
            "text": "Hidden Bearish Continuation(Dashed Red line): the momentum indicator makes a higher high, while the price action makes a lower high."
        },
		{
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Divergences-RSI-1.png"
        },
		{
            "style": "Text",
            "text": "Above: a bearish (red) with medium strength with an 11.25% drop, and a bullish (green) divergence."
        },
		{
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Divergences-RSI-2.png"
        },
		{
            "style": "Text",
            "text": "Above: a hidden bullish (dashed green) and a bullish (green) divergence with strong strength and 70% increase."
        },
		{
            "style": "Text",
            "text": "The length of the divergence finder, the pivot length, as well as the threshold for strong and weak divergences can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Loop under ’RSI Divergence’ Procedure Loop."
        },	
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Divergences-RSI-params-1.png"
        },		
		{
            "style": "Text",
            "text": "Keep in mind that the longer the pivot length, the greater the accuracy but the longer the lag for confirming the pivot peak/low."
        },	
		{
            "style": "Text",
            "text": "The upper and lower cutoff for divergence detection can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Initialization under ’RSI Divergence’ Procedure Initialization."
        },
        {
            "style": "Png",
            "text": "PNGs/Foundations/Docs/indicators/Divergences-RSI-params-2.png"
        },
		{
            "style": "Text",
            "text": "The length of the RSI can be changed by locating and opening the Javascript Code under Data Building Procedure -> Procedure Loop under ’RSI14’ Procedure Loop."
        },	
		{
            "style": "Title",
            "text": "Products & Properties"
        },
        {
            "style": "Text",
            "text": "The following properties are available to access:"
        },
        {
            "style": "Table",
            "text": "| Product Name | Product Variable | Properties |\n| RSI-Div | rsiDiv | status, strength, divPerc |"
        },
        {
            "style": "List",
            "text": "status: returns a string with the following possible values: bullish, bearish, bull continuation, bear continuation"
        },
		{
            "style": "List",
            "text": "strength: returns a string with the following possible values: weak, medium, strong"
        },
        {
            "style": "List",
            "text": "divPerc: returns a number that corresponds to the percent change between peaks or lows of an identified divergence"
        },
		{
            "style": "Text",
            "text": "Examples:"
        },
		{
            "style": "Javascript",
            "text": "chart.at01hs.rsiDiv.status == \"bullish\""
        },
		{
            "style": "Javascript",
            "text": "chart.at15min.rsiDiv.strength == \"strong\""
        },
		{
            "style": "Javascript",
            "text": "chart.at15min.rsiDiv.divPerc > 20"
        },
		{
            "style": "Text",
            "text": "To increase confirmation confidence, find a suitable RSI value to enter the trade after the divergence is found, for example, RSI > 50 after a bullish detection."
        },
        {
            "style": "Title",
            "text": "Maintainer:",
            "updated": 1622481793076
        },
        {
            "style": "Link",
            "text": "@quantum8 (github)->github.com/quantum8/Superalgos"
        }
    ]
}