{
    "tutorial": "Hello World Tutorial",
    "pageNumber": 6,
    "type": "Tutorial Step - Trading System",
    "definition": {
        "text": "Trading System is already set up. Let's have a look!",
        "icon": {
            "name": "trading-system-reference",
            "project": "Foundations"
        },
        "updated": 1614242955916,
        "translations": [
            {
                "language": "DE",
                "text": "Das Trading System ist bereits aufgesetzt. Lass es uns anschauen!",
                "updated": 1622978283268,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Trading System ya está configurado. ¡Echemos un vistazo!",
                "updated": 1629348173186
            },
            {
                "language": "IT",
                "text": "Il Trading System è già impostato. Diamo un'occhiata!",
                "updated": 1639075033970
            },
            {
                "language": "TR",
                "text": "Ticaret Sistemi ( Trading System ) çoktan kuruldu. Hadi kontrol edelim!",
                "updated": 1640616471688
            },
            {
                "language": "RU",
                "text": "Торговая система уже настроена. Давайте посмотрим!",
                "updated": 1640854450217
            },
            {
                "language": "NL",
                "text": "Het Trading System is al ingesteld. Laten we eens kijken!",
                "updated": 1670773536410
            },
            {
                "language": "ID",
                "text": "Trading System sudah siap. Ayo kita lihat!",
                "updated": 1670299893634
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The strategy is already deployed. So let's have a look around to understand it!",
            "updated": 1614243171735,
            "translations": [
                {
                    "language": "DE",
                    "text": "ie Strategie ist bereits umgesetzt. Schauen wir sie uns einmal an, um sie zu verstehen!",
                    "updated": 1622978294304,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "La estrategia ya está desplegada. ¡Así que echemos un vistazo para entenderlo!",
                    "updated": 1629348191210
                },
                {
                    "language": "IT",
                    "text": "Ho già proveduto a settare l'occorrente e la strategia è già implementata. Diamo un'occhiata in giro!",
                    "updated": 1639075146492
                },
                {
                    "language": "TR",
                    "text": "Strateji çoktan uygulandı. Bunu anlamak için etrafa bir göz atalım!",
                    "updated": 1640616484894
                },
                {
                    "language": "RU",
                    "text": "Стратегия уже развернута. Так что давайте осмотримся, чтобы понять ее!",
                    "updated": 1640854463200
                },
                {
                    "language": "NL",
                    "text": "De strategie is al ingezet. Dus laten we eens rondkijken om het te begrijpen!",
                    "updated": 1670773556235
                },
                {
                    "language": "ID",
                    "text": "Strategi telah di sebarkan. Jadi mari kita lihat sekiling untuk memahami apa yang terjadi!",
                    "updated": 1670299903038
                }
            ]
        },
        {
            "style": "Text",
            "text": "As you cand see, a Trading System has 2 main offsprings:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wie du sehen kannst, hat ein Tradingsystem zwei Hauptnachfolger:",
                    "updated": 1622978319793,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Como puedes ver, un Trading System tiene 2 descendientes principales:",
                    "updated": 1629348227357
                },
                {
                    "language": "IT",
                    "text": "Come puoi vedere, il Trading System ha 2 figli (offsprings) principali:",
                    "updated": 1639076579571
                },
                {
                    "language": "TR",
                    "text": "Gördüğünüz gibi, bir Ticaret Sisteminin ( Trading System ) 2 ana ürünü vardır:",
                    "updated": 1640616501493
                },
                {
                    "language": "RU",
                    "text": "Как видно, торговая система имеет 2 основных потомка:",
                    "updated": 1640854521203
                },
                {
                    "language": "NL",
                    "text": "Zoals je kunt zien, heeft een Trading System 2 belangrijke afstammelingen:",
                    "updated": 1670773588307
                },
                {
                    "language": "ID",
                    "text": "Seperti yang kamu lihat, sebuah Trading System memiliki 2 offspring utama:",
                    "updated": 1670299913436
                }
            ]
        },
        {
            "style": "List",
            "text": "Dynamic Indicators: This lets you build On-The-Fly indicators",
            "updated": 1614243245995,
            "translations": [
                {
                    "language": "DE",
                    "text": "Dynamic Indicators (\"Dynamische Indikatoren\"): Damit kannst du On-The-Fly-Indikatoren erstellen",
                    "updated": 1622978351655,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Dynamic Indicators: Esto te permite crear indicadores sobre la marcha",
                    "updated": 1629348275874
                },
                {
                    "language": "IT",
                    "text": "Dynamic Indicators: Serve per costruire indicatori On-The-Fly (non verrà usato in questo tutorial)",
                    "updated": 1639075240227
                },
                {
                    "language": "TR",
                    "text": "Dinamik Göstergeler: Bu, Anında göstergeler oluşturmanızı sağlar",
                    "updated": 1640616513602
                },
                {
                    "language": "RU",
                    "text": "Dynamic Indicators: Это позволяет создавать индикаторы \"на лету\".",
                    "updated": 1640854555101
                },
                {
                    "language": "NL",
                    "text": "Dynamic Indicators: Hiermee kunt u On-The-Fly-indicatoren bouwen",
                    "updated": 1670773605978
                },
                {
                    "language": "ID",
                    "text": "Dynamic Indicators: Ini memperbolehkanmu membuat indikator dengan mudah",
                    "updated": 1670299923051
                }
            ]
        },
        {
            "style": "List",
            "text": "Trading Strategy: Is where we define parameters, conditions and formulas for our strategy",
            "updated": 1614243343779,
            "translations": [
                {
                    "language": "DE",
                    "text": "Trading Strategy (\"Handelsstrategie\"): Hier definieren wir Parameter, Bedingungen und Formeln für unsere Strategie",
                    "updated": 1622978372386,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Trading Strategy: Es donde definimos parámetros, condiciones y fórmulas para nuestra estrategia.",
                    "updated": 1629348244296
                },
                {
                    "language": "IT",
                    "text": "Trading Strategy: È qui che definiamo parametri, condizioni e formule per la nostra strategia",
                    "updated": 1639075258476
                },
                {
                    "language": "TR",
                    "text": "Ticaret Stratejisi ( Strategy ): Stratejimiz için parametreleri, koşulları ve formülleri tanımladığımız yerdir",
                    "updated": 1640616526965
                },
                {
                    "language": "RU",
                    "text": "Trading Strategy: Это место, где мы определяем параметры, условия и формулы для нашей стратегии",
                    "updated": 1640854568299
                },
                {
                    "language": "NL",
                    "text": "Trading Strategy: Hier definiëren we parameters, voorwaarden en formules voor onze strategie",
                    "updated": 1670773619775
                },
                {
                    "language": "ID",
                    "text": "Trading Strategy: Ini dimana kita menjelaskan parameter, kondisi, dan formula untuk strategi kita",
                    "updated": 1670299933001
                }
            ]
        },
        {
            "style": "Success",
            "text": "This tutorial doesn't cover definitions or concepts used in SA. This tutorial is only about how to deploy a strategy!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Dieses Tutorial behandelt keine Definitionen oder Konzepte, die in SA verwendet werden. In diesem Tutorial geht es nur darum, wie man eine Strategie einsetzt!",
                    "updated": 1622978385419,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Este tutorial no cubre definiciones o conceptos usados ​​en SA. ¡Este tutorial solo trata sobre cómo implementar una estrategia!",
                    "updated": 1629348296182
                },
                {
                    "language": "IT",
                    "text": "Questo tutorial non copre definizioni o concetti utilizzati in SA. Questo tutorial riguarda solo come implementare una strategia!",
                    "updated": 1639075281490
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bu öğretici, SA'da kullanılan tanımları veya kavramları kapsamaz. Bu öğretici yalnızca bir stratejinin nasıl uygulanacağıyla ilgilidir",
                    "updated": 1640616560846
                },
                {
                    "language": "RU",
                    "text": "В этом учебнике не рассматриваются определения или концепции, используемые в Superalgos. Этот учебник посвящен только тому, как развернуть стратегию!",
                    "updated": 1640854608376
                },
                {
                    "language": "NL",
                    "text": "Deze zelfstudie behandelt geen definities of concepten die in SA worden gebruikt. Deze tutorial gaat alleen over het implementeren van een strategie!",
                    "updated": 1670773636570
                },
                {
                    "language": "ID",
                    "text": "Tutorial ini tidak mencakup definisi atau konsep yang digunakan dalam SA. Tutorial ini hanya untuk bagaimana cara menyebarkan strategi!",
                    "updated": 1670299940303
                }
            ]
        }
    ]
}