{
    "tutorial": "Hello World Tutorial",
    "pageNumber": 7,
    "type": "Tutorial Step - Trigger Stage",
    "definition": {
        "text": "Trigger Stage is our Talent Scout",
        "icon": {
            "name": "trigger-stage",
            "project": "Foundations"
        },
        "updated": 1622385913906,
        "translations": [
            {
                "language": "DE",
                "text": "Trigger Stage ist unser Talent Scout.",
                "updated": 1622978455848,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Trigger Stages es nuestro talento scout",
                "updated": 1682515254809
            },
            {
                "language": "IT",
                "text": "Il Trigger Stage è il nostro Talent Scout",
                "updated": 1639077137307
            },
            {
                "language": "TR",
                "text": "Tetik Aşaması ( Trigger Stage ) Yetenek Avcımızdır",
                "updated": 1640616679711
            },
            {
                "language": "RU",
                "text": "Trigger Stage - наш разведчик талантов",
                "updated": 1640854684418
            },
            {
                "language": "NL",
                "text": "Trigger Stage is onze Talentscout",
                "updated": 1670773801127
            },
            {
                "language": "ID",
                "text": "Trigger Stage adalah Pemandu Bakat kita",
                "updated": 1670300579964
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Our strategy is based on SMA cross and it is in this node that we can instruct the bot to search for conditions that have to be met in order to take a trade.",
            "updated": 1614243969544,
            "translations": [
                {
                    "language": "DE",
                    "text": "Unsere Strategie basiert auf dem SMA-Kreuz und in diesem Knoten können wir den Bot anweisen, nach Bedingungen zu suchen, die erfüllt sein müssen, um einen Handel zu tätigen.",
                    "updated": 1622978530689,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Nuestra estrategia se basa en el cruce de SMA y es en este nodo donde podemos instruir al bot para que busque las condiciones que deben cumplirse para realizar una operación.",
                    "updated": 1629348884906
                },
                {
                    "language": "IT",
                    "text": "La nostra strategia si basa sull'incrocio di 2 medie. Ed è in questo nodo che inseriamo le informazioni da dare al nostro bot per decidere quando entrare nel mercato.",
                    "updated": 1639076778420
                },
                {
                    "language": "TR",
                    "text": "Stratejimiz SMA çaprazına dayalıdır ve bu düğümde bota bir ticaret yapmak için karşılanması gereken koşulları aramasını söyleyebiliriz.",
                    "updated": 1640616693744
                },
                {
                    "language": "RU",
                    "text": "Наша стратегия основана на пересечении SMA, и именно в этом узле мы можем поручить боту поиск условий, которые должны быть выполнены для совершения сделки.",
                    "updated": 1640854793725
                },
                {
                    "language": "NL",
                    "text": "Onze strategie is gebaseerd op het kruisen van SMA en het is in dit knooppunt dat we de bot opdracht kunnen geven om te zoeken naar voorwaarden waaraan moet worden voldaan om een transactie aan te gaan.",
                    "updated": 1670773886440
                },
                {
                    "language": "ID",
                    "text": "Strategi kita berdasar kepada SMA cross dan itu terdapat pada node yang dapat menginstruksikan bot untuk mencari suatu kondisi yang harus dipenuhi untuk mengambil keputusan berdagang/trading.",
                    "updated": 1670300587289
                }
            ]
        },
        {
            "style": "Important",
            "text": "This stage is all about checking the market and deciding if some conditions are worth a trade or not!",
            "translations": [
                {
                    "language": "DE",
                    "text": "In dieser Phase geht es darum, den Markt zu überprüfen und zu entscheiden, ob die Bedingungen einen Handel wert sind oder nicht!",
                    "updated": 1622978559675,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "¡Esta etapa se trata de verificar el mercado y decidir si algunas condiciones valen la pena o no!",
                    "updated": 1629348903247
                },
                {
                    "language": "IT",
                    "text": "In questa fase il mercato viene studiato per verificare se e quando le nostre condizioni iniziali vengano soddisfatte.",
                    "updated": 1639077044786
                },
                {
                    "language": "TR",
                    "text": "Önemli: Bu aşama tamamen piyasayı kontrol etmek ve bazı koşulların ticarete değip değmeyeceğine karar vermekle ilgilidir!",
                    "updated": 1640616728982
                },
                {
                    "language": "RU",
                    "text": "Этот этап заключается в проверке рынка и принятии решения о том, соответствуют ли некоторые условия для совершения сделки или нет!",
                    "updated": 1640854776134
                },
                {
                    "language": "NL",
                    "text": "In deze fase draait alles om het controleren van de markt en het beslissen of sommige voorwaarden een transactie waard zijn of niet!",
                    "updated": 1670773908137
                },
                {
                    "language": "ID",
                    "text": "Dalam tahap ini semua tentang memeriksa market dan mengambil keputusan jika beberapa kondisi layak diperdagangkan atau tidak!",
                    "updated": 1670300593184
                }
            ]
        },
        {
            "style": "Text",
            "text": "Let's have a look at its 3 offsprings and I will show you some little tricks to implement the strategy in the fastest possible way!",
            "updated": 1614244059064,
            "translations": [
                {
                    "language": "DE",
                    "text": "Werfen wir einen Blick auf seine drei Nachfolger und ich zeige dir ein paar kleine Tricks, um die Strategie schnellstmöglich zu implementieren!",
                    "updated": 1622978601078,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¡Echemos un vistazo a sus 3 descendientes y te muestro algunos pequeños trucos para implementar la estrategia de la manera más rápida posible!",
                    "updated": 1629348921004
                },
                {
                    "language": "IT",
                    "text": "Diamo un'occhiata ai 3 figli del Trigger Stage, vi mostrerò alcuni piccoli trucchi per implementare la strategia nel modo più veloce possibile!",
                    "updated": 1639077107348
                },
                {
                    "language": "TR",
                    "text": "Şimdi 3 ürüne bir göz atalım ve size stratejiyi mümkün olan en hızlı şekilde uygulayabilmeniz için bazı küçük püf noktaları göstereceğim!",
                    "updated": 1640616739975
                },
                {
                    "language": "RU",
                    "text": "Давайте посмотрим на три его потомка, и я покажу вам несколько маленьких хитростей, чтобы реализовать эту стратегию самым быстрым способом!",
                    "updated": 1640854844167
                },
                {
                    "language": "NL",
                    "text": "Laten we eens kijken naar zijn 3 afstammelingen en ik zal je enkele trucjes laten zien om de strategie zo snel mogelijk te implementeren!",
                    "updated": 1670773952618
                },
                {
                    "language": "ID",
                    "text": "Mari kita lihat ketiga offspring-nya dan aku akan memperlihatkanmu sebuah trik kecil untuk mengemplementasikan strategi dengan cara yang secepat mungkin!",
                    "updated": 1670300599571
                }
            ]
        }
    ]
}