{
    "tutorial": "Hello World Tutorial",
    "pageNumber": 11,
    "type": "Tutorial Step - Open Stage",
    "definition": {
        "text": "The Open Stage is where bot take position!",
        "icon": {
            "name": "Open\\open-stage",
            "project": "Foundations"
        },
        "updated": 1614260398081,
        "translations": [
            {
                "language": "DE",
                "text": "Die Open Stage ist der Zeitpunkt, an dem der Bot die Position einnimmt!",
                "updated": 1622979315892,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "El Open Stage es donde el bot toma posición!",
                "updated": 1629356240122,
                "style": "Definition"
            },
            {
                "language": "FR",
                "text": "L'Open Stage, c'est là où le bot prend position!",
                "updated": 1630753496446
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The strategy I want to backtest is based on 4h TF and the strategy is Long. This means that bot will Buy the asset to later Sell it (at a better price we hope!). To keep things simple, all I have to do is to indicate the TF in the Target Rate node using my full balance in the Target Size in Quoted Asset.",
            "updated": 1614333476016,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Strategie, die ich backtesten möchte, basiert auf 4h TF und die Strategie ist Long (steigende Kurse). Das bedeutet, dass der Bot das Asset kaufen wird, um es später zu verkaufen (zu einem besseren Preis, wie wir hoffen!). Um die Dinge einfach zu halten, muss ich nur den TF im Target Rate-Knoten angeben, indem ich meinen vollen Saldo im Target Size in Quoted Asset verwende.",
                    "updated": 1622979336945,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "La estrategia que quiero hacer backtesting se basa en 4h TF y la estrategia es Long. Esto significa que el bot Buy el asset para después Sell (¡a un mejor precio esperamos!). Para simplificar las cosas, todo lo que tengo que hacer es indicar el TF en el nodo Target Rate usando todo mi saldo en el Target Size en Quoted Asset.",
                    "updated": 1629356415752,
                    "style": "Text"
                },
                {
                    "language": "FR",
                    "text": "La stratégie que je veux backtester est basée sur TF(période) de 4h et la stratégie est Longue. Cela signifie que le robot va acheter l'actif pour le vendre plus tard (à un meilleur prix, nous l'espérons !). Pour garder les choses simples, tout ce que j'ai à faire est d'indiquer la TF dans le nœud Target Rate en utilisant mon solde complet dans le Target Size de Quoted Asset.",
                    "updated": 1630753561277
                }
            ]
        },
        {
            "style": "Success",
            "text": "If our market is BTC/USDT then the Quoted Asset is USDT and Base Asset is BTC",
            "updated": 1622979463214,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn unser Markt BTC/USDT ist, dann ist das Quoted Asset USDT und Base Asset ist BTC.",
                    "updated": 1622979556680,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Si nuestro mercado es BTC/USDT entonces la Quoted Asset is USDT y Base Asset es BTC",
                    "updated": 1629356454601,
                    "style": "Success"
                },
                {
                    "language": "FR",
                    "text": "Si notre marché est BTC/USDT, l'actif coté est USDT et l'actif de base est BTC.",
                    "updated": 1630753587601
                }
            ]
        }
    ]
}