{
    "tutorial": "Hello World Tutorial",
    "pageNumber": 19,
    "type": "Tutorial Step - The End",
    "definition": {
        "text": "This is the final step in this tutorial but a first big step for you!",
        "updated": 1614270786500,
        "icon": {
            "name": "hits",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "DE",
                "text": "Dies ist der letzte Schritt in diesem Tutorial, aber ein erster großer Schritt für dich!",
                "updated": 1622980855701,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Este es el paso final de este tutorial, ¡pero un primer gran paso para ti!",
                "updated": 1629578693755
            },
            {
                "language": "IT",
                "text": "Sei arrivato alla fine di questo tutorial!",
                "updated": 1640111747286
            },
            {
                "language": "TR",
                "text": "Bu eğitimdeki son adımdır, ancak sizin için ilk büyük adımdır!",
                "updated": 1640618657018
            },
            {
                "language": "RU",
                "text": "Это последний шаг в данном руководстве, но для вас это первый большой шаг!",
                "updated": 1640857775385
            },
            {
                "language": "NL",
                "text": "Dit is de laatste stap in deze zelfstudie, maar een eerste grote stap voor jou!",
                "updated": 1670776898670
            },
            {
                "language": "ID",
                "text": "Inilah langkah akhir dari tutorial ini tapi langkah awal yang besar untuk kamu!",
                "updated": 1670589483948
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Now that you have seen how fast and easy it is to deploy simple strategies in SA, I leave you with some hints you can explore.",
            "updated": 1614270919320,
            "translations": [
                {
                    "language": "DE",
                    "text": "Nachdem du nun gesehen hast, wie schnell und einfach es ist, einfache Strategien in SA einzusetzen, lasse ich dich mit einigen Tipps zurück, die du erforschen kannst.",
                    "updated": 1622980866244,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Ahora que ha visto lo rápido y fácil que es implementar estrategias simples en SA, te dejo algunos consejos que puedes explorar.",
                    "updated": 1682357936063
                },
                {
                    "language": "IT",
                    "text": "Ora che hai visto quanto sia facile e veloce implementare strategie semplici in SA, ti lascio con alcuni suggerimenti che puoi esplorare.",
                    "updated": 1640111763816
                },
                {
                    "language": "TR",
                    "text": "Artık SA'da basit stratejileri uygulamanın ne kadar hızlı ve kolay olduğunu gördüğünüze göre, size keşfedebileceğiniz bazı ipuçları bırakıyorum.",
                    "updated": 1640618668873
                },
                {
                    "language": "RU",
                    "text": "Теперь, когда вы увидели, как быстро и легко можно развернуть простые стратегии в Superalgos, я оставляю вам несколько подсказок, которые вы можете проверить.",
                    "updated": 1640857826726
                },
                {
                    "language": "NL",
                    "text": "Nu je hebt gezien hoe snel en gemakkelijk het is om eenvoudige strategieën in SA te maken, geef ik je enkele hints die je kunt verkennen.",
                    "updated": 1670776930539
                },
                {
                    "language": "ID",
                    "text": "Sekarang kamu sudah melihat bagaimana cepat dan mudahnya men-deploy strategi simpel pada SA, Aku tinggalkan kamu dengan suatu petunjuk  yang bisa kamu eksplore.",
                    "updated": 1670589490361
                }
            ]
        },
        {
            "style": "Text",
            "text": "Maybe you can add a new indicator and use its properties like an additional filter for the Trigger Stage.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Vielleicht kannst du einen neuen Indikator hinzufügen und seine Eigenschaften wie einen zusätzlichen Filter für die Trigger Stage verwenden",
                    "updated": 1622981671905,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Tal vez puedes agregar un nuevo indicador y usar sus propiedades como un filtro adicional para el Trigger Stage",
                    "updated": 1682357954347
                },
                {
                    "language": "IT",
                    "text": "Per esempio potresti aggiungere un nuovo indicatore e utilizzare le sue proprietà come un filtro aggiuntivo per il Trigger Stage.",
                    "updated": 1640111791051
                },
                {
                    "language": "TR",
                    "text": "Belki yeni bir gösterge ekleyebilir ve özelliklerini Tetik Aşaması ( Trigger Stage ) için ek bir filtre gibi kullanabilirsiniz.",
                    "updated": 1640618680246
                },
                {
                    "language": "RU",
                    "text": "Возможно, вы захотите добавить новый индикатор и использовать его свойства как дополнительный фильтр для этапа Trigger Stage.",
                    "updated": 1640857883663
                },
                {
                    "language": "NL",
                    "text": "Misschien kunt u een nieuwe indicator toevoegen en de eigenschappen ervan gebruiken als een extra filter voor de Trigger Stage.",
                    "updated": 1670776952195
                },
                {
                    "language": "ID",
                    "text": "Mungkin kamu bisa menambahkan indikator baru dan menggunakan propertinya seperti filter tambahan untuk Trigger Stage.",
                    "updated": 1670589499190
                }
            ],
            "updated": 1622980962381
        },
        {
            "style": "Text",
            "text": "Or you can modify the SL so to have a trailing one instead of being fixed.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Oder du kannst den SL so modifizieren, dass er einen Trailing hat, anstatt fest zu sein.",
                    "updated": 1622980929319,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "O puedes modificar el SL para tener uno final en lugar de ser fijo.",
                    "updated": 1629579019376
                },
                {
                    "language": "IT",
                    "text": "O potresti provare ad impostare un Trailer Stop Loss.",
                    "updated": 1640111815335
                },
                {
                    "language": "TR",
                    "text": "Ya da SL'yi, bir sonraki sabit bir isteme sahip olacak şekilde değiştirebilirsiniz.",
                    "updated": 1640618693371
                },
                {
                    "language": "RU",
                    "text": "Или вы можете модифицировать SL таким образом, чтобы трейлинг был не фиксированным, а скользящим.",
                    "updated": 1640857938812
                },
                {
                    "language": "NL",
                    "text": "Of u kunt de SL zo aanpassen dat deze meebeweegt in plaats van vast te zitten.",
                    "updated": 1670776989511
                },
                {
                    "language": "ID",
                    "text": "Atau kamu bisa memodifikasi SL sehingga punya sesuatu untuk diikuti daripada mencoba untuk memperbaiki.",
                    "updated": 1670589940367
                }
            ]
        },
        {
            "style": "Note",
            "text": "Thank you for your time. You can read a more in depth article here: http://bit.ly/9808usHelloWorld",
            "updated": 1614271289324,
            "translations": [
                {
                    "language": "DE",
                    "text": "Vielen Dank für deine Zeit. Hier findest du einen ausführlicheren Artikel: http://bit.ly/9808usHelloWorld",
                    "updated": 1622980916321,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Gracias por tu tiempo. Puedes leer un artículo más detallado aquí: http://bit.ly/9808usHelloWorld",
                    "updated": 1682357964929
                },
                {
                    "language": "IT",
                    "text": "Grazie per il tuo impegno. Se desideri qui puoi trovare un articolo riguardo questo tutorial: http://bit.ly/9808usHelloWorld",
                    "updated": 1640111869718
                },
                {
                    "language": "TR",
                    "text": "Not: Zaman ayırdığınız için teşekkür ederim. Daha ayrıntılı makaleyi buradan okuyabilirsiniz: http://bit.ly/9808usHelloWorld",
                    "updated": 1640618710445
                },
                {
                    "language": "RU",
                    "text": "Спасибо за уделенное время. Более подробную статью вы можете прочитать здесь: http://bit.ly/9808usHelloWorld.",
                    "updated": 1640857954646
                },
                {
                    "language": "NL",
                    "text": "Bedankt voor je tijd. U kunt hier een meer diepgaand artikel lezen: http://bit.ly/9808usHelloWorld",
                    "updated": 1670777012077
                },
                {
                    "language": "ID",
                    "text": "Terima kasih untuk waktunya. Kamu bisa baca lebih lanjut pada artikel ini: http://bit.ly/9808usHelloWorld",
                    "updated": 1670589999093
                }
            ]
        }
    ]
}