{
    "tutorial": "Hello World Tutorial",
    "pageNumber": 4,
    "type": "Tutorial Step - Custom Data Mine",
    "definition": {
        "text": "Not only Workspaces can be modified",
        "icon": {
            "name": "data-mine",
            "project": "Foundations"
        },
        "updated": 1614241455319,
        "translations": [
            {
                "language": "DE",
                "text": "Nicht nur Workspaces können modifiziert werden.",
                "updated": 1622977759915,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "No solo Workspaces se pueden modificar",
                "updated": 1629346887546
            },
            {
                "language": "IT",
                "text": "Non solo i Workspaces possono essere modificati",
                "updated": 1639073159902
            },
            {
                "language": "TR",
                "text": "Yalnızca Çalışma Alanları ( Workspaces ) değiştirilemez",
                "updated": 1640616138230
            },
            {
                "language": "RU",
                "text": "Изменять можно не только рабочие пространства",
                "updated": 1640633292137
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "SA is very modular and can be arranged the way we prefer for our needs.",
            "updated": 1614241605095,
            "translations": [
                {
                    "language": "DE",
                    "text": "SA ist sehr modular und kann so angeordnet werden, wie wir es für unsere Bedürfnisse bevorzugen.",
                    "updated": 1622977780236,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "SA es muy modular y se puede organizar de la manera que prefiramos para nuestras necesidades.",
                    "updated": 1629347317411
                },
                {
                    "language": "IT",
                    "text": "SA è modulare e può essere organizzato nel modo che preferiamo per le nostre esigenze.",
                    "updated": 1639073670338
                },
                {
                    "language": "TR",
                    "text": "SA çok modülerdir ve ihtiyaçlarımız için tercih ettiğimiz şekilde düzenlenebilir.",
                    "updated": 1640616150087
                },
                {
                    "language": "RU",
                    "text": "У Superalgos модульная система, которая может быть организована так, как мы хотим для наших нужд.",
                    "updated": 1640633435587
                }
            ]
        },
        {
            "style": "Text",
            "text": "I prepared for you a very basic Workspace with a new Data Mine and arranged the nodes deleting all I don't need for this tutorial.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Ich habe für dich einen sehr einfachen Workspace mit einer neuen Data Mine vorbereitet und die Knoten angeordnet, wobei ich alles gelöscht habe, was ich für dieses Tutorial nicht benötige.",
                    "updated": 1622977811209,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Te preparé un muy básico Workspace con un nuevo Data Mine y organize los nodos eliminando todo lo que no necesito para este tutorial.",
                    "updated": 1629347385771
                },
                {
                    "language": "IT",
                    "text": "Ho preparato per te un workspace molto semplice con un nuovo  Data Mine e ho organizzato i nodi eliminando tutto ciò che non mi serviva per questo tutorial.",
                    "updated": 1639073239124
                },
                {
                    "language": "TR",
                    "text": "Yeni bir Veri Madeni ( Data Mine ) ile sizin için çok basit bir Çalışma Alanı ( Workspace ) hazırladım ve bu eğitim için ihtiyacım olmayan her şeyi silerek düğümleri düzenledim.",
                    "updated": 1640616164929
                },
                {
                    "language": "RU",
                    "text": "Я подготовил для вас базовое рабочее пространство с новым Data Mine и расположил узлы, удалив все, что мне не нужно для этого урока.",
                    "updated": 1640633473041
                }
            ]
        },
        {
            "style": "Success",
            "text": "In SA data mines can be added and removed but the data saved on your hard disk will not be deleted if you remove an indicator!",
            "translations": [
                {
                    "language": "DE",
                    "text": "In SA können Data Mines hinzugefügt und entfernt werden, aber die auf der Festplatte gespeicherten Daten werden nicht gelöscht, wenn du einen Indikator entfernst!",
                    "updated": 1622977843713,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "En SA, las minas de datos se pueden agregar y eliminar, pero los datos guardados en su disco duro no se eliminarán si eliminas un indicador.",
                    "updated": 1629347666344
                },
                {
                    "language": "IT",
                    "text": "In SA anche i Data Mine possono essere aggiunti o rimossi ma ricorda che i dati salvati sul disco rigido non verranno eliminati se si rimuove un indicatore!",
                    "updated": 1639073315071
                },
                {
                    "language": "TR",
                    "text": "İpucu: Sa veri madenleri eklenebilir ve kaldırılabilir, ancak bir göstergeyi kaldırırsanız sabit diskinize kaydedilen veriler silinmez!",
                    "updated": 1640616179214
                },
                {
                    "language": "RU",
                    "text": "В Superalgos источники данных можно добавлять и удалять, но данные, сохраненные на жестком диске, не будут удалены, если вы удалите индикатор!",
                    "updated": 1640633531680
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}