{
    "tutorial": "Hello World Tutorial",
    "pageNumber": 10,
    "type": "Tutorial Step - Take Position",
    "definition": {
        "text": "Time to take Position!",
        "icon": {
            "name": "take-position",
            "project": "Foundations"
        },
        "updated": 1614246263376,
        "translations": [
            {
                "language": "DE",
                "text": "Zeit, um Position zu beziehen!",
                "updated": 1622979146522,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Tiempo para tomar Position!",
                "updated": 1629355595189
            },
            {
                "language": "IT",
                "text": "E'ora di comprare!",
                "updated": 1639078245611
            },
            {
                "language": "TR",
                "text": "Pozisyon ( Position ) alma zamanı!",
                "updated": 1640617143844
            },
            {
                "language": "RU",
                "text": "Время занять позицию (Position)!",
                "updated": 1640856251728
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "In this node I use the same trick used for the Trigger Off Event but in this case forcing it to True. I already defined in the Trigger On Event what are my conditions. So in this node I can just copy the two conditions or set it to True.",
            "updated": 1614260289104,
            "translations": [
                {
                    "language": "DE",
                    "text": "In diesem Knoten verwende ich den gleichen Trick wie beim Trigger Off Event (Ereignis), erzwinge aber in diesem Fall den Wert True. Ich habe bereits im Trigger On Event definiert, was meine Bedingungen sind. In diesem Knoten kann ich also einfach die beiden Bedingungen kopieren und auf True setzen.",
                    "updated": 1622981314446,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "En este nodo utilizo el mismo truco utilizado para el Trigger Off Event pero en este caso obligándolo a True.Ya lo definí en el Trigger On Event cuales son mis condiciones. Entonces en este nodo puedo simplemente copiar las dos condiciones o configurarlo en True.",
                    "updated": 1629355939657
                },
                {
                    "language": "IT",
                    "text": "In questo nodo utilizzo lo stesso trucco utilizzato per l'evento Trigger Off ma in questo caso forzandolo a True. Ho già definito nel Trigger On Event quali sono le mie condizioni. Quindi in questo nodo posso semplicemente copiare le due condizioni o impostarlo su True.",
                    "updated": 1639078166522
                },
                {
                    "language": "TR",
                    "text": "Bu düğümde ( Trigger Off Event ) için kullanılanın aynısını kullanıyorum, True yapıyorum. Tetikleyici Olayda (Trigger On Event )koşullarımın neler olduğunu zaten tanımladım. Yani bu düğümde iki koşulu kopyalayabilir veya True olarak ayarlayabilirim.",
                    "updated": 1640617163744
                },
                {
                    "language": "RU",
                    "text": "В этом узле я использую тот же прием, что и для события Trigger Off Event, но в данном случае заставляю его принимать значение True. В событии Trigger On Event я уже определил, каковы мои условия. Поэтому в этом узле я могу просто скопировать эти два условия или установить их в True.",
                    "updated": 1640885064499
                }
            ]
        },
        {
            "style": "Success",
            "text": "Of course if I need more conditions I can add or modify them as per my needs!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn ich mehr Bedingungen benötige, kann ich sie natürlich nach meinen Bedürfnissen hinzufügen oder ändern!",
                    "updated": 1622979260265,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "¡Por supuesto, si necesito más condiciones, puedo agregarlas o modificarlas según mis necesidades!",
                    "updated": 1629355966149
                },
                {
                    "language": "IT",
                    "text": "Ovviamente se ho bisogno di più condizioni posso aggiungerle o modificarle secondo le mie esigenze!",
                    "updated": 1639078182830
                },
                {
                    "language": "TR",
                    "text": "İpucu: Elbette daha fazla koşula ihtiyacım olursa, bunları ihtiyaçlarıma göre ekleyebilir veya değiştirebilirim!",
                    "updated": 1640617211347
                },
                {
                    "language": "RU",
                    "text": "Конечно, если мне понадобится больше условий, я могу добавить или изменить их в соответствии с моими потребностями!",
                    "updated": 1640856441565
                }
            ]
        },
        {
            "style": "Note",
            "text": "Cool. My initial definitions are set. It's time to move to the Open Stage!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Cool. Meine Definitionen sind festgelegt. Es ist an der Zeit, zur Open Stage überzugehen!",
                    "updated": 1622981356171,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Súper. Mis definiciones iniciales están establecidas. ¡Es hora de pasar al Open Stage!",
                    "updated": 1629356060233
                },
                {
                    "language": "IT",
                    "text": "Bene! Le mie definizioni iniziali sono impostate. È ora di passare all'Open Stage!",
                    "updated": 1639078235045
                },
                {
                    "language": "TR",
                    "text": "Not: Harika. İlk tanımlarım belirlendi. Açık Sahne'ye ( Open Stage ) geçme zamanı",
                    "updated": 1640617221673
                },
                {
                    "language": "RU",
                    "text": "Отлично. Мои первоначальные определения установлены. Пора переходить к стадии открытия (Open Stage)!",
                    "updated": 1640856486187
                }
            ]
        }
    ]
}