{
    "tutorial": "Hello World Tutorial",
    "pageNumber": 9,
    "type": "Tutorial Step - Trigger Off",
    "definition": {
        "text": "If you do not need a condition just set it to False or True!",
        "icon": {
            "name": "trigger-off",
            "project": "Foundations"
        },
        "updated": 1614333368044,
        "translations": [
            {
                "language": "DE",
                "text": "Wenn du keine Bedingung benötigst setze es einfach auf „False“ oder „True“!",
                "updated": 1622978946854,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si no necesitas una condición, configúrela en False o True!",
                "updated": 1629352241171
            },
            {
                "language": "IT",
                "text": "Se non hai bisogno di una condizione, impostala su False o True!",
                "updated": 1639077650052
            },
            {
                "language": "TR",
                "text": "Bir koşula ihtiyacınız yoksa, onu Yanlış (false) veya Doğru (true) olarak ayarlamanız yeterlidir!",
                "updated": 1640617057356
            },
            {
                "language": "RU",
                "text": "Если вам не нужно условие, просто установите его в False или True!",
                "updated": 1640855968420
            },
            {
                "language": "NL",
                "text": "Als u geen voorwaarde nodig heeft, stelt u deze gewoon in op False of True!",
                "updated": 1670774274921
          },
          {
                "language": "ID",
                "text": "JIka kamu tidak perlu kondisi cukup atur saja ke False atau True!",
                "updated": 1670304541845
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "For my backtest I don't need a Trigger Off condition so I just write false in Javascript code",
            "updated": 1614334212315,
            "translations": [
                {
                    "language": "DE",
                    "text": "Für meinen Backtest benötige ich keine Trigger Off Bedingung, also schreibe ich einfach False in den Javascript-Code",
                    "updated": 1622978973861,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Para mi backtest no necesito un Trigger Off condición, así que solo escribo false en codigo Javascript",
                    "updated": 1629354481694
                },
                {
                    "language": "IT",
                    "text": "Per il mio backtest non ho bisogno di una condizione Trigger Off, quindi scrivo solo false nel codice Javascript",
                    "updated": 1639077681031
                },
                {
                    "language": "TR",
                    "text": "Geri testim için Tetikleme Kapalı ( Trigger Off ) koşuluna ihtiyacım yok, bu yüzden Javascript kodunda yanlış ( false ) yazıyorum",
                    "updated": 1640617070236
                },
                {
                    "language": "RU",
                    "text": "Для моего бэктеста мне не нужно условие отключения триггера (Trigger Off), поэтому я просто пишу false в коде Javascript",
                    "updated": 1640856059315
                },
                {
                    "language": "NL",
                    "text": "Voor mijn backtest heb ik geen Trigger Off conditie, dus ik schrijf gewoon false in Javascript code",
                    "updated": 1670774355503
                },
                {
                    "language": "ID",
                    "text": "Untuk backtest-ku aku tidak perlu kondisi Trigger Off jadi aku hanya menulis false di kode Javascript",
                    "updated": 1670304556205
                }
            ]
        },
        {
            "style": "Success",
            "text": "Remember that Conditions can be only True or False. When I write some Javascript code inside these type of nodes, they must evaluate True or False because essentially what I'm writing is a test.",
            "updated": 1614245807894,
            "translations": [
                {
                    "language": "DE",
                    "text": "Denke daran, dass Bedingungen nur True oder False sein können. Wenn ich Javascript-Code innerhalb dieser Art von Knoten schreibe, müssen sie True oder False auswerten, weil das, was ich schreibe, im Wesentlichen ein Test ist.",
                    "updated": 1622978923884,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Recuerda que Conditions puede ser solo True o False. Cuando escribo código Javascript dentro de este tipo de nodos, deben evaluar True o False porque esencialmente lo que estoy escribiendo es una prueba.",
                    "updated": 1629354487276
                },
                {
                    "language": "IT",
                    "text": "Ricorda che le condizioni possono essere solo true o false. Quando scrivo del codice Javascript all'interno di questo tipo di nodi, viene valutato True o False perché essenzialmente quello che sto scrivendo è un test.",
                    "updated": 1639077755545
                },
                {
                    "language": "TR",
                    "text": "İpucu: Koşulların yalnızca Doğru (false) veya Yanlış (true) olabileceğini unutmayın. Bu tür düğümlerin içine bazı Javascript kodları yazdığımda, Doğru veya Yanlış değerlendirmeleri gerekir çünkü aslında yazdığım şey bir testtir.",
                    "updated": 1640617083909
                },
                {
                    "language": "RU",
                    "text": "Помните, что условия могут принимать значения True или False. Когда я пишу код Javascript внутри узлов такого типа, они должны вычислять True или False, потому что, по сути, то, что я пишу, является тестом.",
                    "updated": 1640856112075
                },
                {
                    "language": "NL",
                    "text": "Onthoud dat Voorwaarden alleen True of False kunnen zijn. Wanneer ik wat Javascript-code in dit soort knooppunten schrijf, moeten ze True of False evalueren, omdat wat ik schrijf in wezen een test is.",
                    "updated": 1670774393326
                },
                {
                    "language": "ID",
                    "text": "Selalu diingat bahwa Kondisi hanya bisa True atau False. Ketika aku menulis sebuah kode Javascript didalam tipe node ini, mereka harus mengevaluasi True atau False karena biasanya adalah sebuah test.",
                    "updated": 1670304588981
                }
            ]
        }
    ]
}