{
    "tutorial": "Hello World Tutorial",
    "pageNumber": 15,
    "type": "Tutorial Step - Update Data Mines",
    "definition": {
        "text": "Chances are you already have some data mined!",
        "icon": {
            "name": "data-tasks",
            "project": "Foundations"
        },
        "updated": 1614267263084,
        "translations": [
            {
                "language": "DE",
                "text": "Eventuell hast du bereits ein paar Daten gemined!",
                "updated": 1622980204621,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Lo más probable es que ya tengas algunos datos extraídos!",
                "updated": 1629576816892
            },
            {
                "language": "IT",
                "text": "Se hai già seguito il Welcome Tutorial, probabilmente hai già minato un pò di candele!",
                "updated": 1640110485198
            },
            {
                "language": "TR",
                "text": "Bazı verileri zaten almış olabilirsiniz!",
                "updated": 1640617991764
            },
            {
                "language": "RU",
                "text": "Скорее всего, у вас уже есть некоторые накопленные данные!",
                "updated": 1640857240429
            },
            {
                "language": "NL",
                "text": "De kans is groot dat je al wat data hebt verzameld!",
                "updated": 1670775689388
            },
            {
                "language": "ID",
                "text": "Kemungkinan kamu sudah memiliki beberapa data yang tertambang!",
                "updated": 1670310694214
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If you have done the intro Tutorial then probably you already have mined some data. But I added a new indicator that is not present in the initial configuration. So please Run the data Mines and wait until they are 100% ready.",
            "updated": 1614267281564,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn du das Intro-Tutorial gemacht hast, dann hast du wahrscheinlich schon einige Daten geschürft. Allerdings habe ich einen neuen Indikator hinzugefügt, der in der Anfangskonfiguration nicht vorhanden ist. Führe also bitte die Data Mines aus (\"Run\") und warte, bis sie zu 100% fertig sind.",
                    "updated": 1622980292728,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Si has hecho la intro Tutorial entonces probablemente ya hayas extraído algunos datos. Pero agregué un nuevo indicador que no está presente en la configuración inicial. Así que por favor Run los data Mines Y espera hasta que estén 100% listos.",
                    "updated": 1629576956473
                },
                {
                    "language": "IT",
                    "text": "Se hai fatto il Welcome Tutorial il tuo grafico sarà già popolato dalle candele del prezzo e probabilmente qualche indicatore. In quetso Workspace ho però aggiunto un nuovo indicatore che non è presente nella configurazione iniziale. Quindi, per favore, esegui Data Mine Task chiamato Sparta e attendi fino al completamento al 100%.",
                    "updated": 1640110613363
                },
                {
                    "language": "TR",
                    "text": "Giriş Eğitimini ( Tutorial ) yaptıysanız, muhtemelen bazı verileri almışsınızdır. Ancak ilk yapılandırmada bulunmayan yeni bir gösterge ekledim. Bu yüzden lütfen veri Madenlerini ( Mines ) çalıştırın ve %100 hazır olana kadar bekleyin.",
                    "updated": 1640618010805
                },
                {
                    "language": "RU",
                    "text": "Если вы изучили вводный учебник, то, вероятно, вы уже добыли некоторые данные. Но я добавил новый индикатор, которого нет в начальной конфигурации. Поэтому, пожалуйста, запустите добычу данных и подождите, пока они не будут готовы на 100%.",
                    "updated": 1640857287228
                },
                {
                    "language": "NL",
                    "text": "Als je de intro Tutorial hebt gedaan, heb je waarschijnlijk al wat gegevens verzameld. Maar ik heb een nieuwe indicator toegevoegd die niet aanwezig is in de initiële configuratie. Voer dus de data Mines uit door op <i>Run</i> te klikken, en wacht tot ze 100% klaar zijn.",
                    "updated": 1670775905496
                },
                {
                    "language": "ID",
                    "text": "Jika kamu telah menyelesaikan intro Tutorial maka kemungkinan kamu telah menambang beberapa data. Tetapi aku menambahkan indikator baru yang tidak terlihat pada konfigurasi awal. Jadi mohon Run data Mines dan tunggu sampai mereka 100% siap.",
                    "updated": 1670310702877
                }
            ]
        },
        {
            "style": "Important",
            "text": "Make sure that under Sparta Data Mine Tasks the newly added indicator Simple Moving Average is 100% updated (this may take a while depending on your hardware)",
            "updated": 1614267364900,
            "translations": [
                {
                    "language": "DE",
                    "text": "Stelle sicher, dass unter Sparta Data Mine Tasks der neu hinzugefügte Indikator Simple Moving Average zu 100% aktualisiert ist.",
                    "updated": 1622980304913,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "Asegúrate de que debajo Sparta Data Mine Tasks el indicador recién agregado Simple Moving Average está 100% actualizado.",
                    "updated": 1629577044677
                },
                {
                    "language": "IT",
                    "text": "Assicurati che in Sparta - Data Mine Tasks l'indicatore SMA sia aggiornato al 100%.",
                    "updated": 1640110648546
                },
                {
                    "language": "TR",
                    "text": "Önemli: Sparta Veri Madeni Görevleri ( Data Mine Tasks ) altında yeni eklenen Basit Hareketli Ortalama göstergesinin ( Simple Moving Average ) %100 güncellendiğinden emin olun.",
                    "updated": 1640618037690
                },
                {
                    "language": "RU",
                    "text": "Убедитесь, что в разделе Sparta Data Mine Tasks недавно добавленный индикатор Simple Moving Average обновлен на 100%.",
                    "updated": 1640857303985
                },
                {
                    "language": "NL",
                    "text": "Zorg ervoor dat onder Sparta Data Mine Tasks de nieuw toegevoegde indicator Simple Moving Average 100% is bijgewerkt (dit kan enige tijd duren, afhankelijk van uw hardware)",
                    "updated": 1670776030439
                },
                {
                    "language": "ID",
                    "text": "Pastikan bahwa dibawah Sparta Data Mine Tasks, indikator Simple Moving Average yang baru ditambahkan 100% diperbarui (Ini akan membutuhkan waktu tergantung hardware)",
                    "updated": 1670310711274
                }
            ]
        },
        {
            "style": "Success",
            "text": "Once all indicators are 100% you can stop the data mines and save resources for the backtest",
            "updated": 1614267400047,
            "translations": [
                {
                    "language": "DE",
                    "text": "Sobald alle Indikatoren 100%ig sind, kannst du die Data Mines stoppen und Ressourcen für den Backtest sparen.",
                    "updated": 1622980322182,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Ya al 100%, puedes detener los Data Mines y ahorrar recursos para el backtest.",
                    "updated": 1629577393595
                },
                {
                    "language": "IT",
                    "text": "Una volta che tutti gli indicatori sono al 100%, puoi fermare i Data Mine e risparmiare risorse per il backtest",
                    "updated": 1640110681763
                },
                {
                    "language": "TR",
                    "text": "İpucu: Tüm göstergeler %100 olduğunda, veri madenlerini durdurabilir ve geriye dönük test için kaynak tasarrufu yapabilirsiniz",
                    "updated": 1640618053948
                },
                {
                    "language": "RU",
                    "text": "Как только все показатели достигнут 100%, вы можете остановить добычу данных и сохранить ресурсы для бэктеста.",
                    "updated": 1640857369873
                },
                {
                    "language": "NL",
                    "text": "Zodra alle indicatoren 100% zijn, kunt u de datamijnen stoppen en systeem resources besparen voor de backtest",
                    "updated": 1670776063780
                },
                {
                    "language": "ID",
                    "text": "Ketika semua indikator sudah 100% kamu dapat memberhentikan data mines dan menyimpan sumber daya untuk backtest",
                    "updated": 1670310718877
                }
            ]
        }
    ]
}