{
    "type": "Model",
    "definition": {
        "text": "In machine learning, a model is a function with learnable parameters that maps an input to an output. The optimal parameters are obtained by training the model on data. A well-trained model will provide an accurate mapping from the input to the desired output.",
        "updated": 1613200965382,
        "translations": [
            {
                "language": "RU",
                "text": "В машинном обучении модель - это функция с обучаемыми параметрами, которая отображает входные данные на выходные. Оптимальные параметры получаются путем обучения модели на данных. Хорошо обученная модель обеспечивает точное отображение входных данных на желаемый выход.",
                "updated": 1645249016691
            },
            {
                "language": "TR",
                "text": "Makine öğreniminde model, bir girdiyi bir çıktıya eşleyen öğrenilebilir parametrelere sahip bir fonksiyondur. En uygun parametreler, modelin veriler üzerinde eğitilmesiyle elde edilir. İyi eğitilmiş bir model, girdiden istenen çıktıya doğru bir eşleme sağlayacaktır.",
                "updated": 1654397345762
            },
            {
                "language": "DE",
                "text": "Beim maschinellen Lernen ist ein Modell eine Funktion mit erlernbaren Parametern, die eine Eingabe auf eine Ausgabe abbildet. Die optimalen Parameter werden durch Training des Modells anhand von Daten ermittelt. Ein gut trainiertes Modell liefert eine genaue Abbildung der Eingabe auf die gewünschte Ausgabe.",
                "updated": 1707240560955
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "In TensorFlow.js there are two ways to create a machine learning model:",
            "updated": 1613201440028,
            "translations": [
                {
                    "language": "RU",
                    "text": "В TensorFlow.js существует два способа создания модели машинного обучения:",
                    "updated": 1645249024667
                },
                {
                    "language": "TR",
                    "text": "TensorFlow.js'de bir makine öğrenimi modeli oluşturmanın iki yolu vardır:",
                    "updated": 1654397351751,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "In TensorFlow.js gibt es zwei Möglichkeiten, ein maschinelles Lernmodell zu erstellen:",
                    "updated": 1707240580482
                }
            ]
        },
        {
            "style": "List",
            "text": "using the Layers API where you build a model using layers.",
            "translations": [
                {
                    "language": "RU",
                    "text": "с помощью Layers API, где вы строите модель, используя слои.",
                    "updated": 1645249052521
                },
                {
                    "language": "TR",
                    "text": "Katmanları kullanarak bir model oluşturduğunuz Katmanlar API'sini kullanarak.",
                    "updated": 1654397358286,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "unter Verwendung der API-Ebenen (Layers API), bei der Sie ein Modell mit Ebenen aufbauen.",
                    "updated": 1707240595236
                }
            ]
        },
        {
            "style": "List",
            "text": "using the Core API with lower-level ops such as tf.matMul(), tf.add(), etc.",
            "translations": [
                {
                    "language": "RU",
                    "text": "использование Core API с операциями более низкого уровня, такими как tf.matMul(), tf.add() и т.д.",
                    "updated": 1645249041243
                },
                {
                    "language": "TR",
                    "text": "tf.matMul(), tf.add(), vb. gibi daha düşük seviyeli işlemlerle Core API'yi kullanmak.",
                    "updated": 1654397364009,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Verwendung der Kern-API (Core API) mit untergeordneten Operationen wie tf.matMul(), tf.add(), usw.",
                    "updated": 1707240604126
                }
            ]
        }
    ]
}