{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 32,
    "type": "Tutorial Step - Link Chart to Trading System",
    "definition": {
        "text": "We are on a roll! I hope you are ready to see your Trading System in action next!",
        "icon": {
            "name": "chart-points",
            "project": "Foundations"
        },
        "updated": 1619024433448,
        "translations": [
            {
                "language": "ES",
                "text": "¡Estamos en una buena racha! Espero que estés listo para ver tu Trading System en acción a continuación!",
                "updated": 1628726073887
            },
            {
                "language": "RU",
                "text": "Мы в ударе! Надеюсь, вы готовы увидеть свою торговую систему (Trading System) в действии дальше!",
                "updated": 1639080261066
            },
            {
                "language": "DE",
                "text": "Wir haben einen Lauf! Ich hoffe, Sie sind bereit, Ihr Trading System als nächstes in Aktion zu sehen!",
                "updated": 1639497372330
            },
            {
                "language": "TR",
                "text": "Başlıyoruz! Umarım bundan sonra ticaret sisteminizi ( Trading System ) çalışırken görmeye hazırsınızdır!",
                "updated": 1642595883980
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The next thing you will want to connect with most charts are the results of your trading sessions. For the most part, this is the same as connecting to a Data Mine. There are just a few differences I will walk you through. One major difference is that each Time Machine can only reference one Trading Session. For example, one Backtesting Session that is associated with one Trading System. This helps keep your charts clean and readable. It would be confusing to see buy orders from two different trading systems all at once! What this means for connecting a chart is that we need to establish two references in order for things to work.",
            "updated": 1620560071262,
            "translations": [
                {
                    "language": "ES",
                    "text": "Lo siguiente que querrás conectar con la mayoría de los gráficos son los resultados de tus trading sessions. En su mayor parte, esto es lo mismo que conectarse a un Data Mine. Hay algunas diferencias que te explicaré. Una diferencia importante es que cada Time Machine solo puede hacer referencia a un Trading Session. Por ejemplo, un Backtesting Session que está asociado con un Trading System. Esto ayuda a mantener tus gráficos limpios y legibles. ¡Sería confuso ver órdenes de compra de dos sistemas comerciales diferentes a la vez! Esto significa que para conectar un gráfico necesitamos establecer dos referencias para que las cosas funcionen.",
                    "updated": 1628727113714
                },
                {
                    "language": "RU",
                    "text": "Следующее, что вы захотите связать с большинством графиков, - это результаты ваших торговых сессий. По большей части это то же самое, что и подключение к шахте данных (Data Mine). Я расскажу вам о нескольких отличиях. Одно из основных отличий заключается в том, что каждая машина времени (Time Machine)может ссылаться только на одну торговую сессию (Trading Session). Например, одна сессия бэктестинга (Backtesting Session) связанная с одной торговой системой (Trading System). Это поможет сохранить ваши диаграммы чистыми и читаемыми. Было бы непонятно видеть ордера на покупку от двух разных торговых систем одновременно! Для подключения графика это означает, что нам необходимо установить две ссылки для того, чтобы все работало.",
                    "updated": 1639080477529
                },
                {
                    "language": "DE",
                    "text": "Das nächste, was Sie mit den meisten Charts verbinden möchten, sind die Ergebnisse Ihrer Handelssitzungen. Im Großen und Ganzen ist dies dasselbe wie die Verbindung zu einer Data Mine. Es gibt nur ein paar Unterschiede, die ich Ihnen erläutern werde. Ein wesentlicher Unterschied besteht darin, dass jede Time Machine nur eine Trading Session referenzieren kann. Zum Beispiel eine Backtesting Session, die mit einem Trading System verbunden ist. Dies trägt dazu bei, dass Ihre Charts übersichtlich und lesbar bleiben. Es wäre verwirrend, Kaufaufträge von zwei verschiedenen Handelssystemen auf einmal zu sehen! Für das Verbinden eines Diagramms bedeutet dies, dass wir zwei Referenzen erstellen müssen, damit die Dinge funktionieren.",
                    "updated": 1639497542248
                },
                {
                    "language": "TR",
                    "text": "Çoğu çizelgeyle ilişkilendirmek isteyeceğiniz bir sonraki şey, işlem seanslarınızın sonuçlarıdır. Çoğunlukla bu, bir veri madenine (Data Mine ) bağlanmakla aynıdır. Size birkaç farklılıktan bahsedeceğim. Ana farklılıklardan biri, her zaman makinesinin ( Time Machine ) yalnızca bir işlem seansına atıfta bulunabilmesidir. Örneğin, bir ticaret oturumu ( Trading Session ) ilişkili bir geriye dönük test oturumu ( Backtesting Session ). Bu, diyagramlarınızı temiz ve okunabilir tutmanıza yardımcı olacaktır. Aynı anda iki farklı ticaret sisteminden ( Trading System ) satın alma emri görmek anlaşılmaz olurdu! Grafiği bağlamak için bu, her şeyin çalışması için iki bağlantı kurmamız gerektiği anlamına gelir.",
                    "updated": 1642596301256
                }
            ]
        }
    ]
}