{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 20,
    "type": "Tutorial Step - Why Is It Blank?",
    "definition": {
        "text": "Woohoo, you did it! You have added your first custom chart. Let's see what we've got so far. Zoom all the way into your chart and take a look around.",
        "updated": 1619020412228,
        "icon": {
            "name": "Charting-Space/chart-points",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Has agregado tu primer gráfico personalizado. Veamos qué tenemos hasta ahora. Amplía todo el recorrido de tu gráfico y eche un vistazo a tu alrededor.",
                "updated": 1628647058651
            },
            {
                "language": "RU",
                "text": "Ух ты, ты сделал это! Вы добавили свой первый пользовательский график. Давайте посмотрим, что у нас есть на данный момент. Увеличьте масштаб вашей диаграммы и осмотритесь.",
                "updated": 1638175954140
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Your chart is there alright, but it's pretty boring still.",
            "updated": 1619020652143,
            "translations": [
                {
                    "language": "ES",
                    "text": "Su gráfico está bien, pero todavía es bastante aburrido.",
                    "updated": 1628646906326
                },
                {
                    "language": "RU",
                    "text": "Ваш график там есть, но он все равно довольно скучный.",
                    "updated": 1638175975827
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Find the Layer Manager for the Timeline Chart you added. Use your mouse to scroll a few times.",
            "updated": 1620046806923,
            "translations": [
                {
                    "language": "ES",
                    "text": "Encuentra el Layer Manager para el Timeline Chart tu agregaste. Utiliza tu ratón para desplazarte unas cuantas veces.",
                    "updated": 1628646968752
                },
                {
                    "language": "RU",
                    "text": "Найдите менеджер слоев (Layer Manager) для добавленной диаграммы временной шкалы (Timeline Chart). Используйте мышь, чтобы прокрутить несколько раз.",
                    "updated": 1638176050854
                }
            ]
        },
        {
            "style": "Text",
            "text": "No matter how hard you scroll nothing happens does it? Don't worry, nothing is broken! We just haven’t hooked it up to any of your data. Let’s change that! ",
            "updated": 1620046673656,
            "translations": [
                {
                    "language": "ES",
                    "text": "No importa cuánto te desplaces, no pasa nada. ¡No te preocupes, no hay nada roto! Simplemente no lo hemos conectado a ninguno de sus datos. ¡Cambiemos eso!",
                    "updated": 1628647017081
                },
                {
                    "language": "RU",
                    "text": "Как бы вы ни старались, ничего не происходит, не так ли? Не волнуйтесь, ничего не сломано! Мы просто не подключили его к вашим данным. Давайте изменим это!",
                    "updated": 1638176090746
                }
            ]
        },
        {
            "style": "Note",
            "text": "A Layer Manager inherits the name from its Timeline Chart. That's why a short name was best!",
            "updated": 1620555102768,
            "translations": [
                {
                    "language": "ES",
                    "text": "Un Layer Manager hereda el nombre de su Timeline Chart. ¡Por eso era mejor un nombre corto!",
                    "updated": 1628647051230
                },
                {
                    "language": "RU",
                    "text": "Менеджер слоев (Layer Manager) наследует имя от своей временной диаграммы (Timeline Chart). Вот почему короткое имя было лучшим!",
                    "updated": 1638176175990
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}