{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 12,
    "type": "Tutorial Step - Magical Machines",
    "definition": {
        "text": "You've seen these portals to another dimension before! Now let's take a closer look at the magical Time Machine.",
        "icon": {
            "name": "time-machine",
            "project": "Foundations"
        },
        "updated": 1628359226218,
        "translations": [
            {
                "language": "ES",
                "text": "¡Has visto estos portales a otra dimensión antes! Ahora echemos un vistazo más de cerca a la magia de los Time Machine.",
                "updated": 1628645012003
            },
            {
                "language": "RU",
                "text": "Вы уже видели эти порталы в другое измерение! Теперь давайте подробнее рассмотрим волшебную Машину времени (Time Machine).",
                "updated": 1637937803910
            },
            {
                "language": "DE",
                "text": "Du hast diese Portale in eine andere Dimension schon einmal gesehen! Jetzt wollen wir uns die magische Time Machine genauer ansehen.",
                "updated": 1639102802329
            },
            {
                "language": "TR",
                "text": "Bu portalları zaten başka bir boyutta gördünüz! Şimdi büyülü Zaman Makinesi'ne ( Time Machine ) daha yakından bakalım.",
                "updated": 1642583621863
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may have noticed that each control panel has a Time Machine associated with it. You've already seen time machines in previous tutorials. But today we're going to be working with them much more closely.",
            "updated": 1682430357310,
            "translations": [
                {
                    "language": "ES",
                    "text": "Te habrás dado cuenta de que cada panel de control tiene una Máquina del Tiempo asociada. Ya has visto máquinas del tiempo en tutoriales anteriores. Pero hoy vamos a estar trabajando con ellos mucho más de cerca.",
                    "updated": 1682430394186
                },
                {
                    "language": "RU",
                    "text": "Вы могли заметить, что к каждой приборной панели подключена машина времени (Time Machine). Вы уже сталкивались с машинами времени в предыдущих уроках. Но сегодня мы будем работать с ними гораздо более тесно.",
                    "updated": 1637937896002
                },
                {
                    "language": "DE",
                    "text": "Sie haben vielleicht bemerkt, dass jedes Dashboard mit einer Time Machine verbunden ist. Zeitmaschinen haben Sie bereits in früheren Tutorials kennengelernt. Aber heute werden wir viel intensiver mit ihnen arbeiten.",
                    "updated": 1639102892584
                },
                {
                    "language": "TR",
                    "text": "Her gösterge panosunun kendisine bağlı bir Zaman Makinesi ( Time Machine ) olduğunu fark etmiş olabilirsiniz. Daha önceki derslerde zaman makineleriyle zaten karşılaşmıştınız. Ama bugün onlarla çok daha yakın çalışacağız.",
                    "updated": 1642583712773
                }
            ]
        }
    ]
}