{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 20,
    "type": "Tutorial Step - Why Is It Blank?",
    "definition": {
        "text": "Woohoo, you did it! You have added your first custom chart. Let's see what we've got so far. Zoom all the way into your chart and take a look around.",
        "updated": 1619020412228,
        "icon": {
            "name": "chart-points",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Has agregado tu primer gráfico personalizado. Veamos qué tenemos hasta ahora. Amplía todo el recorrido de tu gráfico y echa un vistazo a tu alrededor.",
                "updated": 1682430667060
            },
            {
                "language": "RU",
                "text": "Ух ты, ты сделал это! Вы добавили свой первый пользовательский график. Давайте посмотрим, что у нас есть на данный момент. Увеличьте масштаб вашей диаграммы и осмотритесь.",
                "updated": 1638175954140
            },
            {
                "language": "DE",
                "text": "Juhu, Sie haben es geschafft! Sie haben Ihr erstes eigenes Diagramm erstellt. Schauen wir uns an, was wir bis jetzt haben. Zoomen Sie ganz in Ihr Diagramm hinein und sehen Sie sich um.",
                "updated": 1639151762100
            },
            {
                "language": "TR",
                "text": "Vay canına, başardın! İlk özel grafiğinizi eklediniz. Bakalım şu an elimizde neler var. Grafiğinizi yakınlaştırın ve etrafınıza bakın.",
                "updated": 1642587530657
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Your chart is there alright, but it's pretty boring still.",
            "updated": 1619020652143,
            "translations": [
                {
                    "language": "ES",
                    "text": "Tu gráfico está bien, pero todavía es bastante aburrido.",
                    "updated": 1682430674369
                },
                {
                    "language": "RU",
                    "text": "Ваш график там есть, но он все равно довольно скучный.",
                    "updated": 1638175975827
                },
                {
                    "language": "DE",
                    "text": "Ihr Diagramm ist zwar da, aber es ist trotzdem ziemlich langweilig.",
                    "updated": 1639151808547
                },
                {
                    "language": "TR",
                    "text": "Grafiğin tamam, ama yine de oldukça sıkıcı.",
                    "updated": 1642587571696
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Find the Layer Manager for the Timeline Chart you added. Use your mouse to scroll a few times.",
            "updated": 1620046806923,
            "translations": [
                {
                    "language": "ES",
                    "text": "Encuentra el Layer Manager para el Timeline Chart tu agregaste. Utiliza tu ratón para desplazarte unas cuantas veces.",
                    "updated": 1628646968752
                },
                {
                    "language": "RU",
                    "text": "Найдите менеджер слоев (Layer Manager) для добавленной диаграммы временной шкалы (Timeline Chart). Используйте мышь, чтобы прокрутить несколько раз.",
                    "updated": 1638176050854
                },
                {
                    "language": "DE",
                    "text": "Suchen Sie den Layer Manager für das von Ihnen hinzugefügte Timeline Chart. Verwenden Sie Ihre Maus, um ein paar Mal zu blättern.",
                    "updated": 1639151885292
                },
                {
                    "language": "TR",
                    "text": "Eklenen zaman çizelgesi grafiği ( Timeline Chart ) için Katman Yöneticisini ( Layer Manager ) bulun. Farenizi kullanarak birden çok kez kaydırma yapın.",
                    "updated": 1642587680942
                }
            ]
        },
        {
            "style": "Text",
            "text": "No matter how hard you scroll nothing happens does it? Don't worry, nothing is broken! We just haven’t hooked it up to any of your data. Let’s change that! ",
            "updated": 1620046673656,
            "translations": [
                {
                    "language": "ES",
                    "text": "No importa cuánto te desplaces, no pasa nada. ¡No te preocupes, no hay nada roto! Simplemente no lo hemos conectado a ninguno de tus datos. ¡Cambiemos eso!",
                    "updated": 1682430689023
                },
                {
                    "language": "RU",
                    "text": "Как бы вы ни старались, ничего не происходит, не так ли? Не волнуйтесь, ничего не сломано! Мы просто не подключили его к вашим данным. Давайте изменим это!",
                    "updated": 1638176090746
                },
                {
                    "language": "DE",
                    "text": "Auch wenn Sie noch so viel blättern, es passiert nichts, oder? Keine Sorge, es ist nichts kaputt! Wir haben es nur noch nicht mit Ihren Daten verknüpft. Das wollen wir ändern!",
                    "updated": 1639151933412
                },
                {
                    "language": "TR",
                    "text": "Ne kadar uğraşırsan uğraş, hiçbir şey olmuyor değil mi? Endişelenme, hiçbir şey bozulmaz! Sadece verilerinize bağlamadık. Hadi değiştirelim!",
                    "updated": 1642587727333
                }
            ]
        },
        {
            "style": "Note",
            "text": "A Layer Manager inherits the name from its Timeline Chart. That's why a short name was best!",
            "updated": 1620555102768,
            "translations": [
                {
                    "language": "ES",
                    "text": "Un Layer Manager hereda el nombre de tu Timeline Chart. ¡Por eso era mejor un nombre corto!",
                    "updated": 1682430699791
                },
                {
                    "language": "RU",
                    "text": "Менеджер слоев (Layer Manager) наследует имя от своей временной диаграммы (Timeline Chart). Вот почему короткое имя было лучшим!",
                    "updated": 1638176175990
                },
                {
                    "language": "DE",
                    "text": "Ein Layer Manager erbt den Namen von seinem Timeline Chart. Deshalb ist ein kurzer Name am besten!",
                    "updated": 1639152044645
                },
                {
                    "language": "TR",
                    "text": "Katman yöneticisi ( Layer Manager ), adı kendi zaman çizelgesinden ( Timeline Chart ) devralır. Kısa isim bu yüzden en iyisiydi!",
                    "updated": 1642587830243
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}