{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 17,
    "type": "Tutorial Step - Chart Spawning",
    "definition": {
        "text": "One thing to keep in mind when adding Time Machines is that they may spawn on top of other charts within the Charting Space.",
        "updated": 1620554644805,
        "icon": {
            "name": "Mouse/mouse-left-click",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Una cosa a tener en cuenta al agregar Time Machines es que pueden aparecer en la parte superior de otros gráficos dentro del Charting Space.",
                "updated": 1628646293826
            },
            {
                "language": "RU",
                "text": "При добавлении машин времени следует помнить, что они могут появляться поверх других графиков в пространстве графиков (Charting Space).",
                "updated": 1637940239089
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Let's take a look around the Charting Space and find the time machine you added!",
            "updated": 1620264582796,
            "translations": [
                {
                    "language": "ES",
                    "text": "Echemos un vistazo alrededor del Charting Space y encuentra la máquina del tiempo que agregaste.",
                    "updated": 1628646330822
                },
                {
                    "language": "RU",
                    "text": "Давайте осмотримся в Charting Space и найдем машину времени, которую вы добавили!",
                    "updated": 1637940276541
                }
            ]
        },
        {
            "style": "Callout",
            "text": "If necessary, move the time machines around and look for the title you added to your time machine in the Design Space.",
            "updated": 1620554665332,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si es necesario, mueva las máquinas del tiempo y busque el título que agregó a su máquina del tiempo en el Design Space.",
                    "updated": 1628646350166
                },
                {
                    "language": "RU",
                    "text": "При необходимости переместите машины времени и найдите название, которое вы добавили к машине времени в Design Space.",
                    "updated": 1637940311613
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Success",
            "text": "Remember, to move a chart hold Shift and drag with a left-click.",
            "updated": 1620046117168,
            "translations": [
                {
                    "language": "ES",
                    "text": "Recuerde, para mover un gráfico, mantenga Shift y arrastre con un clic izquierdo.",
                    "updated": 1628646377242
                },
                {
                    "language": "RU",
                    "text": "Помните, что для перемещения графика удерживайте Shift и перетаскивайте его левой кнопкой мыши.",
                    "updated": 1637940361014
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}