{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 18,
    "type": "Tutorial Step - I See a Chart!",
    "definition": {
        "text": "Did you find the Time Machine you added? Don't forget to move around the Charting Space, I know it's here!",
        "updated": 1620264964599,
        "icon": {
            "name": "Charting-Space/chart-points",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "¿Encontraste el Time Machine que agregaste? No olvides moverte por el Charting Space, ¡Sé que está aquí!",
                "updated": 1628646486524
            },
            {
                "language": "RU",
                "text": "Вы нашли \"Машину времени\" (Time Machine),которую добавили? Не забывайте перемещаться по пространству чартов (Charting Space), я знаю, что оно здесь!",
                "updated": 1638175402508
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You should see three charts within the Charting Space.",
            "updated": 1620264097333,
            "translations": [
                {
                    "language": "ES",
                    "text": "Debería ver tres gráficos dentro del Charting Space.",
                    "updated": 1628646517644
                },
                {
                    "language": "RU",
                    "text": "Вы должны увидеть три графика в пространстве графиков (Charting Space).",
                    "updated": 1638175440080
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Read the titles and find the one you added!",
            "updated": 1620264144764,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Lee los títulos y encuentra el que agregaste!",
                    "updated": 1628646530332
                },
                {
                    "language": "RU",
                    "text": "Прочитайте названия и найдите то, что вы добавили!",
                    "updated": 1638175465519
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you zoom in there's not much to look at yet. But that's okay. We are on our way to your very own custom chart. Woohoo! Let's keep going and add some data to your new Time Machine.",
            "updated": 1620264752831,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si amplía, no hay mucho que ver todavía. Pero eso está bien. Estamos en camino a su propia carta personalizada. ¡Guau! Sigamos y agreguemos algunos datos a su nuevo Time Machine.",
                    "updated": 1628646548672
                },
                {
                    "language": "RU",
                    "text": "Если увеличить масштаб, то пока не на что смотреть. Но это нормально. Мы на пути к созданию вашей собственной индивидуальной диаграммы. Ух ты! Давайте продолжим и добавим некоторые данные в вашу новую машину времени (Time Machine).",
                    "updated": 1638175495560
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}