{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 39,
    "type": "Tutorial Step - Not Seeing Anything?",
    "definition": {
        "text": "Are you having trouble with the Trading Layers? It is important you know what you are looking for otherwise you might not find it.",
        "updated": 1619024985292,
        "icon": {
            "name": "bot-data-dependencies",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "¿Tiene problemas con el Trading Layers? Es importante que sepas lo que está buscando, de lo contrario, es posible que no lo encuentres.",
                "updated": 1628732458149
            },
            {
                "language": "RU",
                "text": "У вас проблемы с торговыми слоями (Trading Layers)? Важно знать, что вы ищете, иначе вы можете этого не найти.",
                "updated": 1639084442197
            },
            {
                "language": "DE",
                "text": "Haben Sie Probleme mit den Trading Layers? Es ist wichtig, dass Sie wissen, wonach Sie suchen, sonst finden Sie es vielleicht nicht.",
                "updated": 1639500186980
            },
            {
                "language": "TR",
                "text": "Ticaret ( Trading ) Katmanları ile ilgili sorun mu yaşıyorsunuz? Ne aradığınızı bilmeniz önemlidir, aksi halde bulamayabilirsiniz.",
                "updated": 1642881684238
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Important",
            "text": "Remember to pay attention to the Time Frame and dates the session was run under. Otherwise you won’t see anything!",
            "updated": 1617887429273,
            "translations": [
                {
                    "language": "ES",
                    "text": "Recuerda prestar atención a el Time Frame y fechas en las que se llevó a cabo la sesión. De lo contrario, no verás nada.",
                    "updated": 1628732501490
                },
                {
                    "language": "RU",
                    "text": "Не забудьте обратить внимание на временные рамки (Time Frame) и даты, в которые проводилась сессия. Иначе вы ничего не увидите!",
                    "updated": 1639084486874
                },
                {
                    "language": "DE",
                    "text": "Achten Sie auf den Time Frame und die Daten, unter denen die Sitzung durchgeführt wurde. Sonst werden Sie nichts sehen!",
                    "updated": 1639500251377
                },
                {
                    "language": "TR",
                    "text": "Önemli: Oturumun yürütüldüğü Zaman Çerçevesine ( Time Frame ) ve tarihlere dikkat etmeyi unutmayın. Aksi takdirde hiçbir şey göremezsiniz!",
                    "updated": 1642881854303
                }
            ]
        },
        {
            "style": "Success",
            "text": "The Lightning Strike Backtesting Session was run on the one minute time frame from September 1 2020 to September 2 2020.",
            "updated": 1617887385163,
            "translations": [
                {
                    "language": "ES",
                    "text": "El Lightning Strike Backtesting Session se ejecutó en el marco de tiempo de un minuto desde el 1 de septiembre de 2020 hasta el 2 de septiembre de 2020.",
                    "updated": 1628732527935
                },
                {
                    "language": "RU",
                    "text": "Бэктестинг сессии Lightning Strike проводился на минутном таймфрейме с 1 сентября 2020 года по 2 сентября 2020 года.",
                    "updated": 1639084540044
                },
                {
                    "language": "DE",
                    "text": "Die Lightning Strike Backtesting Session wurde im einminütigen Zeitrahmen vom 1. September 2020 bis zum 2. September 2020 durchgeführt.",
                    "updated": 1639500311080
                },
                {
                    "language": "TR",
                    "text": "İpucu: Lightning Strike Geri Test Oturumu ( Backtesting Session ), 1 Eylül 2020 ile 2 Eylül 2020 arasındaki bir dakikalık zaman diliminde gerçekleştirildi.",
                    "updated": 1642881941654
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}