{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 31,
    "type": "Tutorial Step - It’s Alive!",
    "definition": {
        "text": "Let's take a look at your new working chart.  I hope you are as excited as I am!",
        "updated": 1619024389980,
        "icon": {
            "name": "Trading/trading-system",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Echemos un vistazo a tu nueva tabla de trabajo. ¡Espero que estés tan emocionado como yo!",
                "updated": 1628725847421
            },
            {
                "language": "RU",
                "text": "Давайте посмотрим на ваш новый рабочий график. Надеюсь, вы так же рады, как и я!",
                "updated": 1639079985455
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Important",
            "text": "First make sure to run all Data Tasks and wait for them to reach 100%.",
            "updated": 1617850764129,
            "translations": [
                {
                    "language": "ES",
                    "text": "Primero asegúrate de correr todos los Data Tasks y espera a que alcancen el 100%.",
                    "updated": 1628725915506
                },
                {
                    "language": "RU",
                    "text": "Сначала запустите все Задачи данных (Data Tasks) и подождите, пока они достигнут 100%.",
                    "updated": 1639080026546
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Fire up the Charting Space and take a look at your Chart.  Have some fun and turn a few layers on and off.",
            "updated": 1617850952279,
            "translations": [
                {
                    "language": "ES",
                    "text": "Enciende el Charting Space y echa un vistazo a tu gráfico. Diviértete y activa y desactiva algunas capas.",
                    "updated": 1628725952620
                },
                {
                    "language": "RU",
                    "text": "Запустите программу Charting Space и посмотрите на свой график. Повеселитесь и включите и выключите несколько слоев.",
                    "updated": 1639080153367
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you can see layers showing up when you turn them on, great job! If nothing is showing up, go back over previous steps and make sure you didn't miss anything.",
            "updated": 1619023984488,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si puedes ver que aparecen capas cuando las enciendes, ¡excelente trabajo! Si no aparece nada, vuelv ea los pasos anteriores y asegúrate de que no te haya perdido nada.",
                    "updated": 1628726004784
                },
                {
                    "language": "RU",
                    "text": "Если вы видите, что слои появляются при включении, это отличная работа! Если ничего не отображается, вернитесь к предыдущим шагам и убедитесь, что вы ничего не пропустили.",
                    "updated": 1639080169442
                }
            ]
        }
    ]
}