{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 30,
    "type": "Tutorial Step - Verify the Layers",
    "definition": {
        "text": "As you may have noticed, the layers that were added match the Bot Products under the Candles Data Mine Products node.",
        "updated": 1620048469797,
        "icon": {
            "name": "layer",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Esto agregará automáticamente referencias a todas las capas individuales producidas por el Bot Products bajo el nodo Candles Data Mine Products.",
                "updated": 1628725658313
            },
            {
                "language": "RU",
                "text": "Как вы могли заметить, добавленные слои соответствуют Bot Products в узле Candles Data Mine Products .",
                "updated": 1639079836469
            },
            {
                "language": "DE",
                "text": "Wie Sie vielleicht bemerkt haben, stimmen die hinzugefügten Ebenen mit den Bot Products unter dem Knoten Candles Data Mine Products überein.",
                "updated": 1639276637474
            },
            {
                "language": "TR",
                "text": "Gördüğünüz gibi, eklenen katmanlar Mum Veri Madeni Ürünleri ( Candles Data Mine Products ) düğümünün altındaki Bot Ürünleri'ne ( Bot Products ) karşılık geliyor.",
                "updated": 1642594732219
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Take a few minutes and check between the Bot Products offspring nodes and your new layers. They Match!",
            "updated": 1620559042193,
            "translations": [
                {
                    "language": "ES",
                    "text": "Tómate unos minutos y comprueba entre nodos Bot Products descendientes y sus nuevas capas. ¡Coinciden!",
                    "updated": 1628725744845
                },
                {
                    "language": "RU",
                    "text": "Потратьте несколько минут и проверьте узлы потомства Bot Products  и ваши новые слои. Они совпадают!",
                    "updated": 1639079732143
                },
                {
                    "language": "DE",
                    "text": "Nehmen Sie sich ein paar Minuten Zeit und vergleichen Sie die Bot Products Nachkommenknoten mit Ihren neuen Ebenen. Sie stimmen überein!",
                    "updated": 1639276702434
                },
                {
                    "language": "TR",
                    "text": "Birkaç dakikanızı ayırın ve Bot Ürünleri ( Bot Products ) düğümü ve yeni katmanlarınızı inceleyin. Eşleşiyorlar mı!",
                    "updated": 1642594873527
                }
            ]
        },
        {
            "style": "Note",
            "text": "You can have more fine tuned control over the layers available in your charts by adding or deleting individual layers.  Your charts are truly yours! ",
            "updated": 1621522922044,
            "translations": [
                {
                    "language": "ES",
                    "text": "Puede tener un control más preciso sobre las capas disponibles en sus gráficos agregando o eliminando capas individuales. ¡Tus gráficos son verdaderamente tuyos!",
                    "updated": 1628725765776
                },
                {
                    "language": "RU",
                    "text": "Вы можете более тонко контролировать слои, доступные в ваших диаграммах, добавляя или удаляя отдельные слои. Ваши диаграммы - это действительно ваше!",
                    "updated": 1639079659448
                },
                {
                    "language": "DE",
                    "text": "Sie können die in Ihren Diagrammen verfügbaren Ebenen noch genauer steuern, indem Sie einzelne Ebenen hinzufügen oder löschen. Ihre Diagramme gehören wirklich Ihnen!",
                    "updated": 1639276753042
                },
                {
                    "language": "TR",
                    "text": "Not: Tek tek katmanlar ekleyerek veya silerek, çizelgelerinizde bulunan katmanlar üzerinde daha hassas ayar kontrolüne sahip olabilirsiniz. Grafikleriniz sizin!",
                    "updated": 1642594936719
                }
            ]
        }
    ]
}