{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 7,
    "type": "Tutorial Step - Adjust for Your Exchange",
    "definition": {
        "text": "You may remember this question from the welcome tutorial. Are you trading at binance.com or binance.us?",
        "updated": 1628362159423,
        "icon": {
            "name": "crypto-exchange",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Puedes recordar esta pregunta del tutorial de bienvenida. ¿Estás operando en binance.com o binance.us?",
                "updated": 1628639559252
            },
            {
                "language": "DE",
                "text": "Vielleicht erinnern Sie sich an diese Frage aus dem Willkommenstutorial. Handeln Sie bei binance.com oder binance.us?",
                "updated": 1637613425795
            },
            {
                "language": "RU",
                "text": "Возможно, вы помните этот вопрос из приветственного урока. Вы торгуете на binance.com или binance.us?",
                "updated": 1637915646125
            },
            {
                "language": "TR",
                "text": "Bu soruyu Hoş Geldiniz Eğitimi'nden hatırlayabilirsiniz. Binance.com'da mı yoksa binance.us'ta mı işlem yapıyorsunuz?",
                "updated": 1642518585809
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This workspace was built using binance.com. If that is your exchange, go ahead and skip this step. However, if your data is stored on binance.us you will need to make one quick adjustment.",
            "updated": 1628362179049,
            "translations": [
                {
                    "language": "ES",
                    "text": "Este espacio de trabajo fue construido usando binance.com. Si ese es su intercambio, continúa y omite este paso. Sin embargo, si tus datos están almacenados en binance.us, deberás realizar un ajuste rápido.",
                    "updated": 1682429707520
                },
                {
                    "language": "DE",
                    "text": "Dieser workspace wurde mit binance.com erstellt. Wenn dies Ihr exchange ist, können Sie diesen Schritt überspringen. Wenn Ihre Daten jedoch auf binance.us gespeichert sind, müssen Sie eine kurze Anpassung vornehmen.",
                    "updated": 1637613649493
                },
                {
                    "language": "RU",
                    "text": "Это рабочее пространство было построено с использованием binance.com. Если это ваш обмен, продолжайте и пропустите этот шаг. Однако, если ваши данные хранятся на binance.us вам нужно будет сделать одну быструю настройку.",
                    "updated": 1637915731066
                },
                {
                    "language": "TR",
                    "text": "Bu çalışma alanı binance.com ile oluşturulmuştur. Bu sizin borsanızsa, bu adımı atlayabilirsiniz. Ancak verileriniz binance.us'da saklanıyorsa hızlı bir düzenleme yapmanız gerekir.",
                    "updated": 1642518617071
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Configure the Binance node to your left.",
            "updated": 1628362210759,
            "translations": [
                {
                    "language": "ES",
                    "text": "Configura el nodo Binance a tu izquierda.",
                    "updated": 1682429714571
                },
                {
                    "language": "DE",
                    "text": "Konfigurieren Sie die Binance Node zu Ihrer Linken.",
                    "updated": 1637613673124
                },
                {
                    "language": "RU",
                    "text": "Настройте узел Binance слева от вас.",
                    "updated": 1637915753924
                },
                {
                    "language": "TR",
                    "text": "Binance düğümünü solunuzda yapılandırın.",
                    "updated": 1642518632696
                }
            ]
        },
        {
            "style": "List",
            "text": "Open the configuration and change the codeName to binanceus. Move the mouse pointer out of the configuration bubble and it will close and save automatically.",
            "updated": 1637613950322,
            "translations": [
                {
                    "language": "ES",
                    "text": "Open la configuración y cambia la codeName a binanceus. Mueve el puntero del mouse fuera de la burbuja de configuración y se cerrará y guardará automáticamente.",
                    "updated": 1682429776307
                },
                {
                    "language": "DE",
                    "text": "Öffnen Sie die configuration und ändern Sie den CodeName in binance.us. Bewegen Sie den Mauszeiger aus der Konfigurationsblase und sie wird automatisch geschlossen und gespeichert",
                    "updated": 1637614015199
                },
                {
                    "language": "RU",
                    "text": "Откройте конфигурацию и измените CodeName на binanceus. Выведите указатель мыши из пузырька конфигурации, и он автоматически закроется и сохранится.",
                    "updated": 1637915859838
                },
                {
                    "language": "TR",
                    "text": "Yapılandırmayı açın ve Kod Adını ( codeName ) binance.us olarak değiştirin. Fare imlecinizi yapılandırma balonunun dışına getirin, otomatik olarak kapanacak ve kaydedilecektir.",
                    "updated": 1642518644650
                }
            ]
        },
        {
            "style": "List",
            "text": "Edit the label of the node to read Binanceus.",
            "updated": 1628362267536,
            "translations": [
                {
                    "language": "ES",
                    "text": "Edita la etiqueta del nodo para que diga Binanceus.",
                    "updated": 1682429905059
                },
                {
                    "language": "DE",
                    "text": "Ändern Sie die Bezeichnung der Node so, dass sie Binanceus lautet.",
                    "updated": 1637614035479
                },
                {
                    "language": "RU",
                    "text": "Отредактируйте метку узла так, чтобы она читалась как Binanceus.",
                    "updated": 1637915855217
                },
                {
                    "language": "TR",
                    "text": "Düğüm etiketini Binanceus'u okuyacak şekilde değiştirin.",
                    "updated": 1642518659762
                }
            ]
        }
    ]
}