{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 11,
    "type": "Tutorial Step - Dashboards in the Future",
    "definition": {
        "text": "The future holds more in store. But it is still a work in progress!",
        "updated": 1628360382244,
        "icon": {
            "name": "under-construction",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "El futuro nos depara más. ¡Pero todavía es un trabajo en progreso!",
                "updated": 1628642151827
            },
            {
                "language": "RU",
                "text": "В будущем нас ждет еще больше. Но это все еще в процессе работы!",
                "updated": 1637937598065
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Eventually Dashboards will be used to bring multiple Time Machines together in useful configurations within the Charting Space. Think of multiple charts configured in intricate side by side displays! But for right now, they help us stay organized.",
            "updated": 1628360410405,
            "translations": [
                {
                    "language": "ES",
                    "text": "Finalmente Dashboards se utilizará para traer múltiples Time Machines juntos en configuraciones útiles dentro del Charting Space. ¡Piensa en múltiples gráficos configurados en intrincadas pantallas una al lado de la otra! Pero por ahora, nos ayudan a mantenernos organizados.",
                    "updated": 1628644087316
                },
                {
                    "language": "RU",
                    "text": "В конечном счете, приборные панели будут использоваться для объединения нескольких машин времени в полезные конфигурации в пространстве диаграмм (Charting Space). Подумайте о нескольких графиках, сконфигурированных в замысловатые дисплеи бок о бок! Но на данный момент они помогают нам оставаться организованными.",
                    "updated": 1637937667673
                }
            ]
        },
        {
            "style": "Important",
            "text": "Superalgos is a community project. If you are a developer that would like to see this feature come to life, you can help make it happen!",
            "updated": 1628360435813,
            "translations": [
                {
                    "language": "ES",
                    "text": "Superalgos es un proyecto comunitario. Si eres un desarrollador al que le gustaría que esta función cobre vida, ¡puedes ayudar a que esto suceda!",
                    "updated": 1628644124615
                },
                {
                    "language": "RU",
                    "text": "Superalgos - это проект сообщества. Если вы являетесь разработчиком, который хотел бы увидеть эту функцию в реальности, вы можете помочь сделать это!",
                    "updated": 1637937717128
                }
            ]
        }
    ]
}