{
    "tutorial": "Setting Up a New Chart",
    "pageNumber": 24,
    "type": "Tutorial Step - Your Data Treasure Trove",
    "definition": {
        "text": "The Data Storage node holds all the important data your bots work so hard to produce. Think of it like your own personal tresure chest full of data.",
        "icon": {
            "name": "Data/data-storage",
            "project": "Foundations"
        },
        "updated": 1617373173279,
        "translations": [
            {
                "language": "ES",
                "text": "El nodo Data Storage contiene  los datos importantes que sus bots trabajan duro para producir. Piensa en ello como tu propio cofre de tesoros lleno de datos.",
                "updated": 1628722704852
            },
            {
                "language": "RU",
                "text": "На узле Data Storage хранятся все важные данные, над созданием которых так усердно работают ваши боты. Считайте, что это ваш личный сундук с сокровищами, полный данных.",
                "updated": 1639074450030
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "All of the Data Products you will want to visualize in your charts are kept in the Data Storage node. Let’s start by getting some practice finding where the data we want is stored. Remember, we want to connect our chart to the Candles Data Mine. Accessing these products will let us visualize Indicators and other Market Data.",
            "updated": 1619023429735,
            "translations": [
                {
                    "language": "ES",
                    "text": "Toda los Data Products que quieras visualizar en tus gráficos se mantienen en el nodo Data Storage. Comencemos practicando un poco para encontrar dónde se almacenan los datos que queremos. Recuerda, queremos conectar nuestro gráfico al Candles Data Mine. Acceder a estos productos nos permitirá visualizar Indicadores y otros Market Data.",
                    "updated": 1628722429136
                },
                {
                    "language": "RU",
                    "text": "Все продукты данных, которые вы захотите визуализировать в своих диаграммах, хранятся в узле Хранилище данных. Для начала давайте потренируемся находить, где хранятся нужные нам данные.. Помните, что мы хотим подключить наш график к шахте данных (Candles Data Mine). Доступ к этим продуктам позволит нам визуализировать индикаторы и другие рыночные данные (Market Data).",
                    "updated": 1639074600572
                }
            ]
        },
        {
            "style": "Note",
            "text": "One great thing about Superalgos is that it uses consistent logic across the system. What that means for us now is that once you learn to hook a chart to one type of data you will know the basic steps to hook your charts to anything you want!",
            "updated": 1617645915009,
            "translations": [
                {
                    "language": "ES",
                    "text": "Superalgos utiliza una lógica coherente en todo el sistema. Lo que eso significa para nosotros ahora es que una vez que aprenda a conectar un gráfico a un tipo de datos, sabrá los pasos básicos para conectar sus gráficos a lo que desee.",
                    "updated": 1628722599505
                },
                {
                    "language": "RU",
                    "text": "Одна из замечательных особенностей Superalgos заключается в том, что он использует последовательную логику во всей системе. Для нас это означает, что как только вы научитесь привязывать график к одному типу данных, вы будете знать основные шаги для привязки графиков к чему угодно!",
                    "updated": 1639074625764
                }
            ]
        }
    ]
}