{
    "topic": "Trading Farms",
    "pageNumber": "1",
    "type": "Trading Farms - Fundamental Concepts",
    "definition": {
        "text": "How to set up a flexible and scalable crypto-trading farm running Superalgos distributed on multiple machines. ",
        "updated": 1614352880564,
        "translations": [
            {
                "language": "RU",
                "text": "Как создать гибкую и масштабируемую ферму криптотрейдинга под управлением Superalgos, распределенную на нескольких машинах.",
                "updated": 1640351665465
            },
            {
                "language": "DE",
                "text": "Wie man eine flexible und skalierbare Krypto-Handelsfarm einrichtet, auf der Superalgos verteilt auf mehreren Rechnern läuft.",
                "updated": 1678054485679
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Introduction",
            "updated": 1614353180566,
            "translations": [
                {
                    "language": "RU",
                    "text": "Введение",
                    "updated": 1640351675777
                },
                {
                    "language": "DE",
                    "text": "Einführung",
                    "updated": 1678054500305
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos is designed for coordinated, flexible, and scalable trading operations.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Superalgos предназначен для скоординированных, гибких и масштабируемых торговых операций.",
                    "updated": 1640351691594
                },
                {
                    "language": "DE",
                    "text": "Superalgos ist für koordinierte, flexible und skalierbare Handelsoperationen konzipiert.",
                    "updated": 1678054509513
                }
            ]
        },
        {
            "style": "Title",
            "text": "LAN Network",
            "updated": 1614353250354,
            "translations": [
                {
                    "language": "DE",
                    "text": "LAN-Netzwerk",
                    "updated": 1678054518789
                }
            ]
        },
        {
            "style": "Text",
            "text": "A Network, represented by the LAN Network Hierarchy, is just a definition that allows the system to know where Tasks need to be run, and where data is hosted. At any workspace you might define one, or even more than one, LAN Network Hierarchy. For simplicity, we will continue the explanation assuming only one Network is defined.",
            "updated": 1617263502648,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сеть Network, представленная иерархией LAN Network Hierarchy, - это просто определение, которое позволяет системе знать, где должны выполняться задачи и где размещаются данные. На любом рабочем пространстве вы можете определить одну или даже несколько иерархий LAN Network Hierarchy. Для простоты мы продолжим объяснение, предполагая, что определена только одна сеть.",
                    "updated": 1640351833339
                },
                {
                    "language": "DE",
                    "text": "Ein Netzwerk, welches durch die LAN-Netzwerkhierarchie (LAN Network Hierarchy) dargestellt wird, ist lediglich eine Definition, die es dem System ermöglicht, zu wissen, wo Aufgaben ausgeführt werden müssen und wo Daten gehostet werden. In jedem Arbeitsbereich können Sie eine oder sogar mehrere LAN-Netzwerkhierarchien (LAN Network Hierarchy) definieren. Der Einfachheit halber gehen wir bei der weiteren Erläuterung davon aus, dass nur ein Netzwerk definiert ist.",
                    "updated": 1678054922092
                }
            ]
        },
        {
            "style": "Text",
            "text": "In its current version, the system may be deployed in multiple machines—as many as desired—and each machine may constitute a node in a network of nodes. In fact, different networks of nodes may live within the same computer network, because they are just an abstractions, not something physical.",
            "updated": 1614353448225,
            "translations": [
                {
                    "language": "RU",
                    "text": "В своей нынешней версии система может быть развернута на нескольких машинах - сколько угодно - и каждая машина может представлять собой узел в сети узлов. На самом деле, в одной компьютерной сети могут существовать различные сети узлов, поскольку они являются лишь абстракцией, а не чем-то физическим.",
                    "updated": 1640351862940
                },
                {
                    "language": "DE",
                    "text": "In seiner aktuellen Version kann das System auf mehreren Rechnern - beliebig vielen - eingesetzt werden, und jeder Rechner kann einen Knoten in einem Netz von Knoten darstellen. Tatsächlich können verschiedene Netze von Knoten innerhalb desselben Computernetzes existieren, da sie nur eine Abstraktion und nicht etwas Physisches sind.",
                    "updated": 1678054994230
                }
            ]
        },
        {
            "style": "Title",
            "text": "Purpose",
            "translations": [
                {
                    "language": "RU",
                    "text": "Назначение",
                    "updated": 1640351877820
                },
                {
                    "language": "DE",
                    "text": "Zweck",
                    "updated": 1678054609027
                }
            ]
        },
        {
            "style": "Text",
            "text": "The whole purpose of the Network definition is to let the system know where each task must run and where the data is located. ",
            "updated": 1614353600414,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вся цель определения сети заключается в том, чтобы система знала, где должна выполняться каждая задача и где находятся данные.",
                    "updated": 1640363459771
                },
                {
                    "language": "DE",
                    "text": "Der Zweck der Netzdefinition besteht darin, dem System mitzuteilen, wo jede Aufgabe ausgeführt werden muss und wo sich die Daten befinden.",
                    "updated": 1678054617711
                }
            ]
        },
        {
            "style": "Success",
            "text": "A Superalgos Client can become a node in a Network definition if you configure a Network Node with the IP and ports of a certain Superalgos Client.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Клиент Superalgos может стать узлом в определении сети, если вы настроите узел сети с IP и портами определенного клиента Superalgos.",
                    "updated": 1640363480436
                },
                {
                    "language": "DE",
                    "text": "Ein Superalgos- Client kann ein Knoten in einer Netzwerkdefinition werden, wenn Sie einen Netzwerkknoten (Network Node) mit der IP und den Ports eines bestimmten Superalgos- Client´s konfigurieren.",
                    "updated": 1678054629847
                }
            ]
        },
        {
            "style": "Title",
            "text": "Organization",
            "updated": 1614353624048,
            "translations": [
                {
                    "language": "RU",
                    "text": "Организация",
                    "updated": 1640363495830
                },
                {
                    "language": "DE",
                    "text": "Organisation",
                    "updated": 1678054646345
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are many different way you might want to organize the Tasks across several Clients. It is really up to you. The system doesn't care or have any preferred way for you to do so. It just need to know where each Task runs, and where the Data is located. That's it.",
            "updated": 1617263562866,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете по-разному организовать задачи для нескольких клиентов. Это действительно зависит от вас. Систему это не волнует, и у нее нет предпочтительного для вас способа сделать это. Ей просто нужно знать, где выполняется каждая задача и где находятся данные. Вот и все.",
                    "updated": 1640363523276
                },
                {
                    "language": "DE",
                    "text": "Es gibt viele verschiedene Möglichkeiten, wie Sie die Aufgaben über mehrere Clients hinweg organisieren können. Das bleibt wirklich Ihnen überlassen. Das System kümmert sich nicht darum und hat auch keine bevorzugte Methode dafür. Es muss nur wissen, wo jede Aufgabe (Task) ausgeführt wird und wo sich die Daten befinden. Das war's.",
                    "updated": 1678054652434
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Each node on a Network may specialize in a single type of process or handle multiple processes of different types.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Каждый узел в сети может специализироваться на одном типе процессов или обрабатывать несколько процессов разных типов.",
                    "updated": 1640363541202
                },
                {
                    "language": "DE",
                    "text": "Jeder Knoten in einem Netz kann sich auf einen einzigen Prozesstyp spezialisieren oder mehrere Prozesse unterschiedlichen Typs bearbeiten.",
                    "updated": 1678054663111
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example, you may have a set of nodes running data mining operations extracting data from multiple markets and multiple exchanges. You may have a set of nodes specializing in processing indicators and technical studies. And you may have a set of nodes specializing in running trading sessions.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Например, у вас может быть набор узлов, выполняющих операции по поиску данных, извлекающих данные с нескольких рынков и нескольких бирж. У вас может быть набор узлов, специализирующихся на обработке индикаторов и технических исследований. И у вас может быть набор узлов, специализирующихся на проведении торговых сессий.",
                    "updated": 1640363564886
                },
                {
                    "language": "DE",
                    "text": "Sie können beispielsweise eine Reihe von Knoten haben, die Data-Mining-Operationen durchführen und Daten von mehreren Märkten und mehreren Börsen extrahieren. Sie können über eine Reihe von Knoten verfügen, die auf die Verarbeitung von Indikatoren und technischen Studien spezialisiert sind. Und Sie können über eine Reihe von Knoten verfügen, die auf die Durchführung von Handelssitzungen spezialisiert sind.",
                    "updated": 1678054708904
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may also use different criteria to arrange the network. For example, you may have a node running combined data mining, data processing, and trading operations on a single exchange or market, and other nodes running similar combined operations on other exchanges or markets.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы также можете использовать различные критерии для организации сети. Например, у вас может быть узел, выполняющий комбинированные операции по поиску данных, обработке данных и торговле на одной бирже или рынке, и другие узлы, выполняющие аналогичные комбинированные операции на других биржах или рынках.",
                    "updated": 1640363590580
                },
                {
                    "language": "DE",
                    "text": "Sie können auch verschiedene Kriterien für die Anordnung des Netzes verwenden. Sie können beispielsweise einen Knoten haben, der kombinierte Data-Mining-, Datenverarbeitungs- und Handelsoperationen an einer einzigen Börse oder einem einzigen Markt durchführt, und andere Knoten, die ähnliche kombinierte Operationen an anderen Börsen oder Märkten durchführen.",
                    "updated": 1678054720627
                }
            ]
        },
        {
            "style": "Text",
            "text": "Or you may have a network of nodes for your testing environment and another network of nodes for your production environment.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Или у вас может быть сеть узлов для тестовой среды и другая сеть узлов для производственной среды.",
                    "updated": 1640363607362
                },
                {
                    "language": "DE",
                    "text": "Oder Sie haben ein Netzwerk von Knoten für Ihre Testumgebung und ein anderes Netzwerk von Knoten für Ihre Produktionsumgebung.",
                    "updated": 1678054729415
                }
            ]
        },
        {
            "style": "Callout",
            "text": "In other words, the system allows building any arrangement of networks of nodes corresponding to the organizational logic of your preference.",
            "updated": 1617263606632,
            "translations": [
                {
                    "language": "RU",
                    "text": "Другими словами, система позволяет построить любое расположение сетей узлов, соответствующее организационной логике вашего предпочтения.",
                    "updated": 1640363628972
                },
                {
                    "language": "DE",
                    "text": "Mit anderen Worten: Das System ermöglicht den Aufbau beliebiger Knotennetzwerke, die der von Ihnen bevorzugten Organisationslogik entsprechen.",
                    "updated": 1678054742307
                }
            ]
        },
        {
            "style": "Title",
            "text": "Auto Tracking of Dependencies",
            "updated": 1614353913256,
            "translations": [
                {
                    "language": "RU",
                    "text": "Автоматическое отслеживание зависимостей",
                    "updated": 1640363641892
                },
                {
                    "language": "DE",
                    "text": "Automatische Verfolgung von Abhängigkeiten",
                    "updated": 1678054753342
                }
            ]
        },
        {
            "style": "Text",
            "text": "When you define a Task, inside of it you are referencing a Process Definition, which has in turn a definition specifying which other processes it depends on (for example to start after some other process finished) and it also has Data Dependencies, which means that in order to run, it needs to read the data output from other processes.",
            "updated": 1617263665349,
            "translations": [
                {
                    "language": "RU",
                    "text": "Когда вы определяете задачу, внутри нее вы ссылаетесь на определение процесса Process Definition, которое в свою очередь содержит определение, указывающее, от каких других процессов она зависит (например, запуск после завершения какого-либо другого процесса), а также имеет зависимости от данных, что означает, что для запуска ей необходимо считывать данные, выводимые другими процессами.",
                    "updated": 1640363717260
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie eine Aufgabe (Task) definieren, verweisen Sie darin auf eine Prozessdefinition (Process Definition), die wiederum eine Definition hat, die angibt, von welchen anderen Prozessen sie abhängt (z. B. um nach Beendigung eines anderen Prozesses zu starten), und sie hat auch Datenabhängigkeiten, was bedeutet, dass sie, um zu funktionieren, die von anderen Prozessen ausgegebenen Daten lesen muss.",
                    "updated": 1678054764918
                }
            ]
        },
        {
            "style": "Note",
            "text": "All these definitions are built-in inside Data Mines, Trading Mines and Learning mines at a conceptual level. This means that a Data Mine does not really know where the data a process depends on actually is, or where a process that it depends on, is actually running. That problem is solved at runtime once a Task is executed.",
            "updated": 1617263712801,
            "translations": [
                {
                    "language": "RU",
                    "text": "Все эти определения встроены в Data Mine, Trading Mine и Learning Mine на концептуальном уровне. Это означает, что Data Mine не знает, где на самом деле находятся данные, от которых зависит процесс, или где на самом деле запущен процесс, от которого он зависит. Эта проблема решается во время выполнения задачи.",
                    "updated": 1640363848836
                },
                {
                    "language": "DE",
                    "text": "Alle diese Definitionen sind in Data Mines, Trading Mines und Learning Mines auf einer konzeptionellen Ebene eingebaut. Das bedeutet, dass eine Data Mine nicht wirklich weiß, wo sich die Daten befinden, von denen ein Prozess abhängt, oder wo ein Prozess, von dem sie abhängt, tatsächlich läuft. Dieses Problem wird in dem Moment gelöst, sobald eine Aufgabe (Task) ausgeführt wird.",
                    "updated": 1678054777252
                }
            ]
        },
        {
            "style": "Text",
            "text": "What is unique about Superalgos is that the system keeps track of the network arrangements you create and makes sure that all processes in the system can seamlessly track dependencies across the network. This means, for example, that trading sessions running on Node X may access data in Node Y and Node Z without requiring any sort of configuration.",
            "updated": 1614354242360,
            "translations": [
                {
                    "language": "RU",
                    "text": "Уникальность Superalgos заключается в том, что система отслеживает созданные вами сетевые схемы и гарантирует, что все процессы в системе могут легко отслеживать зависимости в сети. Это означает, например, что торговые сессии, запущенные на узле X, могут получить доступ к данным на узлах Y и Z без необходимости какой-либо настройки.",
                    "updated": 1640363879025
                },
                {
                    "language": "DE",
                    "text": "Das Besondere an Superalgos ist, dass das System die von Ihnen erstellten Netzwerkarrangements verfolgt und dafür sorgt, dass alle Prozesse im System nahtlos Abhängigkeiten über das Netzwerk hinweg verfolgen können. Das bedeutet zum Beispiel, dass Handelssitzungen, die auf Knoten X laufen, auf Daten in Knoten Y und Knoten Z zugreifen können, ohne dass irgendeine Art von Konfiguration erforderlich ist.",
                    "updated": 1678054795372
                }
            ]
        },
        {
            "style": "Text",
            "text": "This is achieved by sending to a newly executed Task a snapshot of the Network Map at the instant when the Task is being run. From the Mine definition the Task can know which processes and data it depends on, and by looking into the snapshot of the Network, it can guess which Client is hosting the Data or the Tasks that the process depends on, allowing it to communicate with those Clients, and fetch the data from them, or wait for the right events signaling that the dependent process has finished.",
            "updated": 1617263799269,
            "translations": [
                {
                    "language": "RU",
                    "text": "Это достигается путем отправки только что выполненной Задаче (Task) снимка карты Сети в тот момент, когда Задача выполняется. Из определения Mine задача может знать, от каких процессов и данных она зависит, и, глядя на снимок сети, она может предположить, какой клиент размещает данные или задачи, от которых зависит процесс, что позволяет ей общаться с этими клиентами и получать от них данные или ждать нужных событий, сигнализирующих о завершении зависимого процесса.",
                    "updated": 1640364378870
                },
                {
                    "language": "DE",
                    "text": "Dies wird dadurch erreicht, indem einem neu ausgeführten Task ein Schnappschuss der Netzwerkkarte zum Zeitpunkt der Ausführung der Task gesendet wird. Anhand dieser Daten, kann die Task erkennen, von welchen Prozessen und Daten er abhängt, und durch einen Blick in den Schnappschuss des Netzwerks kann er erraten, welcher Client die Daten oder die Tasks hostet, von denen der Prozess abhängt, so dass er mit diesen Client ´s kommunizieren und die Daten von ihnen abrufen oder auf die richtigen Ereignisse warten kann, die signalisieren, dass der betreffende Prozess beendet ist.",
                    "updated": 1678054811485
                }
            ]
        },
        {
            "style": "Title",
            "text": "Peer to Peer",
            "updated": 1614354292649,
            "translations": [
                {
                    "language": "DE",
                    "text": "Gleichrangigkeit",
                    "updated": 1678054818533
                }
            ]
        },
        {
            "style": "Text",
            "text": "There is no preferred node where to manage the rest of the Client s.",
            "updated": 1614354328656,
            "translations": [
                {
                    "language": "RU",
                    "text": "Нет предпочтительного узла, где можно управлять остальными клиентами.",
                    "updated": 1640364402758
                },
                {
                    "language": "DE",
                    "text": "Es gibt keinen bevorzugten Knotenpunkt, an dem der Rest der Client ´s verwaltet werden kann.",
                    "updated": 1678054829593
                }
            ]
        },
        {
            "style": "Callout",
            "text": "The operation may be managed entirely from any node on the network. In fact, it may be managed from a computer in the network not running Superalgos, by pointing the browser to any of the nodes in the network to run the UI.",
            "updated": 1614354336816,
            "translations": [
                {
                    "language": "RU",
                    "text": "Управление операцией может осуществляться полностью с любого узла сети. Фактически, управление может осуществляться с компьютера в сети, на котором не запущен Superalgos, путем указания браузера на любой из узлов в сети для запуска пользовательского интерфейса UI.",
                    "updated": 1640364540658
                },
                {
                    "language": "DE",
                    "text": "Der Vorgang kann vollständig von einem beliebigen Knoten im Netz verwaltet werden. Er kann sogar von einem Computer im Netz verwaltet werden, auf dem Superalgos nicht läuft, indem der Browser auf einen der Knoten im Netz gerichtet wird, um die Benutzeroberfläche (UI) auszuführen.",
                    "updated": 1678054840041
                }
            ]
        },
        {
            "style": "Text",
            "text": "The following explanations assume that you are familiar with the basic workings of Superalgos, and in particular, of the Network hierarchy. If that is not the case, then please read the Network pages before diving into building a trading farm.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Следующие объяснения предполагают, что вы знакомы с основными принципами работы Superalgos, и в частности с иерархией Network. Если это не так, то, пожалуйста, прочитайте страницы, посвященные Network, прежде чем приступать к созданию торговой фермы.",
                    "updated": 1640364591170
                },
                {
                    "language": "DE",
                    "text": "Die folgenden Erläuterungen setzen voraus, dass Sie mit der grundlegenden Funktionsweise von Superalgos und insbesondere der Netzwerkhierarchie vertraut sind. Sollte dies nicht der Fall sein, lesen Sie bitte die Netzwerkseiten, bevor Sie sich am Aufbau einer Handelsfarm versuchen.",
                    "updated": 1678054852931
                }
            ]
        },
        {
            "style": "Title",
            "text": "Security",
            "translations": [
                {
                    "language": "RU",
                    "text": "Безопасность",
                    "updated": 1640364607061
                },
                {
                    "language": "DE",
                    "text": "Sicherheit",
                    "updated": 1678054859737
                }
            ]
        },
        {
            "style": "Warning",
            "text": "At this stage, Superalgos does not implement any form of security measures, therefore, the system is to be used in the context of a restricted Local Area Network only.",
            "updated": 1611343257268,
            "translations": [
                {
                    "language": "RU",
                    "text": "На данном этапе Superalgos не реализует никаких мер безопасности, поэтому система должна использоваться только в условиях ограниченной локальной сети.",
                    "updated": 1640364622974
                },
                {
                    "language": "DE",
                    "text": "Da Superalgos in diesem Stadium keinerlei Sicherheitsmaßnahmen vorsieht, darf das System nur im Rahmen eines begrenzten lokalen Netzwerks verwendet werden.",
                    "updated": 1678054870286
                }
            ]
        }
    ]
}