{
    "topic": "Trading Farms",
    "pageNumber": "3",
    "type": "Trading Farms - Operating a Trading Farm",
    "definition": {
        "text": "Operate tasks in remote nodes pretty much as if they were running on the home node. ",
        "updated": 1614352903667,
        "translations": [
            {
                "language": "RU",
                "text": "Выполняйте задачи на удаленных узлах точно так же, как если бы они выполнялись на домашнем узле.",
                "updated": 1640368502266
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The operation of a trading farm is done from within the home node. There is no need to use the UI application with any other node in the network, although you may if you wish.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Управление торговой фермой осуществляется изнутри домашнего узла. Нет необходимости использовать приложение с пользовательским интерфейсом с любым другим узлом в сети, хотя при желании вы можете это сделать.",
                    "updated": 1640368564096
                }
            ]
        },
        {
            "style": "Text",
            "text": "Running or stopping tasks residing in any of the network nodes is a transparent operation, and works in the same way as if the tasks were in the home node. When a task is started, the process takes a snapshot of the state of the network at that point and traces all dependencies before starting the job at hand.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Запуск или остановка заданий, расположенных в любом из узлов сети, является прозрачной операцией и работает так же, как если бы задания находились в домашнем узле. При запуске задания процесс делает снимок состояния сети на данный момент и отслеживает все зависимости, прежде чем приступить к выполнению задания.",
                    "updated": 1640368599846
                }
            ]
        },
        {
            "style": "Callout",
            "text": "This means that changes made in the distribution of tasks in the network at any point are recognized by each task upon starting.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Это означает, что изменения, внесенные в распределение задач в сети в любой точке, распознаются каждой задачей при запуске.",
                    "updated": 1640368683225
                }
            ]
        },
        {
            "style": "Text",
            "text": "However, entities that don’t run in tasks—such as time machines and timeline charts in the charting space—function with the state of the network upon starting the UI app. This means that, for example, if you move a data mining task to a different node, the associated chart will show the data in the former node until you refresh the browser.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Однако объекты, которые не выполняются в задачах, такие как машины времени и временные диаграммы в пространстве диаграмм, функционируют в соответствии с состоянием сети при запуске приложения с пользовательским интерфейсом. Это означает, что, например, если вы переместите задачу добычи данных на другой узел, связанная с ней диаграмма будет отображать данные на прежнем узле до тех пор, пока вы не обновите браузер.",
                    "updated": 1640368735453
                }
            ]
        },
        {
            "style": "Text",
            "text": "Finally, when uninstalling a market, the system will attempt to uninstall the corresponding tasks on all network nodes. If you wish to uninstall markets on specific nodes only, you may delete data structures individually instead.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Наконец, при удалении рынка система попытается удалить соответствующие задачи на всех узлах сети. Если вы хотите удалить рынки только на определенных узлах, вы можете удалить структуры данных по отдельности.",
                    "updated": 1640368755136
                }
            ]
        }
    ]
}