{
    "type": "Self Learning",
    "definition": {
        "text": "Self-learning as a machine learning paradigm was introduced in 1982 along with a neural network capable of self-learning named crossbar adaptive array (CAA). It is a learning with no external rewards and no external teacher advice. The CAA self-learning algorithm computes, in a crossbar fashion, both decisions about actions and emotions (feelings) about consequence situations. The system is driven by the interaction between cognition and emotion.",
        "updated": 1613199403151,
        "translations": [
            {
                "language": "RU",
                "text": "Самообучение как парадигма машинного обучения было представлено в 1982 году вместе с нейронной сетью, способной к самообучению, названной Crossbar adaptive array (CAA). Это обучение без внешних вознаграждений и советов со стороны учителя. Алгоритм самообучения CAA вычисляет, в перекрестном порядке, как решения о действиях, так и эмоции (чувства) по поводу последствий ситуаций. Система управляется взаимодействием между познанием и эмоциями.",
                "updated": 1645249793354
            },
            {
                "language": "TR",
                "text": "Bir makine öğrenme paradigması olarak kendi kendine öğrenme, 1982 yılında çapraz çubuk uyarlamalı dizi (CAA) adı verilen kendi kendine öğrenme yeteneğine sahip bir sinir ağı ile birlikte tanıtılmıştır. Bu, harici ödüllerin ve harici öğretmen tavsiyesinin olmadığı bir öğrenmedir. CAA kendi kendine öğrenme algoritması, çapraz çubuk tarzında, hem eylemlerle ilgili kararları hem de sonuç durumlarıyla ilgili duyguları (hisleri) hesaplar. Sistem, biliş ve duygu arasındaki etkileşim tarafından yönlendirilir.",
                "updated": 1654397537431
            },
            {
                "language": "DE",
                "text": "Selbstlernen als Paradigma des maschinellen Lernens wurde 1982 zusammen mit einem selbstlernenden neuronalen Netz namens Crossbar Adaptive Array (CAA) eingeführt. Es handelt sich um ein Lernen ohne externe Belohnungen und ohne Ratschläge eines externen Lehrers. Der selbstlernende CAA-Algorithmus berechnet in einer Art Kreuzschiene sowohl Entscheidungen über Handlungen als auch Emotionen (Gefühle) über Folgesituationen. Das System wird durch die Interaktion zwischen Kognition und Emotion gesteuert. ",
                "updated": 1705011585112
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645249798620
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397543780,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1705008081192
                }
            ]
        }
    ]
}