{
    "type": "Trading Episode",
    "definition": {
        "text": "Episode is the object that handles the information corresponding to the whole run of the trading bot&mdash;beginning to end&mdash;between the specified initial datetime and final datetime, in the time range parameter of the trading session.",
        "translations": [
            {
                "language": "RU",
                "text": "Episode - это объект, который обрабатывает информацию, соответствующую всему запуску торгового бота - от начала до конца - между указанным начальным временем и конечным временем, в параметре временного диапазона (Time Range) торговой сессии.",
                "updated": 1640342495399
            },
            {
                "language": "TR",
                "text": "Episode, işlem oturumunun (Trading Session) zaman aralığı  (Time Range) parametresinde belirtilen başlangıç ve bitiş tarihleri arasındaki -baştan sona kadar - tüm bilgileri işleyen nesnedir.",
                "updated": 1641994321755
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "In other words, episode is the context framed between the datetimes that make up the whole trading session, as per the session's configuration. As such, an episode keeps track of&mdash;and accumulates&mdash;the results of all positions entered throughout a complete run of a trading session.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Другими словами, эпизод - это контекст между датами, составляющими всю торговую сессию, в соответствии с конфигурацией сессии. Таким образом, эпизод отслеживает и накапливает результаты всех позиций, введенных на протяжении всей торговой сессии.",
                    "updated": 1640342547504
                },
                {
                    "language": "TR",
                    "text": "Başka bir deyişle, Episode, oturumun yapılandırmasına göre tüm işlem seansını oluşturan tarihler arasında belirlenen durumdur. Bu nedenle, Episode, bir ticaret seansının tamamı boyunca girilen tüm pozisyonların sonuçlarını takip eder ve biriktirir.",
                    "updated": 1641994457823
                }
            ]
        },
        {
            "style": "Text",
            "text": "In this section of the hierarchy, you have access to:",
            "translations": [
                {
                    "language": "RU",
                    "text": "В этом разделе иерархии у вас есть доступ к:",
                    "updated": 1640342566394
                },
                {
                    "language": "TR",
                    "text": "Hiyerarşinin bu bölümünde şunlara erişebilirsiniz:",
                    "updated": 1641994469836
                }
            ]
        },
        {
            "style": "List",
            "text": " running balances and overall performance metrics denominated in both the base and quoted assets;",
            "translations": [
                {
                    "language": "RU",
                    "text": "текущим балансам и общим показателям эффективности, выраженных как в базовых, так и в котируемых активах;",
                    "updated": 1640342722780
                },
                {
                    "language": "TR",
                    "text": "hem temel hem de kote varlıklarda belirtilen cari bakiyeler ve genel performans metrikleri;",
                    "updated": 1641994485902
                }
            ]
        },
        {
            "style": "List",
            "text": "counters, such as the number of positions taken, orders placed, hits, fails, and so on;",
            "translations": [
                {
                    "language": "RU",
                    "text": "счетчикам, таких как количество занятых позиций, размещенных ордеров, попаданий, неудач и так далее;",
                    "updated": 1640342740815
                },
                {
                    "language": "TR",
                    "text": "alınan pozisyon sayısı, verilen emirler, isabetler, başarısızlıklar vb. gibi sayaçlar;",
                    "updated": 1641994502826
                }
            ]
        },
        {
            "style": "List",
            "text": "statistics, such as performance metrics consolidating both assets, number of days in the episode, or user-defined statistics;",
            "translations": [
                {
                    "language": "RU",
                    "text": "статистике, такой как показатели производительности, объединяющие оба актива, количество дней в эпизоде или статистика, задаваемая пользователем;",
                    "updated": 1640342674348
                },
                {
                    "language": "TR",
                    "text": "her iki varlığı da birleştiren performans metrikleri, bölümdeki gün sayısı veya kullanıcı tanımlı istatistikler gibi istatistikler;",
                    "updated": 1641994518325
                }
            ]
        },
        {
            "style": "List",
            "text": "the distance to certain events, such as the number of candles to the last  take position event, or the last create order event;",
            "translations": [
                {
                    "language": "RU",
                    "text": "расстоянии до определенных событий, например, количество свечей до последнего события взятия позиции или последнего события создания ордера;",
                    "updated": 1640342792439
                },
                {
                    "language": "TR",
                    "text": "belirlenen olaylarda, son pozisyon alma olayına veya son emir oluşturma olayına kadar olan mesafe (mum sayısı);",
                    "updated": 1641994684116
                }
            ]
        },
        {
            "style": "List",
            "text": "rates describing each candle in the episode, such as the open, close, min and max rates;",
            "translations": [
                {
                    "language": "RU",
                    "text": "ставкам, описывающим каждую свечу в эпизоде, таким как ставки открытия, закрытия, min и max;",
                    "updated": 1640342822991
                },
                {
                    "language": "TR",
                    "text": "açılış, kapanış, minimum ve maksimum oranlar gibi bölümdeki her bir mumu tanımlayan oranlar;",
                    "updated": 1641994732523
                }
            ]
        }
    ]
}