{
    "type": "Debug Mode",
    "definition": {
        "text": "Debug Mode will log to the console every operation that is executed, as well as runtime performance information like memory footprint and total kernel execution time. Note that this will greatly slow down your application, do not use this in production.",
        "updated": 1613062911672,
        "translations": [
            {
                "language": "RU",
                "text": "Режим отладки будет записывать в консоль каждую выполненную операцию, а также информацию о производительности во время выполнения, такую как объем памяти и общее время выполнения ядра. Обратите внимание, что это сильно замедлит работу вашего приложения, не используйте это в производстве.",
                "updated": 1645247289425
            },
            {
                "language": "TR",
                "text": "Hata Ayıklama Modu, yürütülen her işlemin yanı sıra bellek ayak izi ve toplam çekirdek yürütme süresi gibi çalışma zamanı performans bilgilerini konsola kaydeder. Bunun uygulamanızı büyük ölçüde yavaşlatacağını unutmayın, bunu üretimde kullanmayın.",
                "updated": 1654396939524
            },
            {
                "language": "DE",
                "text": "Im Debug-Modus wird jeder ausgeführte Vorgang auf der Konsole protokolliert, ebenso wie Informationen zur Laufzeitleistung, wie z. B. der Speicherbedarf und die Gesamtausführungszeit des Kernels. Beachten Sie, dass dies Ihre Anwendung stark verlangsamt, verwenden Sie dies nicht in der Produktion.  ",
                "updated": 1708628969388
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645247294567
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654396946400,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1708460171936
                }
            ]
        }
    ]
}