{
    "type": "LAN Network Node",
    "definition": {
        "text": "A network node represents a machine running Superalgos, on which processes run and data is stored.",
        "translations": [
            {
                "language": "ES",
                "text": "Un network node representa una maquina corriendo Superalgos, en la cual procesos corren y data es guardada.",
                "updated": 1624229963419
            },
            {
                "language": "RU",
                "text": "Узел LAN Network представляет собой машину, на которой работает Superalgos, на которой выполняются процессы и хранятся данные.",
                "updated": 1638353600754
            },
            {
                "language": "DE",
                "text": "Ein Network Node (Netzwerkknoten) stellt eine Maschine dar, auf der Superalgos läuft, auf der Prozesse ablaufen und Daten gespeichert werden.",
                "updated": 1651909956300
            },
            {
                "language": "TR",
                "text": "Bir ağ düğümü, Superalgos çalıştıran, üzerinde işlemlerin yürütüldüğü ve verilerin depolandığı bir makineyi temsil eder.",
                "updated": 1701083980177
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "By default, processes are set up to run locally in a network node representing your local machine. However, the system is prepared to run distributed on a network of nodes, or what we call a trading farm.",
            "translations": [
                {
                    "language": "RU",
                    "text": "По умолчанию процессы настроены для локального запуска на сетевом узле, представляющем ваш локальный компьютер. Однако система готова к работе в сети узлов, или в том, что мы называем торговой фермой.",
                    "updated": 1638353637092
                },
                {
                    "language": "DE",
                    "text": "Standardmäßig sind die Prozesse so eingerichtet, dass sie lokal auf einem Netzwerkknoten ausgeführt werden, der Ihren lokalen Rechner darstellt. Das System ist jedoch darauf vorbereitet, verteilt auf einem Netzwerk von Nodes zu laufen, oder was wir eine Trading Frm nennen.",
                    "updated": 1651909967974
                },
                {
                    "language": "TR",
                    "text": "Varsayılan olarak, işlemler yerel makinenizi temsil eden bir ağ düğümünde yerel olarak çalışacak şekilde ayarlanmıştır. Ancak sistem, düğümlerden oluşan bir ağda ya da işlem çiftliği olarak adlandırdığımız bir ağda dağıtılmış olarak çalışmaya hazırdır.",
                    "updated": 1701083984858
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may create unlimited network nodes and map them with different machines on a network. Each computer in the network runs an instance of the Superalgos backend, and you may control the whole network operation from a single machine, or—in general—from any machine in the network running the Superalgos frontend. To learn more about distributed setups, check the trading farms pages.",
            "updated": 1609249489127,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете создать неограниченное количество сетевых узлов и сопоставить их с разными машинами в сети. На каждом компьютере в сети работает экземпляр бэкэнда Superalgos, и вы можете управлять всей работой сети с одной машины или - в общем - с любой машины в сети, на которой запущен интерфейс Superalgos. Чтобы узнать больше о распределенных настройках, посетите страницы торговых ферм.",
                    "updated": 1638354477297
                },
                {
                    "language": "DE",
                    "text": "Sie können eine unbegrenzte Anzahl von Netzwerkknoten erstellen und diese verschiedenen Rechnern in einem Netzwerk zuordnen. Jeder Computer im Netzwerk führt eine Instanz des Superalgos-Backends aus, und Sie können den gesamten Netzwerkbetrieb von einer einzigen Maschine aus steuern, oder - im Allgemeinen - von jeder Maschine im Netzwerk, auf der das Superalgos-Frontend läuft. Um mehr über verteilte Setups zu erfahren, besuchen Sie die Seiten über Trading Farms.",
                    "updated": 1651909916506
                },
                {
                    "language": "TR",
                    "text": "Sınırsız sayıda ağ düğümü oluşturabilir ve bunları bir ağ üzerindeki farklı makinelerle eşleştirebilirsiniz. Ağdaki her bilgisayar Superalgos arka ucunun bir örneğini çalıştırır ve tüm ağ işlemini tek bir makineden veya genel olarak Superalgos ön ucunu çalıştıran ağdaki herhangi bir makineden kontrol edebilirsiniz. Dağıtılmış kurulumlar hakkında daha fazla bilgi edinmek için ticaret çiftlikleri sayfalarını kontrol edin.",
                    "updated": 1701083989072
                }
            ]
        },
        {
            "style": "Text",
            "text": "The easiest and fastest way to set up a network node is using the Install Market function available on markets defined in the Crypto Ecosystem hierarchy, under the exchange markets node. This function adds data mining tasks for all sensor and indicator bots shipping with the system, backtesting and live trading tasks for trading systems shipping with the system, including the data storage definitions for both, and also creates the corresponding dashboards and charts in the Charting Space hierarchy. You may learn more about this function in the how to install a new market page.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Самый простой и быстрый способ настроить сетевой узел - использовать функцию Install Market, доступную на рынках, определенных в иерархии Crypto Ecosystem в узле биржевых рынков. Эта функция добавляет задачи интеллектуального анализа данных для всех сенсорных и индикаторных роботов, поставляемых с системой, бэктестирование и задачи реальной торговли для торговых систем, поставляемых с системой, включая определения хранилищ данных для обеих, а также создание соответствующих панелей мониторинга и диаграмм в иерархии пространства диаграмм. Вы можете узнать больше об этой функции на странице, посвященной установке новой торговой площадки.",
                    "updated": 1638354521595
                },
                {
                    "language": "DE",
                    "text": "Der einfachste und schnellste Weg, einen Netzwerkknoten einzurichten, ist die Funktion \"Markt installieren\", die für die in der Crypto Ecosystem-Hierarchie definierten Märkte unter dem Knoten \"Exchange markets\" verfügbar ist. Diese Funktion fügt Data-Mining-Aufgaben für alle Sensor- und Indikator-Bots, die mit dem System ausgeliefert werden, Backtesting- und Live-Trading-Aufgaben für Handelssysteme, die mit dem System ausgeliefert werden, einschließlich der Datenspeicherdefinitionen für beide, hinzu und erstellt auch die entsprechenden Dashboards und Charts in der Charting Space-Hierarchie. Mehr über diese Funktion erfahren Sie auf der Seite \"How to install a new market\".",
                    "updated": 1651910131626
                },
                {
                    "language": "TR",
                    "text": "Bir ağ düğümü kurmanın en kolay ve en hızlı yolu, Kripto Ekosistemi ( Crypto Ecosystem ) hiyerarşisinde tanımlanan piyasalarda, borsa piyasaları düğümü altında bulunan Piyasayı Kur işlevini kullanmaktır. Bu işlev, sistemle birlikte gönderilen tüm sensör ve gösterge botları için veri madenciliği görevlerini, sistemle birlikte gönderilen ticaret sistemleri için geriye dönük test ve canlı ticaret görevlerini, her ikisi için de veri depolama tanımlarını ekler ve ayrıca Grafik Alanı ( Charting Space ) hiyerarşisinde ilgili gösterge tablolarını ve grafikleri oluşturur. Yeni bir piyasa nasıl kurulur sayfasında bu işlev hakkında daha fazla bilgi edinebilirsiniz.",
                    "updated": 1701084057949
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you need finer control over the operation you wish to deploy on the network, then you may use the individual functions available under each section of the hierarchy under the network node.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вам нужен более точный контроль над операцией, которую вы хотите развернуть в сети, вы можете использовать отдельные функции, доступные в каждом разделе иерархии под сетевым узлом.",
                    "updated": 1638354544089
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie eine genauere Kontrolle über den Vorgang benötigen, den Sie im Netzwerk einsetzen möchten, können Sie die einzelnen Funktionen verwenden, die in jedem Abschnitt der Hierarchie unter dem Netzknoten verfügbar sind.",
                    "updated": 1651910185616
                },
                {
                    "language": "TR",
                    "text": "Ağ üzerinde dağıtmak istediğiniz işlem üzerinde daha ince kontrole ihtiyacınız varsa, ağ düğümü altındaki hiyerarşinin her bir bölümü altında bulunan ayrı işlevleri kullanabilirsiniz.",
                    "updated": 1701084019054
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "LAN Network Node Configuration",
            "updated": 1642942035295,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация узла LAN Network",
                    "updated": 1647781834402
                },
                {
                    "language": "DE",
                    "text": "LAN Network Node Konfiguration",
                    "updated": 1651910198621
                },
                {
                    "language": "TR",
                    "text": "LAN Ağ Düğümü Yapılandırması ( LAN Network Node Configuration )",
                    "updated": 1701084078507
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties",
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1638354578590
                },
                {
                    "language": "DE",
                    "text": "Eigenschaften",
                    "updated": 1651910206786
                },
                {
                    "language": "TR",
                    "text": "Özellikler ( Properties )",
                    "updated": 1701084138050
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "List",
            "text": "host is the machine or hardware represented by the network node. The default parameter is localhost, but if you intend to access the backend services of this node from a remote computer, then you must change localhost for the IP Address of the machine on which the node is running, for example, to 147.0.0.1.",
            "translations": [
                {
                    "language": "RU",
                    "text": "host - это машина или оборудование, представленное сетевым узлом. Параметр по умолчанию - localhost, но если вы намереваетесь получить доступ к серверным службам этого узла с удаленного компьютера, вы должны изменить localhost для IP-адреса компьютера, на котором работает узел, например, на 147.0.0.1.",
                    "updated": 1638354599031
                },
                {
                    "language": "DE",
                    "text": "host ist die Maschine oder Hardware, die durch den Netzwerkknoten repräsentiert wird. Der Standardparameter ist localhost. Wenn Sie jedoch beabsichtigen, von einem entfernten Computer aus auf die Backend-Dienste dieses Knotens zuzugreifen, müssen Sie localhost in die IP-Adresse des Rechners ändern, auf dem der Knoten ausgeführt wird, z. B. in 147.0.0.1.",
                    "updated": 1651910237720
                },
                {
                    "language": "TR",
                    "text": "ana bilgisayar, ağ düğümü tarafından temsil edilen makine veya donanımdır. Varsayılan parametre localhost'tur, ancak bu düğümün arka uç hizmetlerine uzak bir bilgisayardan erişmek istiyorsanız, localhost'u düğümün çalıştığı makinenin IP Adresi için, örneğin 147.0.0.1 olarak değiştirmelisiniz.",
                    "updated": 1701084144329
                }
            ]
        },
        {
            "style": "List",
            "text": "webPort is the port used by the Web Server, at this stage 34248.",
            "updated": 1609247881896,
            "translations": [
                {
                    "language": "RU",
                    "text": "webPort - это порт, используемый веб-сервером, на данном этапе 34248.",
                    "updated": 1638354613945
                },
                {
                    "language": "DE",
                    "text": "webPort ist der vom Webserver verwendete Port, in diesem Fall 34248.",
                    "updated": 1651910253259
                },
                {
                    "language": "TR",
                    "text": "webPort, Web Sunucusu tarafından kullanılan bağlantı noktasıdır, bu aşamada 34248'dir.",
                    "updated": 1701084151225
                }
            ]
        },
        {
            "style": "List",
            "text": "webSocketsPort is the port used by the system to communicate over the local area network, by default set at 18041.",
            "translations": [
                {
                    "language": "RU",
                    "text": "webSocketsPort - это порт, используемый системой для связи по локальной сети, по умолчанию установлен 18041.",
                    "updated": 1638354625777
                },
                {
                    "language": "DE",
                    "text": "webSocketsPort ist der Port, der vom System für die Kommunikation über das lokale Netz verwendet wird und standardmäßig auf 18041 eingestellt ist.",
                    "updated": 1651910267466
                },
                {
                    "language": "TR",
                    "text": "webSocketsPort, sistem tarafından yerel alan ağı üzerinden iletişim kurmak için kullanılan bağlantı noktasıdır ve varsayılan olarak 18041 olarak ayarlanmıştır.",
                    "updated": 1701084161130
                }
            ]
        },
        {
            "style": "List",
            "text": "webSocketsExternalURL is the URL used by the system to communicate over the wide area network, by default set undefined.",
            "translations": [
                {
                    "language": "RU",
                    "text": "webSocketsExternalURL - это URL-адрес, используемый системой для связи по глобальной сети, по умолчанию установлен в \"undefined\".",
                    "updated": 1638354664660
                },
                {
                    "language": "DE",
                    "text": "webSocketsExternalURL ist die URL, die vom System für die Kommunikation über das WAN verwendet wird; standardmäßig ist sie undefiniert.",
                    "updated": 1651910305318
                },
                {
                    "language": "TR",
                    "text": "webSocketsExternalURL, sistem tarafından geniş alan ağı üzerinden iletişim kurmak için kullanılan URL'dir, varsayılan olarak tanımsız olarak ayarlanmıştır.",
                    "updated": 1701084177450
                }
            ]
        }
    ]
}