{
    "type": "Cancel Order Event",
    "definition": {
        "text": "The cancel order event makes cancelling limit orders possible.",
        "translations": [
            {
                "language": "RU",
                "text": "Событие Cancel Order Event позволяет отменить лимитные ордера.",
                "updated": 1639845713831
            },
            {
                "language": "TR",
                "text": "İptal emri olayı, limit emirlerini iptal etmeyi mümkün kılar.",
                "updated": 1652797304986
            },
            {
                "language": "DE",
                "text": "Das Ereignis \"cancel order\" ermöglicht die Stornierung von limitierten Aufträgen.",
                "updated": 1708265555016
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The cancel order event defines the market situations in which a limit order shall be canceled. When the event is triggered, the order is closed, even when the order may have been partially filled. In such a case, the size filled remains as is, and all accounts are computed accordingly, with the partial fill.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Событие отмены ордера определяет рыночные ситуации, в которых лимитный ордер должен быть отменен. Когда событие запускается, ордер закрывается, даже если он мог быть частично исполнен. В таком случае заполненный размер остается неизменным, и все счета рассчитываются соответственно с частичным заполнением.",
                    "updated": 1638646134499
                },
                {
                    "language": "TR",
                    "text": "İptal emri olayı, bir limit emrinin iptal edileceği piyasa durumlarını tanımlar. Etkinlik tetiklendiğinde, sipariş kısmen doldurulmuş olsa bile sipariş kapatılır. Böyle bir durumda, doldurulan boyut olduğu gibi kalır ve tüm hesaplar kısmi dolum ile buna göre hesaplanır.",
                    "updated": 1652797320244
                },
                {
                    "language": "DE",
                    "text": "Das Auftragsstornierungsereignis definiert die Marktsituationen, in denen ein Limitauftrag storniert werden soll. Wenn das Ereignis ausgelöst wird, wird der Auftrag geschlossen, auch wenn der Auftrag möglicherweise teilweise ausgeführt wurde. In einem solchen Fall bleibt die gefüllte Größe unverändert, und alle Konten werden entsprechend mit der Teilfüllung berechnet.",
                    "updated": 1708265555158,
                    "style": "Text"
                }
            ]
        }
    ]
}