{
    "type": "Chart Points",
    "definition": {
        "text": "A chart points groups definitions of coordinate points used to define polygons.",
        "translations": [
            {
                "language": "ES",
                "text": "Un chart points agrupa definiciones de puntos de coordenadas que se utilizan para definir polígonos.",
                "updated": 1628036795702
            },
            {
                "language": "RU",
                "text": "Chart Points группируют определения координатных точек, используемых для определения полигонов.",
                "updated": 1638646349547
            },
            {
                "language": "TR",
                "text": "Bir grafik noktaları, çokgenleri tanımlamak için kullanılan koordinat noktalarının tanımlarını gruplandırır.",
                "updated": 1652797517523
            },
            {
                "language": "DE",
                "text": "Diagrammpunkte gruppieren die Definitionen von Koordinatenpunkten, die zur Definition von Polygonen verwendet werden.",
                "updated": 1708265556518
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The definition of a point consists of the name of the point and the corresponding values for the x and y coordinates. To create such definitions, point and point formulas are used.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Определение точки состоит из имени точки и соответствующих значений для координат x и y. Для создания таких определений используются точка и точечные формулы.",
                    "updated": 1638646404452
                },
                {
                    "language": "TR",
                    "text": "Bir noktanın tanımı, noktanın adından ve x ve y koordinatları için karşılık gelen değerlerden oluşur. Bu tür tanımları oluşturmak için nokta ve nokta formülleri kullanılır.",
                    "updated": 1652797526994
                },
                {
                    "language": "DE",
                    "text": "Die Definition eines Punktes besteht aus dem Namen des Punktes und den entsprechenden Werten für die x- und y-Koordinaten. Um solche Definitionen zu erstellen, werden Punkt- und Punktformeln verwendet.",
                    "updated": 1708265556674,
                    "style": "Text"
                }
            ]
        }
    ]
}