{
    "type": "Asset Contribution Claim",
    "definition": {
        "text": "Use this node to reference an Asset node in one of the Assets hierarchy to establish an Asset Contribution Claim. This claim means that you declare that you have worked on that Asset, either creating or improving it, and that you expect to be rewarded accordingly!",
        "updated": 1630349414102,
        "translations": [
            {
                "language": "ES",
                "text": "Use este nodo para referenciar un nodo de Asset (Activo) en una de las jerarquías de Assets para establecer una Asset Contribution Claim.( Solicitud de Contribución de Activo) Est solicitud significa que declara que ha trabajado en un activo, ya sea creándolo o mejorándolo, y que espera ser recompensado consecuentemente!",
                "updated": 1636283349685
            },
            {
                "language": "RU",
                "text": "Используйте этот узел для ссылки на узел Asset в одной из иерархий Assets, чтобы установить Asset Contribution Claim. Это заявление означает, что вы заявляете, что работали над этим Asset, создавая или улучшая его, и ожидаете соответствующего вознаграждения!",
                "updated": 1639133533054
            },
            {
                "language": "TR",
                "text": "Bir Varlık Katkı Talebi oluşturmak için Varlıklar (Assets) hiyerarşisinden birindeki bir Varlık düğümüne başvurmak için bu düğümü kullanın. Bu iddia, o Varlık (Asset) üzerinde çalıştığınızı, onu yarattığınızı veya geliştirdiğinizi ve buna göre ödüllendirilmeyi beklediğinizi beyan ettiğiniz anlamına gelir!",
                "updated": 1644497237856
            },
            {
                "language": "DE",
                "text": "Verwenden Sie diesen Knoten, um auf einen Asset -Knoten in der Assets -Hierarchie zu verweisen und einen Asset-Beitragsanspruch zu erheben. Dieser Anspruch bedeutet, dass Sie erklären, dass Sie an diesem Asset gearbeitet haben, indem Sie es entweder erstellt oder verbessert haben, und dass Sie erwarten, entsprechend belohnt zu werden!  ",
                "updated": 1708628841893
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624728761840
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reusable Governance Snippets->Claims Content",
            "updated": 1630325363447,
            "translations": [
                {
                    "language": "TR",
                    "text": "Yönetişim->Kavram->Kullanılabilir Yönetişim Parçacıkları->Hak Talepleri İçeriği",
                    "updated": 1654394431315,
                    "style": "Include"
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1639133552344
                },
                {
                    "language": "TR",
                    "text": "Konfigürasyon",
                    "updated": 1654394437730,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Konfiguration",
                    "updated": 1708461398795
                }
            ]
        }
    ]
}