{
    "type": "Claims Program",
    "definition": {
        "text": "When you contribute to Superalgos, you must produce a claim for your contribution, and you must harness the support of people working close to you, who will vouch or vote for your claims.",
        "updated": 1630256293740,
        "translations": [
            {
                "language": "ES",
                "text": "cuando contribuye con Superalgos, debe producir una solicitud por dicha contribución, y debeand you must aprovechar el apoyo de las personas que trabajan cerca de usted, quienes responderá o votará por sus solicitudes.",
                "updated": 1636041066589
            },
            {
                "language": "RU",
                "text": "Когда вы вносите свой вклад в Superalgos, вы должны подать заявку на свой вклад и заручиться поддержкой близких вам людей, которые подтвердят или проголосуют за это.",
                "updated": 1638990396697
            },
            {
                "language": "TR",
                "text": "Superalgos'a katkıda bulunduğunuzda, katkınız için bir talepte bulunmalı ve size yakın çalışan, iddialarınıza kefil olacak veya oy verecek kişilerin desteğini istemelisiniz.",
                "updated": 1644495276016
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1630256308831
        },
        {
            "style": "Important",
            "text": "Governance is decentralized. There is no central authority controlling who contributes what or what rewards contributors get. Instead, the project delegates in the Community the capacity to establish the value of contributions and to determine who contributed what.",
            "updated": 1630256982050,
            "translations": [
                {
                    "language": "ES",
                    "text": "La gobernanza es descentralizada. No hay una autoridad central controlando quien contribuye queo que recompensas  reciben los contribuyentes. En lugar de eso, el proyecto delega en la comunidad la capacidad de establecer el valor de las contribuciones y de determinar quien contribuye que.",
                    "updated": 1636041621066
                },
                {
                    "language": "RU",
                    "text": "Управление децентрализовано. Нет никакого центрального органа, контролирующего, кто вносит вклад и какие вознаграждения получают участники. Вместо этого проект делегирует сообществу возможность устанавливать ценность вкладов и определять, кто и что внес.",
                    "updated": 1638990470744
                },
                {
                    "language": "TR",
                    "text": "Yönetim merkeziyetsizdir. Kimin katkıda bulunacağını veya katkıda bulunanların hangi ödülleri alacağını kontrol eden merkezi bir otorite yoktur. Bunun yerine, proje, Topluluk içindeki katkıların değerini belirleme ve kimin neye katkıda bulunduğunu belirlemek için yetkisini topluluğa devretmiştir.",
                    "updated": 1644495374637
                }
            ]
        },
        {
            "style": "Text",
            "text": "As such, governance is a social system. When you get involved with Superalgos, you interact with the Community and find ways to contribute. While doing so, you relate to or associate with community members that have similar interests or are focused on the same areas of the project you may be working in. It is these people that will vouch for your claims!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Como tal, la gobernanza es un sistema social. Cuando se involucra con Superalgos,  interactúa con la comunidad y encuentra modos de contribuir. Mientras hace eso, entra en relación o se asocia con miembros de la comunidad que tienen intereses similares o que están focalizados en las mismas áreas del proyecto en las que está trabajando. Esta es la gente que los respaldará en sus solicitudes!",
                    "updated": 1636041930754
                },
                {
                    "language": "RU",
                    "text": "Как таковое, управление - это социальная система. Когда вы участвуете в Superalgos, вы взаимодействуете с Сообществом и находите способы внести свой вклад. При этом вы общаетесь или общаетесь с членами сообщества, которые имеют схожие интересы или сосредоточены на тех же областях проекта, в котором вы, возможно, работаете. Именно эти люди подтвердят ваши заявления!",
                    "updated": 1638990541765
                },
                {
                    "language": "TR",
                    "text": "Dolayısıyla yönetim sosyal bir sistemdir. Superalgos'a dahil olduğunuzda, Topluluk (Community) ile etkileşime girer ve katkıda bulunmanın yollarını bulursunuz. Bunu yaparken, benzer ilgi alanlarına sahip veya üzerinde çalıştığınız projenin aynı alanlarına odaklanmış topluluk üyeleriyle ilişki kurarsınız. İddialarınıza kefil olacak olan bu insanlardır!",
                    "updated": 1644495444067
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are three different types of claims you may place: ",
            "translations": [
                {
                    "language": "ES",
                    "text": "Hay tres tipos diferentes de solicitudes que puede realizar:",
                    "updated": 1636041961553
                },
                {
                    "language": "RU",
                    "text": "Существует три различных типа претензий, которые вы можете подать:",
                    "updated": 1638990572805
                },
                {
                    "language": "TR",
                    "text": "Yapabileceğiniz üç farklı hak talebi türü vardır:",
                    "updated": 1644495472288
                }
            ]
        },
        {
            "style": "List",
            "text": "Asset Contribution Claim",
            "translations": [
                {
                    "language": "TR",
                    "text": "Asset Contribution Claim (Varlık Katkı Talebi)",
                    "updated": 1644495482905
                }
            ]
        },
        {
            "style": "List",
            "text": "Feature Contribution Claim",
            "translations": [
                {
                    "language": "TR",
                    "text": "Feature Contribution Claim (Özellik Katkı Talebi)",
                    "updated": 1644495523143
                }
            ]
        },
        {
            "style": "List",
            "text": "Position Contribution Claim",
            "updated": 1630256348337,
            "translations": [
                {
                    "language": "TR",
                    "text": "Position Contribution Claim (Pozisyon Katkı Talebi)",
                    "updated": 1644495537263
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are also three different folder types of nodes that act as organizational devices from which you may spawn the above claim nodes:",
            "translations": [
                {
                    "language": "ES",
                    "text": "También hay tres tipos de carpetas de nodos diferentes que actúan como dispositivos organizativos a partir de los cuales puede generar los nodos de solicitudes anteriores.:",
                    "updated": 1636042005643
                },
                {
                    "language": "RU",
                    "text": "Также существует три различных типа папок узлов, которые действуют как организационные устройства, из которых вы можете создавать указанные выше узлы заявок:",
                    "updated": 1638990598227
                },
                {
                    "language": "TR",
                    "text": "Ayrıca, yukarıdaki talep düğümlerini oluşturabileceğiniz kurumsal aygıtlar gibi davranan üç farklı klasör tipi düğüm vardır:",
                    "updated": 1644495560501
                }
            ]
        },
        {
            "style": "List",
            "text": "Asset Claims Folder",
            "translations": [
                {
                    "language": "TR",
                    "text": "Asset Claims Folder (Varlık Talep Klasörü)",
                    "updated": 1644495635878
                }
            ]
        },
        {
            "style": "List",
            "text": "Feature Claims Folder",
            "updated": 1630256365206,
            "translations": [
                {
                    "language": "TR",
                    "text": "Feature Claims Folder (Özellik Talep Klasörü)",
                    "updated": 1644495646450
                }
            ]
        },
        {
            "style": "List",
            "text": "Position Claims Folder",
            "updated": 1630256373604,
            "translations": [
                {
                    "language": "TR",
                    "text": "Position Claims Folder (Pozisyon Talep Düğümü)",
                    "updated": 1644495661705
                }
            ]
        },
        {
            "style": "Text",
            "text": "These three types of claims match the three types of definition hierarchies used to describe the project:",
            "translations": [
                {
                    "language": "ES",
                    "text": "Estos tres tipos de declaraciones coinciden con los tres tipos de jerarquías de definición que se utilizan para describir el proyecto:",
                    "updated": 1636042035723
                },
                {
                    "language": "RU",
                    "text": "Эти три типа заявлений соответствуют трем типам иерархий определений, используемых для описания проекта:",
                    "updated": 1638990642149
                },
                {
                    "language": "TR",
                    "text": "Bu üç talep türü, projeyi tanımlamak için kullanılan üç tür hiyerarşisiyle eşleşir:",
                    "updated": 1644495691830
                }
            ]
        },
        {
            "style": "List",
            "text": "Assets",
            "translations": [
                {
                    "language": "TR",
                    "text": "Assets (Varlıklar)",
                    "updated": 1644495702403
                }
            ]
        },
        {
            "style": "List",
            "text": "Features",
            "translations": [
                {
                    "language": "TR",
                    "text": "Features (Özelikler)",
                    "updated": 1644495710502
                }
            ]
        },
        {
            "style": "List",
            "text": "Positions",
            "translations": [
                {
                    "language": "TR",
                    "text": "Positions (Pozisyonlar)",
                    "updated": 1644495719579
                }
            ]
        },
        {
            "style": "Callout",
            "text": "To place a claim, use the appropriate type of contribution claim node to reference the matching type of definition. For example, use an Asset Contribution Claim node to reference an Asset node within an Assets hierarchy. When you do that, you are effectively placing a claim on that asset.",
            "updated": 1630323960334,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para colocar un reclamo, use el tipo apropiado de nodo de reclamo de contribución para hacer referencia al tipo de definición coincidente.Por ejemplo, use un nodo de Asset Contribution Claim para referenciar un nodo de Asset node con una jerarquía Assets. Cuando hace esto, está efectivamente colocando una solicituda en dicho asset.",
                    "updated": 1636042322243
                },
                {
                    "language": "RU",
                    "text": "Чтобы разместить заявку, используйте соответствующий тип узла заявки на взнос для ссылки на соответствующий тип определения. Например, используйте узел Asset Contribution Claim для ссылки на узел Asset в иерархии Assets. Когда вы это делаете, вы фактически предъявляете претензию на этот ресурс.",
                    "updated": 1638991185571
                },
                {
                    "language": "TR",
                    "text": "Bir talepte bulunmak için, eşleşen tanım türüne başvuruda bulunmak üzere uygun türde katkı talebi düğümünü kullanın. Örneğin, Varlıklar hiyerarşisindeki bir Varlık (Asset) düğümüne başvurmak için bir Varlık Katkı Talebi (Asset Contribution Claim) düğümü kullanın. Bunu yaptığınızda, o varlık üzerinde etkili bir şekilde hak talebinde bulunmuş olursunuz.",
                    "updated": 1644496782797
                }
            ]
        },
        {
            "style": "Note",
            "text": "This claim means that you declare that you have worked on that asset, either creating or improving it, and that you expect to be rewarded accordingly.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Esta afirmación significa que declara que ha trabajado en ese activo, ya sea creándolo o mejorándolo, y que espera ser recompensado en consecuencia.",
                    "updated": 1636042350532
                },
                {
                    "language": "RU",
                    "text": "Это означает, что вы заявляете, что работали над этим ресурсом, создавая или улучшая его, и ожидаете соответствующего вознаграждения.",
                    "updated": 1638991248603
                },
                {
                    "language": "TR",
                    "text": "Bu iddia, o varlık üzerinde çalıştığınızı, onu yarattığınızı veya iyileştirdiğinizi ve buna göre ödüllendirilmeyi beklediğinizi beyan ettiğiniz anlamına gelir.",
                    "updated": 1644496802287
                }
            ]
        },
        {
            "style": "Text",
            "text": "How a claim is resolved depends on three interrelated concepts:",
            "updated": 1630256564789,
            "translations": [
                {
                    "language": "ES",
                    "text": "La forma en que se resuelve una reclamación depende de tres conceptos interrelacionados:",
                    "updated": 1636042384399
                },
                {
                    "language": "RU",
                    "text": "Порядок разрешения претензии зависит от трех взаимосвязанных концепций:",
                    "updated": 1638991270692
                },
                {
                    "language": "TR",
                    "text": "Bir talebin nasıl çözüldüğü birbiriyle ilişkili üç kavrama bağlıdır:",
                    "updated": 1644496867937
                }
            ]
        },
        {
            "style": "List",
            "text": "The Claim Power you drive into the node that places the claim.",
            "updated": 1630256658386,
            "translations": [
                {
                    "language": "ES",
                    "text": "El Claim Power que dirija hacia el nodo que coloca la solicitud.",
                    "updated": 1636042424716
                },
                {
                    "language": "RU",
                    "text": "Claim Power, который вы вбиваете в узел, который размещает заявку.",
                    "updated": 1638991498259
                },
                {
                    "language": "TR",
                    "text": "Hak talebinin yerleştirildiği düğüme verdiğiniz Talep Gücü.",
                    "updated": 1644496907479
                }
            ]
        },
        {
            "style": "List",
            "text": "The Claim Votes your claim gets from other users, and the Voting Power they drive into those votes.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Los Claim Votes que su solicitud obtenga de otros usuarios, y el Voting Power ellos dirijen a esos votos.",
                    "updated": 1636042491572
                },
                {
                    "language": "RU",
                    "text": "Claim Votes, который ваша заявка получает от других пользователей, и Voting Power, который они вкладывают в эти голоса.",
                    "updated": 1638991475900
                },
                {
                    "language": "TR",
                    "text": "Talep Oyları, talebinizin diğer kullanıcılardan aldığı oylar ve bu oylara verdikleri Oylama Gücü.",
                    "updated": 1644496937691
                }
            ]
        },
        {
            "style": "List",
            "text": "The Token Rewards available within the definition node you are claiming.",
            "updated": 1630256728009,
            "translations": [
                {
                    "language": "ES",
                    "text": "LasToken Rewards disponibles con la definición del nodo que ha presentado la solicitud.",
                    "updated": 1636042546324
                },
                {
                    "language": "RU",
                    "text": "Token Rewards, доступные в узле определения, на который вы претендуете.",
                    "updated": 1638991542338
                },
                {
                    "language": "TR",
                    "text": "Talep ettiğiniz düğümde bulunan Token Ödülleri.",
                    "updated": 1644496960239
                }
            ]
        },
        {
            "style": "Success",
            "text": "To learn all the details about claims resolution, read the How Claims are Resolved page in the Governance Flow topic of The Governance Project book.",
            "updated": 1630257166423,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para aprender estos detalles acerca de las claims resolution, leer la página How Claims are Resolved (como se resuelven las solicitudes)en el topico del flujo de gobernanza del libro Governance Project.",
                    "updated": 1636042664873
                },
                {
                    "language": "RU",
                    "text": "Чтобы узнать все подробности о разрешении претензий, прочтите страницу How Claims are Resolved в разделе Governance Flow книги The Governance Project.",
                    "updated": 1638991638290
                },
                {
                    "language": "TR",
                    "text": "Taleplerin çözümlenmesiyle ilgili tüm ayrıntıları öğrenmek için, Yönetişim Projesi kitabının (The Governance Project) Yönetişim Akışı konusundaki Talepler Nasıl Çözülür (How Claims are Resolved) sayfasını okuyun.",
                    "updated": 1644497022746
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1638991651989
                },
                {
                    "language": "TR",
                    "text": "Yapılandırma",
                    "updated": 1644497038427
                }
            ]
        }
    ]
}