{
    "tutorial": "Basic Education",
    "pageNumber": 38,
    "type": "Tutorial Step - Working with Workspaces",
    "definition": {
        "text": "You may think of a workspace as a stage in a theatre. It is the setting on which something will play out!",
        "icon": {
            "name": "workspace",
            "project": "Foundations"
        },
        "updated": 1615893942449,
        "translations": [
            {
                "language": "IT",
                "text": "Puoi vedere il Workspace come il palco di un teatro. È il luogo dove qualcosa andrà in scena!",
                "updated": 1619546463150,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Puede pensar en un espacio de trabajo como en el escenario de un teatro. ¡Es el escenario en el que se desarrollará algo!",
                "updated": 1626618738205
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may set up as many workspaces as you like, each of them for specific use cases. For example:",
            "updated": 1615904641004,
            "translations": [
                {
                    "language": "IT",
                    "text": "Puoi configurare quanti workspace vuoi, ognuno per uno specifico utilizzo. Per esempio:",
                    "updated": 1619546502168,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Puede configurar tantos espacios de trabajo como desee, cada uno de ellos para casos de uso específicos. Por ejemplo:",
                    "updated": 1626618800731
                }
            ]
        },
        {
            "style": "List",
            "text": "You may have a workspace to build a Trading System that will need specific indicators from a specific Data Mine.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Puoi avere un workspace per costruire un Trading System che ha bisogno di specifici indicatori da specifici Data Mine.",
                    "updated": 1619546574933,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Puede tener un espacio de trabajo para construir un Trading System que necesitarán indicadores específicos de un Data Mine.",
                    "updated": 1626618837507
                }
            ],
            "updated": 1622374580811
        },
        {
            "style": "List",
            "text": "You may have another workspace setup with all the available indicators so that you may study how each of them works.",
            "updated": 1615904707330,
            "translations": [
                {
                    "language": "IT",
                    "text": "Puoi avere un altro workspace con tutti gli indicatori disponibili così da studiare come funziona ognuno di essi.",
                    "updated": 1619546609509,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Puede tener otra configuración de espacio de trabajo con todos los indicadores disponibles para que puedas estudiar cómo funciona cada uno de ellos.",
                    "updated": 1626618870536
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Read this page to learn the basics about how to deal with workspaces...",
            "updated": 1615904777283,
            "translations": [
                {
                    "language": "IT",
                    "text": "Leggi questa pagina per imparare le basi su come lavorare con i workspaces...",
                    "updated": 1619546636057,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Lee esta página y aprende los conceptos básicos sobre cómo manejar los espacios de trabajo...",
                    "updated": 1626618939242
                }
            ]
        }
    ]
}