{
    "tutorial": "Basic Education",
    "pageNumber": 54,
    "type": "Tutorial Step - More Indicators?",
    "definition": {
        "text": "Indicators are built by the Community! Usually, a developer will build a few indicators he or she needs, and contribute them to the project in a new Data Mine!",
        "updated": 1616235133472,
        "icon": {
            "name": "data-mine",
            "project": "Data-Mining"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Gli Indicators sono costruiti dalla community! Solitamente uno sviluppatore costruisce gli indicatori di cui ha bisogno, e contribuisce al progetto con una nuova Data Mine!",
                "updated": 1619592382827,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Los indicadores los construye la comunidad! Un desarrollador construirá indicadores que necesite y los aportará al proyecto en una nueva mina de datos (Data Mine).",
                "updated": 1675378647530,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Indikatoren werden von der Community erstellt! Normalerweise baut ein Entwickler ein paar Indikatoren, die er oder sie braucht, und stellt sie dem Projekt in einer neuen Data Mine zur Verfügung!",
                "updated": 1634590447390
            },
            {
                "language": "TR",
                "text": "Indikatrler Topluluk tarafından oluşturulmuştur! Genellikle, bir geliştirici ihtiyaç duyduğu birkaç gösterge oluşturur ve bunları yeni bir Veri Madeni'ndeki ( Data Mine ) projeye katkıda  bulunur!",
                "updated": 1639836507868
            },
            {
                "language": "RU",
                "text": "Индикаторы создаются сообществом! Обычно разработчик создает несколько нужных ему индикаторов и вносит их в проект в новой Data Mine!",
                "updated": 1640876027226
            },
            {
                "language": "ID",
                "text": "Indikator dibangun oleh Komunitas! Biasanya, developer akan membangun beberapa indikator yang dia butuhkan, dan berkontribusi pada projek di Data Mine baru!",
                "updated": 1645561682561
            },
            {
                "language": "NL",
                "text": "Indicatoren worden gebouwd door de Community! Gewoonlijk bouwt een ontwikkelaar een paar indicatoren die hij of zij nodig heeft, en draagt deze bij aan het project in een nieuwe Data Mine!",
                "updated": 1669552608362
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Community Data Mines Book is where you may find all existing data mines and their indicators! Each chapter in the book corresponds to a Data Mine...",
            "updated": 1616233302089,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il Community Data Mines Book è dove puoi trovare tutti i data mines esistenti e i loro indicatori. Ogni capitolo del libro corrisponde a una Data Mine...",
                    "updated": 1619592437976,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El Community Data Mines Book es donde puedes encontrar todas los Data Mines y sus indicadores. Cada capítulo del libro corresponde a un Data Mine...",
                    "updated": 1628024715026,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Im  Community Data Mines Buch finden Sie alle bestehenden Data Mines und ihre Indikatoren! Jedes Kapitel des Buches entspricht einer Data Mine...",
                    "updated": 1634590455084
                },
                {
                    "language": "TR",
                    "text": "Topluluk Veri Madenleri Kitabı ( Community Data Mines Book ), mevcut tüm veri madenlerini ve göstergelerini bulabileceğiniz yerdir! Kitaptaki her bölüm bir Veri Madenine ( Data Mine ) karşılık gelir...",
                    "updated": 1639836612445
                },
                {
                    "language": "RU",
                    "text": "Книга Community Data Mines - это место, где вы можете найти все существующие сборщики данных и их индикаторы! Каждая глава в книге соответствует добыче данных...",
                    "updated": 1640877157320
                },
                {
                    "language": "ID",
                    "text": "Community Data Mines Book adalah tempat kamu dapat menemukan semua data mines yang ada dan indikatornya! Setiap chapters dalam buku ini sesuai dengan Data Mine...",
                    "updated": 1645561764976
                },
                {
                    "language": "NL",
                    "text": "In het Community Data Mines Book vindt u alle bestaande data mines en hun indicatoren! Elk hoofdstuk in het boek komt overeen met een Data Mine...",
                    "updated": 1669552651465
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Scan the contents of each chapter to get an idea of what is available at this point!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Dai un'occhiata al contenuto dei capitoli per avere un'idea su cosa sia disponibile al momento!",
                    "updated": 1619592485175,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Escanea el contenido de cada capítulo para saber de lo que está disponible en este momento!",
                    "updated": 1628023653141,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Scannen Sie den Inhalt jedes Kapitels, um eine Vorstellung davon zu bekommen, was an dieser Stelle verfügbar ist!",
                    "updated": 1634590467643
                },
                {
                    "language": "TR",
                    "text": "Bu noktada hangi indikatörlerin olduğuna dair bir fikir edinmek için her bölümün içeriğini inceleyin!",
                    "updated": 1639836749476
                },
                {
                    "language": "RU",
                    "text": "Просмотрите содержание каждой главы, чтобы получить представление о том, что доступно на данный момент!",
                    "updated": 1640877218761
                },
                {
                    "language": "ID",
                    "text": "Pindai isi setiap chapter untuk mendapatkan gambaran tentang apa yang tersedia pada titik ini!",
                    "updated": 1645561755033
                },
                {
                    "language": "NL",
                    "text": "Lees de inhoud van elk hoofdstuk om een idee te krijgen van wat er op dit moment beschikbaar is!",
                    "updated": 1669552669273
                }
            ]
        },
        {
            "style": "Success",
            "text": "To use a Data Mine, you must include it in the workspace or as a plugin, and install the market. All Data Tasks will be created automatically!",
            "updated": 1616235254167,
            "translations": [
                {
                    "language": "IT",
                    "text": "Per usare una Data Mine,, includila nel workspace o come plugin, e installa il market. Tutti i Data Tasks verranno creati automaticamente!",
                    "updated": 1619592631191,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Para usar un Data Mine, debes incluirlo en el espacio de trabajo o como complemento e instalar el mercado. ¡Todas las tareas de datos se crearán automáticamente!",
                    "updated": 1628024742935,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Um eine Data Mine zu verwenden, müssen Sie sie in den Workspace oder als Plugin einbinden und den Markt installieren. Alle Data Tasks werden dann automatisch erstellt!",
                    "updated": 1634590473687
                },
                {
                    "language": "TR",
                    "text": "Bir Veri Madeni ( Data Mine ) kullanmak için, onu çalışma alanına bir eklenti olarak dahil etmeli ve marketi kurmalısınız. Tüm Veri Görevleri ( Data Task ) otomatik olarak oluşturulacaktır!",
                    "updated": 1639836804563
                },
                {
                    "language": "RU",
                    "text": "Чтобы использовать Data Mine, вы должны включить его в рабочее пространство или как плагин и установить рынок. Все задачи Data Tasks будут созданы автоматически!",
                    "updated": 1640877259977
                },
                {
                    "language": "ID",
                    "text": "Untuk menggunakan Data Mine, kamu harus memasukkannya di workspace atau sebagai plugin, dan menginstal market. Semua Data Tasks akan dibuat secara otomatis!",
                    "updated": 1645561819588
                },
                {
                    "language": "NL",
                    "text": "Om een Data Mine te gebruiken, moet u deze in de werkruimte of als plugin opnemen, en de markt installeren. Alle Data Tasks worden automatisch gemaakt!",
                    "updated": 1669552746945
                }
            ]
        }
    ]
}