{
    "tutorial": "Basic Education",
    "pageNumber": 47,
    "type": "Tutorial Step - Improving a Plugin",
    "definition": {
        "text": "Let's say you are a developer and are testing a new exchange. You wish to modify the Sensor Bot to introduce a new feature or param.",
        "icon": {
            "name": "sensor-bot",
            "project": "Foundations"
        },
        "updated": 1615996858987,
        "translations": [
            {
                "language": "IT",
                "text": "Mettiamo che sei uno sviluppatore che testa un nuovo exchange, e vuoi modificare il Sensor Bot introducendo un nuovo parametro.",
                "updated": 1619590703521,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si eres un desarrollador y estás probando un nuevo exchange. Deseas modificar el Sensor Bot para introducir una nueva característica o parámetro.",
                "updated": 1626710809333
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Sensor Bot is part of the Candles Data Mine, which is usually included as a plugin in most plugin workspaces. In such a case, you must proceed like in the previous case: enable saving and get to work! You can find your new modified file in the Plugins\\Data-Mines folder as if it was a backup.",
            "updated": 1628350435675,
            "translations": [
                {
                    "language": "IT",
                    "text": "Quel bot è parte del Master Data Mine, che è incluso come plugin nella maggior parte dei plugin workspace. In questo caso, procedi come nel caso precedente: cancella il nodo Plugin File del Mastart Data Mine e ripristina il file dalla cartella Plugins\\Data-Mines come fosse un Backup.",
                    "updated": 1619590793878,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El Sensor Bot es parte del Candles Data Mine, que generalmente se incluye como plugin en la mayoría de los workspaces de plugins. En tal caso, debes proceder como en el caso anterior: eliminar el nodo Plugin File correspondiente a los  Candles Data Mine y restaurar el archivo de mina de datos desde la carpeta   Plugins\\Data-Mines como si fuera un backup.",
                    "updated": 1626709343670
                }
            ]
        },
        {
            "style": "Success",
            "text": "Once you finish, submit a PR to contribute the improvements on the bot!",
            "updated": 1628350465749,
            "translations": [
                {
                    "language": "IT",
                    "text": "Una volta finito, fai un backup del nuovo nodo Masters Data Mine e usalo per rimpiazzare il plugin file Masters! Assicurati di dargli lo stesso nome. Poi, apri una Pull Request per contribuire al miglioramento del bot!",
                    "updated": 1619590866081,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Toma un backup de los modificados nodos Candles Data Mine y usa el archivo de respaldo para reemplazar el archivo Candles plugin! ¡Asegúrate de darle el mismo nombre! Luego, envía un PR para contribuir con las mejoras en el bot.",
                    "updated": 1626710763189
                }
            ]
        }
    ]
}