{
    "tutorial": "Basic Education",
    "pageNumber": 41,
    "type": "Tutorial Step - How Plugins Work",
    "definition": {
        "text": "Find the Plugin Trading Systems node inside the Algorithmic Trading project and expand it! Note the Plugin File node named Masters-Lightning-Strike...",
        "icon": {
            "name": "expand-structure-of-nodes",
            "project": "Foundations"
        },
        "updated": 1636303001726,
        "translations": [
            {
                "language": "IT",
                "text": "Cerca il nodo Plugin Trading Systems e espandilo! Vedrai un nodo Plugin File chiamato Masters-Lightning-Strike...",
                "updated": 1619554497047,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Encuentra el nodo Plugin Trading Systemsy y expandelo! Nota el nodo del archivo Plugin llamado Masters-Lightning-Strike...",
                "updated": 1626641150426,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Suchen Sie den Knoten Plugin Trading Systems und erweitern Sie ihn! Beachten Sie den Plugin-Datei-Knoten namens Masters-Lightning-Strike...",
                "updated": 1634588528149
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Lightning Strike is the demo Trading System you've been playing with during the Welcome tutorial. It has been placed as a plugin in this workspace!",
            "updated": 1615924603782,
            "translations": [
                {
                    "language": "IT",
                    "text": "Lightning Strike è il Trading System demo che hai utilizzato nel Welcome Tutorial. È incluso in questo workspace come plugin!",
                    "updated": 1619554546740,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Lightning Strike es la demo Trading System con la que has estado jugando durante el Welcome tutorial. Se ha colocado como plugin en este workspace!",
                    "updated": 1626642058733,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Lightning Strike ist das Demo Trading System, mit dem Sie während des Willkommens-Tutorials gespielt haben. Es wurde als Plugin in diesem Workspace platziert!",
                    "updated": 1634588533500
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Follow the orange dotted line downwards until you find the node it connects to! Use the keyboard trick Ctrl + arrows to go faster!",
            "updated": 1615919519995,
            "translations": [
                {
                    "language": "IT",
                    "text": "Segui la linea tratteggiata arancione finchè trovi il nodo a cui si connette! Usa i tasti Ctrl + frecce sulla tastiera per andare più veloce!",
                    "updated": 1619554592294,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Sige la línea de puntos naranja hacia abajo hasta que encuentre el nodo al que se conecta. Usa el truco del teclado Ctrl + flechas para ir más rápido!",
                    "updated": 1626642159336,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Folgen Sie der orange gepunkteten Linie nach unten, bis Sie den Knoten finden, mit dem es verbunden ist! Benutzen Sie den Tastaturtrick Ctrl + Pfeile, um schneller zu werden!",
                    "updated": 1634588564331
                }
            ]
        },
        {
            "style": "Text",
            "text": "That's it! You found the Lightning Strike Trading System node. If you drag it to the side, you will find the Plugin File Position node below.",
            "updated": 1615919373745,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ben fatto! Hai trovato il nodo Lightning Strike Trading System. Se lo trascini a lato, troverai il nodo Plugin File Position.",
                    "updated": 1619554669930,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¡Eso es! Encontraste el nodo Lightning Strike Trading System. Si lo arrastras hacia un lado, encontrarás el nodo Plugin File Position debajo.",
                    "updated": 1626642259700,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Das war's! Sie haben den Knoten Lightning Strike Trading System gefunden. Wenn Sie ihn zur Seite ziehen, finden Sie darunter den Knoten Plugin File Position.",
                    "updated": 1634588578954
                }
            ]
        }
    ]
}