{
    "tutorial": "Basic Education",
    "pageNumber": 52,
    "type": "Tutorial Step - About Other Markets",
    "definition": {
        "text": "You may work with any of the markets listed at the exchange! Take a look at the setup in the Exchange Markets node!",
        "icon": {
            "name": "Market\\market",
            "project": "Foundations"
        },
        "updated": 1616176775093,
        "translations": [
            {
                "language": "IT",
                "text": "Puoi lavorare con ogni market presente sull'exchange! Dai un'occhiata al setup del nodo Exchange Markets.",
                "updated": 1619591894634,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Puedes trabajar con cualquiera de los mercados listados en el exchange! ¡Echa un vistazo a la configuración en el nodo Exchange Markets!",
                "updated": 1628020751758,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Sie können mit jedem der an der Börse gelisteten Märkte arbeiten! Werfen Sie einen Blick auf die Einrichtung im Knoten Exchange Markets!",
                "updated": 1634590229826
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I'm not going to explain how to set up new markets as the topic is covered in the Install a New Market Tutorial in the Install a New Market Tutorial Plugin Workspace. I just wanted to let you know that it's easy!",
            "updated": 1622635572968,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non tratterò la cosa nel dettaglio, perchè ci penserà il tutorial Install a New Market Tutorial nel Tested Exchanges Plugin Workspace. Voglio solo dirti quanto sia facile!",
                    "updated": 1619591965876,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "No voy a explicar cómo configurar nuevos mercados, ya que el tema se trata en Install a New Market Tutorial in the Install a New Market Tutorial Plugin Workspace. ¡Solo quería hacerte saber que es fácil!",
                    "updated": 1628020854073,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Ich werde nicht erklären, wie man neue Märkte einrichtet, da das Thema im Tutorial Install a New Market Tutorial im the Install a New Market Tutorial Plugin Workspace behandelt wird. Ich wollte Sie nur wissen lassen, dass es ganz einfach ist!",
                    "updated": 1634590236889
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Take a look at the menu of the BTC/USDT Market! Notice the \"Install Market\" and \"Uninstall Market\" buttons! That's how you do it!",
            "updated": 1622378122769,
            "translations": [
                {
                    "language": "IT",
                    "text": "Guarda il menù del market BTC\\USDT, e trova i pulsanti Install Market e Uninstall Market. Ecco come si fa!",
                    "updated": 1619592006493,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Eche un vistazo al menú del mercado BTC/USDT! Observe los botones \"Install Market\" y \"Uninstall Market\" . ¡Asi es como lo haces!",
                    "updated": 1628021245760,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Werfen Sie einen Blick auf das Menü des BTC/USDT-Marktes! Beachten Sie die Schaltflächen  \"Install Market\" und \"Uninstall Market\"! So machen Sie es!",
                    "updated": 1634590245917
                }
            ]
        },
        {
            "style": "Success",
            "text": "I'll leave it at that and let you do the Install a New Market Tutorial when the time is right!",
            "updated": 1616176871622,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non mi addentro oltre, lo farà Install a New Market Tutorial in seguito!",
                    "updated": 1619592082998,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "¡Lo dejaré así y te dejaré hacer el Install a New Market Tutorial cuando sea tu tiempo!",
                    "updated": 1628021318712,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": " Ich lasse es dabei bewenden und überlasse Ihnen das Install a New Market Tutorial, wenn die Zeit reif ist!",
                    "updated": 1634590252957
                }
            ]
        }
    ]
}