{
    "tutorial": "Basic Education",
    "pageNumber": 27,
    "type": "Tutorial Step - Is It Done?",
    "definition": {
        "text": "If you haven't yet, go ahead and establish a reference from the Trading System Reference to the Lightning Strike Trading System!",
        "updated": 1615808208398,
        "icon": {
            "name": "trading-system",
            "project": "Algorithmic-Trading"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Se non lo hai già fatto, stabilisci una reference dal Trading System Reference al Lightning Strike Trading System!",
                "updated": 1619502021908,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si aún no lo has hecho, sigue adelante y establece una referencia del Trading System Reference al Lightning Strike Trading System!",
                "updated": 1675376832812,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wenn Sie es noch nicht getan haben, stellen Sie einen Trading System Reference zum  Lightning Strike Trading System her!",
                "updated": 1634334724601
            },
            {
                "language": "TR",
                "text": "Henüz yapmadıysanız, devam edin ve Trading System Reference düğümünden,Lightning Strike Trading System düğümüne bir referans oluşturun!",
                "updated": 1639561668806
            },
            {
                "language": "RU",
                "text": "Если вы еще не сделали этого, перейдите по ссылке из Trading System Reference в торговую систему Lightning Strike!",
                "updated": 1640870261141
            },
            {
                "language": "ID",
                "text": "Jika belum, lakukanlah dan buat referensi dari Trading System Reference ke Lightning Strike Trading System!",
                "updated": 1644949362631
            },
            {
                "language": "NL",
                "text": "Als je dat nog niet hebt gedaan, ga je gang en creëer een referentie van de Trading System Reference naar het Lightning Strike Trading System!",
                "updated": 1669542467400
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may find this technique to establish a reference to be a bit clumsy or impractical. The truth is it works well in some contexts, and not that great in others. The challenges to establishing references are:",
            "updated": 1687794843590,
            "translations": [
                {
                    "language": "IT",
                    "text": "Forse troverai questa tecnica per creare le reference un po' caotica o poco pratica. Se hai idee su come migliorarla, apri pure una feature request issue su Github. Considerà però quanto segue:",
                    "updated": 1619502100883,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Puedes encontrar que esta técnica para establecer una referencia sea un poco torpe o poco práctica. Si tienes una idea mejor o sabes cómo mejorarla, no dudes en abrir un <i>issue</i> de solicitud de función. Asegúrese de tener en cuenta lo siguiente:",
                    "updated": 1675376873016,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Vielleicht finden Sie diese Methode, einen Verweis zu erstellen, etwas ungeschickt oder unpraktisch. Wenn Sie eine bessere Idee haben oder wissen, wie man sie verbessern kann, können Sie gerne eine Funktionsanfrage stellen. Beachten Sie bitte Folgendes:",
                    "updated": 1634334734634
                },
                {
                    "language": "TR",
                    "text": "Referans oluşturmak için bu teknik biraz hantal veya pratik olmayabilir. Daha iyi bir fikriniz varsa veya nasıl geliştireceğinizi biliyorsanız, bu konuda fikrinizi bize ulaştırmaktan çekinmeyin.Bunu yaparkenaAşağıdakileri dikkate aldığınızdan emin olun:",
                    "updated": 1639561720192
                },
                {
                    "language": "RU",
                    "text": "Возможно, вы сочтете этот метод создания ссылки несколько неуклюжим или непрактичным. Если у вас есть идея получше или вы знаете, как ее улучшить, не стесняйтесь, откройте вопрос о запросе функции. Убедитесь, что вы учли следующее:",
                    "updated": 1640870284394
                },
                {
                    "language": "ID",
                    "text": "Kamu mungkin menemukan teknik ini untuk membuat referensi menjadi sedikit janggal atau tidak praktis. Jika kamu memiliki ide yang lebih baik atau tahu cara memperbaikinya, jangan ragu untuk membuka fitur request issue. Pastikan kamu mempertimbangkan yang berikut ini:",
                    "updated": 1644949461178
                },
                {
                    "language": "NL",
                    "text": "Misschien vindt u deze techniek om een referentie vast te stellen een beetje onhandig of onpraktisch. Als u een beter idee heeft of weet hoe u het kunt verbeteren, kunt u een nieuw functieverzoek openen. Zorg ervoor dat u rekening houdt met het volgende:",
                    "updated": 1669542518350
                }
            ]
        },
        {
            "style": "List",
            "text": "In a complex workspace, there may be hundreds of nodes that may be able to accept a reference.",
            "translations": [
                {
                    "language": "IT",
                    "text": "In un workspace complesso, centinaia di nodi potrebbero accettare una reference.",
                    "updated": 1619502129280,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "En un espacio de trabajo complejo, puede haber cientos de nodos que puedan aceptar una referencia.",
                    "updated": 1626541444738,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "In einem komplexen Workspace kann es Hunderte von Knoten geben, die eine Referenz akzeptieren können.",
                    "updated": 1634334744672
                },
                {
                    "language": "TR",
                    "text": "Karmaşık bir çalışma alanında, bir referans oluşturabileceğiniz yüzlerce düğüm olabilir.",
                    "updated": 1639561802732
                },
                {
                    "language": "RU",
                    "text": "В сложном рабочем пространстве могут быть сотни узлов, которые могут принимать ссылку.",
                    "updated": 1640870320552
                },
                {
                    "language": "ID",
                    "text": "Di workspace yang kompleks, mungkin ada ratusan node yang mungkin dapat menerima referensi.",
                    "updated": 1644949490752
                },
                {
                    "language": "NL",
                    "text": "In een complexe werkruimte kunnen er honderden knooppunten zijn die een referentie kunnen accepteren.",
                    "updated": 1669542533566
                }
            ]
        },
        {
            "style": "List",
            "text": "The reference must be established unequivocally from a specific node to another specific node.",
            "updated": 1615808355918,
            "translations": [
                {
                    "language": "IT",
                    "text": "La reference deve essere stabilita in modo univoco tra una coppia di nodi.",
                    "updated": 1619502166682,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "La referencia debe establecerse inequívocamente desde un nodo específico a otro nodo específico.",
                    "updated": 1626542624855,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Die Referenz muss eindeutig von einem bestimmten Knoten zu einem anderen bestimmten Knoten hergestellt werden.",
                    "updated": 1634334760002
                },
                {
                    "language": "TR",
                    "text": "Başvuru, belirli bir düğümden başka bir düğüme kesin olarak oluşturulmalıdır.",
                    "updated": 1639561860379
                },
                {
                    "language": "RU",
                    "text": "Ссылка должна быть однозначно установлена от конкретного узла к другому конкретному узлу.",
                    "updated": 1640870336304
                },
                {
                    "language": "ID",
                    "text": "Referensi harus dibuat secara tegas dari node tertentu ke node tertentu lainnya.",
                    "updated": 1644949516370
                },
                {
                    "language": "NL",
                    "text": "De verwijzing moet ondubbelzinnig tot stand komen van een specifiek knooppunt naar een ander specifiek knooppunt.",
                    "updated": 1669542556974
                }
            ]
        },
        {
            "style": "Success",
            "text": "We'll try an alternative method in the next step!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ti assicuro che comunque non è complicato se lo fai un paio di volte!",
                    "updated": 1619502186118,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "¡No es tan difícil una vez que lo haces un par de veces!",
                    "updated": 1626541754980,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "In der Zwischenzeit kann ich Ihnen versichern, dass es gar nicht so schwer ist, wenn Sie es ein paar Mal gemacht haben!",
                    "updated": 1634334766682
                },
                {
                    "language": "TR",
                    "text": "Bu arada, referans oluşturma işlemini birkaç kez yaptığınızda o kadar da zor olmadığını göreceksiniz.!",
                    "updated": 1639561910211
                },
                {
                    "language": "RU",
                    "text": "А пока позвольте заверить вас, что это не так уж и сложно, если сделать это несколько раз!",
                    "updated": 1640870349694
                },
                {
                    "language": "ID",
                    "text": "Sementara itu, izinkan aku meyakinkan kamu bahwa itu tidak sulit begitu kamu melakukannya beberapa kali!",
                    "updated": 1644949547584
                }
            ],
            "updated": 1687794882508
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}