{
    "tutorial": "Basic Education",
    "pageNumber": 28,
    "type": "Tutorial Step - Is It Done?",
    "definition": {
        "text": "If you haven't yet, go ahead and establish a reference from the Trading System Reference to the Lightning Strike Trading System!",
        "updated": 1615808208398,
        "icon": {
            "name": "trading-system",
            "project": "Algorithmic-Trading"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Se non lo hai già fatto, stabilisci una reference dal Trading System Reference al Lightning Strike Trading System!",
                "updated": 1619502021908,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si aún no lo ha hecho, sigue adelante y estableze una referencia del Trading System Reference al Lightning Strike Trading System!",
                "updated": 1626541349340,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wenn Sie es noch nicht getan haben, stellen Sie einen Trading System Reference zum  Lightning Strike Trading System her!",
                "updated": 1634334724601
            },
            {
                "language": "TR",
                "text": "Henüz yapmadıysanız, devam edin ve Trading System Reference düğümünden,Lightning Strike Trading System düğümüne bir referans oluşturun!",
                "updated": 1639561668806
            },
            {
                "language": "RU",
                "text": "Если вы еще не сделали этого, перейдите по ссылке из Trading System Reference в торговую систему Lightning Strike!",
                "updated": 1640870261141
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may find this technique to establish a reference to be a bit clumsy or impractical. If you have a better idea or know how to improve it, feel free to open a feature request issue. Make sure you consider the following:",
            "updated": 1615808367637,
            "translations": [
                {
                    "language": "IT",
                    "text": "Forse troverai questa tecnica per creare le reference un po' caotica o poco pratica. Se hai idee su come migliorarla, apri pure una feature request issue su Github. Considerà però quanto segue:",
                    "updated": 1619502100883,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Puedes encontrar que esta técnica para establecer una referencia sea un poco torpe o poco práctica. Si tiene una idea mejor o sabe cómo mejorarla, no dude en abrir un problema de solicitud de función. Asegúrese de tener en cuenta lo siguiente:",
                    "updated": 1626541405664,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Vielleicht finden Sie diese Methode, einen Verweis zu erstellen, etwas ungeschickt oder unpraktisch. Wenn Sie eine bessere Idee haben oder wissen, wie man sie verbessern kann, können Sie gerne eine Funktionsanfrage stellen. Beachten Sie bitte Folgendes:",
                    "updated": 1634334734634
                },
                {
                    "language": "TR",
                    "text": "Referans oluşturmak için bu teknik biraz hantal veya pratik olmayabilir. Daha iyi bir fikriniz varsa veya nasıl geliştireceğinizi biliyorsanız, bu konuda fikrinizi bize ulaştırmaktan çekinmeyin.Bunu yaparkenaAşağıdakileri dikkate aldığınızdan emin olun:",
                    "updated": 1639561720192
                },
                {
                    "language": "RU",
                    "text": "Возможно, вы сочтете этот метод создания ссылки несколько неуклюжим или непрактичным. Если у вас есть идея получше или вы знаете, как ее улучшить, не стесняйтесь, откройте вопрос о запросе функции. Убедитесь, что вы учли следующее:",
                    "updated": 1640870284394
                }
            ]
        },
        {
            "style": "List",
            "text": "In a complex workspace, there may be hundreds of nodes that may be able to accept a reference.",
            "translations": [
                {
                    "language": "IT",
                    "text": "In un workspace complesso, centinaia di nodi potrebbero accettare una reference.",
                    "updated": 1619502129280,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "En un espacio de trabajo complejo, puede haber cientos de nodos que puedan aceptar una referencia.",
                    "updated": 1626541444738,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "In einem komplexen Workspace kann es Hunderte von Knoten geben, die eine Referenz akzeptieren können.",
                    "updated": 1634334744672
                },
                {
                    "language": "TR",
                    "text": "Karmaşık bir çalışma alanında, bir referans oluşturabileceğiniz yüzlerce düğüm olabilir.",
                    "updated": 1639561802732
                },
                {
                    "language": "RU",
                    "text": "В сложном рабочем пространстве могут быть сотни узлов, которые могут принимать ссылку.",
                    "updated": 1640870320552
                }
            ]
        },
        {
            "style": "List",
            "text": "The reference must be established unequivocally from a specific node to another specific node.",
            "updated": 1615808355918,
            "translations": [
                {
                    "language": "IT",
                    "text": "La reference deve essere stabilita in modo univoco tra una coppia di nodi.",
                    "updated": 1619502166682,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "La referencia debe establecerse inequívocamente desde un nodo específico a otro nodo específico.",
                    "updated": 1626542624855,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Die Referenz muss eindeutig von einem bestimmten Knoten zu einem anderen bestimmten Knoten hergestellt werden.",
                    "updated": 1634334760002
                },
                {
                    "language": "TR",
                    "text": "Başvuru, belirli bir düğümden başka bir düğüme kesin olarak oluşturulmalıdır.",
                    "updated": 1639561860379
                },
                {
                    "language": "RU",
                    "text": "Ссылка должна быть однозначно установлена от конкретного узла к другому конкретному узлу.",
                    "updated": 1640870336304
                }
            ]
        },
        {
            "style": "Success",
            "text": "In the meantime, let me assure you it's not that hard once you do it a couple of times!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ti assicuro che comunque non è complicato se lo fai un paio di volte!",
                    "updated": 1619502186118,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "¡No es tan difícil una vez que lo haces un par de veces!",
                    "updated": 1626541754980,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "In der Zwischenzeit kann ich Ihnen versichern, dass es gar nicht so schwer ist, wenn Sie es ein paar Mal gemacht haben!",
                    "updated": 1634334766682
                },
                {
                    "language": "TR",
                    "text": "Bu arada, referans oluşturma işlemini birkaç kez yaptığınızda o kadar da zor olmadığını göreceksiniz.!",
                    "updated": 1639561910211
                },
                {
                    "language": "RU",
                    "text": "А пока позвольте заверить вас, что это не так уж и сложно, если сделать это несколько раз!",
                    "updated": 1640870349694
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}