{
    "tutorial": "Basic Education",
    "pageNumber": 40,
    "type": "Tutorial Step - Let's Talk Plugins",
    "definition": {
        "text": "Plugins are data structures that ship with the system and that you may call into any workspace using the Plugins hierarchy.",
        "updated": 1615914003358,
        "icon": {
            "name": "plugins",
            "project": "Community-Plugins"
        },
        "translations": [
            {
                "language": "IT",
                "text": "I Plugins sono strutture di dati incluse nel sistema e che puoi integrare in ogni workspace usando l'apposita gerarchia.",
                "updated": 1619554267111,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Plugins son estructuras de datos que se envían con el sistema y que puede llamar a cualquier espacio de trabajo utilizando la jerarquía de Plugins.",
                "updated": 1626622977338,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Plugins sind Datenstrukturen, die mit dem System geliefert werden und die Sie über die Plugins-Hierarchie in jedem Workspace aufrufen können.",
                "updated": 1634588386781
            },
            {
                "language": "TR",
                "text": "Eklentiler ( Plugins ) , sistemle birlikte gelen ve Eklentiler hiyerarşisini ( Plugins Hierrarchy ) kullanarak herhangi bir çalışma alanına çağırabileceğiniz veri yapılarıdır.",
                "updated": 1639767098656
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Plugins are data structures meant to be reused. That is why they ship as plugins, so that you may place them on any workspace.",
            "updated": 1615917170964,
            "translations": [
                {
                    "language": "IT",
                    "text": "I Plugins sono creati per essere riutilizzabili. Per questo motivo sono progettati per essere integrati in qualsiasi workspace.",
                    "updated": 1619554339495,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Plugins son estructuras de datos destinadas a ser reutilizadas. Es por eso que se envían como plugins, para que puedas colocarlos en cualquier Workspace.",
                    "updated": 1626620113069,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Plugins sind Datenstrukturen, die wiederverwendet werden sollen. Aus diesem Grund werden sie als Plugins ausgeliefert, so dass Sie sie in jedem Workspace platzieren können.",
                    "updated": 1634588379363
                },
                {
                    "language": "TR",
                    "text": "Eklentiler ( Plugins ), yeniden kullanılması amaçlanan veri yapılarıdır. Bu nedenle, herhangi bir çalışma alanına yerleştirebilmeniz için eklenti olarak menüde yer alırlar.",
                    "updated": 1639767154794
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Expand the Plugins node!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Espandi il nodo Plugins!",
                    "updated": 1619554350367,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Amplia el nodo Plugins!",
                    "updated": 1626619242709,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Erweitern Sie den Knoten Plugins!",
                    "updated": 1634588371523
                },
                {
                    "language": "TR",
                    "text": "Plugins düğümünü genişletin!",
                    "updated": 1639767179987
                }
            ]
        },
        {
            "style": "Text",
            "text": "As you can tell from the structure of the hierarchy, there are several types of plugins! They ship as JSON files, sorted by type in the plugins folder. Check it out!",
            "updated": 1615917052972,
            "translations": [
                {
                    "language": "IT",
                    "text": "Come vedi dalla struttura della gerarchia, ci sono diversi tipi di plugins! Sono salvati in appositi files JSON in una cartella di riferimento. Dai un'occhiata!",
                    "updated": 1619554435988,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Como puede deducirse de la estructura de la jerarquía, existen varios tipos de plugins! Se envían como archivos JSON, ordenados por tipo en la carpeta de plugins. ¡Échale un vistazo!",
                    "updated": 1626619903123,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wie Sie an der Struktur der Hierarchie erkennen können, gibt es mehrere Arten von Plugins! Sie werden als JSON-Dateien ausgeliefert, die nach Typ im Plugins-Ordner sortiert sind. Probieren Sie es aus!",
                    "updated": 1634588393321
                },
                {
                    "language": "TR",
                    "text": "Hiyerarşinin yapısından da anlayabileceğiniz gibi, çeşitli eklenti türleri vardır! Eklentiler klasöründe türe göre sıralanmış JSON dosyaları olarak bulunurlar. Eklentiler düğümünü keşfetmekten çekinme!",
                    "updated": 1639767248787
                }
            ]
        },
        {
            "style": "Json",
            "text": "\\Projects\\Foundations\\Plugins",
            "updated": 1615916283983
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}