{
    "tutorial": "Basic Education",
    "pageNumber": 37,
    "type": "Tutorial Step - Working with Workspaces",
    "definition": {
        "text": "You may think of a workspace as a stage in a theatre. It is the setting on which something will play out!",
        "icon": {
            "name": "workspace",
            "project": "Foundations"
        },
        "updated": 1615893942449,
        "translations": [
            {
                "language": "IT",
                "text": "Puoi vedere il Workspace come il palco di un teatro. È il luogo dove qualcosa andrà in scena!",
                "updated": 1619546463150,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Puedes pensar en un espacio de trabajo (Workspace) como en el escenario de un teatro. ¡Es el escenario en el que se desarrollará algo!",
                "updated": 1675377305053,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Sie können sich einen Workspace wie eine Bühne im Theater vorstellen. Er ist der Rahmen, auf dem sich etwas abspielt!",
                "updated": 1634587175719
            },
            {
                "language": "TR",
                "text": "Çalışma alanını bir tiyatro sahnesi olarak düşünebilirsiniz. Herhangi birşey ile oynayabileceğiniz bir yer.",
                "updated": 1639743696784
            },
            {
                "language": "RU",
                "text": "Вы можете представить себе рабочее пространство как сцену в театре. Это окружение, на котором что-то будет происходить!",
                "updated": 1640871697395
            },
            {
                "language": "ID",
                "text": "Kamu mungkin menganggap workspace sebagai panggung di teater. Ini adalah pengaturan di mana sesuatu akan dimainkan!",
                "updated": 1645033779536
            },
            {
                "language": "NL",
                "text": "U kunt een werkruimte zien als een podium in een theater. Het is de setting waarop iets zich zal afspelen!",
                "updated": 1669545321890
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may set up as many workspaces as you like, each of them for specific use cases. For example:",
            "updated": 1615904641004,
            "translations": [
                {
                    "language": "IT",
                    "text": "Puoi configurare quanti workspace vuoi, ognuno per uno specifico utilizzo. Per esempio:",
                    "updated": 1619546502168,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Puedes configurar tantos espacios de trabajo como desees, cada uno de ellos para casos de uso específicos. Por ejemplo:",
                    "updated": 1675377335778,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie können so viele Workspaces einrichten, wie Sie möchten, jeder davon für einen bestimmten Anwendungsfall. Zum Beispiel:",
                    "updated": 1634587186919
                },
                {
                    "language": "TR",
                    "text": "Her biri farklı kullanım durumları için istediğiniz kadar çalışma alanı oluşturabilirsiniz. Örneğin:",
                    "updated": 1639745440768
                },
                {
                    "language": "RU",
                    "text": "Вы можете создать столько рабочих пространств, сколько пожелаете, каждое из которых предназначено для определенных случаев использования. Например:",
                    "updated": 1640871711776
                },
                {
                    "language": "ID",
                    "text": "Kamu dapat mengatur workspaces sebanyak yang kamu suka, dengan masing-masing untuk kasus serta penggunaan khusus. Sebagai contoh:",
                    "updated": 1645033835786
                },
                {
                    "language": "NL",
                    "text": "U kunt zoveel werkruimten instellen als u wilt, elk voor specifieke gebruikssituaties. Bijvoorbeeld:",
                    "updated": 1669545336118
                }
            ]
        },
        {
            "style": "List",
            "text": "You may have a workspace to build a Trading System that will need specific indicators from a specific Data Mine.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Puoi usare uno workspace per costruire un Trading System che ha bisogno di specifici indicatori da specifici Data Mine. ",
                    "updated": 1666639607726,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Puedes tener un espacio de trabajo para construir un Trading System que necesitará indicadores específicos de un Data Mine.",
                    "updated": 1675377351234,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Sie können einen Workspace einrichten, um ein Trading System aufzubauen, das bestimmte Indikatoren aus einer bestimmten Data Mine benötigt.",
                    "updated": 1634587193298
                },
                {
                    "language": "TR",
                    "text": "Belirli bir Veri Madeninden ( Data Mine ) belirli göstergelere ihtiyaç duyacak bir Ticaret Sistemi ( Trading System ) oluşturmak için bir çalışma alanı oluşturabilirsiniz.",
                    "updated": 1639745526299
                },
                {
                    "language": "RU",
                    "text": "У вас может быть рабочее пространство для построения торговой системы, для которой потребуются определенные индикаторы из конкретных Data Mine.",
                    "updated": 1640871745307
                },
                {
                    "language": "ID",
                    "text": "Kamu mungkin memiliki workspace untuk membangun Trading System yang akan membutuhkan indikator spesifik dari spesifik  Data Mine.",
                    "updated": 1645033917389
                },
                {
                    "language": "NL",
                    "text": "Mogelijk hebt u een werkruimte om een Trading System te bouwen waarvoor specifieke indicatoren van een specifieke Data Mine nodig zijn.",
                    "updated": 1669545372385
                }
            ],
            "updated": 1622374580811
        },
        {
            "style": "List",
            "text": "You may have another workspace setup with all the available indicators so that you may study how each of them works.",
            "updated": 1615904707330,
            "translations": [
                {
                    "language": "IT",
                    "text": "Puoi avere un altro workspace con tutti gli indicatori disponibili così da studiare come funziona ognuno di essi.",
                    "updated": 1619546609509,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Puedes tener otra configuración de espacio de trabajo con todos los indicadores disponibles para que puedas estudiar cómo funciona cada uno de ellos.",
                    "updated": 1675377362524,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Sie können einen anderen Workspace mit allen verfügbaren Indikatoren einrichten, damit Sie die Funktionsweise jedes einzelnen Indikators studieren können.",
                    "updated": 1634587201243
                },
                {
                    "language": "TR",
                    "text": "Her birinin nasıl çalıştığını inceleyebilmeniz için mevcut tüm göstergelere sahip başka bir çalışma alanı kurulumunuz olabilir.",
                    "updated": 1639745549535
                },
                {
                    "language": "RU",
                    "text": "Вы можете настроить еще одно рабочее пространство со всеми доступными индикаторами, чтобы изучить, как работает каждый из них.",
                    "updated": 1640871761029
                },
                {
                    "language": "ID",
                    "text": "Kamu mungkin memiliki pengaturan workspace lain dengan semua indikator yang tersedia sehingga kamu dapat mempelajari cara kerja masing-masing.",
                    "updated": 1645033950889
                },
                {
                    "language": "NL",
                    "text": "Mogelijk hebt u een andere opstelling van de werkruimte met alle beschikbare indicatoren, zodat u kunt bestuderen hoe elk van hen werkt.",
                    "updated": 1669545395198
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Read this page to learn the basics about how to deal with workspaces...",
            "updated": 1615904777283,
            "translations": [
                {
                    "language": "IT",
                    "text": "Leggi questa pagina per imparare le basi su come lavorare con i workspaces...",
                    "updated": 1619546636057,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Lee esta página y aprende los conceptos básicos sobre cómo manejar los espacios de trabajo...",
                    "updated": 1626618939242,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Lesen Sie diese Seite, um die Grundlagen über den Umgang mit Workspaces zu erfahren...",
                    "updated": 1634587206424
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanlarıyla nasıl başa çıkılacağına ilişkin temel bilgileri öğrenmek için bu sayfayı okuyun... Workspaces",
                    "updated": 1639746575260
                },
                {
                    "language": "RU",
                    "text": "Прочитайте эту страницу, чтобы узнать основы работы с рабочими пространствами...",
                    "updated": 1640871822987
                },
                {
                    "language": "ID",
                    "text": "Baca halaman ini untuk mempelajari dasar-dasar tentang cara berurusan dengan workspaces...",
                    "updated": 1645033977060
                },
                {
                    "language": "NL",
                    "text": "<b>Lees deze pagina om de basis te leren over hoe om te gaan met werkruimten...</b>",
                    "updated": 1669545427471
                }
            ]
        }
    ]
}