{
    "tutorial": "Basic Education",
    "pageNumber": 54,
    "type": "Tutorial Step - More Indicators?",
    "definition": {
        "text": "Indicators are built by the Community! Usually, a developer will build a few indicators he or she needs, and contribute them to the project in a new Data Mine!",
        "updated": 1616235133472,
        "icon": {
            "name": "data-mine",
            "project": "Data-Mining"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Gli Indicators sono costruiti dalla community! Solitamente uno sviluppatore costruisce gli indicatori di cui ha bisogno, e contribuisce al progetto con una nuova Data Mine!",
                "updated": 1619592382827,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Los indicadores los construye la comunidad! Un desarrollador construirá indicadores que necesita y los aportará al proyecto en una nueva mina de datos.",
                "updated": 1628024771860,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Indikatoren werden von der Community erstellt! Normalerweise baut ein Entwickler ein paar Indikatoren, die er oder sie braucht, und stellt sie dem Projekt in einer neuen Data Mine zur Verfügung!",
                "updated": 1634590447390
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Community Data Mines Book is where you may find all existing data mines and their indicators! Each chapter in the book corresponds to a Data Mine...",
            "updated": 1616233302089,
            "translations": [
                {
                    "language": "IT",
                    "text": "Il Community Data Mines Book è dove puoi trovare tutti i data mines esistenti e i loro indicatori. Ogni capitolo del libro corrisponde a una Data Mine...",
                    "updated": 1619592437976,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El Community Data Mines Book es donde puedes encontrar todas los Data Mines y sus indicadores. Cada capítulo del libro corresponde a un Data Mine...",
                    "updated": 1628024715026,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Im  Community Data Mines Buch finden Sie alle bestehenden Data Mines und ihre Indikatoren! Jedes Kapitel des Buches entspricht einer Data Mine...",
                    "updated": 1634590455084
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Scan the contents of each chapter to get an idea of what is available at this point!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Dai un'occhiata al contenuto dei capitoli per avere un'idea su cosa sia disponibile al momento!",
                    "updated": 1619592485175,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Escanea el contenido de cada capítulo para saber de lo que está disponible en este momento!",
                    "updated": 1628023653141,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Scannen Sie den Inhalt jedes Kapitels, um eine Vorstellung davon zu bekommen, was an dieser Stelle verfügbar ist!",
                    "updated": 1634590467643
                }
            ]
        },
        {
            "style": "Success",
            "text": "To use a Data Mine, you must include it in the workspace or as a plugin, and install the market. All Data Tasks will be created automatically!",
            "updated": 1616235254167,
            "translations": [
                {
                    "language": "IT",
                    "text": "Per usare una Data Mine,, includila nel workspace o come plugin, e installa il market. Tutti i Data Tasks verranno creati automaticamente!",
                    "updated": 1619592631191,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Para usar un Data Mine, debes incluirlo en el espacio de trabajo o como complemento e instalar el mercado. ¡Todas las tareas de datos se crearán automáticamente!",
                    "updated": 1628024742935,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Um eine Data Mine zu verwenden, müssen Sie sie in den Workspace oder als Plugin einbinden und den Markt installieren. Alle Data Tasks werden dann automatisch erstellt!",
                    "updated": 1634590473687
                }
            ]
        }
    ]
}