{
    "tutorial": "Basic Education",
    "pageNumber": 36,
    "type": "Tutorial Step - Only Share Shares!",
    "definition": {
        "text": "Shares are just like Backups, but the resulting file is stripped off sensitive personal information!",
        "icon": {
            "name": "share-entity",
            "project": "Foundations"
        },
        "updated": 1617037759268,
        "translations": [
            {
                "language": "IT",
                "text": "Le Shares sono come i Backups, ma dal file vengono rimossi i dati personali e sensibili!",
                "updated": 1619546242891,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Shares son como Backups, ¡pero al archivo resultante se le quita la información personal confidencial!",
                "updated": 1626618089488,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Shares sind wie Backups, aber die resultierende Datei ist frei von sensiblen persönlichen Informationen!",
                "updated": 1634586443245
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Get used to sharing Shares! This good practice will help you avoid dangerous mistakes in the future!",
            "updated": 1622374504966,
            "translations": [
                {
                    "language": "IT",
                    "text": "Abituati al loro utilizzo! È una buona pratica per evitare possibili errori pericolosi in futuro!",
                    "updated": 1619546289258,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Acostúmbrate a compartir Shares. ¡Esta buena práctica te ayudará a evitar errores peligrosos en el futuro!",
                    "updated": 1626618451384,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Gewöhnen Sie sich daran, Shares zu teilen! Diese gute Praxis wird Ihnen helfen, in Zukunft gefährliche Fehler zu vermeiden!",
                    "updated": 1634586450108
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Read the page about Shares for more info!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Leggi la pagina sulle Shares per maggiori info!",
                    "updated": 1619546300806,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Leer la página sobre Shares para más información!",
                    "updated": 1626618230044,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Lesen Sie die Seite über Shares für weitere Informationen!",
                    "updated": 1634586458598
                }
            ]
        },
        {
            "style": "Warning",
            "text": "Whenever you wish to share your work, never share your Workspace files or Backups. Those files may contain sensitive information such as your Exchange Account Key. Instead, share your Shares!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Quando vuoi condividere il tuo lavoro, non condividere mai i tuoi Workspace o Backups. Questi file possono contenere informazioni sensibili, come la tua Exchange Account Key. Piuttosto, condividi le tue Shares!",
                    "updated": 1619546375019,
                    "style": "Warning"
                },
                {
                    "language": "ES",
                    "text": "Siempre que desees compartir tu trabajo, nunca compartas tus archivos Workspace o Backups. Pueden contener información confidencial como tu Exchange Account Key. En cambio, comparte tus Shares!",
                    "updated": 1626618429538,
                    "style": "Warning"
                },
                {
                    "language": "DE",
                    "text": "Wann immer Sie Ihre Arbeit freigeben möchten, geben Sie niemals Ihre Workspace Dateien oder Backups frei. Diese Dateien können sensible Informationen wie Ihren Exchange Account Key enthalten. Geben Sie stattdessen Ihre Shares frei!",
                    "updated": 1634586464169
                }
            ]
        }
    ]
}