{
    "tutorial": "Basic Education",
    "pageNumber": 40,
    "type": "Tutorial Step - Let's Talk Plugins",
    "definition": {
        "text": "Plugins are data structures that ship with the system and that you may call into any workspace using the Plugins hierarchy.",
        "updated": 1615914003358,
        "icon": {
            "name": "plugins",
            "project": "Community-Plugins"
        },
        "translations": [
            {
                "language": "IT",
                "text": "I Plugins sono strutture di dati incluse nel sistema e che puoi integrare in ogni workspace usando l'apposita gerarchia.",
                "updated": 1619554267111,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Los Plugins son estructuras de datos que se envían con el sistema y que puede llamar a cualquier espacio de trabajo utilizando la jerarquía de Plugins.",
                "updated": 1675377516565,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Plugins sind Datenstrukturen, die mit dem System geliefert werden und die Sie über die Plugins-Hierarchie in jedem Workspace aufrufen können.",
                "updated": 1634588386781
            },
            {
                "language": "TR",
                "text": "Eklentiler ( Plugins ) , sistemle birlikte gelen ve Eklentiler hiyerarşisini ( Plugins Hierrarchy ) kullanarak herhangi bir çalışma alanına çağırabileceğiniz veri yapılarıdır.",
                "updated": 1639767098656
            },
            {
                "language": "RU",
                "text": "Плагины (Plugins) - это структуры данных, которые поставляются вместе с системой и которые вы можете вызывать в любом рабочем пространстве с помощью иерархии Plugins.",
                "updated": 1640873263568
            },
            {
                "language": "ID",
                "text": "Plugin adalah struktur data yang dikirimkan bersama sistem dan kamu dapat memanggil ke workspace manapun menggunakan Plugins hierarchy.",
                "updated": 1645035554043
            },
            {
                "language": "NL",
                "text": "Plugins zijn gegevensstructuren die bij het systeem worden geleverd en die u kunt aanroepen in elke werkruimte met behulp van de Plugins hiërarchie.",
                "updated": 1669545883008
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Plugins are data structures that are meant to be reused. That is why they ship as plugins, so that you may place them on any workspace.",
            "updated": 1615917170964,
            "translations": [
                {
                    "language": "IT",
                    "text": "I Plugins sono creati per essere riutilizzabili. Per questo motivo sono progettati per essere integrati in qualsiasi workspace.",
                    "updated": 1619554339495,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Los Plugins son estructuras de datos destinadas a ser reutilizadas. Es por eso que se envían como plugins, para que puedas colocarlos en cualquier Workspace.",
                    "updated": 1675377521792,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Plugins sind Datenstrukturen, die wiederverwendet werden sollen. Aus diesem Grund werden sie als Plugins ausgeliefert, so dass Sie sie in jedem Workspace platzieren können.",
                    "updated": 1634588379363
                },
                {
                    "language": "TR",
                    "text": "Eklentiler ( Plugins ), yeniden kullanılması amaçlanan veri yapılarıdır. Bu nedenle, herhangi bir çalışma alanına yerleştirebilmeniz için eklenti olarak menüde yer alırlar.",
                    "updated": 1639767154794
                },
                {
                    "language": "RU",
                    "text": "Плагины - это структуры данных, предназначенные для повторного использования. Именно поэтому они поставляются в виде плагинов, чтобы вы могли разместить их на любом рабочем пространстве.",
                    "updated": 1640873283703
                },
                {
                    "language": "ID",
                    "text": "Plugin adalah struktur data yang dimaksudkan untuk digunakan kembali. Itulah sebabnya dikirim sebagai plugin, sehingga kamu dapat menempatkannya di workspace manapun.",
                    "updated": 1645035650373
                },
                {
                    "language": "NL",
                    "text": "Plugins zijn datastructuren die bedoeld zijn om hergebruikt te worden. Daarom worden ze geleverd als plugins, zodat u ze op elke werkruimte kunt plaatsen.",
                    "updated": 1669545908504
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Expand the Plugins node!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Espandi il nodo Plugins!",
                    "updated": 1619554350367,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Amplia el nodo Plugins!",
                    "updated": 1626619242709,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Erweitern Sie den Knoten Plugins!",
                    "updated": 1634588371523
                },
                {
                    "language": "TR",
                    "text": "Plugins düğümünü genişletin!",
                    "updated": 1639767179987
                },
                {
                    "language": "RU",
                    "text": "Разверните узел Plugins!",
                    "updated": 1640873292273
                },
                {
                    "language": "ID",
                    "text": "Perluas node Plugin!",
                    "updated": 1645035669748
                },
                {
                    "language": "NL",
                    "text": "Vouw het knooppunt Plugins uit!",
                    "updated": 1669545927685
                }
            ]
        },
        {
            "style": "Text",
            "text": "As you can tell from the structure of the hierarchy, there are several types of plugins! They ship as JSON files, sorted by Project and type in the plugins folder. Check it out!",
            "updated": 1649174495914,
            "translations": [
                {
                    "language": "IT",
                    "text": "Come puoi vedere dalla struttura della gerarchia, ci sono diversi tipi di plugin! Vengono spediti come file JSON, ordinati per Project e scritti nella cartella dei plugin.",
                    "updated": 1666640107286,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Como se puede deducir de la estructura de la jerarquía, ¡hay varios tipos de Plugins! Se envían como archivos JSON, ordenados por proyecto y tipo en la carpeta de plugins. ¡Compruébalo!",
                    "updated": 1675377553724,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wie Sie an der Struktur der Hierarchie erkennen können, gibt es mehrere Arten von Plugins! Sie werden als JSON-Dateien ausgeliefert, die nach Typ im Plugins-Ordner sortiert sind. Probieren Sie es aus!",
                    "updated": 1634588393321
                },
                {
                    "language": "TR",
                    "text": "Hiyerarşinin yapısından da anlayabileceğiniz gibi, çeşitli eklenti türleri vardır! Eklentiler klasöründe Proje ve türe göre sıralanmış JSON dosyaları olarak gönderilirler. Bir göz atın!",
                    "updated": 1666103751444
                },
                {
                    "language": "RU",
                    "text": "Как видно из структуры иерархии, существует несколько типов плагинов! Они поставляются в виде JSON файлов, отсортированных по проекту и типу в папке plugins. Проверьте это!",
                    "updated": 1661377667089
                },
                {
                    "language": "ID",
                    "text": "Seperti yang kamu tahu dari struktur hierarki, ada beberapa jenis plugin! Mereka mengirim sebagai file JSON, diurutkan berdasarkan jenis di folder plugin. Coba lihat!",
                    "updated": 1645035703122
                },
                {
                    "language": "NL",
                    "text": "Zoals je kunt zien aan de structuur van de hiërarchie, zijn er verschillende soorten plugins! Ze worden verzonden als JSON-bestanden, gesorteerd op Project en type in de map plugins. Ga het maar eens bekijken!",
                    "updated": 1669546014089
                }
            ]
        },
        {
            "style": "Json",
            "text": "\\Plugins",
            "updated": 1649174519153
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}