{
    "tutorial": "Basic Education",
    "pageNumber": 39,
    "type": "Tutorial Step - The Current Workspace",
    "definition": {
        "text": "The current workspace is the User Workspace or the Native Workspace you are using at any point.",
        "icon": {
            "name": "workspace",
            "project": "Foundations"
        },
        "updated": 1629895521103,
        "translations": [
            {
                "language": "IT",
                "text": "Il workspace corrente è lo User Workspace o il Native Workspace in uso al momento.",
                "updated": 1666639905870,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "El espacio de trabajo actual es el espacio de trabajo de usuario o el espacio de trabajo de plugin que estés utilizando en cualquier momento.",
                "updated": 1675377464308,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Der aktuelle Workspace ist der User Workspace oder der Native Workspace, den Sie gerade verwenden.",
                "updated": 1634587888849
            },
            {
                "language": "TR",
                "text": "Şu anki çalışma alanı, herhangi bir noktada kullandığınız Kullanıcı Çalışma Alanı ( User Workspace ) veya Eklenti Çalışma Alanıdır ( Native Workspace ).\n",
                "updated": 1639766680038
            },
            {
                "language": "RU",
                "text": "Текущее рабочее пространство - это рабочее пространство пользователя (User Workspace) или рабочее пространство плагина (Native Workspace), которое вы используете в данный момент.",
                "updated": 1640873140025
            },
            {
                "language": "ID",
                "text": "Workspace saat ini adalah User Workspace atau Native Workspace yang kamu gunakan kapan saja.",
                "updated": 1645034616173
            },
            {
                "language": "NL",
                "text": "De huidige werkruimte is de User Workspace of de Native Workspace die u op enig moment gebruikt.",
                "updated": 1669545656096
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If you close and restart the app, or refresh the UI, the system loads the workspace that was last in use.",
            "updated": 1615907362014,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se chiudi e riapri l'app, o aggiorni la UI, il sistema carica l'ultimo workspace utilizzato.",
                    "updated": 1619553925670,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Si cierras y reinicias la aplicación, o actualizas el User Interface, el sistema carga el ultimo Workspace usado.",
                    "updated": 1626622914590,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie die Anwendung schließen und neu starten oder die Benutzeroberfläche UI aktualisieren, lädt das System den zuletzt verwendeten Workspace.",
                    "updated": 1634587898657
                },
                {
                    "language": "TR",
                    "text": "Uygulamayı kapatıp yeniden başlatırsanız veya kullanıcı arayüzünü ( UI ) yenilerseniz, sistem en son kullanımda olan çalışma alanını yükler.",
                    "updated": 1639766730029
                },
                {
                    "language": "RU",
                    "text": "Если вы закрываете и перезапускаете приложение или обновляете пользовательский интерфейс, система загружает рабочее пространство, которое использовалось в последний раз.",
                    "updated": 1640873164889
                },
                {
                    "language": "ID",
                    "text": "Jika kamu menutup dan me-restart aplikasi, atau menyegarkan UI, sistem memuat workspace yang terakhir digunakan.",
                    "updated": 1645034652877
                },
                {
                    "language": "NL",
                    "text": "Als u de app sluit en opnieuw start of de UI vernieuwt, laadt het systeem de werkruimte die het laatst in gebruik was.",
                    "updated": 1669545681058
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Access the menu of the Workspace node, double-click on the \"Getting Started Tutorials\" label and change it to \"Basic Education\".",
            "updated": 1622375773294,
            "translations": [
                {
                    "language": "IT",
                    "text": "Vai al menù del nodo Workspace, fai doppio click sull'etichetta Getting Started e cambia il nome del workspace in \"Basic Education\".",
                    "updated": 1666639957957,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Accede al menú del nodo Workspace, doble clic en la etiqueta  \"Getting Started Tutorials\" y cámbialo a \"Basic Education\".",
                    "updated": 1626621401640,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Rufen Sie das Menü des Knotens Workspace auf, doppelklicken Sie auf die Bezeichnung \"Getting Started Tutorials\" und ändern Sie sie in \"Basic Education\".",
                    "updated": 1634587910330
                },
                {
                    "language": "TR",
                    "text": "Workspace düğümünün menüsünü açın, \"Gettşing Started Tutorial\" etiketine çift tıklayın ve \"Basic Education\" olarak değiştirin.",
                    "updated": 1639766836285
                },
                {
                    "language": "RU",
                    "text": "Войдите в меню узла Workspace, дважды щелкните по ярлыку \"Getting Started Tutorials\" и измените его на \"Basic Education\".",
                    "updated": 1640873189495
                },
                {
                    "language": "ID",
                    "text": "Akses menu node Workspace, klik dua kali pada label \"Getting Started Tutorials\" dan ubah menjadi \"Basic Education\".",
                    "updated": 1645034772611
                },
                {
                    "language": "NL",
                    "text": "Open het menu van het Workspace Node, dubbelklik op het label \"Getting Started Tutorials\" en wijzig dit in \"Basic Education\".",
                    "updated": 1669545708960
                }
            ]
        },
        {
            "style": "Text",
            "text": "Now hit Ctrl + Shift + Alt + Key-S",
            "updated": 1615907276880,
            "translations": [
                {
                    "language": "IT",
                    "text": "Poi premi Ctrl + Shift + Alt + Key-S",
                    "updated": 1619553982192,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Ahora presiona  Ctrl + Shift + Alt + Key-S",
                    "updated": 1626621439639,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Drücken Sie nun Ctrl + Shift + Alt + Key-S",
                    "updated": 1634587951733
                },
                {
                    "language": "TR",
                    "text": "Ve bu tuş kombinasyonunu kullanarak çalışma alanınızı kaydedin:  Ctrl + Shift + Alt + Key-S",
                    "updated": 1639766873790
                },
                {
                    "language": "RU",
                    "text": "Теперь нажмите Ctrl + Shift + Alt + Key-S",
                    "updated": 1640873199684
                },
                {
                    "language": "ID",
                    "text": "Sekarang tekan Ctrl + Shift + Alt + Key-S",
                    "updated": 1645034781934
                },
                {
                    "language": "NL",
                    "text": "Druk nu op Ctrl + Shift + Alt + <kbd>Toets-S</kbd>",
                    "updated": 1669545762147
                }
            ]
        },
        {
            "style": "Success",
            "text": "Go to the Platform/My-Workspaces folder to verify the new file is there. Find it on the menu too!",
            "updated": 1687799579776,
            "translations": [
                {
                    "language": "IT",
                    "text": "Vai alla cartella My-Workspaces per verificare che il nuovo file sia lì. Trovalo anche nel menù degli spazi di lavoro",
                    "updated": 1666640010928,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Ve a la carpeta My-Workspaces para verificar que el nuevo archivo está allí. ¡Encuéntralo también en la pestaña de espacios de trabajo!",
                    "updated": 1626622475717,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Gehen Sie zum Ordner My-Workspaces , um zu überprüfen, ob die neue Datei dort vorhanden ist. Sie finden sie auch auf der Registerkarte Workspaces !",
                    "updated": 1634587938906
                },
                {
                    "language": "TR",
                    "text": "Yeni dosyanın orada olduğunu doğrulamak için Dosya gezgininizde Superalgos klasörünün altında, az önce verdilen yolu kontrol edin. ",
                    "updated": 1639766984680
                },
                {
                    "language": "RU",
                    "text": "Перейдите в папку My-Workspaces, чтобы убедиться, что новый файл находится там. Найдите его также на вкладке Workspaces!",
                    "updated": 1640873230589
                },
                {
                    "language": "ID",
                    "text": "Buka folder My-Workspaces untuk memverifikasi file baru apakah ada di sana. Temukan di workspaces tab juga!",
                    "updated": 1645034841207
                },
                {
                    "language": "NL",
                    "text": "Ga naar de map My-Workspaces om te controleren of het nieuwe bestand aanwezig is. Je zult het ook vinden op het tabblad workspaces!",
                    "updated": 1669545815696
                }
            ]
        }
    ]
}