{
    "tutorial": "Basic Education",
    "pageNumber": 57,
    "type": "Tutorial Step - Your Graduation",
    "definition": {
        "text": "Congratulations! You've graduated from your Basic Education and are ready to move on to more advanced stuff!",
        "updated": 1616262672256,
        "icon": {
            "name": "Trading\\trading-strategy",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Congratulazioni! Ti sei laureato in Basic Education e sei pronto a tuffarti in materie più avanzate!",
                "updated": 1619592957336,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Felicidades! Te has graduado de tu Basic Education Tutorial y estas listo para pasar a cosas más avanzadas!",
                "updated": 1675378876499,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Herzlichen Glückwunsch! Sie haben Ihre Grundausbildung abgeschlossen und sind nun bereit für fortgeschrittenere Dinge!",
                "updated": 1634590980526
            },
            {
                "language": "TR",
                "text": "Tebrikler! Temel Eğitiminden mezun oldunuz ve daha ileri seviyelere geçmeye hazırsınız!",
                "updated": 1639837530748
            },
            {
                "language": "RU",
                "text": "Поздравляем! Вы закончили базовое обучение и готовы перейти к более сложным вещам!",
                "updated": 1640877555296
            },
            {
                "language": "ID",
                "text": "Selamat! Kamu telah lulus dari  Basic Education kamu dan siap untuk beralih ke hal-hal yang lebih maju!",
                "updated": 1645562463593
            },
            {
                "language": "NL",
                "text": "Gefeliciteerd! Je bent afgestudeerd voor je Basic Education en bent klaar om door te gaan naar meer geavanceerde dingen!",
                "updated": 1669553215582
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "In the next tutorial you are going to learn how to update your app, switch branches to test the version in the develop branch, a few tricks about the Docs, and more!",
            "updated": 1616262918705,
            "translations": [
                {
                    "language": "IT",
                    "text": "Nel prossimo tutorial imparerai come aggiornare la tua app, cambiare branch per testare la versione in sviluppo, trucchi sui Docs e altro!",
                    "updated": 1619593005138,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "En el siguiente tutorial, aprenderás cómo actualizar tu aplicación, cambiar de rama para probar la versión en la rama de desarrollo, algunos trucos sobre los Documentos y más.",
                    "updated": 1628033834427,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Im nächsten Tutorial werden Sie lernen, wie Sie Ihre Anwendung aktualisieren, den Zweig wechseln, um die Version im Entwicklungszweig zu testen, ein paar Tricks zu den Docs und vieles mehr!",
                    "updated": 1634590987001
                },
                {
                    "language": "TR",
                    "text": "Sonraki eğitimde uygulamanızı nasıl güncelleyeceğinizi, geliştirme dalındaki sürümü test etmek için dalları nasıl değiştireceğinizi, Dokümanlar hakkında birkaç püf noktası ve daha fazlasını öğreneceksiniz!",
                    "updated": 1639837561573
                },
                {
                    "language": "RU",
                    "text": "В следующем уроке вы узнаете, как обновлять приложение, переключаться между ветками для тестирования версии в ветке develop, несколько хитростей, связанных с Docs, и многое другое!",
                    "updated": 1640877589274
                },
                {
                    "language": "ID",
                    "text": "Dalam tutorial berikutnya kamu akan belajar cara memperbarui aplikasi kamu, beralih branches untuk menguji versi di branches develop version, beberapa trik tentang Docs, dan banyak lagi!",
                    "updated": 1645562518766
                },
                {
                    "language": "NL",
                    "text": "In de volgende zelfstudie leer je hoe je je app kunt updaten, van branches kunt wisselen om de versie in de ontwikkelomgeving te testen, een paar trucs over de Docs, en meer!",
                    "updated": 1669553254718
                }
            ]
        },
        {
            "style": "Callout",
            "text": "You'll also be able submit a review about your experience with Superalgos up to this point!",
            "updated": 1616262935170,
            "translations": [
                {
                    "language": "IT",
                    "text": "Potrai anche scrivere una recensione sulla tua esperienza in Superalgos finora!",
                    "updated": 1619593027426,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡También podrás enviar una reseña sobre tu experiencia con Superalgos hasta este momento!",
                    "updated": 1628033856097,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Sie werden auch die Möglichkeit haben, einen Bericht über Ihre bisherigen Erfahrungen mit Superalgos zu verfassen!",
                    "updated": 1634590998253
                },
                {
                    "language": "TR",
                    "text": "Ayrıca bu noktaya kadar Superalgos ile olan deneyiminiz hakkında bir inceleme gönderebileceksiniz!",
                    "updated": 1639837576185
                },
                {
                    "language": "RU",
                    "text": "Вы также сможете оставить отзыв о своем опыте работы с Superalgos на данный момент!",
                    "updated": 1640877621521
                },
                {
                    "language": "ID",
                    "text": "Kamu juga dapat mengirimkan ulasan tentang pengalaman Kamu dengan Superalgos hingga saat ini!",
                    "updated": 1645562541153
                },
                {
                    "language": "NL",
                    "text": "Je kunt ook een beoordeling geven over je ervaring met Superalgos tot nu toe!",
                    "updated": 1669553271901
                }
            ]
        },
        {
            "style": "Success",
            "text": "As you progress with Superalgos, you may need a refresher on the topics covered in this tutorial or the one before! That is a standard practice, so do come back until you learn all tricks!",
            "updated": 1616263081822,
            "translations": [
                {
                    "language": "IT",
                    "text": "Man mano che procedi in Superalgos, potresti aver bisogno di un ripasso sui topic affrontati in questo tutorial o in quello prima. È normale, puoi tornare quando vuoi finchè non impari tutti i trucchi!",
                    "updated": 1619593078538,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "A medida que avanzas, es posible que necesites un repaso de los temas tratados en este tutorial o en el anterior. Esa es una práctica estándar, ¡así que regresa hasta que aprendas todos los trucos!",
                    "updated": 1675378906043,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie mit Superalgos weiterkommen, brauchen Sie vielleicht eine Auffrischung der Themen, die in diesem oder dem vorherigen Tutorial behandelt wurden! Das ist eine gängige Praxis, also kommen Sie wieder, bis Sie alle Tricks gelernt haben!",
                    "updated": 1634591004640
                },
                {
                    "language": "TR",
                    "text": "Superalgos ile ilerlerken, bu eğitimde veya bir öncekinde ele alınan konularda tazelemeye ihtiyacınız olabilir! Bu standart bir uygulamadır, bu yüzden tüm püf noktalarını öğrenene kadar tekrar etmeyi ihmal etmeyin!",
                    "updated": 1639837606771
                },
                {
                    "language": "RU",
                    "text": "По мере освоения Superalgos вам может понадобиться освежить в памяти темы, затронутые в этом или предыдущем уроке! Это обычная практика, так что возвращайтесь, пока не выучите все хитрости!",
                    "updated": 1640877652521
                },
                {
                    "language": "ID",
                    "text": "Saat berprogress maju dengan Superalgos, kamu mungkin perlu merefresh pada topik yang dibahas dalam tutorial ini atau yang sebelumnya! Itu adalah praktik standar, jadi kembalilah sampai kamu mempelajari semua trik!",
                    "updated": 1645562599862
                },
                {
                    "language": "NL",
                    "text": "Naarmate je vordert met Superalgos, heb je misschien een opfriscursus nodig over de onderwerpen die in deze zelfstudie of de vorige worden behandeld! Dat is een standaardpraktijk, dus kom terug totdat je alle trucs hebt geleerd!",
                    "updated": 1669553307966
                }
            ]
        }
    ]
}