{
    "tutorial": "Basic Education",
    "pageNumber": 42,
    "type": "Tutorial Step - Positioning Plugins",
    "definition": {
        "text": "Here's the crazy bit... the Plugin File Position node determines where in the workspace the plugin is placed!",
        "updated": 1615921131447,
        "icon": {
            "name": "plugin-file-position",
            "project": "Community-Plugins"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Il nodo Plugin File Position determina dove sarà posizionato il nodo nel workspace!",
                "updated": 1619554715666,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Aquí está la locura... el nodo Plugin File Position determina en qué parte del workspace el plugin es colocado.",
                "updated": 1626642524737,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Jetzt kommt der verrückte Teil... der Knoten Plugin File Position bestimmt, wo im Workspace das Plugin platziert wird!",
                "updated": 1634588642076
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "That is why you found the Trading System node on top of the Plugin File Position node!",
            "updated": 1615920675491,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ecco perchè trovi il nodo Trading System sopra il nodo Plugin File Position!",
                    "updated": 1619554752815,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¡Por eso encontraste el nodo Trading System en la parte superior del nodo Plugin File Position!",
                    "updated": 1626642599727,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Aus diesem Grund finden Sie den Knoten Trading System über dem Knoten Plugin File Position!",
                    "updated": 1634588653804
                }
            ]
        },
        {
            "style": "Success",
            "text": "If you deleted the Trading System node, it would show up again the next time you reload the workspace! Plugins are loaded from the plugin file every time the workspace is loaded!",
            "updated": 1615920995477,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se cancelli il nodo Trading System, ricomparirà la prossima volta che ricarichi il workspace. I Plugins sono caricati dal file plugin ogni volta che il workspace viene caricato!",
                    "updated": 1619554795779,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "¡Si eliminas el nodo Trading System, volvería a aparecer la próxima vez que recargues el workspace!¡Plugins se cargan desde el archivo plugin cada vez que se carga el workspace!",
                    "updated": 1626642734045,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie den Knoten Trading System löschen, erscheint er wieder, wenn Sie den Workspace das nächste Mal neu laden! Plugins werden jedes Mal aus der Plugin-Datei geladen, wenn der Workspace geladen wird!",
                    "updated": 1634588661690
                }
            ]
        },
        {
            "style": "Text",
            "text": "Feel free to try it! If so you wish, you may delete the Trading System node and refresh the page. Bear in mind that you will need to find the Basic Education Tutorial and click Resume on the menu to continue!",
            "updated": 1622376059637,
            "translations": [
                {
                    "language": "IT",
                    "text": "Prova, se vuoi! Puoi anche cancellare il nodo Trading System e aggiornare la pagina. Tieni a mente che per continuare da qui dovrai cercare il Basic Education Tutorial e cliccare Resume sul menù!",
                    "updated": 1619554844566,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¡No dudes en probarlo! Si lo desea, puedes eliminar el nodo Trading System y actualiza la página. Ten en cuenta que deberás encontrar el Basic Education Tutorial y hacer clic en Resume en el menú para continuar!",
                    "updated": 1626642833516,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Probieren Sie es einfach aus! Wenn Sie möchten, können Sie den Knoten Trading System löschen und die Seite neu laden. Denken Sie daran, dass Sie das Tutorial zur Grundausbildung finden und im Menü auf Fortsetzen klicken müssen, um fortzufahren!",
                    "updated": 1634588669393
                }
            ]
        }
    ]
}