{
    "tutorial": "Basic Education",
    "pageNumber": 11,
    "type": "Tutorial Step - Play With The Tape!",
    "definition": {
        "text": "Try the different distance settings of the Lightning Strike Trading System Reference node! Go ahead! Click the tape button!",
        "icon": {
            "name": "Trading\\trading-system-reference",
            "project": "Foundations"
        },
        "updated": 1615476811627,
        "translations": [
            {
                "language": "IT",
                "text": "Prova differenti impostazioni per la distanza del nodo Trading System Reference! Cliccai il tasto con il metro!",
                "updated": 1619460658554,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Prueba los diferentes ajustes de distancia del nodo Lightning Strike Trading System Reference. ¡Adelante! ¡Haz clic en el botón de cinta!",
                "updated": 1625957648227,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Probieren Sie die verschiedenen Entfernungseinstellungen des Lightning Strike Trading System Reference Knoten aus! Machen Sie weiter! Klicken Sie auf die Schaltfläche mit dem \"Maßband\"!",
                "updated": 1634332512924
            },
            {
                "language": "TR",
                "text": "Lightning Strike Ticaret Sistemi Referans düğümünün ( Trading System Reference Node ) farklı mesafe ayarlarını deneyin! Devam edelim! Bant düğmesine tıklayın!",
                "updated": 1636749363536
            },
            {
                "language": "RU",
                "text": "Попробуйте различные настройки расстояния в узле Lightning Strike Trading System Reference! Вперед! Нажмите на кнопку в виде рулетки!",
                "updated": 1640866617814
            },
            {
                "language": "ID",
                "text": "Coba pilihan lain pengaturan Distance to Parent dari node Lightning Strike Trading System Reference ! Cobalah! Clik tombol tape-nya!",
                "updated": 1643473899607
            },
            {
                "language": "NL",
                "text": "Probeer de verschillende afstandsinstellingen van het Lightning Strike Trading System Reference knooppunt! Doe Maar! Klik op de tape-knop!",
                "updated": 1668336095301
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Pretty straightforward, right? Now, what happens when the node you are adjusting has offspring of its own?",
            "updated": 1615476877641,
            "translations": [
                {
                    "language": "IT",
                    "text": "Facile, no? E che succede quando i nodi che stai regolando hanno a loro volta dei figli?",
                    "updated": 1619460693659,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Bastante sencillo, Ahora bien, ¿qué sucede cuando el nodo que estás ajustando tiene descendencia propia?",
                    "updated": 1675375659411,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Ziemlich einfach, oder? Was passiert nun, wenn der Knoten, den Sie einstellen, selbst Ableger hat?",
                    "updated": 1634332545887
                },
                {
                    "language": "TR",
                    "text": "Oldukça basit, değil mi? Şimdi, ayarladığınız düğümün kendi yavruları olduğunda ne olur ona bakalım.",
                    "updated": 1636749391543
                },
                {
                    "language": "RU",
                    "text": "Довольно просто, верно? Теперь, что произойдет, если узел, который вы настраиваете, имеет собственное потомство?",
                    "updated": 1640866634862
                },
                {
                    "language": "ID",
                    "text": "Cukup mudah, benar? Sekarang, apa yang terjadi ketika node yang kamu sesuaikan memiliki turunannya sendiri?",
                    "updated": 1643353705305
                },
                {
                    "language": "NL",
                    "text": "Vrij eenvoudig, toch? Wat gebeurt er als het knooppunt dat u aanpast, zelf sub-knooppunten heeft?",
                    "updated": 1668336125708
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Let's find out! Click the Distance to Parent button once on the Trading Parameters node!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Scopriamolo! Clicca una volta il bottone Distance To Parent sul nodo Trading Parameters!",
                    "updated": 1619460737845,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Vamos a averiguar! Haz clic en el botón \"Distance to Parent\" una vez en el nodo Trading Parameters!",
                    "updated": 1675375672935,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Finden wir es heraus! Klicken Sie einmal auf die Schaltfläche Abstand zum Übergeordneten Knoten auf den Knoten Trading Parameters !",
                    "updated": 1634332609115
                },
                {
                    "language": "TR",
                    "text": "Hadi bulalım! İşlem Parametreleri ( Trading Parameters ) düğümünde Ebeveyne Uzaklık ( Distance To Parent ) düğmesine bir kez tıklayın!",
                    "updated": 1636749475116
                },
                {
                    "language": "RU",
                    "text": "Давайте узнаем! Нажмите кнопку Distance to Parent один раз на узле Trading Parameters!",
                    "updated": 1640866666986
                },
                {
                    "language": "ID",
                    "text": "Mari kita cari tahu! Klik tombol Distance to Parent sekali di node Trading Parameters!",
                    "updated": 1643353717357
                },
                {
                    "language": "NL",
                    "text": "Laten we het uitzoeken! Klik eenmaal op de knop Distance to Parent op het knooppunt Trading Parameters!",
                    "updated": 1668336179730
                }
            ]
        },
        {
            "style": "Note",
            "text": "Because you increased the distance separating the Trading Parameters node from the Backtesting Session node, the offspring of the Trading Parameters node also increased proportionally!",
            "updated": 1615476086180,
            "translations": [
                {
                    "language": "IT",
                    "text": "Siccome hai aumentato la distanza che separa il nodo Trading Parameters dal nodo Backtesting Session, la distanza dei figli del nodo Trading Parameters è aumentata allo stesso modo!",
                    "updated": 1619460842878,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Debido a que aumentó la distancia que separa el nodo Trading Parameters del nodo Backtesting Session, la descendencia del nodo Trading Parameters también aumentó proporcionalmente.",
                    "updated": 1625957905179,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Da Sie den Abstand zwischen dem Trading Parameters Knoten und dem Backtesting Session Knoten vergrößert haben, haben sich auch die Unterknoten des Trading Parameters Knotens proportional vergrößert!",
                    "updated": 1634332645315
                },
                {
                    "language": "TR",
                    "text": "İşlem Parametreleri düğümünü Geri Test Oturumu (Backtesting Session Node ) düğümünden ayıran mesafeyi artırdığınız için, İşlem Parametreleri ( Trading Parameters ) düğümünün yavruları da orantılı olarak arttı!",
                    "updated": 1636749564919
                },
                {
                    "language": "RU",
                    "text": "Поскольку вы увеличили расстояние, отделяющее узел Trading Parameters от узла Backtesting Session, потомство узла Trading Parameters также пропорционально увеличилось!",
                    "updated": 1640866688182
                },
                {
                    "language": "ID",
                    "text": "Karena kamu menambah jarak yang memisahkan node Trading Parameters dari node Backtesting Session, turunan node Trading Parameters juga bertambah secara proporsional!",
                    "updated": 1643353672230
                },
                {
                    "language": "NL",
                    "text": "Omdat u de afstand tussen het knooppunt Trading Parameters en het knooppunt Backtesting Session hebt vergroot, namen de sub-knooppunten van het knooppunt Trading Parameters ook proportioneel toe!",
                    "updated": 1668336231913
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}