{
    "tutorial": "Basic Education",
    "pageNumber": 26,
    "type": "Tutorial Step - Let's Get On With It!",
    "definition": {
        "text": "What if the nodes are far away from each other, maybe even in different hierarchies? Watch the video to learn a few tricks!",
        "updated": 1616098998366,
        "icon": {
            "name": "mouse-right-click",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "E se i nodi sono troppo lontani tra loro, magari in due diverse gerarchie? Guarda il video per imparare un paio di trucchi!",
                "updated": 1619501705796,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¿Qué pasa si los nodos están muy lejos unos de otros, tal vez incluso en diferentes jerarquías? ¡Mira el video y aprende algunos trucos!",
                "updated": 1626540840863,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Was tun, wenn die Knoten weit voneinander entfernt sind, vielleicht sogar in verschiedenen Hierarchien? Sehen Sie sich das Video an und lernen Sie ein paar Tricks!",
                "updated": 1634334595517
            },
            {
                "language": "TR",
                "text": "Ya Düğümler birbirinden çok uzaktaysa, hatta belki farklı hiyerarşilerdeyse? Birkaç püf noktası öğrenmek için videoyu izleyin!",
                "updated": 1639488625000
            },
            {
                "language": "RU",
                "text": "Что делать, если узлы находятся далеко друг от друга, возможно, даже в разных иерархиях? Посмотрите видео, чтобы узнать несколько приемов!",
                "updated": 1640869528063
            },
            {
                "language": "ID",
                "text": "Bagaimana jika node jauh dari satu sama lain, bahkan mungkin dalam hierarki yang berbeda? Tonton video untuk mempelajari beberapa trik!",
                "updated": 1644949084231
            },
            {
                "language": "NL",
                "text": "Wat als de knooppunten ver van elkaar verwijderd zijn, misschien zelfs in verschillende hiërarchieën? Bekijk de video om een paar trucjes te leren!",
                "updated": 1669542195152
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "These UI tricks may make your life easier:",
            "updated": 1615807543929,
            "translations": [
                {
                    "language": "IT",
                    "text": "Questi trucchi ti faciliteranno:",
                    "updated": 1619501769226,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Estos trucos UI pueden facilitarte la vida:",
                    "updated": 1675376809849,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Diese UI-Tricks können Ihnen das Leben leichter machen:",
                    "updated": 1634334609357
                },
                {
                    "language": "TR",
                    "text": "Bu UI ( User Interface ) hileleri hayatınızı kolaylaştırabilir:",
                    "updated": 1639488655612
                },
                {
                    "language": "RU",
                    "text": "Эти приемы пользовательского интерфейса могут облегчить вам жизнь:",
                    "updated": 1640869539046
                },
                {
                    "language": "ID",
                    "text": "Trik UI ini dapat membuat hidup kamu lebih mudah :",
                    "updated": 1644949107171
                },
                {
                    "language": "NL",
                    "text": "Deze UI-trucs kunnen uw leven gemakkelijker maken:",
                    "updated": 1669542210029
                }
            ]
        },
        {
            "style": "List",
            "text": "Pin the node you are going to move across the design space, so that it will stay where you drop it!",
            "updated": 1640097977030,
            "translations": [
                {
                    "language": "IT",
                    "text": "Fissa il nodo che sposterai attraverso lo spazio di progettazione, in modo che rimanga dove lo lasci cadere!",
                    "updated": 1666638912033,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Fija el nodo que vas a mover en el espacio de diseño para que se quede donde lo sueltes.",
                    "updated": 1675376701617,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Stecken Sie den Knoten, den Sie verschieben wollen, in den Entwurfsbereich, damit er dort bleibt, wo Sie ihn ablegen!",
                    "updated": 1641741319676
                },
                {
                    "language": "TR",
                    "text": "Taşıyacağınız düğümü tasarım alanı boyunca sabitleyin, böylece bıraktığınız yerde kalacaktır!",
                    "updated": 1666103508666
                },
                {
                    "language": "RU",
                    "text": "Закрепите узел, который вы собираетесь переместить, в пространстве проектирования, чтобы он остался там, куда вы его переместите!",
                    "updated": 1640869565155
                },
                {
                    "language": "ID",
                    "text": "Pin node kamu yang akan bergerak melintasi design space, sehingga akan tetap di tempat kamu menjatuhkannya!",
                    "updated": 1644949159572
                },
                {
                    "language": "NL",
                    "text": "Pin het knooppunt dat u over de ontwerpruimte gaat verplaatsen vast, zodat het blijft staan waar u het neerzet!",
                    "updated": 1669542234745
                }
            ]
        },
        {
            "style": "List",
            "text": "Click the \"Save node to be moved\" button on the node you wish to move.",
            "updated": 1640098072442,
            "translations": [
                {
                    "language": "IT",
                    "text": "Fare clic sul pulsante \"Save node to be moved\" sul nodo che vuoi spostare.",
                    "updated": 1666639012740,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Pulse el botón \" Save node to be moved \" en el nodo que desea mover.",
                    "updated": 1675376730128,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf die Schaltfläche \"Save node to be moved\" auf dem Knoten, den Sie verschieben möchten. ",
                    "updated": 1641741355901
                },
                {
                    "language": "TR",
                    "text": "Farenin sağ tuşu ile üzerine tıkladıktan sonra düğümü ekran boyunca sürüklemek için Windows'ta Ctrl + ok tuşları, Mac'te ise Cmd + ok tuşlarını kullanın. Taşımak istediğiniz düğümün üzerindeki \"Taşınacak düğümü kaydet\" düğmesine tıklayın.",
                    "updated": 1666103626627
                },
                {
                    "language": "RU",
                    "text": "Нажмите кнопку \"Save node to be moved\" на узле, который вы хотите переместить.",
                    "updated": 1640869596572
                },
                {
                    "language": "ID",
                    "text": "Klik tombol \"Save node to be moved\" pada node yang ingin kamu pindahkan.",
                    "updated": 1644949190021
                },
                {
                    "language": "NL",
                    "text": "Klik op de knop \"Save node to be moved\" op de node die u wilt verplaatsen.",
                    "updated": 1669542269472
                }
            ]
        },
        {
            "style": "List",
            "text": "Use the design space map to zoom out and click near the node to which you wish to travel. ",
            "updated": 1640098364795,
            "translations": [
                {
                    "language": "DE",
                    "text": "Verkleinern Sie die Karte des Designraums und klicken Sie in die Nähe des Knotens, zu dem Sie reisen möchten.",
                    "updated": 1641741272856
                },
                {
                    "language": "RU",
                    "text": "Используйте карту пространства проектирования для уменьшения масштаба и щелкните рядом с узлом, к которому вы хотите переместиться.",
                    "updated": 1640869613645
                },
                {
                    "language": "ID",
                    "text": "Gunakan map design space untuk memperkecil dan mengklik di dekat node yang ingin kamu kunjungi.",
                    "updated": 1644949228870
                },
                {
                    "language": "TR",
                    "text": "Uzaklaştırmak için tasarım alanı haritasını kullanın ve seyahat etmek istediğiniz düğümün yakınına tıklayın.",
                    "updated": 1654393826620,
                    "style": "List"
                },
                {
                    "language": "IT",
                    "text": "Usa la mappa dello spazio di progettazione per ridurre lo zoom e fai clic vicino al nodo verso il quale desideri spostarti.",
                    "updated": 1666639048273
                },
                {
                    "language": "NL",
                    "text": "Gebruik de ontwerpruimtekaart om uit te zoomen en klik in de buurt van het knooppunt waarnaar u wilt gaan.",
                    "updated": 1669542302896
                },
                {
                    "language": "ES",
                    "text": "Utiliza el \"Design Space Map\" para alejar la imagen y haz clic cerca del nodo al que deseas viajar.",
                    "updated": 1675376763391
                }
            ]
        },
        {
            "style": "List",
            "text": "Click \"Snap saved node to postion\" and the node you saved will magically appear on top of the node you are at!",
            "updated": 1640098421986,
            "translations": [
                {
                    "language": "DE",
                    "text": "Klicken Sie auf \"Gespeicherten Knoten an Position fangen\", und der gespeicherte Knoten erscheint auf magische Weise über dem Knoten, an dem Sie sich befinden!",
                    "updated": 1641741282424
                },
                {
                    "language": "RU",
                    "text": "Нажмите \" Snap saved node to postion\", и сохраненный вами узел волшебным образом появится поверх узла, на котором вы находитесь!",
                    "updated": 1640869638264
                },
                {
                    "language": "ID",
                    "text": "Klik \"Snap saved node to postion\" dan node yang kamu simpan akan secara ajaib muncul di atas node tempat kamu berada!",
                    "updated": 1644949264728
                },
                {
                    "language": "TR",
                    "text": "\"Kaydedilen düğümü konuma yapıştır\" seçeneğine tıkladığınızda kaydettiğiniz düğüm sihirli bir şekilde bulunduğunuz düğümün üzerinde belirecektir!",
                    "updated": 1654393832697,
                    "style": "List"
                },
                {
                    "language": "IT",
                    "text": "Clicca su \"Snap saved node to postion\" e il nodo che hai salvato apparirà magicamente sopra il nodo in cui ti trovi!",
                    "updated": 1666639078071
                },
                {
                    "language": "NL",
                    "text": "Klik op \"Snap saved node to position\" en het knooppunt dat je hebt opgeslagen, verschijnt op magische wijze bovenop het knooppunt waar je bent!",
                    "updated": 1669542342318
                },
                {
                    "language": "ES",
                    "text": "Haz clic en \" Snap saved node to postion\" y el nodo que has guardado aparecerá mágicamente encima del nodo en el que te encuentras.",
                    "updated": 1675376789200
                }
            ]
        },
        {
            "style": "List",
            "text": "Remove the pin once the reference is established so that the node goes back to its place.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Entfernen Sie die Stecknadel, sobald der Bezug hergestellt ist, damit der Knoten an seinen Platz zurückkehrt.",
                    "updated": 1641741288724
                },
                {
                    "language": "RU",
                    "text": "Удалите штифт после установления ссылки, чтобы узел вернулся на свое место.",
                    "updated": 1640870003951
                },
                {
                    "language": "ID",
                    "text": "Lepaskan pin setelah referensi dibuat sehingga node kembali ke tempatnya.",
                    "updated": 1644949283640
                },
                {
                    "language": "TR",
                    "text": "Düğümün yerine geri dönmesi için referans oluşturulduktan sonra pimi çıkarın.",
                    "updated": 1654393838746,
                    "style": "List"
                },
                {
                    "language": "IT",
                    "text": "Una volta stabilito il riferimento, rimuovi il pin con cui hai fissato il nodo in modo che torni al suo posto.",
                    "updated": 1666639163813
                },
                {
                    "language": "NL",
                    "text": "Verwijder de pin zodra de referentie tot stand is gebracht, zodat het knooppunt terugkeert naar zijn plaats.",
                    "updated": 1669542357727
                },
                {
                    "language": "ES",
                    "text": "Quita el pin una vez establecida la referencia para que el nodo vuelva a su sitio.",
                    "updated": 1675376802665
                }
            ]
        }
    ]
}