{
    "tutorial": "Basic Education",
    "pageNumber": 51,
    "type": "Tutorial Step - Dealing With Data",
    "definition": {
        "text": "The data you download from exchanges and process with indicators is available across the board, accessible from any workspace and strategy.",
        "icon": {
            "name": "Data\\dataset-definition",
            "project": "Foundations"
        },
        "updated": 1616174427620,
        "translations": [
            {
                "language": "IT",
                "text": "Ì dati che hai scaricato dagli exchange e processato con gli indicatori è disponibile ovunque e accessibile da ogni workspace e strategia.",
                "updated": 1619591708965,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Los datos que descargas de los exchanges y procesas están disponibles en todos los ámbitos, accesibles desde cualquier Workspace y estrategia.",
                "updated": 1628020470335,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Die Daten, die Sie von den Börsen herunterladen und mit den Indikatoren verarbeiten, sind übergreifend verfügbar und von jedem Workspace und jeder Strategie aus zugänglich.",
                "updated": 1634589901473
            },
            {
                "language": "TR",
                "text": "Borsalardan indirdiğiniz ve göstergelerle işlediğiniz verilere herhangi bir çalışma alanından ve stratejiden erişilebilirsiniz. Yani çalışma alanını değiştrisenizde yeni alanınızda daha önce indirilmiş bu verileri kullanırsınız. Her çalışma alanı için tekrardan indirmenize gerek yoktur..",
                "updated": 1639825082061
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Data is stored on disk under the Data-Storage folder and is organized by Project, Data Mine, bot, and Market. It doesn't matter what workspace you used to mine the data or process indicators.",
            "updated": 1616175467234,
            "translations": [
                {
                    "language": "IT",
                    "text": "I dati sono salvati nella cartella Data-Storage e organizzati per Progetto, Data Mine, Bot e Market. Non importa quale workspace hai usato per estrarre dati o processare indicatori.",
                    "updated": 1619591759698,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Los datos se almacenan en el disco en la carpeta Data-Storage y están organizados por Project, Data Mine, bot y Market. No importa qué Worksapce hayas utilizado para minar los datos o los indicadores de proceso.",
                    "updated": 1628017724144,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die Daten werden auf der Festplatte im Ordner Data-Storage gespeichert und sind nach Project, Data Mine, Bot und Market geordnet. Es spielt keine Rolle, in welchem Workspace Sie die Daten gewonnen oder die Indikatoren verarbeitet haben.",
                    "updated": 1634589981672
                },
                {
                    "language": "TR",
                    "text": "Veriler, Data-Storage klasörü altında diske depolanır ve Project, Data Mine, bot ve Market tarafından düzenlenir. Verileri veya süreç göstergelerini çıkarmak için hangi çalışma alanını kullandığınızın bir önemi yoktur.",
                    "updated": 1639825127007
                }
            ]
        },
        {
            "style": "Note",
            "text": "All of the data is available to all workspaces, so that you may work with the same data sources irrespective of what you are doing.",
            "translations": [
                {
                    "language": "IT",
                    "text": "I dati sono disponibili a tutti i workspace per permetterti di lavorare con le stesse data source indipendentemente da cosa stai facendo.",
                    "updated": 1619591804048,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Todos los datos están disponibles para todos los espacios de trabajo, por lo que puedes trabajar con las mismas fuentes de datos independientemente de lo que estés haciendo.",
                    "updated": 1628017031765,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Alle Daten stehen in allen Workspaces zur Verfügung, so dass Sie unabhängig von Ihrer Tätigkeit mit denselben Datenquellen arbeiten können.",
                    "updated": 1634589990093
                },
                {
                    "language": "TR",
                    "text": "Herhangi bir borsadan çektiğiniz verilerin hepis tüm çalışma alanlarında mevcuttur, böylece ne yapıyor olursanız olun aynı veri kaynaklarıyla çalışabilirsiniz.",
                    "updated": 1639825202230
                }
            ]
        },
        {
            "style": "Success",
            "text": "There is no built-in data-management in the app. Use your file system instead!",
            "updated": 1616175397455,
            "translations": [
                {
                    "language": "IT",
                    "text": "Non esiste una utilità di data management nell'app. Usa il file system della tua macchina!",
                    "updated": 1619591845921,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "No hay gestión de datos incorporada en la aplicación. ¡Utilice tu sistema de archivos!",
                    "updated": 1628019703596,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Es gibt keine integrierte Datenverwaltung in der App. Verwenden Sie stattdessen Ihr Dateisystem!",
                    "updated": 1634589996758
                },
                {
                    "language": "TR",
                    "text": "Uygulamada yerleşik veri yönetimi yoktur. Bunun yerine dosya sisteminizi kullanın!",
                    "updated": 1639825229337
                }
            ]
        }
    ]
}