{
    "tutorial": "Basic Education",
    "pageNumber": 24,
    "type": "Tutorial Step - Let's See Some References",
    "definition": {
        "text": "Notice the two nodes under the Backtesting Session: Trading System Reference and Trading Engine Reference. Why do we need these nodes?",
        "updated": 1615798435799,
        "icon": {
            "name": "Trading\\trading-system-reference",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Nota i due nodi sotto Backtesting Session: Trading System Reference e Trading Engine Reference. A cosa servono questi nodi?",
                "updated": 1619500944274,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Observe los dos nodos debajo del Backtesting Session: Trading System Reference y Trading Engine Reference. ¿Por qué necesitamos estos nodos?",
                "updated": 1626376931375,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Beachten Sie die beiden Knotenpunkte unter der Backtesting Session: Trading System Reference und Trading Engine Reference. Wozu brauchen wir diese Knoten?",
                "updated": 1634334187982
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Backtesting Session needs to reference the Trading System so that it may obtain the rules for trading. It must also reference the Trading Engine so that it may store information relative to the trading session. However, a node may establish only one outgoing reference!",
            "updated": 1615798936552,
            "translations": [
                {
                    "language": "IT",
                    "text": "Backtesting Session deve referenziare il Trading System così da ottenere le regole per il trading. Deve anche avere un riferimento al Trading Engine così da avere info relative alla sessione di trading. Un nodo può però stabilire solo una reference in uscita!",
                    "updated": 1619501079718,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El Backtesting Session necesita hacer referencia al Trading System para que pueda obtener las reglas para el trading. También debe hacer referencia al Trading Engine para que pueda almacenar información relativa a la sesión de trading. Sin embargo, un nodo puede establecer solo una referencia saliente.",
                    "updated": 1626377104766,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die Backtesting Session muss auf das Handelssystem verweisen, damit sie die Regeln für den Handel erhalten kann. Sie muss auch auf die Trading Engine verweisen, damit sie Informationen in Bezug auf die Handelssitzung speichern kann. Ein Knoten darf jedoch nur einen ausgehenden Verweis herstellen!",
                    "updated": 1634334194200
                }
            ]
        },
        {
            "style": "Note",
            "text": "That is why these nodes exist: they are an aid to the Backtesting Session node so that each of them may reference one node!",
            "updated": 1615798882867,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ecco perchè questi nodi esistono: sono un supporto per il nodo Backtesting Session, così che ognuno di essi abbia un collegamento in uscita con un altro nodo!",
                    "updated": 1619501188069,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Por eso existen estos nodos: ¡son una ayuda para el nodo Backtesting Session para que cada uno de ellos pueda hacer referencia a un nodo!",
                    "updated": 1626532745561,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Aus diesem Grund gibt es diese Knoten: Sie sind ein Hilfsmittel für den Knoten Backtesting Session, so dass jeder von ihnen auf einen Knoten verweisen kann!",
                    "updated": 1634334201093
                }
            ]
        }
    ]
}