{
    "tutorial": "Basic Education",
    "pageNumber": 38,
    "type": "Tutorial Step - Your Workspace vs Plugins",
    "definition": {
        "text": "Go to your File Explorer app and look for the following paths relative to the root Superalgos folder...",
        "icon": {
            "name": "plugins",
            "project": "Community-Plugins"
        },
        "updated": 1615906049600,
        "translations": [
            {
                "language": "IT",
                "text": "Apri il File Explorer del tuo computer e cerca i seguenti path relativi alla cartella root di Superalgos...",
                "updated": 1619553622852,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Ve a la aplicación Explorador de archivos y busca las siguientes rutas relativas a la carpeta raíz de Superalgos...",
                "updated": 1626620466947,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Gehen Sie zu Ihrer Datei-Explorer-Anwendung und suchen Sie nach den folgenden Pfaden relativ zum Stammordner von Superalgos...",
                "updated": 1634587292897
            },
            {
                "language": "TR",
                "text": "Dosya Gezgini uygulamanıza gidin ve Superalgos klasörüne göre aşağıdaki yolları arayın...",
                "updated": 1639765842220
            },
            {
                "language": "RU",
                "text": "Зайдите в проводник (File Explorer) и найдите следующие пути относительно корневой папки Superalgos...",
                "updated": 1640871895869
            },
            {
                "language": "ID",
                "text": "Buka aplikasi File Explorer kamu dan cari paths berikut yang relatif terhadap folder Superalgos utama...",
                "updated": 1645034246004
            },
            {
                "language": "NL",
                "text": "Ga naar uw File Explorer-app en zoek naar de volgende paden ten opzichte van de hoofdmap Superalgos...",
                "updated": 1669545504117
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Json",
            "text": "\\Platform\\My-Workspaces",
            "updated": 1634587417482,
            "translations": [
                {
                    "language": "IT",
                    "text": "\\My-Workspaces",
                    "updated": 1619553626181,
                    "style": "Json"
                }
            ]
        },
        {
            "style": "List",
            "text": "This is where you will find the workspaces you may have saved earlier. If the folder is empty or doesn't exist, it means you haven't saved any workspaces yet!",
            "updated": 1629895377178,
            "translations": [
                {
                    "language": "IT",
                    "text": "Qui è dove troverai gli workspaces che potresti aver salvato in precedenza. Se la cartella è vuota o non esiste, significa che non hai ancora salvato alcuno workspace!",
                    "updated": 1666639702525,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Aquí es donde encontrarás los espacios de trabajo que hayas guardado anteriormente. Si la carpeta está vacía o no existe, significa que aún no has guardado ningún espacio de trabajo.",
                    "updated": 1675377423380,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Hier finden Sie die Workspaces, die Sie möglicherweise zuvor gespeichert haben. Wenn der Ordner leer ist oder nicht existiert, bedeutet dies, dass Sie noch keine Workspaces gespeichert haben!",
                    "updated": 1634587301340
                },
                {
                    "language": "TR",
                    "text": "Daha önce kaydetmiş olabileceğiniz çalışma alanlarını burada bulabilirsiniz. Klasör boşsa veya mevcut değilse, henüz herhangi bir çalışma alanı kaydetmemişsiniz demektir!",
                    "updated": 1639765864958
                },
                {
                    "language": "RU",
                    "text": "Здесь вы найдете рабочие пространства, которые вы, возможно, сохранили ранее. Если папка пуста или не существует, это означает, что вы еще не сохранили ни одного рабочего пространства!",
                    "updated": 1640871913521
                },
                {
                    "language": "ID",
                    "text": "Di sinilah kamu akan menemukan workspaces yang mungkin kamu simpan sebelumnya. Jika folder kosong atau tidak ada, itu berarti kamu belum menyimpan workspaces apa pun!",
                    "updated": 1645034289529
                },
                {
                    "language": "NL",
                    "text": "Hier vindt u de werkruimten die u mogelijk eerder hebt opgeslagen. Als de map leeg is of niet bestaat, betekent dit dat je nog geen werkruimten hebt opgeslagen!",
                    "updated": 1669545524713
                }
            ]
        },
        {
            "style": "Json",
            "text": "\\Plugins\\[Project]\\Workspaces",
            "updated": 1687799294395
        },
        {
            "style": "List",
            "text": "In this folder, you will find Native Workspaces shipping with Superalgos. You may want to read the \"Community Workspaces\" topic in the Docs to learn what each of them is about!",
            "updated": 1622375468421,
            "translations": [
                {
                    "language": "IT",
                    "text": "In questa cartella troverai i Native Workspaces in dotazione con Superalgos. Potresti voler leggere l'argomento \"Community Workspaces\" nella documentazione per sapere di cosa tratta ciascuno!",
                    "updated": 1666639782473,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "En esta carpeta, encontrarás Native Workspaces conectando con  Superalgos. Es posible que desees leer los Documentos del \"Community Workspaces\" para saber de qué se trata cada uno de ellos.",
                    "updated": 1626620829014,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "In diesem Ordner finden Sie die Native Workspaces, die mit Superalgos ausgeliefert werden. Vielleicht möchten Sie das Thema \"Community Workspaces\" in den Docs lesen, um zu erfahren, worum es bei den einzelnen Workspaces geht!",
                    "updated": 1634587316991
                },
                {
                    "language": "TR",
                    "text": "Bu klasörde, Superalgos ile birlikte gönderilen Eklenti Çalışma Alanlarını ( Native Workspaces ) bulacaksınız. Her birinin ne hakkında olduğunu öğrenmek için Dokümanlar'daki \"Community Workspaces\" konusunu okuyabilirsiniz.",
                    "updated": 1639766445410
                },
                {
                    "language": "RU",
                    "text": "В этой папке вы найдете рабочие пространства плагинов, поставляемые с Superalgos. Вы можете прочитать тему \"Community Workspaces\" в документации, чтобы узнать, что представляет собой каждое из них!",
                    "updated": 1640871987116
                },
                {
                    "language": "ID",
                    "text": "Di folder ini, kamu akan menemukan Native Workspaces dikirim dengan Superalgos. Kamu mungkin ingin membaca topik \"Community Workspaces\" di Docs untuk mempelajari masing-masing tentang mereka!",
                    "updated": 1645035566907
                },
                {
                    "language": "NL",
                    "text": "In deze map vindt u Native Workspaces die standaard met Superalgos worden geleverd. Misschien wil je het onderwerp 'Community Workspaces' in de Docs lezen om erachter te komen waar ze allemaal over gaan!",
                    "updated": 1669545573273
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}