{
    "tutorial": "Basic Education",
    "pageNumber": 44,
    "type": "Tutorial Step - Non-Persistence of Changes",
    "definition": {
        "text": "Remember I said that the plugin file is loaded every time the workspace is loaded? This feature has an immediate consequence...",
        "icon": {
            "name": "Bullet\\bullet-error",
            "project": "Foundations"
        },
        "updated": 1615978752612,
        "translations": [
            {
                "language": "IT",
                "text": "Ricordi che ho detto che i file plugin vengono ricreati ogni volta che ricarichi il Workspace? Questo ha delle conseguenze immediate...",
                "updated": 1619590273553,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Recuerda que dije que el archivo plugin se carga cada vez que se carga el espacio de trabajo? Esta característica tiene una consecuencia inmediata ...",
                "updated": 1626655086632,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Warning",
            "text": "Hierarchies included in the workspace as plugins are not saved by default. As such, changes made in those hierarchies do not persist. ",
            "updated": 1628349317266,
            "translations": [
                {
                    "language": "IT",
                    "text": "Le gerarchie incluse come plugins non sono salvate a livello del workspace, quindi i cambiamenti che applichi ai loro oggetti non sono persistenti. Se vuoi modificare un plugin e mantenere i cambiamenti in futuro, devi clonarlo o fare il backup e lavorare sulla copia.",
                    "updated": 1619590378028,
                    "style": "Warning"
                },
                {
                    "language": "ES",
                    "text": "Hierarchies incluidos en el workspace, ya que los plugins no se guardan en el nivel del workspace. Como tal, los cambios realizados en esas jerarquías no persisten. Si deseas modificar un plugin y seguir trabajando con la versión modificada en el futuro, debes clonar o hacer una copia de seguridad del plugin y trabajar en la copia resultante.",
                    "updated": 1626702533816,
                    "style": "Warning"
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you would like to make changes to a plugin you will need to enable saving. To do this find the Plugin File node associated with the hierarchy you would like to save. Then simply click the Enable Saving with Workspace button. It's that easy!",
            "updated": 1628349401737,
            "translations": [
                {
                    "language": "IT",
                    "text": "Nei prossimi step vedremo più in dettaglio quanto detto!",
                    "updated": 1619590413453,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "¡Pasaré por algunos casos de uso específicos en los próximos pasos!",
                    "updated": 1626702765005,
                    "style": "Success"
                }
            ]
        },
        {
            "style": "Success",
            "text": "I will go through some specific use cases in the next few steps!"
        }
    ]
}