{
    "tutorial": "Basic Education",
    "pageNumber": 26,
    "type": "Tutorial Step - Establishing References",
    "definition": {
        "text": "At some point, you will need to establish a reference, so let's do some basic training to develop the formidable skills required!",
        "updated": 1615806228297,
        "icon": {
            "name": "delink-node",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "A un certo punto, dovrai stabilire tu una reference con un nodo. Quindi tanto vale imparare subito come si fa!",
                "updated": 1619501421155,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "En algún momento, deberás establecer una referencia, ¡así que hagamos un entrenamiento básico para desarrollar las habilidades requeridas!",
                "updated": 1626533505140,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Irgendwann werden Sie eine Referenz erstellen müssen, also lassen Sie uns ein paar grundlegende Übungen durchführen, um die erforderlichen Fähigkeiten zu entwickeln!",
                "updated": 1634334474059
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Double-click the delink button on the menu of the Trading System Reference node!",
            "updated": 1622373319578,
            "translations": [
                {
                    "language": "IT",
                    "text": "Clicca sul bottone \"delink\" nel menù del nodo Trading System Reference!",
                    "updated": 1619501451689,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Haz doble clic en el botón de desvincular en el menú del nodo Trading System Reference!",
                    "updated": 1626533552438,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Doppelklicken Sie auf die Schaltfläche Delink im Menü des Knotens Trading System Reference!",
                    "updated": 1634334490234
                }
            ]
        },
        {
            "style": "Note",
            "text": "You just broke the reference! But don't worry... we'll recreate it in the next steps!",
            "updated": 1615806406944,
            "translations": [
                {
                    "language": "IT",
                    "text": "Hai rotto la reference! Ma non preoccuparti...la ricreeremo nei prossimi step!",
                    "updated": 1619501479311,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "¡Acabas de romper la referencia! Tranquilo, lo volveremos a crear en los próximos pasos!",
                    "updated": 1626534167277,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Sie haben gerade die Referenz zerstört! Aber keine Sorge... wir werden sie in den nächsten Schritten wiederherstellen!",
                    "updated": 1634334499633
                }
            ]
        },
        {
            "style": "Text",
            "text": "To establish a reference, follow the same process you use to attach a node. That is, right-click on the node where the reference will originate, drag it close to the node with which the reference will be established, and release the click once the orange ring shows up!",
            "updated": 1615806699660,
            "translations": [
                {
                    "language": "IT",
                    "text": "Per stabilire una reference, segui lo stesso processo usato per collegare un nodo: clicca con il tasto destro sul nodo da cui la reference avrà origine, trascinala vicino al nodo con cui vuoi stabilire il collegamento e rilascia quando vedi un anello arancione!",
                    "updated": 1619501669049,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Para establecer una referencia, sige el mismo proceso que usas para adjuntar un nodo. Haz clic con el botón derecho en el nodo donde se originará la referencia, arrástralo cerca del nodo con el que se establecerá la referencia y suelta cuando aparezca el anillo naranja.",
                    "updated": 1626534977269,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Um eine Referenz zu erstellen, folgen Sie demselben Prozess, den Sie zum Anhängen eines Knotens verwenden. Klicken Sie also mit der rechten Maustaste auf den Knoten, von dem die Referenz ausgehen soll, ziehen Sie ihn in die Nähe des Knotens, mit dem die Referenz hergestellt werden soll, und lassen Sie den Klick los, sobald der orangefarbene Ring erscheint!",
                    "updated": 1634334505328
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}