{
    "tutorial": "Basic Education",
    "pageNumber": 53,
    "type": "Tutorial Step - Building Indicators",
    "definition": {
        "text": "If you are a developer or have at least a basic understanding of JavaScript you will be able to create your own indicators!",
        "icon": {
            "name": "indicator-bot",
            "project": "Data-Mining"
        },
        "updated": 1616180582873,
        "translations": [
            {
                "language": "IT",
                "text": "Se sei uno sviluppatore o hai una conoscenza, anche base, di JavaScript, puoi costruire i tuoi indicatori!",
                "updated": 1619592159342,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si eres un desarrollador o tienes al menos un conocimiento básico de JavaScript, ¡podrás crear tus propios indicadores!",
                "updated": 1628022227899,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wenn Sie ein Entwickler sind oder zumindest ein grundlegendes Verständnis von JavaScript haben, werden Sie in der Lage sein, Ihre eigenen Indikatoren zu erstellen!",
                "updated": 1634590305087
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This is a crucial feature of Superalgos, as trading intelligence can't emerge without the ability to analyze market data! Again, I'm not going to go through how to build indicators at this point, but I do wish to let you know that we've got you covered!",
            "updated": 1616181744667,
            "translations": [
                {
                    "language": "IT",
                    "text": "Questa è una funzione chiave di Superalgos: una trading intelligence non può emergere senza capacità di analizzare dati di mercato! Non mi addentro su come costruire indicatori a questo punto, volevo solo ricordarti che potrai farlo!",
                    "updated": 1619592280131,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Esta es una característica crucial de Superalgos, ya que la inteligencia comercial no puede surgir sin la capacidad de analizar los datos del mercado. Una vez más, no voy a explicar cómo crear indicadores en este momento, ¡pero deseo informarte que lo tenemos cubierto!",
                    "updated": 1628022270052,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Dies ist eine wichtige Funktion von Superalgos, denn ohne die Möglichkeit, Marktdaten zu analysieren, kann keine Handelsintelligenz entstehen! Ich werde an dieser Stelle nicht näher darauf eingehen, wie man Indikatoren erstellt, aber ich möchte Sie darauf hinweisen, dass wir für Sie da sind!",
                    "updated": 1634590310614
                }
            ]
        },
        {
            "style": "Callout",
            "text": "There is a comprehensive series of video tutorials explaining the entire process! Take a quick look at this page in the Docs!",
            "updated": 1616181770763,
            "translations": [
                {
                    "language": "IT",
                    "text": "C'è una serie di video tutorial completa che spiega l'intero processo! Dai un'occhiata alla pagina sui Docs!",
                    "updated": 1619592318550,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Hay una serie completa de tutoriales en video que explican todo el proceso! ¡Echa un vistazo rápido a esta página en los Documentos!",
                    "updated": 1628022294402,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Es gibt eine umfassende Reihe von Vid eo-Tutorials, die den gesamten Prozess erklären! Werfen Sie einen kurzen Blick auf diese Seite in den Docs!",
                    "updated": 1634590316626
                }
            ]
        }
    ]
}