{
    "tutorial": "Basic Education",
    "pageNumber": 47,
    "type": "Tutorial Step - Improving a Plugin",
    "definition": {
        "text": "About the second scenario: let's say you are testing the EMA indicator, found a bug and know how to fix it. You intend to contribute the fix so that everyone benefits from it!",
        "icon": {
            "name": "indicator-bot",
            "project": "Data-Mining"
        },
        "updated": 1629909327051,
        "translations": [
            {
                "language": "IT",
                "text": "Riguardo al secondo scenario: diciamo che stai testando l'indicatore EMA, hai trovato un bug e sai come risolverlo. Intendi contribuire alla correzione in modo che tutti ne traggano vantaggio!",
                "updated": 1666641326747,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Sobre el segundo escenario: digamos que estás probando el indicador EMA, has encontrado un error y sabes cómo solucionarlo. Tu intención es contribuir con la solución para que todo el mundo se beneficie de ella.",
                "updated": 1675378022448,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Zum zweiten Szenario: Nehmen wir an, Sie testen den EMA-Indikator, haben einen Fehler gefunden und wissen, wie man ihn beheben kann. Sie beabsichtigen, den Fehler zu beheben, damit alle davon profitieren!",
                "updated": 1634589198766,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "İkinci senaryo şudur: Diyelim ki EMA göstergesini test ediyorsunuz, bir hata buldunuz ve nasıl düzeltileceğini biliyorsunuz. Herkesin bundan faydalanabilmesi için düzeltmeye katkıda bulunmayı düşünüyorsunuz!",
                "updated": 1639818513811
            },
            {
                "language": "RU",
                "text": "Во втором сценарии: допустим, вы тестируете индикатор EMA, нашли ошибку и знаете, как ее исправить. Вы намерены внести исправление, чтобы все могли им воспользоваться!",
                "updated": 1640874963360
            },
            {
                "language": "ID",
                "text": "Tentang skenario kedua: katakanlah kamu sedang menguji indikator EMA, menemukan bug dan tahu cara memperbaikinya. Kamu bermaksud berkontribusi untuk memperbaiki sehingga semua orang mendapat manfaat dari hal itu!",
                "updated": 1645559461122
            },
            {
                "language": "NL",
                "text": "Het tweede scenario: stel dat u de EMA-indicator aan het testen bent, een bug hebt gevonden en weet hoe u deze moet oplossen. Je bent van plan om de oplossing bij te dragen zodat iedereen er baat bij heeft!",
                "updated": 1669547814537
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This Indicator Bot is part of the Sparta Data Mine, which is usually included as a plugin in some Native Workspaces. To modify the plugin from within the UI and save the changes, you have two options:",
            "updated": 1629909479093,
            "translations": [
                {
                    "language": "IT",
                    "text": "Questo bot indicatore è parte del Master Data Mine, che è incluso come plugin in alcuni dei Native Workspace. Per modificare il plug-in dall'interfaccia utente e salvare le modifiche, hai due opzioni:",
                    "updated": 1666641428095,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Este Indicator Bot forma parte de Sparta Data Mine, que suele incluirse como plugin en algunos Native Workspaces. Para modificar el plugin desde la interfaz de usuario y guardar los cambios, tienes dos opciones:",
                    "updated": 1675378058478,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Dieser Indicator Bot ist Teil der Sparta Data Mine, die normalerweise als Plugin in einigen Native Workspaces enthalten ist. Um das Plugin aus der UI Benutzeroberfläche heraus zu modifizieren und die Änderungen zu speichern, haben Sie zwei Möglichkeiten:",
                    "updated": 1634589206307,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Bu Indıcator Bot 'u, Sparta Veri Madeni'nin ( Data Mine ) bir parçasıdır. Eklentiyi kullanıcı arayüzünden ( UI ) değiştirmek ve değişiklikleri kaydetmek için iki seçeneğiniz vardır:",
                    "updated": 1639818618736
                },
                {
                    "language": "RU",
                    "text": "Этот индикаторный бот (Indicator Bot) является частью Sparta Data Mine, который обычно включается в качестве плагина в некоторые рабочие пространства плагинов. Чтобы изменить плагин из пользовательского интерфейса и сохранить изменения, у вас есть два способа:",
                    "updated": 1640875005766
                },
                {
                    "language": "ID",
                    "text": "Indikator Bot ini adalah bagian dari Sparta Data Mine, yang biasanya dimasukkan sebagai plugin di beberapa workspaces plugin. Untuk memodifikasi plugin dari dalam UI dan menyimpan perubahan, Kamu memiliki dua opsi :",
                    "updated": 1645559526844
                },
                {
                    "language": "NL",
                    "text": "Deze Indicator Bot maakt deel uit van de Sparta Data Mine, die meestal als plugin is opgenomen in sommige werkruimten voor plugins. Om de plugin vanuit de UI te wijzigen en de wijzigingen op te slaan, hebt u twee opties:",
                    "updated": 1669547861719
                }
            ]
        },
        {
            "style": "List",
            "text": "Go to the corresponding Plugin File in the Plugins hierarchy and select Enable Saving With Workspace on the menu. Now the plugin file is updated every time you save the workspace to include the changes you may have introduced!",
            "updated": 1629909628165,
            "translations": [
                {
                    "language": "DE",
                    "text": "Gehen Sie zu dem entsprechenden Plugin File in der Plugins-Hierarchie und wählen Sie im Menü die Option Enable Saving With Workspace. Jetzt wird die Plugin-Datei jedes Mal aktualisiert, wenn Sie den Arbeitsbereich speichern, um die von Ihnen vorgenommenen Änderungen zu berücksichtigen!",
                    "updated": 1634819321377
                },
                {
                    "language": "TR",
                    "text": "Plugin hiyerarşisinde ilgili Plugin Dosyasına gidin ve menüden \"Enable Saving With Workspace\"seçeneğini seçin. Artık eklenti dosyası, çalışma alanını her kaydettiğinizde, yapmış olabileceğiniz değişiklikleri içerecek şekilde güncellenir!",
                    "updated": 1639818782919
                },
                {
                    "language": "RU",
                    "text": "Перейдите к соответствующему узлу Plugin File в иерархии Plugins и выберите в меню Enable Saving With Workspace. Теперь он будет обновляться каждый раз, когда вы сохраняете рабочее пространство, чтобы содержать изменения, которые вы могли внести!",
                    "updated": 1640875166906
                },
                {
                    "language": "ID",
                    "text": "Buka File Plugin yang sesuai dalam hierarki Plugin dan pilih Enable Saving With Workspace pada menu. Sekarang file plugin diperbarui setiap kali kamu menyimpan workspace untuk memasukkan perubahan yang mungkin telah kamu perkenalkan!",
                    "updated": 1645559587333
                },
                {
                    "language": "IT",
                    "text": "Vai al Plugin File corrispondente nella gerarchia Plugin e seleziona <i>Enable Saving With Workspace</i> nel menu. Ora il file del plug-in viene aggiornato ogni volta che salvi l'area di lavoro per includere le modifiche che potresti aver introdotto!",
                    "updated": 1666641552303
                },
                {
                    "language": "NL",
                    "text": "Ga naar het bijbehorende Plugin File in de Plugins hiërarchie en selecteer </i>Enable Saving With Workspace in het menu. Nu wordt het plugin bestand elke keer dat u de werkruimte opslaat bijgewerkt met de wijzigingen die u mogelijk hebt aangebracht!",
                    "updated": 1669547955640
                },
                {
                    "language": "ES",
                    "text": "Ve al Plugin File correspondiente en la jerarquía de Plugins y selecciona Enable Saving With Workspace en el menú. ¡Ahora el archivo del plugin se actualiza cada vez que guardas el espacio de trabajo para incluir los cambios que hayas podido introducir!",
                    "updated": 1675378090445
                }
            ]
        },
        {
            "style": "List",
            "text": "Or use the Save Plugin File option to manually save the plugin file whenever you wish to!",
            "updated": 1629909705348,
            "translations": [
                {
                    "language": "DE",
                    "text": "Oder verwenden Sie die Option \"Plugin speichern\", um die Plugin-Datei manuell zu speichern, wann immer Sie es wünschen!",
                    "updated": 1634589217431,
                    "style": "List"
                },
                {
                    "language": "TR",
                    "text": "Veya eklenti dosyasını istediğiniz zaman manuel olarak kaydetmek için \"Save Plugin File\" seçeneğini kullanın!",
                    "updated": 1639818865475
                },
                {
                    "language": "RU",
                    "text": "Или используйте опцию Save Plugin File, чтобы вручную сохранить файл плагина, когда захотите!",
                    "updated": 1640875192451
                },
                {
                    "language": "ID",
                    "text": "Atau gunakan opsi Save Plugin File untuk menyimpan file plugin secara manual kapan pun kamu mau!",
                    "updated": 1645559620656
                },
                {
                    "language": "IT",
                    "text": "Oppure usa l'opzione <i>Save Plugin File</i> per salvare manualmente il file del plugin ogni volta che lo desideri!",
                    "updated": 1666641598961
                },
                {
                    "language": "NL",
                    "text": "Of gebruik de </i>Save Plugin File optie om het plugin bestand handmatig op te slaan wanneer je maar wilt!",
                    "updated": 1669547989335
                },
                {
                    "language": "ES",
                    "text": "O utiliza la opción Save Plugin File para guardar manualmente el archivo del plugin cada vez que lo desees.",
                    "updated": 1675378109006
                }
            ]
        }
    ]
}