{
    "tutorial": "Basic Education",
    "pageNumber": 44,
    "type": "Tutorial Step - Non-Persistence of Changes",
    "definition": {
        "text": "Remember I said that the plugin file is loaded every time the workspace is loaded? This feature has an immediate consequence...",
        "icon": {
            "name": "bullet-error",
            "project": "Foundations"
        },
        "updated": 1615978752612,
        "translations": [
            {
                "language": "IT",
                "text": "Ricordi che ho detto che i file plugin vengono ricreati ogni volta che ricarichi il Workspace? Questo ha delle conseguenze immediate...",
                "updated": 1619590273553,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Recuerda que dije que el archivo plugin se carga cada vez que se carga el espacio de trabajo? Esta característica tiene una consecuencia inmediata ...",
                "updated": 1626655086632,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Erinnern Sie sich, dass ich sagte, dass die Plugin-Datei jedes Mal geladen wird, wenn der Workspace geladen wird? Diese Funktion hat eine unmittelbare Konsequenz...",
                "updated": 1634588859041
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Warning",
            "text": "Hierarchies placed in the workspace as plugins do not save with the workspace by default. As a result, changes made in those hierarchies do not persist, unless you save them manually or enable automatic saving. ",
            "updated": 1629897700219,
            "translations": [
                {
                    "language": "IT",
                    "text": "Le gerarchie incluse come plugins non sono salvate a livello del workspace, quindi i cambiamenti che applichi ai loro oggetti non sono persistenti. Se vuoi modificare un plugin e mantenere i cambiamenti in futuro, devi clonarlo o fare il backup e lavorare sulla copia.",
                    "updated": 1619590378028,
                    "style": "Warning"
                },
                {
                    "language": "ES",
                    "text": "Las Hierarchies (Jerarquías) colocadas en el workspace como plugins (copias) no se guardan en el  workspace por defecto. Como resultado, los cambios realizados en esas jerarquías no persiten, a menos que las salve en forma manual o habilite el guardado automático. ",
                    "updated": 1633282516205,
                    "style": "Warning"
                },
                {
                    "language": "DE",
                    "text": "Hierarchies , die als Plugins im Workspace platziert werden, werden standardmäßig nicht mit dem Workspace gespeichert. Infolgedessen bleiben Änderungen in diesen Hierarchien nicht erhalten, es sei denn, Sie speichern sie manuell oder aktivieren die automatische Speicherung.",
                    "updated": 1634588866809
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are two main use cases for modifying plugins:",
            "updated": 1629897808476,
            "translations": [
                {
                    "language": "IT",
                    "text": "Nei prossimi step vedremo più in dettaglio quanto detto!",
                    "updated": 1619590413453,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Hay dos casos principales para modificar los plugins:",
                    "updated": 1633282630926,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Es gibt zwei Hauptanwendungsfälle für die Änderung von Plugins:",
                    "updated": 1634588872603
                }
            ]
        },
        {
            "style": "List",
            "text": "You wish to modify a plugin to make it your own and keep working with the modified version in the future.",
            "updated": 1629897838348,
            "translations": [
                {
                    "language": "ES",
                    "text": "Desea modificar un plugin para hacer uno propio y continuar trabajando con la versión modificada en el futuro.",
                    "updated": 1633282732027,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Sie möchten ein Plugin ändern, um es sich zu eigen zu machen und in Zukunft mit der geänderten Version weiter zu arbeiten.",
                    "updated": 1634588878910
                }
            ]
        },
        {
            "style": "List",
            "text": "You wish to update and improve a plugin to contribute the improvements to the project.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Desea actualizar y mejorar un plugin para contribuir en el mejoramiento del proyecto.",
                    "updated": 1633282817838,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Sie möchten ein Plugin aktualisieren und verbessern, um die Verbesserungen zum Projekt beizutragen.",
                    "updated": 1634588884937
                }
            ]
        }
    ]
}