{
    "tutorial": "Basic Education",
    "pageNumber": 55,
    "type": "Tutorial Step - Lost? Get an API Map!",
    "definition": {
        "text": "Are you wondering how to get data from sources other than exchanges in CCXT? Messari? Twitter? We've got you covered!",
        "updated": 1622645027378,
        "icon": {
            "name": "Api\\api-map",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "¿Se preguntas cómo obtener datos de fuentes distintas a los intercambios en CCXT? Messari? Twitter? ¡Te tenemos cubierto!",
                "updated": 1628032498537,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Sie fragen sich, wie Sie in CCXT Daten aus anderen Quellen als Börsen erhalten können? Messari? Twitter? Wir haben die Lösung für Sie!",
                "updated": 1634590563604
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Superalgos enables you to fetch data from any API on the Internet, and you don't need to code to do it! Instead, you may design an API Map or use the ones shipping with the system!",
            "updated": 1622645477339,
            "translations": [
                {
                    "language": "ES",
                    "text": "Superalgos le permite obtener datos de cualquier API en Internet, ¡y no necesitas programar para hacerlo! En su lugar, puedes diseñar un API Map o utilizar los que se envían con el sistema.",
                    "updated": 1628032719618,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Superalgos ermöglicht es Ihnen, Daten von jeder beliebigen API im Internet abzurufen, und Sie müssen dafür nicht programmieren! Stattdessen können Sie eine API Map entwerfen oder die mit dem System mitgelieferten verwenden!",
                    "updated": 1634590573292
                }
            ]
        },
        {
            "style": "Note",
            "text": "An API Map is a set of definitions dictating how a bot can access a particular API and how to interpret the responses from the server.",
            "updated": 1622645609009,
            "translations": [
                {
                    "language": "ES",
                    "text": "Un API Map es un conjunto de definiciones que dictan cómo un bot puede acceder a una API en particular y cómo interpretar las respuestas del servidor.",
                    "updated": 1628032814964,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Eine API Map ist eine Reihe von Definitionen, die festlegen, wie ein Bot auf eine bestimmte API zugreifen kann und wie die Antworten des Servers zu interpretieren sind.",
                    "updated": 1634590580114
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Dive into this section of the Data Mining topic when you are ready to explore the API landscape!",
            "updated": 1622645435555,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Sumérgete en esta sección del Data Mining para explorar el panorama de API!",
                    "updated": 1628032872757,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Tauchen Sie in diesen Abschnitt des Data-Mining-Themas ein, wenn Sie bereit sind, die API-Landschaft zu erkunden!",
                    "updated": 1634590587052
                }
            ]
        }
    ]
}