{
    "tutorial": "Basic Education",
    "pageNumber": 32,
    "type": "Tutorial Step - Back It Up Again!",
    "definition": {
        "text": "I told you I was going to hammer home this topic! Let's try the second example!",
        "updated": 1615827182099,
        "icon": {
            "name": "backup-entity",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Sarò pedante su questo topic! Ora proviamo il secondo esempio!",
                "updated": 1619502967378,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Te dije que iba a insistir en este tema! ¡Probemos el segundo ejemplo!",
                "updated": 1626614763096,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Ich habe Ihnen gesagt, dass ich dieses Thema mit dem Hammer bearbeiten werde! Lassen Sie uns das zweite Beispiel ausprobieren!",
                "updated": 1634585921922
            },
            {
                "language": "TR",
                "text": "İkinci örneği deneyelim!",
                "updated": 1639603129746
            },
            {
                "language": "RU",
                "text": "Я же говорил вам, что собираюсь довести эту тему до ума! Давайте попробуем второй пример!",
                "updated": 1640870858272
            },
            {
                "language": "ID",
                "text": "Sudah kubilang aku akan menjelaskan topik ini! Mari kita coba contoh kedua!",
                "updated": 1644951377689
            },
            {
                "language": "NL",
                "text": "Ik zei toch dat ik op dit onderwerp ging hameren! Laten we het tweede voorbeeld proberen!",
                "updated": 1669544365942
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Take a backup of the Lightning Strike trading system! Restore the backup without deleting the original. Then repeat the restore operation but deleting the original trading system first!",
            "updated": 1616244614576,
            "translations": [
                {
                    "language": "IT",
                    "text": "Fai un backup del nodo Trading System! Ripristina il backup senza cancellare l'originale. Poi ripristinalo di nuovo, ma questa volta cancellando prima il nodo originale!",
                    "updated": 1619503042022,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Realiza una copia de seguridad del sistema Lightning Strike trading! Restaura la copia de seguridad sin eliminar el original. Luego, repite la operación de restauración, pero primero elimina el Trading System original.",
                    "updated": 1675377066807,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Machen Sie ein Backup des Lightning Strike Handelssystems! Stellen Sie das Backup wieder her, ohne das Original zu löschen. Wiederholen Sie dann den Wiederherstellungsvorgang, aber löschen Sie zuerst das ursprüngliche Handelssystem!",
                    "updated": 1634585943896
                },
                {
                    "language": "TR",
                    "text": "Lightning Strike Trading System düğümünün yedeğini alın! Orijinali silmeden yedeği geri yükleyin. Ardından geri yükleme işlemini tekrarlayın, ancak önce orijinal ticaret sistemini silin!",
                    "updated": 1639603462583
                },
                {
                    "language": "RU",
                    "text": "Сделайте резервную копию торговой системы Lightning Strike! Восстановите резервную копию, не удаляя оригинал. Затем повторите операцию восстановления, но сначала удалите оригинальную торговую систему!",
                    "updated": 1640870878407
                },
                {
                    "language": "ID",
                    "text": "Ambil cadangan Lightning Strike trading system! Kembalikan cadangan tanpa menghapus yang asli. Kemudian ulangi operasi pemulihan tetapi hapus trading system asli terlebih dahulu!",
                    "updated": 1644951447502
                },
                {
                    "language": "NL",
                    "text": "Maak een back-up van het Lightning Strike handelssysteem! Herstel de back-up zonder het origineel te verwijderen. Herhaal vervolgens de herstelbewerking maar verwijder eerst het originele handelssysteem!",
                    "updated": 1669544394033
                }
            ]
        },
        {
            "style": "Text",
            "text": "Verify how the incoming references are preserved only in the second case!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Verifica che le references in ingresso sono mantenute solo nel secondo caso!",
                    "updated": 1619503065417,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¡Verifica cómo se conservan las referencias entrantes solo en el segundo caso!",
                    "updated": 1626615039104,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Überprüfen Sie, wie die eingehenden Referenzen nur im zweiten Fall erhalten bleiben!",
                    "updated": 1634585949205
                },
                {
                    "language": "TR",
                    "text": "İkinci durumda (orjinal düğümü silip düğümü geri yüklediğinizde) gelen referansların ( Incoming references ) nasıl korunduğunu gözlemleyin!",
                    "updated": 1639603967310
                },
                {
                    "language": "RU",
                    "text": "Проверьте, как сохраняются входящие ссылки, только во втором случае!",
                    "updated": 1640870935829
                },
                {
                    "language": "ID",
                    "text": "Verifikasi bagaimana incoming references dijaga hanya dalam kasus kedua!",
                    "updated": 1644951500416
                },
                {
                    "language": "NL",
                    "text": "Controleer alleen in het tweede geval hoe de inkomende referenties worden bewaard!",
                    "updated": 1669544412558
                }
            ]
        },
        {
            "style": "Success",
            "text": "Remember that, for incoming references to be preserved, you must delete the original structure of nodes before restoring the backup!",
            "updated": 1615827931407,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ricorda che, per mantenere le reference in entrata, devi cancellare la struttura originale prima di ripristinare il backup!",
                    "updated": 1619503100070,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Recuerda que, para conservar las referencias entrantes, debes eliminar la estructura original de los nodos antes de restaurar la copia de seguridad.",
                    "updated": 1675377083860,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Damit die eingehenden Referenzen erhalten bleiben, müssen Sie die ursprüngliche Struktur der Knoten löschen, bevor Sie die Sicherung wiederherstellen!",
                    "updated": 1634585956756
                },
                {
                    "language": "TR",
                    "text": "Unutmayın, gelen referansların korunması için yedeği geri yüklemeden önce düğümlerin orijinal yapısını silmeniz gerekir!",
                    "updated": 1639603997353
                },
                {
                    "language": "RU",
                    "text": "Помните, что для сохранения входящих ссылок необходимо удалить исходную структуру узлов перед восстановлением резервной копии!",
                    "updated": 1640870949480
                },
                {
                    "language": "ID",
                    "text": "Ingatlah bahwa, agar incoming references dijaga, kamu harus menghapus struktur node asli sebelum mengembalikan cadangan!",
                    "updated": 1644951546081
                },
                {
                    "language": "NL",
                    "text": "Onthoud dat u, om inkomende referenties te behouden, de oorspronkelijke structuur van knooppunten moet verwijderen voordat u de back-up herstelt!",
                    "updated": 1669544434495
                }
            ]
        }
    ]
}