{
    "topic": "Introduction",
    "pageNumber": "2",
    "type": "Bots In Superalgos",
    "definition": {
        "text": "Bots are a crucial concept in Superalgos, and a good thread to explain how hierarchies interact with each other.",
        "updated": 1609944023850,
        "translations": [
            {
                "language": "RU",
                "text": "Боты - важнейшая концепция в Superalgos и хорошая ветка, объясняющая, как иерархии взаимодействуют друг с другом.",
                "updated": 1637939070957
            },
            {
                "language": "EL",
                "text": "Τα ρομπότ είναι μια κρίσιμη έννοια στο Superalgos και μια καλή αρχή για να εξηγήσουμε πώς αλληλοεπιδρούν οι ιεραρχίες μεταξύ τους.",
                "updated": 1638964017793
            },
            {
                "language": "DE",
                "text": "Bots sind ein entscheidendes Konzept in Superalgos und ein guter Leitfaden, um zu erklären, wie Hierarchien miteinander interagieren.",
                "updated": 1641741276059
            },
            {
                "language": "TR",
                "text": "Botlar Superalgos'da çok önemli bir kavramdır ve hiyerarşilerin birbirleriyle nasıl etkileşime girdiğini açıklamak için iyi bir konu başlığıdır.",
                "updated": 1698699077443
            },
            {
                "language": "PT",
                "text": "Os Bots são um conceito crucial no Superalgos e representam uma boa explicação para demonstrar como as hierarquias interagem entre si. ",
                "updated": 1711655470376
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "While sometimes people use the terms trading bot, trading strategy, and trading system interchangeably, in Superalgos the distinction is sharp and unequivocal. Let’s start by offering three fundamental definitions:",
            "updated": 1609944046617,
            "translations": [
                {
                    "language": "RU",
                    "text": "Хотя иногда люди используют термины «торговый бот», «торговая стратегия» и «торговая система» как синонимы, в Superalgos различие является резким и недвусмысленным. Давайте начнем с трех основных определений:",
                    "updated": 1637939113632
                },
                {
                    "language": "EL",
                    "text": "Ενώ μερικές φορές οι άνθρωποι χρησιμοποιούν εναλλακτικά τους όρους ρομπότ συναλλαγών, στρατηγική συναλλαγών και σύστημα συναλλαγών, στο Superalgos η διάκριση είναι οξεία και ξεκάθαρη. Ας ξεκινήσουμε προσφέροντας τρεις θεμελιώδεις ορισμούς:",
                    "updated": 1638964027439
                },
                {
                    "language": "DE",
                    "text": "Während die Begriffe Trading Bot, Trading Strategie und Trading System manchmal synonym verwendet werden, ist die Unterscheidung in Superalgos scharf und unmissverständlich. Lassen Sie uns mit drei grundlegenden Definitionen beginnen:",
                    "updated": 1641741337487
                },
                {
                    "language": "TR",
                    "text": "Bazen insanlar ticaret botu, ticaret stratejisi ve ticaret sistemi terimlerini birbirinin yerine kullanırken, Superalgos'ta ayrım keskin ve nettir. Üç temel tanım sunarak başlayalım:",
                    "updated": 1698699082731
                },
                {
                    "language": "PT",
                    "text": "Embora às vezes as pessoas usem os termos bot de negociação, estratégia de negociação e sistema de negociação (trading system) de forma indistinta, no Superalgos a distinção é clara e inequívoca. Vamos começar oferecendo três definições fundamentais:",
                    "updated": 1711459791756
                }
            ]
        },
        {
            "style": "List",
            "text": "Trading System: A trading system is a framework handling the low-level logic that serves to structure the processes and methods used to implement and deploy trading strategies.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Trading System (Торговая система): торговая система - это структура, обрабатывающая низкоуровневую логику, которая служит для структурирования процессов и методов, используемых для реализации и развертывания торговых стратегий.",
                    "updated": 1639549788436
                },
                {
                    "language": "EL",
                    "text": "Σύστημα συναλλαγών: Ένα σύστημα συναλλαγών είναι ένα πλαίσιο που χειρίζεται τη λογική χαμηλού επιπέδου που χρησιμεύει στη δομή των διαδικασιών και των μεθόδων που χρησιμοποιούνται για την εφαρμογή και την ανάπτυξη στρατηγικών συναλλαγών.",
                    "updated": 1638962955264
                },
                {
                    "language": "DE",
                    "text": "Trading System: Ein Trading System ist ein Rahmenwerk, das die Low-Level-Logik handhabt, die dazu dient, die Prozesse und Methoden zu strukturieren, die für die Implementierung und den Einsatz von Trading Strategies verwendet werden.",
                    "updated": 1641741502917
                },
                {
                    "language": "TR",
                    "text": "Ticaret Sistemi ( Trading System ) : Bir ticaret sistemi, ticaret stratejilerini uygulamak ve dağıtmak için kullanılan süreçleri ve yöntemleri yapılandırmaya hizmet eden düşük seviyeli mantığı ele alan bir çerçevedir.",
                    "updated": 1698699101162
                },
                {
                    "language": "PT",
                    "text": "Trading System: Um sistema de negociação (Trading System) é uma estrutura que lida com a lógica fundamental que serve para estruturar os processos e métodos utilizados para implementar e implantar estratégias de negociação.",
                    "updated": 1711459823846
                }
            ]
        },
        {
            "style": "List",
            "text": "Trading Strategy: A trading strategy is the description of a set of actions or events run in stages. Events are triggered upon the validation of precise conditions describing specific market situations. Trading strategies are designed to achieve a specific goal within the broader plan of a trading system via taking and managing positions.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Trading Strategy (Торговая стратегия): торговая стратегия - это описание набора действий или событий, выполняемых поэтапно. События инициируются после подтверждения точных условий, описывающих конкретные рыночные ситуации. Торговые стратегии предназначены для достижения конкретной цели в рамках более широкого плана торговой системы посредством открытия позиций и управления ими.",
                    "updated": 1639549833388
                },
                {
                    "language": "EL",
                    "text": "Trading Strategy (Στρατηγική Συναλλαγών): Μια στρατηγική συναλλαγών είναι η περιγραφή ενός συνόλου ενεργειών ή γεγονότων που εκτελούνται σε στάδια. Τα γεγονότα ενεργοποιούνται με την επικύρωση ακριβών συνθηκών που περιγράφουν συγκεκριμένες καταστάσεις της αγοράς. Οι στρατηγικές συναλλαγών έχουν σχεδιαστεί για την επίτευξη ενός συγκεκριμένου στόχου εντός του ευρύτερου σχεδίου ενός συστήματος συναλλαγών μέσω λήψης και διαχείρισης θέσεων.",
                    "updated": 1638963081412
                },
                {
                    "language": "DE",
                    "text": "Trading Strategy: Eine Trading Strategy (Handelsstrategie) ist die Beschreibung einer Reihe von Aktionen oder Ereignissen, die schrittweise ausgeführt werden. Ereignisse werden ausgelöst, wenn bestimmte Bedingungen erfüllt sind, die bestimmte Marktsituationen beschreiben. Handelsstrategien sind darauf ausgelegt, ein bestimmtes Ziel im Rahmen des umfassenderen Plans eines Handelssystems durch das Eingehen und Verwalten von Positionen zu erreichen.",
                    "updated": 1641742187305
                },
                {
                    "language": "TR",
                    "text": "Ticaret Stratejisi ( Trading Strategy ): Bir alım satım stratejisi, aşamalı olarak yürütülen bir dizi eylem veya olayın açıklamasıdır. Olaylar, belirli piyasa durumlarını tanımlayan kesin koşulların doğrulanması üzerine tetiklenir. Alım satım stratejileri, pozisyon alma ve yönetme yoluyla bir alım satım sisteminin daha geniş planı dahilinde belirli bir hedefe ulaşmak için tasarlanmıştır.",
                    "updated": 1698699132018
                },
                {
                    "language": "PT",
                    "text": "Trading Strategy: Uma estratégia de negociação (Trading Strategy) é a descrição de um conjunto de ações ou eventos executados faseadamente. Os eventos são iniciados após a validação de condições precisas que descrevem situações de mercado específicas. As estratégias de negociação são projetadas para alcançar um objetivo específico dentro do plano mais amplo de um estratégia de negociação (Trading Strategy), através da tomada e a gestão das posições.",
                    "updated": 1711463502846
                }
            ]
        },
        {
            "style": "List",
            "text": "Trading Bot: A trading bot is a computer program that—based on datasets exposed as products by other bots (counting sensors, indicators and even other trading bots)—applies the trading logic defined on a trading system to, on one side, generate a complete trading simulation (outputting datasets that include trades, the action of strategies, validation of conditions, etc.), and on the other side, manage the execution of orders when on a forward testing or live trading session.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Trading Bot (Торговый бот): торговый бот - это компьютерная программа, которая - на основе наборов данных, представленных в качестве продуктов другими ботами (счетные датчики, индикаторы и даже другие торговые роботы) - применяет торговую логику, определенную в торговой системе, с одной стороны, для полного моделирования торговли (вывод наборов данных, включающих сделки, действие стратегий, проверка условий и т. д.), а с другой стороны, управлять исполнением ордеров во время форвардного тестирования или торговой сессии в реальном времени.",
                    "updated": 1639549857797
                },
                {
                    "language": "EL",
                    "text": "Ρομπότ Συναλλαγών: Ένα ρομπότ συναλλαγών είναι ένα πρόγραμμα υπολογιστή που -με βάση σύνολα δεδομένων που εκτίθενται ως προϊόντα από άλλα ρομπότ (αισθητήρες μέτρησης, δείκτες και ακόμη και άλλα ρομπότ συναλλαγών) - εφαρμόζει τη λογική συναλλαγών που ορίζεται σε ένα σύστημα συναλλαγών για να δημιουργήσει, από τη μία πλευρά, μια πλήρη προσομοίωση συναλλαγών (έκδοση συνόλων δεδομένων που περιλαμβάνουν συναλλαγές, δράση στρατηγικών, επικύρωση συνθηκών κ.λπ.) και, από την άλλη πλευρά, διαχείριση της εκτέλεσης των εντολών όταν βρίσκεστε σε δοκιμαστική ή πραγματική συνεδρία συναλλαγών.",
                    "updated": 1638964083474
                },
                {
                    "language": "DE",
                    "text": "Trading Bot: Ein Trading Bot ist ein Computerprogramm, das auf der Grundlage von Datensätzen, die von anderen Bots (Counting Sensors, Indikatoren und sogar anderen Trading-Bots) als Produkte ausgegeben werden, die in einem Handelssystem definierte Handelslogik anwendet, um einerseits eine vollständige Handelssimulation zu generieren (Ausgabe von Datensätzen, die Trades, die Wirkung von Strategien, die Validierung von Bedingungen usw. umfassen) und andererseits die Ausführung von Aufträgen während einer Forward-Testing- oder Live-Trading-Session zu verwalten.",
                    "updated": 1641742338856
                },
                {
                    "language": "TR",
                    "text": "Ticaret Botu ( Trading Bot ): Bir ticaret botu, diğer botlar (sayım sensörleri, göstergeler ve hatta diğer ticaret botları) tarafından ürün olarak ortaya çıkarılan veri kümelerine dayalı olarak, bir tarafta eksiksiz bir ticaret simülasyonu oluşturmak (alım satımları, stratejilerin eylemini, koşulların doğrulanmasını vb. içeren veri kümelerinin çıktısını almak) için bir ticaret sisteminde tanımlanan ticaret mantığını uygulayan ve diğer tarafta, ileri test veya canlı ticaret oturumundayken emirlerin uygulanmasını yöneten bir bilgisayar programıdır.",
                    "updated": 1698699162721
                },
                {
                    "language": "PT",
                    "text": "Trading Bot: Um bot de negociação (Trading Bot) é um programa de computador que, com base num conjuntos de dados expostos como produtos por outros bots (contando sensores, indicadores e até mesmo outros bots de negociação), aplica a lógica de negociação definida num sistema de negociação (Trading System) para, por um lado, gerar uma simulação de negociação completa (produzindo conjuntos de dados que incluem negociações, a ação de estratégias, validação de condições, etc.), e por outro lado, gerir a execução de ordens durante uma sessão de teste avançado (forward testing) ou negociação ao vivo (live trading session).",
                    "updated": 1711460272175
                }
            ]
        },
        {
            "style": "Callout",
            "text": "In Superalgos, trading systems and trading strategies are definitions describing trading logic, while the trading bot is the computer program that uses the trading logic to test strategies, produce simulations, and trade.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В Superalgos торговые системы и торговые стратегии - это определения, описывающие торговую логику, а торговый бот - это компьютерная программа, которая использует торговую логику для тестирования стратегий, моделирования и торговли.",
                    "updated": 1637939519505
                },
                {
                    "language": "EL",
                    "text": "Στο Superalgos, τα συστήματα συναλλαγών και οι στρατηγικές συναλλαγών είναι ορισμοί που περιγράφουν τη λογική των συναλλαγών, ενώ το ρομπότ συναλλαγών είναι το πρόγραμμα υπολογιστή που χρησιμοποιεί τη λογική συναλλαγών για να δοκιμάσει στρατηγικές, να παράγει προσομοιώσεις και να κάνει συναλλαγές.",
                    "updated": 1638964063091
                },
                {
                    "language": "DE",
                    "text": "In Superalgos sind Trading Systems und Trading Strategies Definitionen, die die Handelslogik beschreiben, während der Trading Bot das Computerprogramm ist, das die Handelslogik verwendet, um Strategien zu testen, Simulationen zu erstellen und zu handeln.",
                    "updated": 1641742387913
                },
                {
                    "language": "TR",
                    "text": "Superalgos'ta ticaret sistemleri ve ticaret stratejileri, ticaret mantığını açıklayan tanımlardır; ticaret botu ise stratejileri test etmek, simülasyonlar üretmek ve ticaret yapmak için ticaret mantığını kullanan bilgisayar programıdır.",
                    "updated": 1698699170017
                },
                {
                    "language": "PT",
                    "text": "No Superalgos, sistemas de negociação (Trading System) e estratégia de negociação (Trading Strategy) são definições que descrevem a lógica de negociação, enquanto o bot de negociação é o programa de computador que utiliza a lógica de negociação para testar estratégias, produzir simulações e negociar.",
                    "updated": 1711463525163
                }
            ]
        },
        {
            "style": "Note",
            "text": "This documentation expands extensively on these three concepts. For the time being, the above distinction is sufficient to continue.",
            "updated": 1609944079526,
            "translations": [
                {
                    "language": "RU",
                    "text": "В этой документации подробно рассматриваются эти три концепции. Пока что вышеупомянутого различия достаточно, чтобы продолжить.",
                    "updated": 1637939553464
                },
                {
                    "language": "EL",
                    "text": "Αυτό το κείμενο επεκτείνεται εκτενώς σε αυτές τις τρεις έννοιες. Προς το παρόν, η παραπάνω διάκριση αρκεί για να συνεχίσετε.",
                    "updated": 1638963387204
                },
                {
                    "language": "DE",
                    "text": "In dieser Dokumentation wird ausführlich auf diese drei Konzepte eingegangen. Vorläufig reicht die obige Unterscheidung aus, um fortzufahren.",
                    "updated": 1641742417822
                },
                {
                    "language": "TR",
                    "text": "Bu dokümantasyon bu üç kavramı kapsamlı bir şekilde açıklamaktadır. Şimdilik, yukarıdaki ayrım devam etmek için yeterlidir.",
                    "updated": 1698699174650
                },
                {
                    "language": "PT",
                    "text": "A documentação irá explicar exaustivamente estes três conceitos. Por enquanto, a definição acima é suficiente para continuarmos.",
                    "updated": 1711460681579
                }
            ]
        },
        {
            "style": "Text",
            "text": "Before diving into an in-depth exploration of each hierarchy, a quick overview is in order. One of the most important underlying concepts in Superalgos is that of bots. Let’s then use bots as the guiding thread to show you how the different hierarchies in Superalgos interact with each other.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Прежде чем углубиться в изучение каждой иерархии, сделаем краткий обзор. Одна из наиболее важных концепций, лежащих в основе Superalgos, - это боты. Затем давайте воспользуемся ботами в качестве ориентира, чтобы показать вам, как различные иерархии в Superalgos взаимодействуют друг с другом.",
                    "updated": 1637939606532
                },
                {
                    "language": "EL",
                    "text": "Πριν μπούμε σε μια εις βάθος εξερεύνηση κάθε ιεραρχίας, χρειάζεται μια γρήγορη επισκόπηση. Μία από τις πιο σημαντικές υποκείμενες έννοιες στο Superalgos είναι αυτή των ρομπότ. Ας χρησιμοποιήσουμε στη συνέχεια τα ρομπότ ως κατευθυντήριο νήμα για να σας δείξουμε πώς αλληλεπιδρούν μεταξύ τους οι διαφορετικές ιεραρχίες στο Superalgos.",
                    "updated": 1638964100273
                },
                {
                    "language": "DE",
                    "text": "Bevor wir die einzelnen Hierarchien eingehend erforschen, ist ein kurzer Überblick angebracht. Eines der wichtigsten grundlegenden Konzepte in Superalgos ist das der Bots. Anhand der Bots wollen wir Ihnen zeigen, wie die verschiedenen Hierarchien in Superalgos miteinander interagieren.",
                    "updated": 1641757433329
                },
                {
                    "language": "TR",
                    "text": "Her bir hiyerarşiyi derinlemesine incelemeye başlamadan önce, hızlı bir genel bakış yapmak yerinde olacaktır. Superalgos'un altında yatan en önemli kavramlardan biri botlardır. O halde, Superalgos'taki farklı hiyerarşilerin birbirleriyle nasıl etkileşime girdiğini göstermek için botları yol gösterici olarak kullanalım.",
                    "updated": 1698699179278
                },
                {
                    "language": "PT",
                    "text": "Antes de mergulharmos na exploração mais detalhada de cada hierarquia, será necessário uma visão geral rápida. Um dos conceitos mais importantes subjacentes ao Superalgos são os bots. Vamos então usar os bots como fio condutor para mostrar como as diferentes hierarquias no Superalgos interagem entre si.",
                    "updated": 1711460770530
                }
            ]
        },
        {
            "style": "Title",
            "text": "Bot Definitions",
            "translations": [
                {
                    "language": "RU",
                    "text": "Определения ботов",
                    "updated": 1637939648067
                },
                {
                    "language": "EL",
                    "text": "Ορισμοί Ρομπότ ",
                    "updated": 1638964119354
                },
                {
                    "language": "DE",
                    "text": "Bot-Definitionen",
                    "updated": 1641757446978
                },
                {
                    "language": "TR",
                    "text": "Bot Tanımları ( Bot Definitions )",
                    "updated": 1698699233610
                },
                {
                    "language": "PT",
                    "text": "Definição de Bot",
                    "updated": 1711460788470
                }
            ]
        },
        {
            "style": "Text",
            "text": "In the pages describing data mines and trading mines you will learn that bots are algorithms defined in such mines. That is, mines hold the source code and configuration—the complete set of definitions—of the three existing kinds of bots: sensors, indicators, and the trading bot.",
            "translations": [
                {
                    "language": "RU",
                    "text": "На страницах, описывающих источники данных и торговые данные, вы узнаете, что боты - это алгоритмы, определенные в таких источниках. То есть источники данных содержат исходный код и конфигурацию - полный набор определений - трех существующих видов ботов: датчиков, индикаторов и торгового бота.",
                    "updated": 1637940402491
                },
                {
                    "language": "EL",
                    "text": "Στις σελίδες που περιγράφουν τα εξορυκτήρια δεδομένων και τα εξορυκτήρια συναλλαγών θα μάθετε ότι τα ρομπότ είναι αλγόριθμοι που ορίζονται σε τέτοια εξορυκτήρια. Δηλαδή, τα εξορυκτήρια διατηρούν τον πηγαίο κώδικα και τη διαμόρφωση - το πλήρες σύνολο ορισμών - των τριών υπαρχόντων ειδών ρομπότ: αισθητήρες, δείκτες και τα ρομπότ συναλλαγών.",
                    "updated": 1638964140838
                },
                {
                    "language": "DE",
                    "text": "Auf den Seiten, die Data Mines und Trading Mines beschreiben, werden Sie lernen, dass Bots Algorithmen sind, die in solchen Minen definiert werden. Das heißt, Minen enthalten den Quellcode und die Konfiguration - den kompletten Satz an Definitionen - der drei existierenden Arten von Bots: Sensoren, Indikatoren und den Trading Bot.",
                    "updated": 1641758511780
                },
                {
                    "language": "TR",
                    "text": "Veri madenlerini ve ticaret madenlerini anlatan sayfalarda botların bu madenlerde tanımlanan algoritmalar olduğunu öğreneceksiniz. Yani madenler, mevcut üç bot türünün kaynak kodunu ve yapılandırmasını (eksiksiz tanımlar kümesi) tutar: sensörler, göstergeler ve ticaret botu.",
                    "updated": 1698699189474
                },
                {
                    "language": "PT",
                    "text": "Nas páginas que descrevem as minas de dados/informação (data mines) e as minas de negociação (trading mines), irá aprender que os bots são algoritmos definidos nessas mesmas minas. Ou seja, as minas contêm o código-fonte e a configuração — o conjunto completo de definições — dos três tipos de bots existentes: sensores, indicadores e o bot de negociação.",
                    "updated": 1711461148574
                }
            ]
        },
        {
            "style": "Text",
            "text": "As a user, you may use all bots in data mines shipping with the system. As a developer, you may create your own mines to develop your own sensors, indicators, and even a new trading bot.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Как пользователь, вы можете использовать всех ботов для сбора данных, поставляемых с системой. Как разработчик, вы можете создавать свои собственные сборщики данных для разработки собственных датчиков, индикаторов и даже нового торгового бота.",
                    "updated": 1637940510087
                },
                {
                    "language": "EL",
                    "text": "Ως χρήστης, μπορείτε να χρησιμοποιήσετε όλα τα ρομπότ στα εξορυκτήρια δεδομένων που δίδονται με το σύστημα. Ως προγραμματιστής, μπορείτε να δημιουργήσετε τα δικά σας εξορυκτήρια για να αναπτύξετε τους δικούς σας αισθητήρες, δείκτες, ακόμη και ένα νέο ρομπότ συναλλαγών.",
                    "updated": 1638963983018
                },
                {
                    "language": "DE",
                    "text": "Als Benutzer können Sie alle Bots in den Minen verwenden, die mit dem System ausgeliefert werden. Als Entwickler können Sie Ihre eigenen Minen erstellen, um Ihre eigenen Sensoren, Indikatoren und sogar einen neuen Trading-Bot zu entwickeln.",
                    "updated": 1641757561971
                },
                {
                    "language": "TR",
                    "text": "Bir kullanıcı olarak, sistemle birlikte gönderilen veri madenlerindeki tüm botları kullanabilirsiniz. Bir geliştirici olarak, kendi sensörlerinizi, göstergelerinizi ve hatta yeni bir ticaret botu geliştirmek için kendi madenlerinizi oluşturabilirsiniz.",
                    "updated": 1698699194571
                },
                {
                    "language": "PT",
                    "text": "Como utilizador,  pode usar todos os bots nas minas de dados/informação (data mines) incluídas no sistema. Como programador, pode criar suas próprias minas para desenvolver seus próprios sensores, indicadores e até mesmo um novo bot de negociação.",
                    "updated": 1711461234092
                }
            ]
        },
        {
            "style": "Title",
            "text": "Bot Instances",
            "translations": [
                {
                    "language": "RU",
                    "text": "Экземпляры ботов",
                    "updated": 1637940566659
                },
                {
                    "language": "EL",
                    "text": "Είδη Ρομπότ",
                    "updated": 1638964180331
                },
                {
                    "language": "DE",
                    "text": "Bot-Instanzen",
                    "updated": 1641757587831
                },
                {
                    "language": "TR",
                    "text": "Bot Örnekleri ( Bot Instances )",
                    "updated": 1698699206978
                },
                {
                    "language": "PT",
                    "text": "Instâncias dos Bot's",
                    "updated": 1711461333205
                }
            ]
        },
        {
            "style": "Text",
            "text": "Using any of these bots entails creating an instance of the bot definition, so that this instance may run the bot’s code. You will seldom need to create bot instances manually, as the process of installing a new market creates all necessary bot instances for your data mining operation and for running trading sessions (by the way, markets are defined and installed from within the crypto ecosystem hierarchy).",
            "translations": [
                {
                    "language": "RU",
                    "text": "Использование любого из этих ботов влечет за собой создание экземпляра определения бота, чтобы этот экземпляр мог запускать код бота. Вам редко придется создавать экземпляры ботов вручную, поскольку в процессе установки нового рынка создаются все необходимые экземпляры ботов для вашей операции интеллектуального анализа данных и для проведения торговых сессий.",
                    "updated": 1637940663667
                },
                {
                    "language": "EL",
                    "text": "Η χρήση οποιουδήποτε από αυτά τα bot συνεπάγεται τη δημιουργία ενός στιγμιότυπου του ορισμού του ρομπότ, έτσι ώστε αυτό το στιγμιότυπο να μπορεί να εκτελέσει τον κώδικα του ρομπότ. Σπάνια θα χρειαστεί να δημιουργήσετε χειροκίνητα στιγμιότυπα ρομπότ, καθώς η διαδικασία εγκατάστασης μιας νέας αγοράς δημιουργεί όλα τα απαραίτητα στιγμιότυπα ρομπότ για τη λειτουργία εξόρυξης δεδομένων και για την εκτέλεση συνεδριάσεων συναλλαγών (παρεμπιπτόντως, οι αγορές ορίζονται και εγκαθίστανται μέσα από την ιεραρχία του κρυπτογραφικού οικοσυστήματος) .",
                    "updated": 1638964461015
                },
                {
                    "language": "DE",
                    "text": "Die Verwendung eines dieser Bots erfordert die Erstellung einer Instanz der Bot-Definition, damit diese Instanz den Code des Bots ausführen kann. In den seltensten Fällen müssen Sie Bot-Instanzen manuell erstellen, da bei der Installation eines neuen Marktes alle erforderlichen Bot-Instanzen für Ihre Data-Mining-Operation und für die Durchführung von Handelssitzungen erstellt werden (Märkte werden übrigens innerhalb der Krypto-Ökosystem-Hierarchie definiert und installiert).",
                    "updated": 1641757618628
                },
                {
                    "language": "TR",
                    "text": "Bu botlardan herhangi birini kullanmak, bot tanımının bir örneğini oluşturmayı gerektirir, böylece bu örnek botun kodunu çalıştırabilir. Yeni bir piyasa kurma işlemi, veri madenciliği operasyonunuz ve alım satım oturumlarını yürütmek için gerekli tüm bot örneklerini oluşturduğundan, bot örneklerini nadiren manuel olarak oluşturmanız gerekecektir (bu arada, piyasalar kripto ekosistemi hiyerarşisi içinden tanımlanır ve kurulur).",
                    "updated": 1698699239074
                },
                {
                    "language": "PT",
                    "text": "Usar qualquer um destes bots implica criar uma instância na definição do bot, para que esta instância possa executar o código do bot. Raramente precisará de criar instâncias de bot manualmente, pois o processo de instalação de um novo mercado cria todas as instâncias de bot necessárias para a sua operação de mineração de dados e para a execução de sessões de negociação (aliás, os mercados são definidos e instalados a partir da hierarquia do ecossistema de criptografia).",
                    "updated": 1711461448787
                }
            ]
        },
        {
            "style": "Text",
            "text": "A bot instance is a reference to a bot as defined in a data or trading mine. The instance of the bot runs the defined processes and generates the defined data products.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Экземпляр бота - это ссылка на бота, как это определено в сборщике данных или торговле. Экземпляр бота запускает определенные процессы и генерирует определенные продукты данных.",
                    "updated": 1639493541774
                },
                {
                    "language": "EL",
                    "text": "Ένα στυγμιότυπο του ρομπότ είναι μια αναφορά σε ένα ρομπότ όπως ορίζεται σε ένα εξορυκτήριο δεδομένων ή συναλλαγών. Το στιγμιότυπο του ρομπότ εκτελεί τις καθορισμένες διεργασίες και δημιουργεί τα καθορισμένα προϊόντα δεδομένων.",
                    "updated": 1638964737284
                },
                {
                    "language": "DE",
                    "text": "Eine Bot-Instanz ist ein Verweis auf einen Bot, wie er in einer Daten- oder Handelsmine definiert ist. Die Instanz des Bots führt die definierten Prozesse aus und erzeugt die definierten Datenprodukte.",
                    "updated": 1641757678220
                },
                {
                    "language": "TR",
                    "text": "Bir bot örneği, bir veri veya ticaret madeninde tanımlandığı şekliyle bir bota referanstır. Bot örneği, tanımlanan süreçleri çalıştırır ve tanımlanan veri ürünlerini üretir.",
                    "updated": 1698699242922
                },
                {
                    "language": "PT",
                    "text": "Uma instância de bot é uma referência a um bot conforme definido numa mina de dados ou de negociação. A instância do bot executa os processos definidos e gera os produtos de dados definidos.",
                    "updated": 1711461504184
                }
            ]
        },
        {
            "style": "Text",
            "text": "Bot instances are run from within the network hierarchy. You use task managers and tasks to control bot instances, meaning, to start and stop them. Also in the network hierarchy lies the configurations about where the data they generate is to be stored.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Экземпляры ботов запускаются из сетевой иерархии. Вы используете диспетчеры задач и задачи для управления экземплярами ботов, то есть для их запуска и остановки. Также в сетевой иерархии находятся конфигурации о том, где должны храниться генерируемые ими данные.",
                    "updated": 1637940741408
                },
                {
                    "language": "EL",
                    "text": "Τα στιγμιότυπα του ρομπότ εκτελούνται μέσα από την ιεραρχία του δικτύου. Χρησιμοποιείτε διαχειριστές εργασιών και εργασίες για να ελέγχετε στιγμιότυπα του ρομπότ, δηλαδή, για να τα ξεκινήσετε και να τα σταματήσετε. Επίσης, στην ιεραρχία του δικτύου βρίσκονται οι διαμορφώσεις σχετικά με το πού θα αποθηκευτούν τα δεδομένα που δημιουργούν.",
                    "updated": 1638964842812
                },
                {
                    "language": "DE",
                    "text": "Bot-Instanzen werden innerhalb der Netzwerkhierarchie ausgeführt. Sie verwenden Task-Manager und Tasks, um Bot-Instanzen zu steuern, d. h. um sie zu starten und zu stoppen. Ebenfalls in der Netzhierarchie liegen die Konfigurationen darüber, wo die von ihnen erzeugten Daten gespeichert werden sollen.",
                    "updated": 1641757696179
                },
                {
                    "language": "TR",
                    "text": "Bot örnekleri ağ hiyerarşisi içinden çalıştırılır. Bot örneklerini kontrol etmek, yani onları başlatmak ve durdurmak için görev yöneticilerini ve görevleri kullanırsınız. Ayrıca ağ hiyerarşisinde, ürettikleri verilerin nerede saklanacağına ilişkin yapılandırmalar da yer alır.",
                    "updated": 1698699246890
                },
                {
                    "language": "PT",
                    "text": "As instâncias do bot são executadas a partir da hierarquia da rede. Você usa gestores de tarefas e tarefas para controlar as instâncias do bot, ou seja, para iniciá-las e pará-las. Também na hierarquia de rede estão as configurações sobre onde os dados que eles geram serão armazenados.",
                    "updated": 1711461590794
                }
            ]
        },
        {
            "style": "Title",
            "text": "Bot Dependencies",
            "translations": [
                {
                    "language": "RU",
                    "text": "Зависимости ботов",
                    "updated": 1637940762763
                },
                {
                    "language": "EL",
                    "text": "Εξαρτήσεις Των Ρομπότ",
                    "updated": 1638964881238
                },
                {
                    "language": "DE",
                    "text": "Bot-Abhängigkeiten",
                    "updated": 1641757817729
                },
                {
                    "language": "TR",
                    "text": "Bot Bağımlılıkları ( Bot Dependencies )",
                    "updated": 1698699255365
                },
                {
                    "language": "PT",
                    "text": "Dependencias dos Bot's",
                    "updated": 1711461611506
                }
            ]
        },
        {
            "style": "Text",
            "text": "Upon execution, bot instances run in a branched sequence determined by their status and data dependencies. For instance, if bot Alice depends on the data produced by bot Bob, then Alice is configured to run as soon as Bob finishes its execution. These configurations are already set up in the corresponding data mines for all existing bots. Therefore, you only need to worry about this if you develop new bots.",
            "translations": [
                {
                    "language": "RU",
                    "text": "После выполнения экземпляры ботов запускаются в разветвленной последовательности, определяемой их статусом и зависимостями данных. Например, если бот Алиса зависит от данных, созданных ботом Бобом, то Алиса настроена на запуск, как только Боб завершит свое выполнение. Эти конфигурации уже настроены в соответствующих сборщиках данных для всех существующих ботов. Следовательно, вам нужно беспокоиться об этом, только если вы разрабатываете новых ботов.",
                    "updated": 1637940854084
                },
                {
                    "language": "EL",
                    "text": "Κατά την εκτέλεση, τα στιγμιότυπα του ρομπότ εκτελούνται σε μια διακλαδισμένη ακολουθία που καθορίζεται από την κατάστασή τους και τις εξαρτήσεις δεδομένων. Για παράδειγμα, εάν το ρομπότ Alice εξαρτάται από τα δεδομένα που παράγονται από το ρομπότ Bob, τότε το Alice έχει ρυθμιστεί να εκτελείται μόλις το Bob ολοκληρώσει την εκτέλεσή του. Αυτές οι διαμορφώσεις έχουν ήδη ρυθμιστεί στα αντίστοιχα εξορυκτήρια δεδομένων για όλα τα υπάρχοντα ρομπότ. Επομένως, χρειάζεται να ανησυχείτε μόνο για αυτό εάν αναπτύξετε νέα ρομπότ.",
                    "updated": 1638964976036
                },
                {
                    "language": "DE",
                    "text": "Bei der Ausführung laufen die Bot-Instanzen in einer verzweigten Reihenfolge, die durch ihren Status und ihre Datenabhängigkeiten bestimmt wird. Wenn z. B. Bot Alice von den Daten abhängt, die von Bot Bob erzeugt werden, wird Alice so konfiguriert, dass sie ausgeführt wird, sobald Bob seine Ausführung beendet hat. Diese Konfigurationen sind bereits in den entsprechenden Datenminen für alle vorhandenen Bots eingerichtet. Sie müssen sich also nur darum kümmern, wenn Sie neue Bots entwickeln.",
                    "updated": 1641759638398
                },
                {
                    "language": "TR",
                    "text": "Yürütüldükten sonra, bot örnekleri durumları ve veri bağımlılıkları tarafından belirlenen dallanmış bir sırayla çalışır. Örneğin, Alice botu Bob botu tarafından üretilen verilere bağımlıysa, Alice, Bob yürütmesini bitirir bitirmez çalışacak şekilde yapılandırılır. Bu konfigürasyonlar mevcut tüm botlar için ilgili veri madenlerinde zaten ayarlanmıştır. Bu nedenle, yalnızca yeni botlar geliştirdiğinizde bu konuda endişelenmeniz gerekir.",
                    "updated": 1698699260577
                },
                {
                    "language": "PT",
                    "text": "Após a execução, as instâncias do bot são executadas em uma sequência ramificada determinada pelo seu status e dependências de dados. Por exemplo, se o bot Alice depende dos dados produzidos pelo bot Bob, então Alice é configurada para ser executada assim que Bob terminar sua execução. Estas configurações já estão definidas nos respectivos minas de dados para todos os bots existentes. Portanto,  só precisa de se preocupar este aspectos se optar por criar novos bots.",
                    "updated": 1711461732926
                }
            ]
        },
        {
            "style": "Text",
            "text": "What you do need to understand as a user is that, if Alice depends on data Bob produces, then Bob needs to be running for Alice to do her job. If Bob is not running, then Alice can only sit and wait for Bob to do his part first.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Что вам действительно нужно понять как пользователю, так это то, что если Алиса зависит от данных, которые производит Боб, то Боб должен работать, чтобы Алиса выполняла свою работу. Если Боб не бежит, Алиса может только сидеть и ждать, пока Боб сделает свою часть работы первым.",
                    "updated": 1637940905925
                },
                {
                    "language": "EL",
                    "text": "Αυτό που πρέπει να καταλάβετε ως χρήστης είναι ότι, εάν το Alice εξαρτάται από τα δεδομένα που παράγει το Bob, τότε το Bob πρέπει να τρέχει για να κάνει το Alice τη δουλειά του. Εάν το Μπομπ δεν τρέχει, τότε το Alice μπορεί μόνο να κάθεται και να περιμένει τον Μπομπ να κάνει πρώτα τη δουλειά του.",
                    "updated": 1638965043059
                },
                {
                    "language": "DE",
                    "text": "Was Sie als Benutzer verstehen müssen, ist, dass, wenn Alice von den Daten abhängt, die Bob produziert, Bob laufen muss, damit Alice ihre Arbeit machen kann. Wenn Bob nicht läuft, kann Alice nur dasitzen und warten, bis Bob seinen Teil erledigt hat.",
                    "updated": 1641759651611
                },
                {
                    "language": "TR",
                    "text": "Bir kullanıcı olarak anlamanız gereken şey, Alice Bob'un ürettiği verilere bağlıysa, Alice'in işini yapabilmesi için Bob'un çalışıyor olması gerektiğidir. Eğer Bob çalışmıyorsa, Alice sadece oturup Bob'un önce kendi görevini yapmasını bekleyebilir.",
                    "updated": 1698699264921
                },
                {
                    "language": "PT",
                    "text": "O que precisa de entender como utilizador é que, se Alice depende dos dados que Bob produz, então Bob precisa estar em execução para que Alice possa fazer seu trabalho. Se Bob não estiver em execução, então Alice só pode esperar que Bob faça sua parte primeiro.",
                    "updated": 1711461964264
                }
            ]
        },
        {
            "style": "Text",
            "text": "A good example of such dependencies may be found when running a live trading session. In such a case, the trading bot depends on the sensor and all indicator bots used in the referenced trading system. Indicators must process the data so that the trading bot may analyze it in realtime. Therefore, before running a live trading session, the data mining operation must be running and up to date.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Хорошим примером является запуск торговой сессии в реальном времени. В таком случае торговый бот зависит от датчика и всех индикаторных ботов, используемых в указанной торговой системе. Индикаторы должны обрабатывать данные, чтобы торговый бот мог анализировать их в реальном времени. Поэтому, прежде чем запускать торговую сессию в реальном времени, операция интеллектуального анализа данных должна быть запущена и обновляться.",
                    "updated": 1637941085371
                },
                {
                    "language": "EL",
                    "text": "Ένα καλό παράδειγμα τέτοιων εξαρτήσεων μπορεί να βρεθεί κατά την εκτέλεση μιας πραγματικής συνεδρίας συναλλαγών. Σε μια τέτοια περίπτωση, το ρομπότ συναλλαγών εξαρτάται από τον αισθητήρα και όλα τα ρομπότ ένδειξης που χρησιμοποιούνται στο συγκεκριμένο σύστημα συναλλαγών. Οι δείκτες πρέπει να επεξεργάζονται τα δεδομένα έτσι ώστε το ρομπότ συναλλαγών να μπορεί να τα αναλύσει σε πραγματικό χρόνο. Επομένως, πριν από την εκτέλεση μιας πραγματικής συνεδρίας συναλλαγών, η λειτουργία εξόρυξης δεδομένων πρέπει να εκτελείται και να είναι ενημερωμένη.",
                    "updated": 1638965146449
                },
                {
                    "language": "DE",
                    "text": "Ein gutes Beispiel für derartige Abhängigkeiten ist eine Live-Trading-Session. In einem solchen Fall hängt der Trading-Bot vom Sensor und allen Indikator-Bots ab, die im referenzierten Trading System verwendet werden. Die Indikatoren müssen die Daten verarbeiten, damit der Trading-Bot sie in Echtzeit auswerten kann. Daher muss vor der Durchführung einer Live-Trading-Session die Data-Mining-Operation ausgeführt werden und auf dem neuesten Stand sein.",
                    "updated": 1641759752672
                },
                {
                    "language": "TR",
                    "text": "Bu tür bağımlılıklara iyi bir örnek, canlı bir ticaret oturumu yürütülürken bulunabilir. Böyle bir durumda, alım satım botu sensöre ve referans alınan alım satım sisteminde kullanılan tüm gösterge botlarına bağlıdır. Göstergeler, alım satım botunun gerçek zamanlı olarak analiz edebilmesi için verileri işlemelidir. Bu nedenle, canlı bir alım satım seansı gerçekleştirmeden önce veri madenciliği işleminin çalışıyor ve güncel olması gerekir.",
                    "updated": 1698699269009
                },
                {
                    "language": "PT",
                    "text": "Um bom exemplo dessas dependências pode ser encontrado ao executar uma sessão de negociação ao vivo. Neste caso, o bot de negociação depende do sensor e de todos os bots indicadores usados no sistema de negociação referenciado. Os indicadores devem processar os dados para que o bot de negociação possa analisá-los em tempo real. Portanto, antes de iniciar uma sessão de negociação ao vivo, a operação de mineração de dados deve estar em execução e atualizada.",
                    "updated": 1711462096204
                }
            ]
        },
        {
            "style": "Title",
            "text": "Bots Execution",
            "translations": [
                {
                    "language": "RU",
                    "text": "Запуск ботов",
                    "updated": 1637941114442
                },
                {
                    "language": "EL",
                    "text": "Λειτουργία των ρομπότ",
                    "updated": 1638965221412
                },
                {
                    "language": "DE",
                    "text": "Ausführung der Bots",
                    "updated": 1641759787452
                },
                {
                    "language": "TR",
                    "text": "Botların Yürütülmesi ( Bots Execution )",
                    "updated": 1698699277978
                },
                {
                    "language": "PT",
                    "text": "Execução de Bots",
                    "updated": 1711462108569
                }
            ]
        },
        {
            "style": "Text",
            "text": "Each bot runs for as long as it may require to perform its job, usually in the order of a few seconds, and remains asleep until the next cycle is due. That is, bots run for short bursts, in frequent cycles. The reason for this behavior is that bots are prepared to read live data feeds and process it online.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Каждый бот работает столько времени, сколько может потребоваться для выполнения своей работы, обычно порядка нескольких секунд, и остается спящим до наступления следующего цикла. То есть боты запускаются короткими очередями, частыми циклами. Причина такого поведения в том, что боты готовы читать потоки данных в реальном времени и обрабатывать их онлайн.",
                    "updated": 1637941148484
                },
                {
                    "language": "EL",
                    "text": "Κάθε ρομπότ λειτουργεί για όσο διάστημα μπορεί να χρειαστεί για να εκτελέσει τη δουλειά του, συνήθως της τάξης των λίγων δευτερολέπτων, και παραμένει σε κατάσταση ύπνου μέχρι να ολοκληρωθεί ο επόμενος κύκλος. Δηλαδή, τα ρομπότ τρέχουν για σύντομο χρόνο, σε συχνούς τακτά διαστήματα. Ο λόγος για αυτήν τη συμπεριφορά είναι ότι τα ρομπότ είναι έτοιμα να διαβάζουν ζωντανές ροές δεδομένων και να τις επεξεργάζονται στο διαδίκτυο.",
                    "updated": 1638965334255
                },
                {
                    "language": "DE",
                    "text": "Jeder Bot läuft so lange, wie er für die Ausführung seiner Aufgabe benötigt, in der Regel in der Größenordnung von einigen Sekunden, und schläft dann, bis der nächste Zyklus ansteht. Das heißt, die Bots laufen in kurzen Intervallen, in häufigen Zyklen. Der Grund für dieses Verhalten ist, dass die Bots darauf vorbereitet sind, Live-Daten zu lesen und online zu verarbeiten.",
                    "updated": 1641759843963
                },
                {
                    "language": "TR",
                    "text": "Her bot görevini yerine getirmek için ihtiyaç duyduğu süre boyunca, genellikle birkaç saniye boyunca çalışır ve bir sonraki döngünün zamanı gelene kadar uykuda kalır. Yani, botlar sık döngüler halinde kısa sürelerle çalışır. Bu davranışın nedeni, botların canlı veri akışlarını okumak ve çevrimiçi olarak işlemek için hazırlanmış olmasıdır.",
                    "updated": 1698699283657
                },
                {
                    "language": "PT",
                    "text": "Cada bot é executado pelo tempo necessário para realizar o seu trabalho, geralmente na ordem de alguns segundos, e permanece inativo até que o próximo ciclo. Ou seja, os bots são executados em “rajadas curtas”, em ciclos frequentes. O motivo deste comportamento é que os bots estão preparados para ler informações de dados ao vivo e processá-los online.",
                    "updated": 1711462256141
                }
            ]
        },
        {
            "style": "Text",
            "text": "Bots need to know which market of which exchange they should work with. Exchanges and markets are defined in the crypto ecosystem hierarchy. Bots obtain that information by establishing references with the appropriate markets in that hierarchy.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Боты должны знать, на каком рынке и на какой бирже им следует работать. Биржи и рынки определены в иерархии крипто-экосистемы. Боты получают эту информацию, устанавливая ссылки на соответствующие рынки в этой иерархии.",
                    "updated": 1637941171007
                },
                {
                    "language": "EL",
                    "text": "Τα ρομπότ πρέπει να γνωρίζουν με ποια αγορά από ποιο χρηματιστήριο θα πρέπει να συνεργαστούν. Τα χρηματιστήρια και οι αγορές ορίζονται στην ιεραρχία του οικοσυστήματος κρυπτογράφησης. Τα ρομπότ αποκτούν αυτές τις πληροφορίες καθιερώνοντας αναφορές με τις κατάλληλες αγορές σε αυτήν την ιεραρχία.",
                    "updated": 1638965424331
                },
                {
                    "language": "DE",
                    "text": "Bots müssen wissen, mit welchem Markt oder welcher Börse sie arbeiten sollen. Die Börsen und Märkte sind in der Hierarchie des Krypto-Ökosystems definiert. Bots erhalten diese Informationen, indem sie Referenzen zu den entsprechenden Märkten in dieser Hierarchie herstellen.",
                    "updated": 1641759873181
                },
                {
                    "language": "TR",
                    "text": "Botların hangi borsanın hangi piyasası ile çalışması gerektiğini bilmesi gerekir. Borsalar ve piyasalar kripto ekosistemi hiyerarşisinde tanımlanmıştır. Botlar, bu hiyerarşideki uygun piyasalarla referanslar kurarak bu bilgileri elde eder.",
                    "updated": 1698699291611
                },
                {
                    "language": "PT",
                    "text": "Os bots precisam saber qual o mercado e de qual correctora devem trabalhar. As correctoras e os mercados são definidos na hierarquia no ecossistema de criptomoedas. Os bots obtêm essas informações estabelecendo referências com os mercados apropriados nessa hierarquia.",
                    "updated": 1711462387531
                }
            ]
        },
        {
            "style": "Text",
            "text": "In the case of the trading bot, it also needs to know which type of trading session it should run, and what trading system’s rules it should follow. For those reasons, trading bots are paired with a specific session, which in turn, references a trading system.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В случае с торговым ботом ему также необходимо знать, какой тип торговой сессии он должен запустить и каким правилам торговой системы он должен следовать. По этим причинам торговые боты связаны с определенной сессией, которая, в свою очередь, ссылается на торговую систему.",
                    "updated": 1637941199948
                },
                {
                    "language": "EL",
                    "text": "Στην περίπτωση του ρομπότ συναλλαγών, πρέπει επίσης να γνωρίζει ποιον τύπο συνεδρίας συναλλαγών θα πρέπει να εκτελέσει και ποιους κανόνες συστήματος συναλλαγών πρέπει να ακολουθεί. Για αυτούς τους λόγους, τα ρομπότ συναλλαγών συνδυάζονται με μια συγκεκριμένη συνεδρία, η οποία με τη σειρά της αναφέρεται σε ένα σύστημα συναλλαγών.",
                    "updated": 1638965484845
                },
                {
                    "language": "DE",
                    "text": "Im Falle des Trading-Bots muss er auch wissen, welche Art von Trading-Session er durchführen soll und welche Regeln des Trading-System er befolgen soll. Aus diesen Gründen werden Trading Bots mit einer bestimmten Sitzung gekoppelt, die ihrerseits auf ein Handelssystem verweist.",
                    "updated": 1641760067260
                },
                {
                    "language": "TR",
                    "text": "Ticaret botu söz konusu olduğunda, hangi tür ticaret oturumunu çalıştırması gerektiğini ve hangi ticaret sisteminin kurallarına uyması gerektiğini de bilmesi gerekir. Bu nedenlerle, ticaret botları belirli bir oturumla eşleştirilir ve bu da bir ticaret sistemine referans verir.",
                    "updated": 1698699295362
                },
                {
                    "language": "PT",
                    "text": "No caso do bot de negociação, ele também precisa saber qual tipo de sessão de negociação deve executar e quais são as regras do sistema de negociação que deve seguir. Por estes motivos, os bots de negociação são associados a uma sessão específica, que por sua vez, faz referência a um sistema de negociação.",
                    "updated": 1711462446578
                }
            ]
        },
        {
            "style": "Text",
            "text": "Trading systems are themselves hierarchies. You may create a trading system by following a framework in which strategies are described in stages. You do not need to code to create a strategy, as the rules are written with simple mathematical statements. However, both basic and advanced knowledge of JavaScript will give you an edge. You may test and deploy your trading system by running trading sessions from within the network hierarchy.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Торговые системы сами по себе являются иерархиями. Вы можете создать торговую систему, следуя структуре, в которой стратегии описываются поэтапно. Ва�� не нужно писать код для создания стратегии, так как правила написаны с помощью простых математических операторов. Однако как базовые, так и продвинутые знания JavaScript дадут вам преимущество. Вы можете протестировать и развернуть свою торговую систему, запустив торговые сессии из сетевой иерархии.",
                    "updated": 1637941289667
                },
                {
                    "language": "EL",
                    "text": "Trading systems (Τα συστήματα συναλλαγών) είναι από μόνα τους ιεραρχίες. Μπορείτε να δημιουργήσετε ένα σύστημα συναλλαγών ακολουθώντας ένα πλαίσιο στο οποίο οι στρατηγικές περιγράφονται σταδιακά. Δεν χρειάζεται να γράψετε κώδικα για να δημιουργήσετε μια στρατηγική, καθώς οι κανόνες γράφονται με απλές μαθηματικές προτάσεις. Ωστόσο, τόσο η βασική όσο και η προηγμένη γνώση JavaScript θα σας δώσουν ένα πλεονέκτημα. Μπορείτε να δοκιμάσετε και να αναπτύξετε το σύστημα συναλλαγών σας εκτελώντας συνεδρίες συναλλαγών μέσα από την ιεραρχία του δικτύου.",
                    "updated": 1638965557790
                },
                {
                    "language": "DE",
                    "text": "Trading-Systeme selbst sind Hierarchien. Ein Trading System können Sie erstellen, indem Sie einem Framework folgen, in dem Strategien in Stufen beschrieben werden. Sie müssen nicht programmieren, um eine Strategie zu erstellen, da die Regeln mit einfachen mathematischen Aussagen geschrieben werden. Allerdings sind sowohl grundlegende als auch fortgeschrittene JavaScript-Kenntnisse von Vorteil. Sie können Ihr Handelssystem testen und einsetzen, indem Sie Handelssitzungen innerhalb der Netzwerkhierarchie durchführen.",
                    "updated": 1641760198660
                },
                {
                    "language": "TR",
                    "text": "Alım satım sistemlerinin kendileri de hiyerarşidir. Stratejilerin aşamalar halinde tanımlandığı bir çerçeveyi takip ederek bir alım satım sistemi oluşturabilirsiniz. Kurallar basit matematiksel ifadelerle yazıldığından, bir strateji oluşturmak için kod yazmanıza gerek yoktur. Ancak, hem temel hem de ileri düzey JavaScript bilgisi size avantaj sağlayacaktır. Ağ hiyerarşisi içinden alım satım oturumları çalıştırarak alım satım sisteminizi test edebilir ve dağıtabilirsiniz.",
                    "updated": 1698699300029
                },
                {
                    "language": "PT",
                    "text": "Os sistemas de negociação (Trading System) são, por si só, hierarquias. Poderá criar um sistema de negociação seguindo um framework no qual as estratégias são descritas em etapas. Não precisa de ser programador para criar uma estratégia, já que as regras são escritas com declarações matemáticas simples. No entanto, tanto o conhecimento básico quanto o avançado de JavaScript podem lhe dar vantagem. Poderá testar e implantar o seu sistema de negociação executando sessões de negociação de dentro da hierarquia da rede.",
                    "updated": 1711462586417
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}