{
    "topic": "Introduction",
    "pageNumber": "1",
    "type": "Fundamental Superalgos Concepts",
    "definition": {
        "text": "Superalgos breaks up complexity and describes the fundamental concepts that make up trading intelligence in hierarchies of nodes. Nodes may reference other nodes to access information in other hierarchies.",
        "updated": 1609943915544
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Algorithmic trading is a data-driven application. It is the superior ability to derive intelligence from data—above all—that gives automated trading an edge over trading manually.",
            "updated": 1609943931550
        },
        {
            "style": "Text",
            "text": "However, it would be simplistic to assume that trading intelligence emerges from data alone."
        },
        {
            "style": "Callout",
            "text": "Trading intelligence emerges from harnessing the interactions of multiple complex concepts."
        },
        {
            "style": "Text",
            "text": "Superalgos is a software infrastructure that contributes to harnessing those concepts and interactions by breaking complexity into small units of information called nodes and arranging them into larger data structures called hierarchies."
        },
        {
            "style": "Text",
            "text": "A hierarchy is a data structure representing an overarching, top-level concept, resulting in a long chain of nodes, usually with many ramifications. The system manages different types of hierarchies, each of them with a specific focus. For example, crypto ecosystem, data mines, or charting space."
        },
        {
            "style": "Text",
            "text": "A node is a small data structure containing information that may be related to market information, trading intelligence, the operation of the system, or other concepts. They are visually represented by icons in the design space."
        },
        {
            "style": "Text",
            "text": "The design space is the visual environment that hosts all system and user definitions. In practical terms, it is the black space below the slider that splits the screen horizontally, separating the design space in the bottom from the charting space on top. As a hierarchy, it features nodes that enable user-control over certain aspects of the look, feel, and behavior of the space."
        },
        {
            "style": "Callout",
            "text": "In other words, nodes arranged in hierarchical data structures describe the top-level concepts that make up trading intelligence in a way that helps users visualize and better understand them."
        },
        {
            "style": "Text",
            "text": "These top-level concepts described as hierarchies interact with other concepts, that is, with other hierarchies. Interactions among hierarchies are called references."
        },
        {
            "style": "Text",
            "text": "A reference is a mechanism by which information in a node is related to, or accessed by, other nodes. The ability of a node to establish a reference with another node enables the first to access the information or features entailed in the second one."
        },
        {
            "style": "Text",
            "text": "To organize all of this information, Superalgos manages the concept of workspaces. A workspace is an entity storing all system and user-generated information, excluding the state and contents of plugins. In technical terms, a workspace is a JSON file."
        },
        {
            "style": "Note",
            "text": "The Bots page brings these conceptual definitions down to earth and offers an overview of how what these top-level concepts are and how they interact with each other.",
            "updated": 1637697607949
        }
    ]
}