{
    "topic": "Introduction",
    "pageNumber": "7",
    "type": "References",
    "definition": {
        "text": "A reference is a mechanism by which information in a node is related to, or accessed by, other nodes. The ability of a node to establish a reference with another node enables the first to access the information or features entailed in the second one.",
        "updated": 1609950165954,
        "translations": [
            {
                "language": "RU",
                "text": "Чтобы установить ссылку, щелкните правой кнопкой мыши первый узел и перетащите его ближе к целевому узлу. Чтобы удалить ссылку, используйте кнопку удаления ссылки в меню.",
                "updated": 1638275608891
            },
            {
                "language": "EL",
                "text": "Για να δημιουργήσετε μια αναφορά, κάντε δεξί κλικ στον πρώτο κόμβο και σύρετέ τον κοντά στον κόμβο προορισμού. Για να αφαιρέσετε μια αναφορά, χρησιμοποιήστε το κουμπί αποσύνδεσης στο μενού.",
                "updated": 1641831518856
            },
            {
                "language": "TR",
                "text": "Referans, bir düğümdeki bilgilerin diğer düğümlerle ilişkili kurma yoludur, düğümlerin birbirleri ile iletişim kurduğu bir mekanizmadır. Bir düğümün başka bir düğümle referans oluşturma yeteneği, birincinin ikincisinde yer alan bilgilere veya özelliklere erişmesini sağlar.",
                "updated": 1639721694189
            },
            {
                "language": "DE",
                "text": "Um eine Referenz herzustellen, klicken Sie mit der rechten Maustaste auf den ersten Knoten und ziehen ihn in die Nähe des Zielknotens. Um eine Referenz zu entfernen, verwenden Sie die Schaltfläche Delink im Menü.",
                "updated": 1643180204105
            },
            {
                "language": "NL",
                "text": "Om een referentie vast te stellen, klikt u met de rechtermuisknop op het eerste knooppunt en sleept u het naar het doelknooppunt. Gebruik de delink knop in het menu om een referentie te verwijderen.",
                "updated": 1668338997266
            },
            {
                "language": "PT",
                "text": "Para estabelecer uma referência, clique com o botão direito do rato no primeiro nó (node) e arraste-o para próximo do nó (node) de destino. Para remover uma referência, use o botão de desvinculação no menu. ",
                "updated": 1711655558325
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Direction",
            "translations": [
                {
                    "language": "RU",
                    "text": "Направление ",
                    "updated": 1638274544071
                },
                {
                    "language": "EL",
                    "text": "Direction (Κατεύθυνση)",
                    "updated": 1641831264696
                },
                {
                    "language": "DE",
                    "text": "Richtung",
                    "updated": 1643178762989
                },
                {
                    "language": "TR",
                    "text": "Yön ( Direction )",
                    "updated": 1698699624578
                },
                {
                    "language": "PT",
                    "text": "Direcção",
                    "updated": 1711466243053
                }
            ]
        },
        {
            "style": "Text",
            "text": "References have a direction property relative to each of the nodes involved in the reference: the node establishing the reference sets an outgoing reference, while the one accepting the reference sets an incoming reference.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Ссылки имеют свойство направления относительно каждого из узлов, участвующих в ссылке: узел, устанавливающий ссылку, устанавливает исходящую ссылку, а тот, который принимает ссылку, устанавливает входящую ссылку.",
                    "updated": 1638274581454
                },
                {
                    "language": "EL",
                    "text": "Οι αναφορές έχουν κατεύθυνση σε σχέση με κάθε έναν από τους κόμβους που εμπλέκονται στην αναφορά: ο κόμβος που δημιουργεί την αναφορά ορίζει μια εξερχόμενη αναφορά, ενώ αυτός που αποδέχεται την αναφορά ορίζει μια εισερχόμενη αναφορά.",
                    "updated": 1638977405548
                },
                {
                    "language": "TR",
                    "text": "Referanslar, referansta yer alan düğümlerin her birine göre bir yön özelliğine sahiptir: referansı oluşturan düğüm giden bir referansı ayarlarken, referansı kabul eden bir gelen referansı ayarlar.",
                    "updated": 1639721717798
                },
                {
                    "language": "DE",
                    "text": "Referenzen haben eine Richtungseigenschaft in Bezug auf jeden der an der Referenz beteiligten Nodes: Der Node, der die Referenz herstellt, setzt eine ausgehende Referenz, während der Node, der die Referenz akzeptiert, eine eingehende Referenz setzt.",
                    "updated": 1643178817756
                },
                {
                    "language": "NL",
                    "text": "Referenties hebben een richtingseigenschap met betrekking tot elk van de knooppunten die bij de referentie betrokken zijn: het knooppunt dat de referentie tot stand brengt, stelt een uitgaande referentie in, terwijl degene die de referentie accepteert een inkomende referentie instelt.",
                    "updated": 1668338647809
                },
                {
                    "language": "PT",
                    "text": "As referências possuem uma propriedade na direção em relação a cada um dos nós (nodes) envolvidos na referência: o nó (node) que estabelece a referência define uma referência de saída, enquanto o que aceita a referência define uma referência de entrada.",
                    "updated": 1711466360109
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example, a Backtesting Session establishes an outgoing reference with a Trading System. This allows the session to access the information within the whole trading system hierarchy, including strategies. At the trading system level, the same reference is viewed as an incoming reference.",
            "updated": 1615795085518,
            "translations": [
                {
                    "language": "RU",
                    "text": "Например, Backtesting Session устанавливает исходящую ссылку с Trading System. Это позволяет сеансу получать доступ к информации внутри всей иерархии торговой системы, включая стратегии. На уровне торговой системы та же ссылка рассматривается как входящая.",
                    "updated": 1638274749386
                },
                {
                    "language": "EL",
                    "text": "Για παράδειγμα, μια Backtesting Session (Συνεδρία Τεστ) δημιουργεί μια εξερχόμενη αναφορά με ένα Trading System (Σύστημα Συναλλαγών). Αυτό επιτρέπει στη συνεδρία να έχει πρόσβαση στις πληροφορίες σε ολόκληρη την ιεραρχία του συστήματος συναλλαγών, συμπεριλαμβανομένων των στρατηγικών. Σε επίπεδο συστήματος συναλλαγών, η ίδια αναφορά θεωρείται ως εισερχόμενη αναφορά.",
                    "updated": 1638978043183
                },
                {
                    "language": "TR",
                    "text": "Örneğin, Geriye Dönük Test Oturumu ( Backtesting Session ), bir Ticaret Sistemi ( Trading System ) ile giden bir referans oluşturur. Bu, Geriye dönük test otuıtumunun stratejiler de dahil olmak üzere tüm ticaret sistemi hiyerarşisindeki bilgilere erişmesini sağlar. Ticaret sistemi düğümünde, aynı referans gelen referans olarak görülür.",
                    "updated": 1639721840641
                },
                {
                    "language": "DE",
                    "text": "Zum Beispiel stellt eine Backtesting Session eine ausgehende Referenz zu einem Trading System her. Dies ermöglicht der Sitzung den Zugriff auf die Informationen innerhalb der gesamten Trading-System-Hierarchie, einschließlich der Strategien. Auf der Ebene des Trading-Systems wird die gleiche Referenz als eingehende Referenz betrachtet.",
                    "updated": 1643178915672
                },
                {
                    "language": "NL",
                    "text": "Een Backtesting Session brengt bijvoorbeeld een uitgaande referentie tot stand met een Trading System. Hierdoor heeft de sessie toegang tot de informatie binnen de hele hiërarchie van het handelssysteem, inclusief strategieën. Op het niveau van het handelssysteem wordt dezelfde referentie gezien als een inkomende referentie.",
                    "updated": 1668338688023
                },
                {
                    "language": "PT",
                    "text": "Por exemplo, numa Sessão de Backtesting (Backtesting Session) estabelece uma referência de saída com um Sistema de Negociação (Trading System). Isso permite que a sessão aceda às informações dentro de toda a hierarquia do sistema de negociação (Trading System), incluindo as estratégias. No nível do sistema de negociação (Trading System), a mesma referência é vista como uma referência de entrada.",
                    "updated": 1711466595311
                }
            ]
        },
        {
            "style": "Note",
            "text": "A node may produce only one outgoing reference, however, it may take several incoming references.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел может создавать только одну исходящую ссылку, однако может принимать несколько входящих ссылок.",
                    "updated": 1638274777302
                },
                {
                    "language": "EL",
                    "text": "Ένας κόμβος μπορεί να παράγει μόνο μία εξερχόμενη αναφορά, ωστόσο, μπορεί να χρειαστούν πολλές εισερχόμενες αναφορές.",
                    "updated": 1638978069101
                },
                {
                    "language": "TR",
                    "text": "Bir düğüm yalnızca bir giden referans üretebilir, ancak birkaç gelen referans alabilir.",
                    "updated": 1639721860207
                },
                {
                    "language": "DE",
                    "text": "Ein Node darf nur eine ausgehende Referenz erzeugen, kann aber mehrere eingehende Referenzen aufnehmen.",
                    "updated": 1643178979063
                },
                {
                    "language": "NL",
                    "text": "Een knooppunt kan slechts één uitgaande referentie produceren, maar het kan meerdere inkomende referenties accepteren.",
                    "updated": 1668338720701
                },
                {
                    "language": "PT",
                    "text": "Um nó (node) pode produzir apenas uma referência de saída, no entanto, pode receber várias referências de entrada.",
                    "updated": 1711466683837
                }
            ]
        },
        {
            "style": "Title",
            "text": "Scope",
            "translations": [
                {
                    "language": "RU",
                    "text": "Область видимости",
                    "updated": 1638274815389
                },
                {
                    "language": "EL",
                    "text": "Scope (Πεδίο εφαρμογής)",
                    "updated": 1641831282906
                },
                {
                    "language": "TR",
                    "text": "Kapsam",
                    "updated": 1639721877331
                },
                {
                    "language": "DE",
                    "text": "Geltungsbereich",
                    "updated": 1643179205457
                },
                {
                    "language": "PT",
                    "text": "Âmbito",
                    "updated": 1711466692058
                }
            ]
        },
        {
            "style": "Text",
            "text": "A reference established between nodes of any particular structure within a hierarchy is said to be an internal reference relative to the said structure of nodes. Similarly, a reference established with a node outside of the said structure, that is, in a different part of the hierarchy or in another hierarchy, is said to be an external reference.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Ссылка, установленная между узлами любой конкретной структуры в иерархии, называется внутренней ссылкой по отношению к указанной структуре узлов. Точно так же ссылка, установленная для узла вне указанной структуры, то есть в другой части иерархии или в другой иерархии, называется внешней ссылкой.",
                    "updated": 1638274847075
                },
                {
                    "language": "EL",
                    "text": "Μια αναφορά που δημιουργείται μεταξύ κόμβων οποιασδήποτε συγκεκριμένης δομής σε μια ιεραρχία λέγεται ότι είναι μια εσωτερική αναφορά σε σχέση με την εν λόγω δομή των κόμβων. Ομοίως, μια αναφορά που έχει δημιουργηθεί με έναν κόμβο έξω από την εν λόγω δομή, δηλαδή σε διαφορετικό τμήμα της ιεραρχίας ή σε άλλη ιεραρχία, λέγεται ότι είναι μια εξωτερική αναφορά.",
                    "updated": 1638978132595
                },
                {
                    "language": "TR",
                    "text": "Bir hiyerarşi içindeki herhangi bir yapının düğümleri arasında oluşturulan bir referansın, bahsedilen düğüm yapısına göre bir iç referanstır.Benzer şekilde, söz konusu yapının dışında, yani hiyerarşinin farklı bir bölümünde veya başka bir hiyerarşide bir düğümle kurulan bir referansa dış referans denir.",
                    "updated": 1639721964625
                },
                {
                    "language": "DE",
                    "text": "Ein Verweis, der zwischen Nodes einer bestimmten Struktur innerhalb einer Hierarchie hergestellt wird, wird als interner Verweis in Bezug auf die besagte Struktur von Nodes bezeichnet. Entsprechend wird eine Referenz, die mit einem Knoten außerhalb der genannten Struktur, d. h. in einem anderen Teil der Hierarchie oder in einer anderen Hierarchie, hergestellt wird, als externe Referenz bezeichnet.",
                    "updated": 1643179205457
                },
                {
                    "language": "NL",
                    "text": "Een referentie die tot stand wordt gebracht tussen knooppunten van een bepaalde structuur binnen een hiërarchie wordt een interne referentie genoemd met betrekking tot de genoemde structuur van knooppunten. Evenzo wordt een referentie die tot stand is gebracht met een knooppunt buiten de genoemde structuur, dat wil zeggen in een ander deel van de hiërarchie of in een andere hiërarchie, een externe referentie genoemd.",
                    "updated": 1668338752770
                },
                {
                    "language": "PT",
                    "text": "Uma referência estabelecida entre nós (nodes) de uma estrutura particular dentro de uma hierarquia é considerada uma referência interna em relação a essa estrutura de nós (nodes). Da mesma forma, uma referência estabelecida com um nó (node) fora dessa estrutura, ou seja, numa parte diferente da hierarquia ou noutra hierarquia, é considerado uma referência externa.",
                    "updated": 1711466804650
                }
            ]
        },
        {
            "style": "Text",
            "text": "Examples of internal references may be found in the Data Mine and Crypto Ecosystem hierarchies. For example, let’s briefly look into one such case within a Plotter Module.",
            "updated": 1615795128743,
            "translations": [
                {
                    "language": "RU",
                    "text": "Примеры внутренних ссылок можно найти в иерархиях Data Mine и Crypto Ecosystem. Например, давайте кратко рассмотрим один такой случай в модуле плоттера.",
                    "updated": 1638274908334
                },
                {
                    "language": "EL",
                    "text": "Παραδείγματα εσωτερικών αναφορών μπορούν να βρεθούν στις ιεραρχίες Data Mine (Εξόρυξη Δεδομένων) και Crypto Ecosystem (Οικοσύστημα Κρύπτο). Για παράδειγμα, ας εξετάσουμε εν συντομία μια τέτοια περίπτωση σε μια Plotter Module (μονάδα Σχεδιογράφου).",
                    "updated": 1638978318212
                },
                {
                    "language": "TR",
                    "text": "Dahili referans örnekleri Veri Madeni ( Data Mine ) ve Kripto Ekosistem ( Crypto Ecosystem ) hiyerarşilerinde bulunabilir. Örneğin, bir Plotter Modülü ( Plotter Module )  içinde böyle bir duruma kısaca bakalım.",
                    "updated": 1639722060706
                },
                {
                    "language": "DE",
                    "text": "Beispiele für interne Verweise finden sich in den Hierarchien Data Mine und Crypto Ecosystem. Schauen wir uns zum Beispiel kurz einen solchen Fall innerhalb eines Plotter-Moduls an.",
                    "updated": 1643179401456
                },
                {
                    "language": "NL",
                    "text": "Voorbeelden van interne verwijzingen zijn te vinden in de hiërarchieën Data Mine en Crypto Ecosystem. Laten we bijvoorbeeld kort kijken naar een dergelijk geval binnen een Plotter Module.",
                    "updated": 1668338783386
                },
                {
                    "language": "PT",
                    "text": "Exemplos de referências internas podem ser encontrados nas hierarquias Data Mine e Crypto Ecosystem. Por exemplo, vamos dar uma breve olhada em um caso desses dentro de um Módulo da Plotter (Plotter Module).",
                    "updated": 1711466884931
                }
            ]
        },
        {
            "style": "Text",
            "text": "The capture below shows the Shapes node and several offspring nodes: on one hand, several Polygon nodes; on the other hand, the Chart Points node.",
            "updated": 1615795168459,
            "translations": [
                {
                    "language": "RU",
                    "text": "На снимке ниже показан узел Shapes и несколько дочерних узлов: с одной стороны, несколько узлов Polygon; с другой стороны, узел Chart Points.",
                    "updated": 1638275031050
                },
                {
                    "language": "EL",
                    "text": "Η παρακάτω εικόνα δείχνει τον κόμβο Shapes και αρκετούς κόμβους απόγονους: από τη μία πλευρά, αρκετοί κόμβοι Polygon. από την άλλη πλευρά, ο κόμβος Chart Points.",
                    "updated": 1638980330060
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki video, Shapes düğümünü ve ona bağlı birkaç alt düğümü gösteriyr: bir tarafta, birkaç Poligon ( Polygon ) düğümü; Öte yandan, Grafik Noktaları ( Chart Points ) düğümü.",
                    "updated": 1639722616225
                },
                {
                    "language": "DE",
                    "text": "Die folgende Abbildung zeigt den Shapes Node und mehrere untergeordnete Nodes: einerseits mehrere Polygon Nodes, andererseits den Chart Points Node.",
                    "updated": 1643179477086
                },
                {
                    "language": "NL",
                    "text": "De onderstaande opname toont het Shapes knooppunt en verschillende sub-knooppunten: aan de ene kant verschillende Polygoon knooppunten; aan de andere kant, het knooppunt Chart Points.",
                    "updated": 1668338832753
                },
                {
                    "language": "PT",
                    "text": "O screenshot abaixo mostra o nó (node) da Formas (Shapes) e vários nós (nodes) descendentes: por um lado, vários nós (nodes) Polígonos (Polygon); por outro lado, o nó (node) Pontos de Gráfico (Chart Points).",
                    "updated": 1711467152676
                }
            ]
        },
        {
            "style": "Gif",
            "text": "GIFs/Foundations/Docs/design-space/shapes-node-references.gif",
            "updated": 1615796201734
        },
        {
            "style": "Text",
            "text": "Notice that vertices under each polygon reference to points under the chart points node.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Обратите внимание, что вершины под каждым многоугольником ссылаются на точки под узлом точек диаграммы.",
                    "updated": 1638275444310
                },
                {
                    "language": "EL",
                    "text": "Παρατηρήστε ότι οι κορυφές κάτω από κάθε πολύγωνο αναφέρονται σε σημεία κάτω από τον κόμβο σημείων γραφήματος.",
                    "updated": 1638980369747
                },
                {
                    "language": "TR",
                    "text": "Polygon altındaki her Vertex'in, grafik noktaları düğümünün altındaki noktalara atıfta bulunduğuna dikkat edin.",
                    "updated": 1639722760063
                },
                {
                    "language": "DE",
                    "text": "Beachten Sie, dass die Scheitelpunkte (Vertex) unter jedem Polygon auf Punkte unter dem Chart Points Node verweisen.",
                    "updated": 1643179624807
                },
                {
                    "language": "NL",
                    "text": "Merk op dat hoekpunten onder elke polygoon verwijzen naar punten onder het knooppunt van chart points.",
                    "updated": 1668338862641
                },
                {
                    "language": "PT",
                    "text": "Repare que os vértices sob cada polígono referem a pontos sob o nó Pontos do Gráfico.",
                    "updated": 1711467314777
                }
            ]
        },
        {
            "style": "Text",
            "text": "This means that the node Shapes features several internal references.",
            "updated": 1620493425376,
            "translations": [
                {
                    "language": "RU",
                    "text": "Это означает, что узел Shapes имеет несколько внутренних ссылок.",
                    "updated": 1638275462704
                },
                {
                    "language": "EL",
                    "text": "Αυτό σημαίνει ότι ο κόμβος Shapes διαθέτει πολλές εσωτερικές αναφορές.",
                    "updated": 1638980395830
                },
                {
                    "language": "TR",
                    "text": "Burda, Şekiller düğümünün birkaç dahili referansa sahip olduğunu görüyoruz.",
                    "updated": 1639722858512
                },
                {
                    "language": "DE",
                    "text": "Das bedeutet, dass der Node Shapes mehrere interne Referenzen aufweist.",
                    "updated": 1643179679721
                },
                {
                    "language": "NL",
                    "text": "Dit betekent dat het knooppunt Shapes verschillende interne referenties heeft.",
                    "updated": 1668338879168
                },
                {
                    "language": "PT",
                    "text": "Isso significa que o nó Formas (Shapes) possui várias referências internas.",
                    "updated": 1711467399764
                }
            ]
        },
        {
            "style": "Note",
            "text": "The backup, clone and share operations make different uses of the properties of references. We will cover the three of them extensively so that you may make the most of these features.",
            "updated": 1615796558622,
            "translations": [
                {
                    "language": "RU",
                    "text": "В операциях резервного копирования, клонирования и совместного использования свойства ссылок используются по-разному. Мы подробно рассмотрим три из них, чтобы вы могли максимально использовать эти функции.",
                    "updated": 1638275489284
                },
                {
                    "language": "EL",
                    "text": "Οι λειτουργίες δημιουργίας αντιγράφων ασφαλείας, κλωνοποίησης και κοινής χρήσης κάνουν διαφορετικές χρήσεις των ιδιοτήτων των αναφορών. Θα καλύψουμε τα τρία από αυτά εκτενώς, ώστε να μπορέσετε να αξιοποιήσετε στο έπακρο αυτά τα χαρακτηριστικά.",
                    "updated": 1638980514482
                },
                {
                    "language": "TR",
                    "text": "Yedekleme, klonlama ve paylaşma işlemleri, referansların özelliklerini farklı şekilde kullanır. Bu özelliklerden en iyi şekilde yararlanabilmeniz için üçünü kapsamlı bir şekilde ele alacağız.",
                    "updated": 1639722919314
                },
                {
                    "language": "DE",
                    "text": "Die Operationen \"backup\", \"clone\" und \"share\" machen auf unterschiedliche Weise Gebrauch von den Eigenschaften von Referenzen. Wir werden diese drei Operationen ausführlich behandeln, damit Sie das Beste aus diesen Funktionen machen können.",
                    "updated": 1643179812074
                },
                {
                    "language": "NL",
                    "text": "De back-up-, kloon- en deelbewerkingen maken verschillend gebruik van de eigenschappen van referenties. We zullen deze drie uitgebreid behandelen, zodat u het meeste uit deze functies kunt halen.",
                    "updated": 1668338901977
                },
                {
                    "language": "PT",
                    "text": "As operações de backup, partilhar e clonagem fazem diferentes usos das propriedades das referências. Vamos abordar cada uma delas detalhadamente para que possa aproveitar ao máximo estes recursos.",
                    "updated": 1711467576634
                }
            ]
        },
        {
            "style": "Title",
            "text": "Graphical Representation",
            "updated": 1615796579270,
            "translations": [
                {
                    "language": "RU",
                    "text": "Графическое представление",
                    "updated": 1638275511142
                },
                {
                    "language": "EL",
                    "text": "Graphical Representation (Γραφική Αναπαράσταση)",
                    "updated": 1641831329539
                },
                {
                    "language": "TR",
                    "text": "Grafiksel Gösterimi",
                    "updated": 1639723030727
                },
                {
                    "language": "DE",
                    "text": "Grafische Darstellung",
                    "updated": 1643179862875
                },
                {
                    "language": "PT",
                    "text": "Representação Gráfica",
                    "updated": 1711467593321
                }
            ]
        },
        {
            "style": "Text",
            "text": "References are graphically represented with faint grey dotted lines, but they are not visible by default. References become visible when you hover the mouse pointer on a node that has a reference, or when activating the display of all references with the following key combination: ",
            "updated": 1615827008604,
            "translations": [
                {
                    "language": "RU",
                    "text": "Ссылки графически представлены слабыми серыми пунктирными линиями, но по умолчанию они не видны. Ссылки становятся видимыми, когда вы наводите указатель мыши на узел, который имеет ссылку, или при активации отображения всех ссылок с помощью следующей комбинации клавиш:",
                    "updated": 1638275541325
                },
                {
                    "language": "EL",
                    "text": "Οι αναφορές αναπαρίστανται γραφικά με αμυδρά γκρι διακεκομμένες γραμμές, αλλά δεν είναι ορατές από προεπιλογή. Οι αναφορές γίνονται ορατές όταν τοποθετείτε το δείκτη του ποντικιού σε έναν κόμβο που έχει αναφορά ή όταν ενεργοποιείτε την εμφάνιση όλων των αναφορών με τον ακόλουθο συνδυασμό πλήκτρων:",
                    "updated": 1638980582054
                },
                {
                    "language": "TR",
                    "text": "Referanslar, soluk gri noktalı çizgilerle grafik olarak temsil edilir, ancak varsayılan olarak görünmezler. Fare işaretçisini referansı olan bir düğümün üzerine getirdiğinizde veya aşağıdaki tuş kombinasyonu ile tüm referansların görüntülenmesini etkinleştirdiğinizde referanslar görünür hale gelir:",
                    "updated": 1639723066967
                },
                {
                    "language": "DE",
                    "text": "Referenzen werden grafisch durch schwache graue gepunktete Linien dargestellt, sind aber standardmäßig nicht sichtbar. Referenzen werden sichtbar, wenn Sie mit dem Mauszeiger auf einen Node zeigen, der eine Referenz hat, oder wenn Sie die Anzeige aller Referenzen mit der folgenden Tastenkombination aktivieren:",
                    "updated": 1643179997175
                },
                {
                    "language": "NL",
                    "text": "Verwijzingen worden grafisch weergegeven met vage grijze stippellijnen, maar zijn standaard niet zichtbaar. Referenties worden zichtbaar wanneer u de muisaanwijzer op een knooppunt houdt dat een referentie heeft, of wanneer u de weergave van alle referenties activeert met de volgende toetsencombinatie:",
                    "updated": 1668338930529
                },
                {
                    "language": "PT",
                    "text": "As referências são representadas graficamente com linhas tracejadas cinzento claro, mas não são visíveis por padrão. As referências tornam-se visíveis quando passa o ponteiro do rato sobre um nó (node) que possui uma referência, ou quando ativa a exibição de todas as referências com a seguinte combinação de teclas:",
                    "updated": 1711467741059
                }
            ]
        },
        {
            "style": "Text",
            "text": "Ctrl + Shift + Key-R"
        },
        {
            "style": "Note",
            "text": "For references to be visible, both nodes involved in the reference must be visible.",
            "updated": 1615796621593,
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы ссылки были видимыми, должны быть видны оба узла, участвующие в ссылке.",
                    "updated": 1638275561318
                },
                {
                    "language": "EL",
                    "text": "Για να είναι ορατές οι αναφορές, πρέπει να είναι ορατοί και οι δύο κόμβοι που εμπλέκονται στην αναφορά.",
                    "updated": 1638980616502
                },
                {
                    "language": "TR",
                    "text": "Referansların görünür olması için referansta yer alan her iki noa'nın da görünür olması gerekir.",
                    "updated": 1639723106478
                },
                {
                    "language": "DE",
                    "text": "Damit Referenzen sichtbar sind, müssen beide an der Referenz beteiligten Nodes sichtbar sein.",
                    "updated": 1643180077915
                },
                {
                    "language": "NL",
                    "text": "Om referenties zichtbaar te maken, moeten beide knooppunten die bij de referentie betrokken zijn, zichtbaar zijn.",
                    "updated": 1668338949493
                },
                {
                    "language": "PT",
                    "text": "Para que as referências sejam visíveis, ambos os nós (nodes) envolvidos na referência devem estar visíveis.",
                    "updated": 1711467826630
                }
            ]
        },
        {
            "style": "Anchor",
            "text": "How to Estabish and Remove References",
            "updated": 1609950438203
        },
        {
            "style": "Title",
            "text": "How to Estabish and Remove References",
            "translations": [
                {
                    "language": "RU",
                    "text": "Как создавать и удалять ссылки",
                    "updated": 1638275580020
                },
                {
                    "language": "EL",
                    "text": "How to Estabish and Remove References (Πώς να δημιουργήσετε και να αφαιρέσετε αναφορές)",
                    "updated": 1641831367416
                },
                {
                    "language": "TR",
                    "text": "Referanslar Nasıl Kurulur ve Kaldırılır",
                    "updated": 1639723120906
                },
                {
                    "language": "DE",
                    "text": "Wie man Referenzen herstellt und entfernt",
                    "updated": 1643180099309
                },
                {
                    "language": "NL",
                    "text": "Hoe referenties tot stand te brengen en te verwijderen",
                    "updated": 1668338965915
                },
                {
                    "language": "PT",
                    "text": "Como Estabelecer e Remover Referências",
                    "updated": 1711467895301
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Topic->Establish and Remove References->Definition"
        },
        {
            "style": "Include",
            "text": "Foundations->Topic->Establish and Remove References->Content",
            "updated": 1609950361692
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}