{
    "topic": "Introduction",
    "pageNumber": "1",
    "type": "Fundamental Superalgos Concepts",
    "definition": {
        "text": "Superalgos breaks up complexity and describes the fundamental concepts that make up trading intelligence in hierarchies of nodes. Nodes may reference other nodes to access information in other hierarchies.",
        "updated": 1609943915544,
        "translations": [
            {
                "language": "RU",
                "text": "Superalgos разделяет сложность и описывает фундаментальные концепции, составляющие торговый интеллект в иерархиях узлов. Узлы могут ссылаться на другие узлы для доступа к информации в других иерархиях.",
                "updated": 1637936649473
            },
            {
                "language": "EL",
                "text": "Το Superalgos διασπά την πολυπλοκότητα και εξηγεί τις θεμελιώδεις έννοιες που συνθέτουν την τεχνητή νοημοσύνη συναλλαγών σε ιεραρχίες κόμβων. Οι κόμβοι μπορεί να παραπέμπουν σε άλλους κόμβους για πρόσβαση σε πληροφορίες από άλλες ιεραρχίες.",
                "updated": 1638960620231
            },
            {
                "language": "ES",
                "text": "Superalgos simplifica y describe mediante jerarquías de nodos los conceptos fundamentales del Trading Inteligente. Los nodos pueden hacer referencia a otros nodos para acceder a información en otras jerarquías.",
                "updated": 1641092262506
            },
            {
                "language": "DE",
                "text": "Superalgos bricht die Komplexität auf und beschreibt die grundlegenden Konzepte, die die Handelsintelligenz in Hierarchien von Nodes aufbauen. Nodes können auf andere Nodes verweisen, um auf Informationen in anderen Hierarchien zuzugreifen.",
                "updated": 1641740211253
            },
            {
                "language": "TR",
                "text": "Superalgos karmaşıklığı parçalara ayırır ve düğüm hiyerarşilerinde ticari zekayı oluşturan temel kavramları tanımlar. Düğümler, diğer hiyerarşilerdeki bilgilere erişmek için diğer düğümlere referans verebilir.",
                "updated": 1698698747813
            },
            {
                "language": "PT",
                "text": "O Superalgos retira a complexidade e descreve os conceitos fundamentais que compõem a inteligência de negociação em hierarquias de Nós (Node). Estes Nós (Node) podem fazer referência a outros Nós (Node) para aceder informações noutras hierarquias. ",
                "updated": 1711655460728
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Algorithmic trading is a data-driven application. It is the superior ability to derive intelligence from data—above all—that gives automated trading an edge over trading manually.",
            "updated": 1609943931550,
            "translations": [
                {
                    "language": "RU",
                    "text": "Алгоритмическая торговля - это приложение, управляемое данными. Именно превосходная способность извлекать аналитические данные, прежде всего, дает автоматическому трейдингу преимущество перед торговлей вручную.",
                    "updated": 1637936885572
                },
                {
                    "language": "EL",
                    "text": "Οι αλγοριθμικές συναλλαγές είναι μια εφαρμογή που βασίζεται σε δεδομένα. Είναι η δυνατότητα άντλησης νοημοσύνης από δεδομένα - πάνω απ 'όλα - που δίνει στις αυτοματοποιημένες συναλλαγές ένα πλεονέκτημα έναντι των χειροκίνητων συναλλαγών.",
                    "updated": 1638791621774
                },
                {
                    "language": "ES",
                    "text": "El Trading algorítmico es una aplicación basada en datos. Es la capacidad superior de derivar inteligencia de los datos, sobre todo, lo que le da al Trading automatizado una ventaja sobre el Trading manual.",
                    "updated": 1641092284771
                },
                {
                    "language": "DE",
                    "text": "Algorithmischer Handel ist eine datengesteuerte Anwendung. Es ist vor allem die überlegene Fähigkeit, Intelligenz aus Daten abzuleiten, die dem automatisierten Handel einen Vorteil gegenüber dem manuellen Handel verschafft.",
                    "updated": 1641740288966
                },
                {
                    "language": "TR",
                    "text": "Algoritmik ticaret veri odaklı bir uygulamadır. Otomatik ticarete manuel ticarete göre avantaj sağlayan şey, her şeyden önce verilerden istihbarat elde etme konusundaki üstün yetenektir.",
                    "updated": 1698698753186
                },
                {
                    "language": "PT",
                    "text": "A negociação algorítmica é uma aplicação orientada por dados. É a capacidade superior de extrair inteligência dos dados - acima de tudo - que confere à negociação automatizada uma vantagem sobre a negociação manual. ",
                    "updated": 1711458695484
                }
            ]
        },
        {
            "style": "Text",
            "text": "However, it would be simplistic to assume that trading intelligence emerges from data alone.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Однако было бы упрощением предполагать, что торговая информация исходит только из данных.",
                    "updated": 1637936986123
                },
                {
                    "language": "EL",
                    "text": "Ωστόσο, θα ήταν απλοϊκό να υποθέσουμε ότι οι συναλλαγές  τεχνητής νοημοσύνης προκύπτουν μόνο από δεδομένα.",
                    "updated": 1638791925499
                },
                {
                    "language": "ES",
                    "text": "Sin embargo, sería simplista suponer que el Trading Inteligente surge solo de los datos.",
                    "updated": 1641092296444
                },
                {
                    "language": "DE",
                    "text": "Es wäre jedoch zu einfach, anzunehmen, dass sich Handelsintelligenz allein aus Daten ergibt.",
                    "updated": 1641740355686
                },
                {
                    "language": "TR",
                    "text": "Ancak, ticari zekanın yalnızca verilerden ortaya çıktığını varsaymak basitlik olur.",
                    "updated": 1698698757385
                },
                {
                    "language": "PT",
                    "text": "Contudo, seria simplista assumir que a inteligência de negociação emerge apenas dos dados.",
                    "updated": 1711458725481
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Trading intelligence emerges from harnessing the interactions of multiple complex concepts.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Торговая аналитика возникает из взаимодействия нескольких сложных концепций.",
                    "updated": 1637937446660
                },
                {
                    "language": "EL",
                    "text": "Trading intelligence (Τεχνητή νοημοσύνη συναλλαγών) προκύπτει από την αξιοποίηση των αλληλεπιδράσεων πολλαπλών πολύπλοκων εννοιών.",
                    "updated": 1638799861812
                },
                {
                    "language": "ES",
                    "text": "El Trading inteligente surge del aprovechamiento de las interacciones de múltiples conceptos complejos.",
                    "updated": 1641092305216
                },
                {
                    "language": "DE",
                    "text": "Handelsintelligenz entsteht durch die Nutzung des Zusammenspiels mehrerer komplexer Konzepte.",
                    "updated": 1641740408555
                },
                {
                    "language": "TR",
                    "text": "Ticari zeka, çok sayıda karmaşık kavramın etkileşiminden yararlanılarak ortaya çıkar.",
                    "updated": 1698698761378
                },
                {
                    "language": "PT",
                    "text": "A inteligência de negociação (Trading) surge ao aproveitar as interações de múltiplos conceitos complexos.",
                    "updated": 1711458761887
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos is a software infrastructure that contributes to harnessing those concepts and interactions by breaking complexity into small units of information called nodes and arranging them into larger data structures called hierarchies.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Superalgos - это программная инфраструктура, которая способствует использованию этих концепций и взаимодействий, разбивая сложность на небольшие единицы информации, называемые узлами, и упорядочивая их в более крупные структуры данных, называемые иерархиями.",
                    "updated": 1637938069788
                },
                {
                    "language": "EL",
                    "text": "Το Superalgos είναι μια υποδομή λογισμικού που συμβάλλει στην αξιοποίηση αυτών των εννοιών και αλληλεπιδράσεων σπάζοντας την πολυπλοκότητα σε μικρές μονάδες πληροφοριών που ονομάζονται κόμβοι και τακτοποιώντας τις σε μεγαλύτερες δομές δεδομένων που ονομάζονται ιεραρχίες.",
                    "updated": 1638799982753
                },
                {
                    "language": "ES",
                    "text": "Superalgos es una infraestructura de software que contribuye a aprovechar esos conceptos e interacciones al dividir la complejidad en pequeñas unidades de información llamadas nodos y organizarlas en estructuras de datos más grandes llamadas jerarquías.",
                    "updated": 1641092315867
                },
                {
                    "language": "DE",
                    "text": "Superalgos ist eine Software-Infrastruktur, die dazu beiträgt, diese Konzepte und Wechselwirkungen nutzbar zu machen, indem sie die Komplexität in kleine Informationseinheiten, so genannte Nodes (Knoten), zerlegt und diese in größeren Datenstrukturen, so genannten Hierarchien, anordnet.",
                    "updated": 1641740634980
                },
                {
                    "language": "TR",
                    "text": "Superalgos, karmaşıklığı düğüm adı verilen küçük bilgi birimlerine ayırarak ve bunları hiyerarşi adı verilen daha büyük veri yapıları halinde düzenleyerek bu kavramların ve etkileşimlerin kullanılmasına katkıda bulunan bir yazılım altyapısıdır.",
                    "updated": 1698698766857
                },
                {
                    "language": "PT",
                    "text": "O Superalgos é uma infraestrutura de software que contribui para aproveitar esses conceitos e interações, desmembrando a complexidade em pequenas unidades de informação chamadas Nós (Node) e organizando-os em estruturas de dados maiores chamadas hierarquias. ",
                    "updated": 1711458820703
                }
            ]
        },
        {
            "style": "Text",
            "text": "A hierarchy is a data structure representing an overarching, top-level concept, resulting in a long chain of nodes, usually with many ramifications. The system manages different types of hierarchies, each of them with a specific focus. For example, crypto ecosystem, data mines, or charting space.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Иерархия - это структура данных, представляющая всеобъемлющую концепцию верхнего уровня, приводящую к длинной цепочке узлов, обычно с множеством ответвлений. Система управляет разными типами иерархий, каждая из которых имеет определенную направленность. Например, криптоэкосистема, сбор данных или графическое пространство.",
                    "updated": 1637938445084
                },
                {
                    "language": "EL",
                    "text": "Η ιεραρχία είναι μια δομή δεδομένων που αντιπροσωπεύει μια γενική έννοια ανώτατου επιπέδου, έχοντας ως αποτέλεσμα μια μακρά αλυσίδα κόμβων, συνήθως με πολλές διακλαδώσεις. Το σύστημα διαχειρίζεται διαφορετικούς τύπους ιεραρχιών, καθένας από αυτούς με μια συγκεκριμένη εστίαση. Για παράδειγμα, οικοσύστημα κρυπτογράφησης, εξορύκτες δεδομένων ή χώρος χαρτογράφησης.",
                    "updated": 1638800075019
                },
                {
                    "language": "ES",
                    "text": "Una jerarquía es una estructura de datos que representa un concepto general de alto nivel, que da como resultado una larga cadena de nodos, generalmente con muchas ramificaciones. El sistema gestiona diferentes tipos de jerarquías, cada una de ellas con un enfoque específico. Por ejemplo, ecosistema criptográfico, minas de datos o espacio de gráficos.",
                    "updated": 1641092327682
                },
                {
                    "language": "DE",
                    "text": "Eine Hierarchie ist eine Datenstruktur, die ein übergreifendes Konzept auf oberster Ebene darstellt, das zu einer langen Kette von Nodes führt, in der Regel mit vielen Verzweigungen. Das System verwaltet verschiedene Arten von Hierarchien, wobei jede von ihnen einen bestimmten Schwerpunkt hat. Zum Beispiel Crypto Ecosystem, Data Mines oder Charting Space.",
                    "updated": 1641740590308
                },
                {
                    "language": "TR",
                    "text": "Hiyerarşi, kapsayıcı, üst düzey bir kavramı temsil eden ve genellikle birçok dallanmaya sahip uzun bir düğüm zinciriyle sonuçlanan bir veri yapısıdır. Sistem, her biri belirli bir odağa sahip farklı hiyerarşi türlerini yönetir. Örneğin, kripto ekosistemi, veri madenleri veya grafik alanı.",
                    "updated": 1698698770953
                },
                {
                    "language": "PT",
                    "text": "Uma hierarquia é uma estrutura de dados que representa um conceito amplo e de alto nível, resultando  numa longa cadeia de Nós (Node), geralmente com muitas ramificações. O sistema gere diferentes tipos de hierarquias, cada uma delas com um foco específico. Por exemplo, ecossistema de cripto moedas (crypto ecosystem), minas de dados/informação (data mines), ou o Interface de Gráficos (Charting Space). ",
                    "updated": 1711458991249
                }
            ]
        },
        {
            "style": "Text",
            "text": "A node is a small data structure containing information that may be related to market information, trading intelligence, the operation of the system, or other concepts. They are visually represented by icons in the design space.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел - это небольшая структура данных, содержащая информацию, которая может иметь отношение к рыночной информации, торговой информации, работе системы или другим концепциям. Они визуально представлены иконками в пространстве проектирования.",
                    "updated": 1637938473696
                },
                {
                    "language": "EL",
                    "text": "Ένας κόμβος είναι μια μικρή δομή δεδομένων που περιέχει πληροφορίες που μπορεί να σχετίζονται με πληροφορίες της αγοράς, πληροφορίες συναλλαγών, τη λειτουργία του συστήματος ή άλλες έννοιες. Αντιπροσωπεύονται οπτικά με εικονίδια στον χώρο σχεδιασμού.",
                    "updated": 1638800085009
                },
                {
                    "language": "ES",
                    "text": "Un nodo es una pequeña estructura de datos que contiene información que puede estar relacionada con información de mercado, Trading inteligente, el funcionamiento del sistema u otros conceptos. Están representados visualmente por iconos en el espacio de diseño.",
                    "updated": 1641092341548
                },
                {
                    "language": "DE",
                    "text": "Ein Node ist eine kleine Datenstruktur, die Informationen enthält, die sich auf Marktinformationen, Handelsinformationen, den Betrieb des Systems oder andere Konzepte beziehen können. Sie werden visuell durch Symbole im Design Space dargestellt.",
                    "updated": 1641740672837
                },
                {
                    "language": "TR",
                    "text": "Bir düğüm, piyasa bilgileri, ticari istihbarat, sistemin çalışması veya diğer kavramlarla ilgili olabilecek bilgileri içeren küçük bir veri yapısıdır. Tasarım alanında görsel olarak simgelerle temsil edilirler.",
                    "updated": 1698698776586
                },
                {
                    "language": "PT",
                    "text": "Um Nó (Node) é uma pequena estrutura de dados contendo informações que podem estar relacionadas a informações de mercado, inteligência de negociação (trading intelligence), actividade do sistema ou outros conceitos. Eles são visualmente representados por ícones na Interface de Design (Design Space). ",
                    "updated": 1711459082866
                }
            ]
        },
        {
            "style": "Text",
            "text": "The design space is the visual environment that hosts all system and user definitions. In practical terms, it is the black space below the slider that splits the screen horizontally, separating the design space in the bottom from the charting space on top. As a hierarchy, it features nodes that enable user-control over certain aspects of the look, feel, and behavior of the space.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Пространство проектирования - это визуальная среда, в которой размещены все системные и пользовательские определения. На практике это пространство под слайдером, которое разделяет экран по горизонтали, отделяя пространство проектирования внизу от пространства диаграммы вверху. Оно включает узлы, которые позволяют пользователю управлять определенными аспектами внешнего вида.",
                    "updated": 1637938673092
                },
                {
                    "language": "EL",
                    "text": "Ο χώρος σχεδιασμού είναι το οπτικό περιβάλλον που φιλοξενεί όλους τους ορισμούς του συστήματος και των χρηστών. Πρακτικά, είναι ο μαύρος χώρος κάτω από το ρυθμιστικό που χωρίζει την οθόνη οριζόντια, διαχωρίζοντας τον χώρο σχεδιασμού στο κάτω μέρος από τον χώρο χαρτογράφησης στο επάνω μέρος. Ως ιεραρχία, διαθέτει κόμβους που επιτρέπουν τον έλεγχο από τον χρήστη σε ορισμένες πτυχές της εμφάνισης, της αίσθησης και της συμπεριφοράς του χώρου.",
                    "updated": 1638810133832
                },
                {
                    "language": "ES",
                    "text": "El espacio de diseño es el entorno visual que alberga todas las definiciones de usuario y del sistema. En términos prácticos, es el espacio negro debajo del control deslizante que divide la pantalla horizontalmente separando el espacio de diseño en la parte inferior del espacio de gráficos en la parte superior. Como jerarquía, presenta nodos que permiten al usuario controlar ciertos aspectos de la apariencia, comodidad y el comportamiento del espacio.",
                    "updated": 1641093078859
                },
                {
                    "language": "DE",
                    "text": "Der Design Space ist die visuelle Umgebung, die alle System- und Benutzerdefinitionen enthält. In der Praxis handelt es sich um den schwarzen Bereich unterhalb des Schiebereglers, der den Bildschirm horizontal teilt und den Design Space im unteren Bereich vom Charting Space im oberen Bereich trennt. Als Hierarchie enthält sie Nodes, die dem Benutzer die Kontrolle über bestimmte Aspekte des Aussehens, der Handhabung und des Verhaltens des Bereichs ermöglichen.",
                    "updated": 1641740724784
                },
                {
                    "language": "TR",
                    "text": "Tasarım alanı, tüm sistem ve kullanıcı tanımlarını barındıran görsel ortamdır. Pratik anlamda, ekranı yatay olarak bölen ve alttaki tasarım alanını üstteki grafik alanından ayıran kaydırıcının altındaki siyah alandır. Bir hiyerarşi olarak, alanın görünümü, hissi ve davranışının belirli yönleri üzerinde kullanıcı kontrolünü sağlayan düğümlere sahiptir.",
                    "updated": 1698698782203
                },
                {
                    "language": "PT",
                    "text": "A Interface de Design (Design Space) é o ambiente visual que contêm todas as definições do sistema e do utilizador. Em termos práticos, é o espaço preto que fica por de baixo de uma tela  deslizante e divide o ecrã horizontalmente, separando a interface de design na parte inferior da Interface dos Gráficos (Charting Space) na parte superior. Tal como uma hierarquia, contêm Nós (Node) que permitem ao utilizador controlar certos aspectos da aparência, sensação e comportamento do espaço.",
                    "updated": 1711459281356
                }
            ]
        },
        {
            "style": "Callout",
            "text": "In other words, nodes arranged in hierarchical data structures describe the top-level concepts that make up trading intelligence in a way that helps users visualize and better understand them.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Другими словами, узлы, организованные в иерархические структуры данных, описывают концепции верхнего уровня, составляющие торговый интеллект, таким образом, чтобы помочь пользователям их визуализировать и лучше понимать.",
                    "updated": 1637938732238
                },
                {
                    "language": "EL",
                    "text": "Με άλλα λόγια, οι κόμβοι που είναι διατεταγμένοι σε ιεραρχικές δομές δεδομένων περιγράφουν τις έννοιες ανώτατου επιπέδου που συνθέτουν την τεχνητή νοημοσύνη συναλλαγών με τρόπο που βοηθά τους χρήστες να τις οπτικοποιήσουν και να τις κατανοήσουν καλύτερα.",
                    "updated": 1638810270963
                },
                {
                    "language": "ES",
                    "text": "En otras palabras, los nodos organizados en estructuras de datos jerárquicas, describen los conceptos de alto nivel que componen al Trading inteligente, de una manera que ayuda a los usuarios a visualizarlos y comprenderlos mejor.",
                    "updated": 1641093222714
                },
                {
                    "language": "DE",
                    "text": "Mit anderen Worten: Die in hierarchischen Datenstrukturen angeordneten Nodes beschreiben die Top-Level-Konzepte, aus denen sich die Handelsintelligenz zusammensetzt, auf eine Art und Weise, die den Benutzern hilft, sie zu visualisieren und besser zu verstehen.",
                    "updated": 1641740780043
                },
                {
                    "language": "TR",
                    "text": "Başka bir deyişle, hiyerarşik veri yapılarında düzenlenen düğümler, ticari zekayı oluşturan üst düzey kavramları, kullanıcıların bunları görselleştirmesine ve daha iyi anlamasına yardımcı olacak şekilde tanımlar.",
                    "updated": 1698698786850
                },
                {
                    "language": "PT",
                    "text": "Por outras palavras, os Nós (Node), estando organizados numa estrutura hierárquicas de dados, descrevem os conceitos de alto nível que compõem a inteligência de negociação de uma maneira que ajuda os utilizadores a visualizá-los e a melhor compreendê-los.",
                    "updated": 1711459340505
                }
            ]
        },
        {
            "style": "Text",
            "text": "These top-level concepts described as hierarchies interact with other concepts, that is, with other hierarchies. Interactions among hierarchies are called references.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Эти концепции верхнего уровня, описанные как иерархии, взаимодействуют с другими концепциями, то есть с другими иерархиями. Взаимодействия между иерархиями называются ссылками.",
                    "updated": 1637938774303
                },
                {
                    "language": "EL",
                    "text": "Αυτές οι έννοιες ανώτατου επιπέδου που περιγράφονται ως ιεραρχίες αλληλοεπιδρούν με άλλες έννοιες, δηλαδή με άλλες ιεραρχίες. Οι αλληλεπιδράσεις μεταξύ των ιεραρχιών ονομάζονται αναφορές.",
                    "updated": 1638960743058
                },
                {
                    "language": "ES",
                    "text": "Estos conceptos de alto nivel representados como jerarquías interactúan con otros conceptos, es decir, con otras jerarquías. Las interacciones entre jerarquías se denominan referencias.",
                    "updated": 1641093258312
                },
                {
                    "language": "DE",
                    "text": "Diese als Hierarchien beschriebenen Top-Level-Konzepte interagieren mit anderen Konzepten, d. h. mit anderen Hierarchien. Die Interaktionen zwischen den Hierarchien werden als References (Beziehungen) bezeichnet.",
                    "updated": 1641740888555
                },
                {
                    "language": "TR",
                    "text": "Hiyerarşiler olarak tanımlanan bu üst düzey kavramlar diğer kavramlarla, yani diğer hiyerarşilerle etkileşim halindedir. Hiyerarşiler arasındaki etkileşimler referanslar olarak adlandırılır.",
                    "updated": 1698698791642
                },
                {
                    "language": "PT",
                    "text": "Estes conceitos principais definidos como hierarquias interagem com outros conceitos, ou seja, com outras hierarquias. As interações entre hierarquias são chamadas referências. ",
                    "updated": 1711459376432
                }
            ]
        },
        {
            "style": "Text",
            "text": "A reference is a mechanism by which information in a node is related to, or accessed by, other nodes. The ability of a node to establish a reference with another node enables the first to access the information or features entailed in the second one.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Ссылка - это механизм, с помощью которого информация в узле связана с другими узлами или доступна для них. Способность узла устанавливать ссылку с другим узлом позволяет первому получить доступ к информации или функциям, связанным со вторым.",
                    "updated": 1637938804544
                },
                {
                    "language": "EL",
                    "text": "Μια αναφορά είναι ένας μηχανισμός μέσω του οποίου οι πληροφορίες σε έναν κόμβο σχετίζονται ή προσπελάζονται από άλλους κόμβους. Η ικανότητα ενός κόμβου να δημιουργήσει μια αναφορά με έναν άλλο κόμβο επιτρέπει στον πρώτο να έχει πρόσβαση στις πληροφορίες ή τα χαρακτηριστικά που περιλαμβάνονται στον δεύτερο.",
                    "updated": 1638810339361
                },
                {
                    "language": "ES",
                    "text": "Una referencia es un mecanismo por el cual la información de un nodo está relaciona con otros nodos o es accedida por ellos. La capacidad de un nodo para establecer una referencia con otro nodo permite que el primero acceda a la información o características implicadas en el segundo.",
                    "updated": 1641093275261
                },
                {
                    "language": "DE",
                    "text": "Eine Referenz ist ein Mechanismus, durch den Informationen in einem Node mit anderen Nodes in Beziehung gesetzt oder von ihnen abgerufen werden. Die Fähigkeit eines Nodes, einen Bezug zu einem anderen Node herzustellen, ermöglicht dem ersten Node den Zugang zu den Informationen oder Merkmalen, die der zweite Node beinhaltet.",
                    "updated": 1641741082888
                },
                {
                    "language": "TR",
                    "text": "Referans, bir düğümdeki bilginin diğer düğümlerle ilişkili olduğu veya diğer düğümler tarafından erişildiği bir mekanizmadır. Bir düğümün başka bir düğümle referans kurabilmesi, ilkinin ikincisinde bulunan bilgi ya da özelliklere erişebilmesini sağlar.",
                    "updated": 1698698796569
                },
                {
                    "language": "PT",
                    "text": "Uma referência é um mecanismo pelo qual as informações contidas numNó (Node) estão relacionadas a, ou acedidas por, outros Nós (Node). A capacidade de um Nó (Node) estabelecer uma referência com outro Nó (Node) permite que o primeiro aceda as informações ou recursos contidos no segundo Nó (Node). ",
                    "updated": 1711459444728
                }
            ]
        },
        {
            "style": "Text",
            "text": "To organize all of this information, Superalgos manages the concept of workspaces. A workspace is an entity storing all system and user-generated information, excluding the state and contents of plugins. In technical terms, a workspace is a JSON file.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы организовать всю эту информацию, Superalgos управляет концепцией рабочих пространств. Рабочее пространство - это объект, в котором хранится вся системная и пользовательская информация, за исключением состояния и содержимого подключаемых модулей. С технической точки зрения рабочее пространство - это файл JSON.",
                    "updated": 1637938840496
                },
                {
                    "language": "EL",
                    "text": "Για να οργανώσει όλες αυτές τις πληροφορίες, το Superalgos χρησιμοποιεί την έννοια των χώρων εργασίας. Ο χώρος εργασίας είναι μια οντότητα που αποθηκεύει όλες τις πληροφορίες που δημιουργούνται από το σύστημα και τους χρήστες, εξαιρουμένης της κατάστασης και των περιεχομένων των προσθηκών. Από τεχνική άποψη, ένας χώρος εργασίας είναι ένα αρχείο JSON.",
                    "updated": 1638810903488
                },
                {
                    "language": "ES",
                    "text": "Para organizar toda esta información, Superalgos gestiona el concepto de espacios de trabajo. Un espacio de trabajo es una entidad que almacena toda la información generada por el usuario y el sistema, excluyendo el estado y el contenido de los complementos. En términos técnicos, un espacio de trabajo es un archivo JSON.",
                    "updated": 1641093289711
                },
                {
                    "language": "DE",
                    "text": "Um all diese Informationen zu organisieren, verwaltet Superalgos das Konzept der Workspaces (Arbeitsbereiche). Ein Workspace ist eine Einheit, die alle System- und Benutzerinformationen speichert, mit Ausnahme des Zustands und der Inhalte von Plugins. Technisch gesehen ist ein Workspace eine JSON-Datei.",
                    "updated": 1641741129226
                },
                {
                    "language": "TR",
                    "text": "Tüm bu bilgileri düzenlemek için Superalgos çalışma alanları kavramını yönetir. Çalışma alanı, eklentilerin durumu ve içeriği hariç olmak üzere, tüm sistem ve kullanıcı tarafından oluşturulan bilgileri depolayan bir varlıktır. Teknik açıdan, bir çalışma alanı bir JSON dosyasıdır.",
                    "updated": 1698698800705
                },
                {
                    "language": "PT",
                    "text": "Para organizar todas essas informações, o Superalgos gere o conceito de Área de Trabalho (Workspace). Um Área de Trabalho (Workspace) é uma entidade que armazena todas as informações geradas pelo sistema e pelo utilizador, excluindo o estado e o conteúdo dos plugins. Em termos técnicos, uma Área de Trabalho (Workspace) é um arquivo JSON.",
                    "updated": 1711459560784
                }
            ]
        },
        {
            "style": "Note",
            "text": "The Bots page brings these conceptual definitions down to earth and offers an overview of how what these top-level concepts are and how they interact with each other.",
            "updated": 1637697607949,
            "translations": [
                {
                    "language": "RU",
                    "text": "На странице «Боты» эти концептуальные определения представлены на земле и предлагается обзор того, каковы эти концепции верхнего уровня и как они взаимодействуют друг с другом.",
                    "updated": 1637938913546
                },
                {
                    "language": "EL",
                    "text": "Η σελίδα των ρομπότ γειώνει αυτούς τους εννοιολογικούς ορισμούς και προσφέρει μια επισκόπηση του πώς είναι αυτές οι έννοιες ανώτατου επιπέδου και πώς αλληλοεπιδρούν μεταξύ τους.",
                    "updated": 1638965781544
                },
                {
                    "language": "ES",
                    "text": "La página de Bots trae a tierra estas definiciones conceptuales y ofrece una descripción general de cómo son estos conceptos de alto nivel y cómo interactúan entre sí.",
                    "updated": 1641093295426
                },
                {
                    "language": "DE",
                    "text": "Die Seite Bots bringt diese konzeptionellen Definitionen auf den Boden der Tatsachen zurück und bietet einen Überblick darüber, was diese Top-Level-Konzepte sind und wie sie miteinander interagieren.",
                    "updated": 1641741163266
                },
                {
                    "language": "TR",
                    "text": "Botlar sayfası bu kavramsal tanımları yeryüzüne indirir ve bu üst düzey kavramların ne olduğuna ve birbirleriyle nasıl etkileşime girdiklerine dair genel bir bakış sunar.",
                    "updated": 1698698805541
                },
                {
                    "language": "PT",
                    "text": "A página de Bots simplifica estes conceitos de uma forma prática e oferece uma visão geral dos principais conceitos e como estes interagem entre si.",
                    "updated": 1711459592831
                }
            ]
        }
    ]
}