{
    "topic": "Feedback Loop",
    "pageNumber": "1",
    "type": "User Feedback",
    "definition": {
        "text": "Superalgos is a Community project! We make the software available to everyone free-of-charge, but we do ask for something in return... your help!",
        "updated": 1610660537960,
        "translations": [
            {
                "language": "RU",
                "text": "Superalgos - это проект сообщества! Мы предоставляем программное обеспечение всем желающим бесплатно, но мы просим кое-что взамен... вашу помощь!",
                "updated": 1640282142246
            },
            {
                "language": "DE",
                "text": "Superalgos ist ein Gemeinschaftsprojekt! Wir stellen die Software für jeden kostenlos zur Verfügung, aber wir bitten um eine Gegenleistung... Ihre Hilfe!",
                "updated": 1645478862408
            },
            {
                "language": "TR",
                "text": "Superalgos birTopluluk ( Community ) projesidir ! Yazılımı ücretsiz olarak herkesin kullanımına sunuyoruz, ancak karşılığında bir şey istiyoruz... yardımınız!",
                "updated": 1652464007034
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "How Can Superalgos Be Free For Everyone?",
            "updated": 1610658497040,
            "translations": [
                {
                    "language": "RU",
                    "text": "Как Superalgos может быть бесплатным для всех?",
                    "updated": 1640282159847
                },
                {
                    "language": "DE",
                    "text": "Wie kann Superalgos für alle kostenlos sein?",
                    "updated": 1645478885682
                },
                {
                    "language": "TR",
                    "text": "Superalgos Herkes İçin Nasıl Ücretsiz Olabilir?",
                    "updated": 1652464138412
                }
            ]
        },
        {
            "style": "Text",
            "text": "That is a question we get all the time.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Этот вопрос нам задают постоянно.",
                    "updated": 1640282170257
                },
                {
                    "language": "DE",
                    "text": "Diese Frage wird dauernd gestellt.",
                    "updated": 1645478900728
                },
                {
                    "language": "TR",
                    "text": "Bu her zaman aldığımız bir soru.",
                    "updated": 1652464125120
                }
            ]
        },
        {
            "style": "Text",
            "text": "The project started with a group of friends joining forces to automate their crypto trading. They realized early on that—for trading intelligence to emerge—a huge software infrastructure was required. They knew that to compete with top market players on a level field, the system needed to be on par or better than commercial and proprietary software available to firms. Such requirements could not be fulfilled by a small team in a reasonable timeframe.",
            "updated": 1610661121217,
            "translations": [
                {
                    "language": "RU",
                    "text": "Проект начался с того, что группа друзей объединила усилия для автоматизации торговли криптовалютами. Они сразу поняли, что для появления торгового интеллекта необходима огромная программная инфраструктура. Они знали, что для того, чтобы конкурировать с ведущими игроками рынка на равных, система должна быть на уровне или даже лучше, чем коммерческое и собственное программное обеспечение, доступное фирмам. Такие требования не могли быть выполнены небольшой командой в разумные сроки.",
                    "updated": 1640282231981
                },
                {
                    "language": "DE",
                    "text": "Das Projekt begann mit einer Gruppe von Freunden, die sich zusammentaten, um ihren Krypto-Handel zu automatisieren. Sie erkannten früh, dass für die Entstehung von Handelsintelligenz eine umfangreiche Software-Infrastruktur erforderlich war. Sie wussten, dass das System gleichwertig oder besser sein musste als die kommerzielle und proprietäre Software, die den Unternehmen zur Verfügung steht, um mit den führenden Marktteilnehmern auf Augenhöhe konkurrieren zu können. Solche Anforderungen konnten von einem kleinen Team nicht in einem vernünftigen Zeitrahmen erfüllt werden.",
                    "updated": 1645478950413
                },
                {
                    "language": "TR",
                    "text": "Proje, bir grup arkadaşın kripto ticaretini otomatikleştirmek için güçlerini birleştirmesiyle başladı. Ticaret zekasının ortaya çıkması için büyük bir yazılım altyapısının gerekli olduğunu erken fark ettiler. Düz bir alanda en iyi piyasa oyuncularıyla rekabet edebilmek için sistemin firmalara sunulan ticari ve özel yazılımlardan daha iyi veya eşit olması gerektiğini biliyorlardı. Bu tür gereksinimler, küçük bir ekip tarafından makul bir zaman diliminde yerine getirilemezdi.",
                    "updated": 1652464115721
                }
            ]
        },
        {
            "style": "Important",
            "text": "Superalgos is free for everyone because we want your help. We want to attract the best minds in the space, so that—together—we may build the ultimate trading automation platform.",
            "updated": 1610660913324,
            "translations": [
                {
                    "language": "RU",
                    "text": "Superalgos бесплатен для всех, потому что нам нужна ваша помощь. Мы хотим привлечь лучшие умы в этой области, чтобы вместе создать совершенную платформу для автоматизации торговли.",
                    "updated": 1640282251556
                },
                {
                    "language": "DE",
                    "text": "Superalgos ist für jeden kostenlos, weil wir Ihre Hilfe wollen. Wir wollen die besten Köpfe in diesem Bereich anziehen, damit wir gemeinsam die ultimative Handelsautomatisierungsplattform aufbauen können.",
                    "updated": 1645478971747
                },
                {
                    "language": "TR",
                    "text": "Superalgos herkes için ücretsizdir çünkü yardımınızı istiyoruz. Alanın en iyi zihinlerini çekmek istiyoruz, böylece birlikte en üst düzey ticaret otomasyon platformunu oluşturabiliriz.",
                    "updated": 1652464216950
                }
            ]
        },
        {
            "style": "Title",
            "text": "Your First Contribution Is Your Feedback!",
            "updated": 1610660067417,
            "translations": [
                {
                    "language": "RU",
                    "text": "Ваш первый вклад - это ваш отзыв!",
                    "updated": 1640282265740
                },
                {
                    "language": "DE",
                    "text": "Ihr erster Beitrag ist Ihr Feedback!",
                    "updated": 1645478999166
                },
                {
                    "language": "TR",
                    "text": "İlk Katkınız Geribildiriminizdir!",
                    "updated": 1652464240801
                }
            ]
        },
        {
            "style": "Text",
            "text": "You just spent an hour or two discovering Superalgos. We want to have your first impression. We want to know what you think! And we want your initial feedback to be the first of many contributions to the project.",
            "updated": 1610660053317,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы только что потратили час или два на знакомство с Superalgos. Мы хотим получить ваше первое впечатление. Мы хотим знать, что вы думаете! И мы хотим, чтобы ваш первый отзыв стал первым из многих вкладов в проект.",
                    "updated": 1640282289784
                },
                {
                    "language": "DE",
                    "text": "Sie haben gerade ein oder zwei Stunden damit verbracht, Superalgos zu entdecken. Wir möchten Ihren ersten Eindruck haben. Wir wollen wissen, was Sie denken! Und wir möchten, dass Ihr erstes Feedback der erste von vielen Beiträgen zu dem Projekt ist.",
                    "updated": 1645479033563
                },
                {
                    "language": "TR",
                    "text": "Superalgos'u keşfetmek için bir veya iki saat harcadınız. İlk izleniminizi almak istiyoruz. Ne düşündüğünüzü bilmek istiyoruz! Ve ilk geri bildiriminizin projeye yapılan birçok katkının ilki olmasını istiyoruz.",
                    "updated": 1652464268661
                }
            ]
        },
        {
            "style": "Callout",
            "text": "You don't need to be a star programmer or professional trader to contribute. Superalgos is about fostering global collaboration and every user is expected to give back. Feedback is valuable. Fixing a typo is valuable. Translating a tutorial is valuable. Producing educational, reporting and removing bugs, contributing an indicator or a trading system, integrating a crypto project... everything is of great value!",
            "updated": 1610662378411,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вам не нужно быть выдающимся программистом или профессиональным трейдером, чтобы внести свой вклад. Superalgos способствует глобальному сотрудничеству, и от каждого пользователя ожидается отдача. Обратная связь ценна. Исправление опечатки - это ценно. Перевести учебник - это ценно. Создание образовательных программ, сообщение об ошибках и их устранение, создание индикатора или торговой системы, интеграция криптовалютного проекта... все имеет огромное значение!",
                    "updated": 1640282337471
                },
                {
                    "language": "DE",
                    "text": "Sie müssen kein Starprogrammierer oder professioneller Trader sein, um einen Beitrag zu leisten. Bei Superalgos geht es darum, die globale Zusammenarbeit zu fördern, und von jedem Nutzer wird erwartet, dass er etwas zurückgibt. Feedback ist wertvoll. Das Korrigieren eines Tippfehlers ist wertvoll. Das Übersetzen eines Tutorials ist wertvoll. Die Erstellung von Lehrmaterial, das Melden und Entfernen von Fehlern, das Einbringen eines Indikators oder eines Handelssystems, die Integration eines Krypto-Projekts... alles ist von großem Wert!",
                    "updated": 1645479075459
                },
                {
                    "language": "TR",
                    "text": "Katkıda bulunmak için yıldız programcı veya profesyonel tüccar olmanıza gerek yok. Superalgos, küresel işbirliğini teşvik etmekle ilgilidir ve her kullanıcının geri vermesi beklenir. Geri bildirim değerlidir. Bir yazım hatası düzeltmek değerlidir. Bir öğreticiyi çevirmek değerlidir. Eğitim üretmek, hataları raporlamak ve kaldırmak, bir gösterge veya ticaret sistemine katkıda bulunmak, bir kripto projesini entegre etmek… her şey çok değerli!",
                    "updated": 1652464357310
                }
            ]
        },
        {
            "style": "Success",
            "text": "To get started with your first contribution, keep going with the tutorial until the end. You will learn a few tricks that will make contributing a breeze!",
            "updated": 1610660489943,
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы начать свой первый вклад, дочитайте учебник до конца. Вы узнаете несколько хитростей, которые помогут вам сделать вклад с легкостью!",
                    "updated": 1640282359559
                },
                {
                    "language": "DE",
                    "text": "Um mit Ihrem ersten Beitrag zu beginnen, lesen Sie das Tutorial bis zum Ende durch. Sie werden ein paar Tricks lernen, die das Verfassen von Beiträgen zum Kinderspiel machen!",
                    "updated": 1645479131992
                },
                {
                    "language": "TR",
                    "text": "İlk katkınızla başlamak için öğreticiyi sonuna kadar devam ettirin. Katkıda bulunmayı çok kolaylaştıracak birkaç püf noktası öğreneceksiniz!",
                    "updated": 1652464402950
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}