{
    "topic": "Governance Flow",
    "pageNumber": "3",
    "type": "Token Rewards, Claims Power and Claim Votes",
    "definition": {
        "text": "These three concepts are intimately related and make up the logic of the token distribution.",
        "updated": 1624781724176
    },
    "paragraphs": [
        {
            "style": "Include",
            "text": "Governance->Concept->Claims Power->Content",
            "updated": 1624781714508
        },
        {
            "style": "Text",
            "text": "You control the flow of your Claims Power so that the appropriate number reaches the node with which you wish to present a claim. That is, you present claims for a specific number of tokens, determined by the Claims Power that reaches the corresponding claim node.",
            "updated": 1624781792664
        },
        {
            "style": "Text",
            "text": "You already know that the Token Rewards in a definition node (a Position, Feature, or Asset node) determines how many tokens are available to incentivize the production and/or maintenance of the concept represented by the node."
        },
        {
            "style": "Callout",
            "text": "When you place a claim on a definition node, you are declaring that you wish the Community to reward you with the number of tokens in your claim (Claims Power) for the work done on the concept embodied by the corresponding definition node."
        },
        {
            "style": "Text",
            "text": "Many different scenarios may arise up to this point. "
        },
        {
            "style": "Text",
            "text": "For example:"
        },
        {
            "style": "List",
            "text": "Your claim may be equal, smaller, or greater than the Token Rewards available in the node."
        },
        {
            "style": "List",
            "text": "Your claim may be the only claim in the node, or there may be other claims too."
        },
        {
            "style": "List",
            "text": "The total Claims Power in all existing claims may be equal, smaller, or greater than the Token Rewards available in the node."
        },
        {
            "style": "Text",
            "text": "And that is not all! On top of the above scenarios, we need to account for Claim Votes!"
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Claim Votes->Content",
            "updated": 1624781853443
        },
        {
            "style": "Text",
            "text": "The flow of Voting Power into Claim Votes follows the same principles as the rest of the flows in the Voting Program. This means that Claim Votes have a specific Voting Power, pretty much like claims have a specific Claims Power.",
            "updated": 1624781873207
        },
        {
            "style": "Text",
            "text": "In other words, when you vote on someone’s claim, you don’t necessarily vote for the entirety of the claim. Your vote carries a specific Voting Power that may be equal, lesser, or greater than the Claim Power in the claim!"
        },
        {
            "style": "Text",
            "text": "In addition, more Contributors may vote for the same claim."
        },
        {
            "style": "Text",
            "text": "As you can see, the variables and possible scenarios are many. Let’s lay out the general rules that guide the calculation of what Token Rewards go to what claims."
        },
        {
            "style": "List",
            "text": "The Token Rewards available in a node determines the maximum number of tokens that may be distributed through that node. In no case shall the system distribute more tokens than what the Token Rewards value indicates. In other words, the Community decides what is the maximum number of tokens to be distributed through any given node with their Weight Votes."
        },
        {
            "style": "List",
            "text": "The maximum Token Rewards allocated to a claim is determined by the Token Rewards available in the node, the Claim Power associated with the claim, or the sum of the Voting Power of all Claim Votes associated with the claim, whichever is smaller."
        },
        {
            "style": "List",
            "text": "When the sum of Voting Power of all Claim Votes associated with a claim is lesser than the Claims Power of the claim, the claim is not paid in full. The Token Rewards is capped by the total Voting Power of all Claim Votes. In other words, claims are paid up to the amount the Community decides with their Claim Votes."
        },
        {
            "style": "List",
            "text": "When Token Rewards are enough to pay all claims, then each claim is paid in full, as expected. In more precise, albeit complex terms, when Token Rewards are greater than the sum of Voting Power for any given number of claims, or the sum of Claims Power for any given number of claims, whichever is lesser, each claim gets the Token Reward equal to its Claims Power or equal to the Voting Power of associated Claim Votes, whichever is lesser. "
        },
        {
            "style": "List",
            "text": "When Token Rewards are NOT enough to pay all claims, an adjustment must be made to pay a fair proportion to each claim, without exceeding the Token Rewards available. In such a case, each claim is reduced in proportion to the amount in which claims exceed the Token Rewards. For example, if the sum of all claims exceeds the Token Reward by 10%, then each claim is reduced by 10%."
        }
    ]
}