{
    "topic": "Governance Flow",
    "pageNumber": "1",
    "type": "The Superalgos Meritocracy",
    "definition": {
        "text": "El Proyecto de Gobernanza de Superalgos aplica un sistema meritocrático por el que cuanto más contribuyas, más derecho tendrás a influir en la dirección del desarrollo.",
        "updated": 1683551953175,
        "translations": [
            {
                "language": "ES",
                "text": "El Superalgos Governance Project ( el proyecto de gobernanza de Superalgos) implementa un sistema de meritocracia por el cuál mientras más contribuye, más derechos tiene a influir en la dirección del desarrollo.",
                "updated": 1637436733851
            },
            {
                "language": "RU",
                "text": "Проект управления Superalgos (Governance Project) реализует меритократическую систему, согласно которой чем больше вы вносите свой вклад, тем больше вы имеете право влиять на направление развития.",
                "updated": 1640318724957
            },
            {
                "language": "TR",
                "text": "Özet: Superalgos Yönetişim Projesi ( Governance Project ), ne kadar çok katkıda bulunursanız, gelişimin yönünü etkileme hakkınız o kadar yüksek olan bir meritokratik sistem uygular.",
                "updated": 1646735959454
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Todo comienza con las Fichas de Superalgos SA que ya tienes y que ganaste por contribuciones anteriores. Tus participaciones te confieren Poder de Fichas.",
            "updated": 1683551975844,
            "translations": [
                {
                    "language": "ES",
                    "text": "Todo comienza con su tenencia de Superalgos SA Tokens existentes que ha ganando previamente con sus contribuciones. Su tenencia le confiere Token Power.",
                    "updated": 1639131167854
                },
                {
                    "language": "RU",
                    "text": "Все начинается с ваших существующих запасов токенов Superalgos SA Tokens, которые вы заработали за предыдущие вклады. Ваши запасы наделяют вас Token Power (Сила токенов).",
                    "updated": 1640318961846
                },
                {
                    "language": "TR",
                    "text": "Her şey, önceki katkılar için kazandığınız mevcut Superalgos SA Jetonlarınız ile başlar. Sahip olduğunuz varlıklar size Jeton Gücü ( Token Power ) verir.",
                    "updated": 1646736000497
                }
            ]
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Token Power->Content",
            "updated": 1624780741084,
            "translations": [
                {
                    "language": "TR",
                    "text": "Yönetişim->Kavram->Token Power->İçerik",
                    "updated": 1654395376183,
                    "style": "Include"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Hay un segundo concepto que es crucial para la forma en que Superalgos valora las contribuciones: La reputación.",
            "updated": 1683551995886,
            "translations": [
                {
                    "language": "ES",
                    "text": "Hay un segundo concepto que es crucial en como Superalgos valúa las contribuciones: la Reputación.",
                    "updated": 1637426971474
                },
                {
                    "language": "RU",
                    "text": "Существует второе понятие, которое имеет решающее значение для того, как Superalgos оценивает вклады: Reputation (Репутация).",
                    "updated": 1640319110013
                },
                {
                    "language": "TR",
                    "text": "Superalgos'un katkılara nasıl değer verdiği konusunda çok önemli olan ikinci bir kavram daha vardır: İtibar: ( Reputation ) ",
                    "updated": 1646736042438
                }
            ]
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reputation->Content",
            "translations": [
                {
                    "language": "TR",
                    "text": "Yönetişim->Kavram->Reputation->İçerik",
                    "updated": 1654395381902,
                    "style": "Include"
                }
            ]
        }
    ]
}