{
    "topic": "Governance Flow",
    "pageNumber": "1",
    "type": "The Superalgos Meritocracy",
    "definition": {
        "text": "The Superalgos Governance Project implements a meritocratic system by which the more you contribute, the more you are entitled to influence the direction of development. ",
        "updated": 1624780224978,
        "translations": [
            {
                "language": "ES",
                "text": "El Superalgos Governance Project ( el proyecto de gobernanza de Superalgos) implementa un sistema de meritocracia por el cuál mientras más contribuye, más derechos tiene a influir en la dirección del desarrollo.",
                "updated": 1637436733851
            },
            {
                "language": "RU",
                "text": "Проект управления Superalgos (Governance Project) реализует меритократическую систему, согласно которой чем больше вы вносите свой вклад, тем больше вы имеете право влиять на направление развития.",
                "updated": 1640318724957
            },
            {
                "language": "TR",
                "text": "Özet: Superalgos Yönetişim Projesi ( Governance Project ), ne kadar çok katkıda bulunursanız, gelişimin yönünü etkileme hakkınız o kadar yüksek olan bir meritokratik sistem uygular.",
                "updated": 1646735959454
            },
            {
                "language": "DE",
                "text": "Das Superalgos Governance Project implementiert ein meritokratisches System. Je mehr Sie dazu beitragen, desto mehr Einfluss haben Sie auf die Entwicklung des Projektes.",
                "updated": 1702327744928
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Everything starts with your existing holdings of Superalgos SA Tokens that you earned for previous contributions. Your holdings confer you Token Power.",
            "updated": 1624780384340,
            "translations": [
                {
                    "language": "ES",
                    "text": "Todo comienza con su tenencia de Superalgos SA Tokens existentes que ha ganando previamente con sus contribuciones. Su tenencia le confiere Token Power.",
                    "updated": 1639131167854
                },
                {
                    "language": "RU",
                    "text": "Все начинается с ваших существующих запасов токенов Superalgos SA Tokens, которые вы заработали за предыдущие вклады. Ваши запасы наделяют вас Token Power (Сила токенов).",
                    "updated": 1640318961846
                },
                {
                    "language": "TR",
                    "text": "Her şey, önceki katkılar için kazandığınız mevcut Superalgos SA Jetonlarınız ile başlar. Sahip olduğunuz varlıklar size Jeton Gücü ( Token Power ) verir.",
                    "updated": 1646736000497
                },
                {
                    "language": "DE",
                    "text": "Für ihre Wertschöpfung bekommen sie eine bestimmte Anzahl Superalgos SA Token. Ihre erworbenen Token verleihen Ihnen Token Power.",
                    "updated": 1702327756154
                }
            ]
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Token Power->Content",
            "updated": 1624780741084,
            "translations": [
                {
                    "language": "TR",
                    "text": "Yönetişim->Kavram->Token Power->İçerik",
                    "updated": 1654395376183,
                    "style": "Include"
                }
            ]
        },
        {
            "style": "Text",
            "text": "There is a second concept that is crucial to how Superalgos values contributions: Reputation.",
            "updated": 1630508777182,
            "translations": [
                {
                    "language": "ES",
                    "text": "Hay un segundo concepto que es crucial en como Superalgos valúa las contribuciones: la Reputación.",
                    "updated": 1637426971474
                },
                {
                    "language": "RU",
                    "text": "Существует второе понятие, которое имеет решающее значение для того, как Superalgos оценивает вклады: Reputation (Репутация).",
                    "updated": 1640319110013
                },
                {
                    "language": "TR",
                    "text": "Superalgos'un katkılara nasıl değer verdiği konusunda çok önemli olan ikinci bir kavram daha vardır: İtibar: ( Reputation ) ",
                    "updated": 1646736042438
                },
                {
                    "language": "DE",
                    "text": "Es gibt ein zweites Kriterium, welches entscheidend dafür ist, wie Superalgos Beiträge bewertet werden: Reputation.",
                    "updated": 1702327785234
                }
            ]
        },
        {
            "style": "Include",
            "text": "Governance->Concept->Reputation->Content",
            "translations": [
                {
                    "language": "TR",
                    "text": "Yönetişim->Kavram->Reputation->İçerik",
                    "updated": 1654395381902,
                    "style": "Include"
                }
            ]
        }
    ]
}