{
    "type": "Workspace",
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1610620673078
        },
        {
            "style": "Text",
            "text": "A workspace stores information about:",
            "translations": [
                {
                    "language": "RU",
                    "text": "В рабочем пространстве хранится информация:",
                    "updated": 1638344605651
                },
                {
                    "language": "DE",
                    "text": "Ein Workspace enthält Daten über:",
                    "updated": 1639344135929
                },
                {
                    "language": "TR",
                    "text": "Bir çalışma alanı aşağıdakilerle ilgili bilgileri depolar:",
                    "updated": 1639746801749
                },
                {
                    "language": "PT",
                    "text": "Uma Área de Trabalho (Workspace) armazena informações sobre:",
                    "updated": 1711485943575
                }
            ]
        },
        {
            "style": "List",
            "text": "Any hierarchy that is not included as a plugin.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Toda hierarchy (jerarquía) que no esté incluida como plugin (enchufe).",
                    "updated": 1633089492790,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Любая иерархия, не включенная в качестве плагина.",
                    "updated": 1638344601117
                },
                {
                    "language": "DE",
                    "text": "Jede Hierarchie, die nicht als Plugin enthalten ist.",
                    "updated": 1639344152746
                },
                {
                    "language": "TR",
                    "text": "Eklenti olmayan her türlü hiyerarşi.",
                    "updated": 1639746876427
                },
                {
                    "language": "EL",
                    "text": "Οποιαδήποτε ιεραρχία που δεν περιλαμβάνεται ως πρόσθετο.",
                    "updated": 1641829782309
                },
                {
                    "language": "PT",
                    "text": "Qualquer hierarquia que não esteja incluída como um plugin. ",
                    "updated": 1711486001595
                }
            ]
        },
        {
            "style": "List",
            "text": "Nodes that may be floating around, detached from hierarchies.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Nodos que puedan estar flotando por ahí, desconectados de jerarquías",
                    "updated": 1633089543104,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Узлы, которые могут находиться в плавающем состоянии, отделены от иерархий.",
                    "updated": 1638344663875
                },
                {
                    "language": "DE",
                    "text": "Nodes, die sich losgelöst von Hierarchien im Umlauf befinden können.",
                    "updated": 1639344198115
                },
                {
                    "language": "TR",
                    "text": "Hiyerarşilerden kopuk, etrafta yüzen düğümler.",
                    "updated": 1639746892148
                },
                {
                    "language": "EL",
                    "text": "Κόμβοι που μπορεί να επιπλέουν, αποκομμένοι από ιεραρχίες.",
                    "updated": 1641829796376
                },
                {
                    "language": "PT",
                    "text": "Nós que podem estar flutuando, desligados de hierarquias. ",
                    "updated": 1711486039092
                }
            ]
        },
        {
            "style": "List",
            "text": "Information regarding the physical position and state of all nodes within the design space, even those detached from hierarchies.",
            "updated": 1615891174248,
            "translations": [
                {
                    "language": "ES",
                    "text": "nformación relacionada a la posición física y al estado de todos los nodos dentro del espacio de diseño, incluyendo aquellos nodos sueltos.",
                    "updated": 1633089604851,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Информация о физическом положении и состоянии всех узлов в пространстве проектирования Design Space, даже тех, которые отделены от иерархий.",
                    "updated": 1638344705517
                },
                {
                    "language": "DE",
                    "text": "Informationen über die physische Position und den Zustand aller Knoten innerhalb des Entwurfsraums(design space), auch derjenigen, die von Hierarchien losgelöst sind.",
                    "updated": 1639344266368
                },
                {
                    "language": "TR",
                    "text": "Tasarım alanı içindeki tüm düğümlerin, hatta hiyerarşilerden ayrılanların bile fiziksel konumu ve durumu ile ilgili bilgiler.",
                    "updated": 1639746907339
                },
                {
                    "language": "EL",
                    "text": "Πληροφορίες σχετικά με τη φυσική θέση και την κατάσταση όλων των κόμβων εντός του σχεδιαστικού χώρου, ακόμη και εκείνων που είναι αποκομμένοι από ιεραρχίες.",
                    "updated": 1641829810443
                },
                {
                    "language": "PT",
                    "text": "Informações sobre a posição física e estado de todos os Nós (Nodes) dentro da Interface de Design (Design Space), mesmo aqueles desvinculados de hierarquias. ",
                    "updated": 1711486104973
                }
            ]
        },
        {
            "style": "Text",
            "text": "A workspace is not part of any of the hierarchies; instead, it contains them.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Un workspace no es parte de ninguna jerarquía, por el contrario, las contiene.",
                    "updated": 1633089633238,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Рабочее пространство не является частью какой-либо иерархии; вместо этого он их содержит.",
                    "updated": 1638344728568
                },
                {
                    "language": "DE",
                    "text": "Ein Workspace ist nicht Teil einer der Hierarchien, sondern enthält sie.",
                    "updated": 1639344339043
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanı, hiyerarşilerin (Düğümlerin) hiçbirinin parçası değildir; tam tersine çalışma alanı hiyerarşileri (Düğümleri) içeris",
                    "updated": 1639746963024
                },
                {
                    "language": "EL",
                    "text": "Ένας χώρος εργασίας δεν αποτελεί μέρος καμίας από τις ιεραρχίες. Αντίθετα, τις περιέχει.",
                    "updated": 1641829822166
                },
                {
                    "language": "PT",
                    "text": "Uma Área de Trabalho (Workspace) não faz parte de nenhuma das hierarquias; em vez disso, as hierarquias estão contidas na própria Área de Trabalho (Workspace).",
                    "updated": 1711486297828
                }
            ]
        },
        {
            "style": "Title",
            "text": "Native Workspaces",
            "translations": [
                {
                    "language": "PT",
                    "text": "Área de Trabalho Nativas (Nativa Workspaces)",
                    "updated": 1711486348639
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos ships with several Native Workspaces. These are pre-configured workspaces built for specific purposes, for example, to host tutorials, demo strategies, specific projects, and so on.",
            "translations": [
                {
                    "language": "PT",
                    "text": "O Superalgos é fornecido com várias Área de Trabalho Nativa (Native Workspace). Estas são Área de Trabalho (Workspace) pré-configurados construídos para fins específicos, por exemplo, para hospedar tutoriais, estratégias de demonstração, projetos específicos, entre outros.",
                    "updated": 1711486501167
                }
            ]
        },
        {
            "style": "Text",
            "text": "Native workspaces are stored in the Plugins folder, organized by Project. For instance, the Getting Started Tutorials Native Workspace is stored in the following location:",
            "translations": [
                {
                    "language": "PT",
                    "text": "As Área de Trabalho Nativas (Native Workspace) são armazenados na pasta \"Plugins\", organizados por projeto (Project). Por exemplo, a Área de Trabalho Nativasa(Native Workspace) dos Tutoriais de Iniciação (Started Tutorials Native Workspace) é armazenado no seguinte local:",
                    "updated": 1711486685925
                }
            ]
        },
        {
            "style": "Json",
            "text": "Plugins/Foundations/Workspaces"
        },
        {
            "style": "Title",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Saving Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Saving Workspaces   (Guardando espacios de trabajo)",
                    "updated": 1633107199561,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Сохранение Workspace",
                    "updated": 1638344990478
                },
                {
                    "language": "DE",
                    "text": "Workspaces speichern",
                    "updated": 1639344719336
                },
                {
                    "language": "TR",
                    "text": "Çalışma Alanlarının Kaydedilmesi",
                    "updated": 1639747716343
                },
                {
                    "language": "EL",
                    "text": "Saving Workspaces (Αποθήκευση Xώρων Eργασίας)",
                    "updated": 1641829933201
                },
                {
                    "language": "PT",
                    "text": "Gravar  Área de Trabalho (Workspace)",
                    "updated": 1711486715926
                }
            ]
        },
        {
            "style": "Text",
            "text": "Any workspace that is saved by the user is a User Workspace.",
            "updated": 1622634912210,
            "translations": [
                {
                    "language": "ES",
                    "text": "Todo workspace que sea grabado por un usuario es un user workspace.",
                    "updated": 1633106992641,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Любая рабочее пространство, сохраненная пользователем, является пользовательским рабочим пространством.",
                    "updated": 1638345038084
                },
                {
                    "language": "DE",
                    "text": "Jeder Workspace, der vom Benutzer gespeichert wird, ist ein User Workspace",
                    "updated": 1639344751205
                },
                {
                    "language": "TR",
                    "text": "Kullanıcı tarafından kaydedilen herhangi bir çalışma alanı, bir Kullanıcı Çalışma Alanıdır.",
                    "updated": 1639747701144
                },
                {
                    "language": "EL",
                    "text": "Κάθε χώρος εργασίας που αποθηκεύεται από τον χρήστη είναι ένας User Workspace (Χώρος Εργασίας Χρήστη).",
                    "updated": 1641829969120
                },
                {
                    "language": "PT",
                    "text": "Qualquer Área de Trabalho (Workspace) que seja guardado pelo utilizador é uma Área de Trabalho (User Workspace) do Utilizador",
                    "updated": 1711486815899
                }
            ]
        },
        {
            "style": "Note",
            "text": "Workspaces are saved as JSON files in the Platform/My-Workspaces folder.",
            "updated": 1687798464799,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los  workspaces son guardados como archivos JSON en la carpeta My-workspaces.",
                    "updated": 1633107047310,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Рабочие пространства сохраняются в виде файлов JSON в папке My-Workspaces.",
                    "updated": 1638345077867
                },
                {
                    "language": "DE",
                    "text": "Workspaces werden als JSON-Dateien im Ordner My-Workspaces gespeichert.",
                    "updated": 1639344889249
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanları, My-Workspaces klasörüne JSON dosyaları olarak kaydedilir.",
                    "updated": 1639748878847
                },
                {
                    "language": "EL",
                    "text": "Οι Workspaces (Χώροι Εργασίας) αποθηκεύονται ως αρχεία JSON στο φάκελο My-Workspaces.",
                    "updated": 1641829997794
                },
                {
                    "language": "PT",
                    "text": "Os Área de Trabalho (Workspace) são guardados como ficheiros JSON na pasta \"Platform/My-Workspaces\".",
                    "updated": 1711486860631
                }
            ]
        },
        {
            "style": "Text",
            "text": "To save a workspace, use the Save Workspace option under the Workspaces menu, or use the following hot-key combination:",
            "updated": 1687798787980,
            "translations": [
                {
                    "language": "ES",
                    "text": "Puede guardar un  workspace manualmente utilizando la siguiente combinación de teclas:",
                    "updated": 1633107089375,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Вы можете сохранить рабочее пространство вручную, используя следующую комбинацию горячих клавиш:",
                    "updated": 1638345094211
                },
                {
                    "language": "DE",
                    "text": "Sie können einen Workspace manuell mit der folgenden Tastenkombination speichern:",
                    "updated": 1639344930505
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki kısayol tuşu kombinasyonunu kullanarak bir çalışma alanını kaydedebilirsiniz:",
                    "updated": 1639748905406
                },
                {
                    "language": "EL",
                    "text": "Μπορείτε να αποθηκεύσετε χειροκίνητα έναν χώρο εργασίας χρησιμοποιώντας τον ακόλουθο συνδυασμό πλήκτρων συντόμευσης:",
                    "updated": 1641830020438
                },
                {
                    "language": "PT",
                    "text": "Para guardar uma Área de Trabalho (Workspace), utilize a opção \"Guardar Espaço de Trabalho (Save Workspace)\" no menu Área de Trabalho (Workspace),  ou utilize a seguinte combinação de teclas de atalho:",
                    "updated": 1711486989582
                }
            ]
        },
        {
            "style": "Text",
            "text": "Ctrl or Cmd + Shift + Alt + Key-S",
            "updated": 1631372841724
        },
        {
            "style": "Success",
            "text": "Backing up a workspace downloads the same file to your local Downloads folder. This is a good way to store sequential versions in case you ever need to go back to a previous state of affairs.",
            "updated": 1615892985307,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si hace un  backup de un  workspace se bajará el mismo archivo a su carpeta de Downloads. Este es un buen modo de almacenar versiones secuencialmente en caso de que alguna vez necesite regresar a una versión anterior.",
                    "updated": 1633107143583,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "При резервном копировании рабочего пространства этот же файл загружается в локальную папку Downloads. Это хороший способ сохранить последовательные версии на случай, если вам когда-нибудь понадобится вернуться к предыдущему состоянию дел.",
                    "updated": 1638345134303
                },
                {
                    "language": "TR",
                    "text": "Bir çalışma alanını yedeklemek, dosyayı yerel İndirilenler klasörünüze indirir. Bu, önceki bir duruma geri dönmeniz gerekmesi ihtimaline karşı sıralı sürümleri saklamanın iyi bir yoludur.",
                    "updated": 1639748938597
                },
                {
                    "language": "EL",
                    "text": "Η δημιουργία αντιγράφων ασφαλείας ενός χώρου εργασίας κατεβάζει το ίδιο αρχείο στον τοπικό σας φάκελο \"Λήψεις\". Αυτός είναι ένας καλός τρόπος αποθήκευσης διαδοχικών εκδόσεων σε περίπτωση που χρειαστεί να επιστρέψετε σε μια προηγούμενη κατάσταση πραγμάτων.",
                    "updated": 1641830034677
                },
                {
                    "language": "PT",
                    "text": "Fazer backup de uma Área de Trabalho (Workspace) faz o download do mesmo ficheiro para a pasta de Downloads local. Esta é uma boa maneira de armazenar versões sequenciais no caso de precisar voltar a um estado anterior.",
                    "updated": 1711487099527
                }
            ]
        },
        {
            "style": "Important",
            "text": "When you load, modify, and save a Native Workspace, the actual plugin file remains intact, that is, the plugin is not modified. Instead, a new file is created in the Platform/My-Workspaces folder. This file is a copy of the Native Workspace featuring the modifications you introduced. The copy is saved with the name of the Workspace node, which is usually the same name as the plugin. To save the workspace with a different name, you must change the name of the Workspace node and save.",
            "updated": 1687798576929,
            "translations": [
                {
                    "language": "PT",
                    "text": "Quando você carrega, modifica e salva um Espaço de Trabalho Nativo, o arquivo de plugin real permanece intacto, ou seja, o plugin não é modificado. Em vez disso, um novo arquivo é criado na pasta \"Platform/My-Workspaces\". Este arquivo é uma cópia do Espaço de Trabalho Nativo com as modificações introduzidas. A cópia é salva com o nome do nó do Espaço de Trabalho, que geralmente é o mesmo nome do plugin. Para salvar o espaço de trabalho com um nome diferente, você deve alterar o nome do nó do Espaço de Trabalho e salvar.",
                    "updated": 1711487235157
                }
            ]
        },
        {
            "style": "Title",
            "text": "Loading Workspaces",
            "updated": 1687798809487,
            "translations": [
                {
                    "language": "PT",
                    "text": "Carregar uma Área de Trabalho (Workspace) ",
                    "updated": 1711487265446
                }
            ]
        },
        {
            "style": "Text",
            "text": "Users may manage multiple workspaces, but only one workspace may be loaded in the system at any point.",
            "translations": [
                {
                    "language": "PT",
                    "text": "Os utilizadores podem gerir vários Área de Trabalho (Workspace), mas apenas um espaço de trabalho pode estar carregado no sistema a qualquer momento.",
                    "updated": 1711487311560
                }
            ]
        },
        {
            "style": "Callout",
            "text": "To load a workspace, use the Native Workspaces or the User Workspace option on the Workspaces menu.",
            "updated": 1687798877373,
            "translations": [
                {
                    "language": "PT",
                    "text": "Para carregar um Área de Trabalho (Workspace), utilize a opção Área de Trabalho Nativa (Native Workspace) ou Área de Trabalho do Utilizador (User Workspace) no menu Área de Trabalho (Workspace).",
                    "updated": 1711487458037
                }
            ]
        },
        {
            "style": "Success",
            "text": "To load a workspace you got from a third party, you may place the file in the Platform/My-Workspaces folder so that you may open it from the User Workspace menu. You may also drag the file and drop it on the Design Space.",
            "updated": 1687798940870,
            "translations": [
                {
                    "language": "PT",
                    "text": "Para carregar um espaço de trabalho que obteve de terceiros, poderá colocar no arquivo na pasta \"Platform/My-Workspaces\" para que possa abri-lo a partir do menu Área de Trabalho do Utilizador (User Workspace) . Por outro lado, poderá também arrastar e soltar o arquivo na Interface de Design (Design Space).",
                    "updated": 1711487652167
                }
            ]
        },
        {
            "style": "Warning",
            "text": "It is not recommended to launch multiple instances of the UI in separate browser tabs to load different workspaces at the same time. The system is not prepared to handle this type of use and it may behave erratically as a consequence.",
            "updated": 1687798954286,
            "translations": [
                {
                    "language": "PT",
                    "text": "Não é recomendado iniciar várias instâncias da interface do utilizador (UI) em separado em abas do navegador para carregar Áreas de Trabalho (Workspace) diferentes ao mesmo tempo. O sistema não está preparado para lidar com esse tipo de uso e pode comportar-se de forma errática como consequência deste múltiplo uso das Áreas de Trabalho (Workspace) simultâneas.",
                    "updated": 1711487889639
                }
            ]
        },
        {
            "style": "Title",
            "text": "Configuration",
            "updated": 1687798668404,
            "translations": [
                {
                    "language": "PT",
                    "text": "Configuração",
                    "updated": 1711487901877
                }
            ]
        },
        {
            "style": "Text",
            "text": "A workspace can have the following configuration properties, all are optional:",
            "translations": [
                {
                    "language": "PT",
                    "text": "Um Área de Trabalho (Workspace) pode ter as seguintes propriedades de configuração, sendo todas opcionais:",
                    "updated": 1711487948011
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n    \"docsLanguage\": \"EN\",\n    \"contributionsBranch\": \"develop\",\n    \"location\": \"tutorials\"\n}",
            "updated": 1679579295030
        },
        {
            "style": "List",
            "text": "<strong>docsLanuage</strong>: sets the language for the documentation",
            "updated": 1679579295030,
            "translations": [
                {
                    "language": "PT",
                    "text": "docsLanuage: define o idioma para a documentação",
                    "updated": 1711487974915
                }
            ]
        },
        {
            "style": "List",
            "text": "<strong>contributionsBranch</strong>: sets the git branch for making your contributions",
            "updated": 1679579295030,
            "translations": [
                {
                    "language": "PT",
                    "text": "contributionsBranch: define o git branch para fazer suas contribuições",
                    "updated": 1711488048978
                }
            ]
        },
        {
            "style": "List",
            "text": "<strong>location</strong>: a specific folder location for this workspace to live. If you want this to be nested in multiple folders, examples would be <i>copy-trading/live</i>, <i>copy-trading/paper</i>.",
            "updated": 1679579295030,
            "translations": [
                {
                    "language": "PT",
                    "text": "location: uma localização específica da pasta para este espaço de trabalho habitar. Se deseja que isso esteja aninhado em várias pastas, exemplos seriam copy-trading/live, copy-trading/paper.",
                    "updated": 1711488084237
                }
            ]
        },
        {
            "style": "Title",
            "text": "Creating Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Creating Workspaces    (Creando workspaces)",
                    "updated": 1633107483723,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Создание Workspace",
                    "updated": 1638345553252
                },
                {
                    "language": "DE",
                    "text": "Workspaces erstellen:",
                    "updated": 1639346933048
                },
                {
                    "language": "EL",
                    "text": "Creating Workspaces (Δημιουργία Χώρων Εργασίας)",
                    "updated": 1641830128218
                },
                {
                    "language": "TR",
                    "text": "Çalışma Alanlarını Oluşturma",
                    "updated": 1654762881660
                },
                {
                    "language": "PT",
                    "text": "Criar Áreas de Trabalho (Workspace)",
                    "updated": 1711488107799
                }
            ]
        },
        {
            "style": "Text",
            "text": "To create a new workspace, rename any of the existing workspaces by changing the label of the workspace node, and save it as explained above. After you change the label and once the workspace is saved (by any of the usual means), a new file is stored in the My-Workspaces folder.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы создать новое рабочее пространство, переименуйте любое из существующих рабочих пространств, изменив метку узла рабочего пространства, и сохраните его, как описано выше. После изменения метки и сохранения рабочего пространства (любым из обычных способов) новый файл сохраняется в папке My-Workspaces.",
                    "updated": 1638345612276
                },
                {
                    "language": "DE",
                    "text": "Um einen neuen Workspace zu erstellen, benennen Sie einen der vorhandenen Workspaces um, indem Sie die Bezeichnung der Workspace Node ändern, und speichern Sie ihn wie oben beschrieben. Nach dem Ändern der Bezeichnung und dem Speichern des Workspaces (auf einem der üblichen Wege) wird eine neue Datei im Ordner My-Workspaces gespeichert.",
                    "updated": 1639347021732
                },
                {
                    "language": "EL",
                    "text": "Για να δημιουργήσετε έναν νέο χώρο εργασίας, μετονομάστε οποιονδήποτε από τους υπάρχοντες χώρους εργασίας αλλάζοντας την ετικέτα του κόμβου χώρου εργασίας και αποθηκεύστε τον όπως εξηγήθηκε παραπάνω. Αφού αλλάξετε την ετικέτα και αφού αποθηκευτεί ο χώρος εργασίας (με οποιοδήποτε από τα συνήθη μέσα), αποθηκεύεται ένα νέο αρχείο στο φάκελο My-Workspaces.",
                    "updated": 1641830146595
                },
                {
                    "language": "TR",
                    "text": "Yeni bir çalışma alanı oluşturmak için, çalışma alanı düğümünün etiketini değiştirerek mevcut çalışma alanlarından herhangi birini yeniden adlandırın ve yukarıda açıklandığı gibi kaydedin. Etiketi değiştirdikten ve çalışma alanı kaydedildikten sonra (normal yollardan herhangi biriyle), Çalışma Alanlarım (My Workspaces) klasöründe yeni bir dosya olarak saklanır.",
                    "updated": 1654762946402
                },
                {
                    "language": "PT",
                    "text": "Para criar um novo espaço de trabalho, dê um novo nome a qualquer uma das Área de Trabalho (Workspace) existentes alterando o rótulo do Nó (Node) da Área de Trabalho (Workspace) e grave-a conforme explicado anteriormente. Após alterar o nome e uma vez que a Área de Trabalho (Workspace) seja guardada (por qualquer dos meios habituais), um novo arquivo é armazenado na pasta \"My-Workspaces\".",
                    "updated": 1711488318707
                }
            ]
        },
        {
            "style": "Success",
            "text": "The Blank Template Native Workspace is the best to start with if you wish to create your own setup.",
            "updated": 1629894382983,
            "translations": [
                {
                    "language": "RU",
                    "text": "Для начала лучше всего использовать шаблон Blank Template Native Workspace, если вы хотите создать свою собственную настройку.",
                    "updated": 1638345758533
                },
                {
                    "language": "DE",
                    "text": "Der Blank Template Native Workspace eignet sich am besten für den Anfang, wenn Sie Ihr eigenes Setup erstellen möchten.",
                    "updated": 1639347042936
                },
                {
                    "language": "EL",
                    "text": "Το Πρόσθετο Κενό Πρότυπο Χώρου Εργασίας είναι το καλύτερο για να ξεκινήσετε εάν θέλετε να δημιουργήσετε τη δική σας σύνθεση.",
                    "updated": 1641830213361
                },
                {
                    "language": "TR",
                    "text": "Boş Şablon Eklentisi Çalışma Alanı (The Blank Template Native Workspace) , kendi kurulumunuzu oluşturmak istiyorsanız başlamak için en iyisidir.",
                    "updated": 1654763011045
                },
                {
                    "language": "PT",
                    "text": "O Modelo em Branco da Área de Trabalho Nativa (Blank Template Native Workspace) é o melhor para começar se desejar criar a sua própria configuração.",
                    "updated": 1711488424387
                }
            ]
        },
        {
            "style": "Title",
            "text": "Deleting Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Deleting Workspaces      ( Borrando workspaces)",
                    "updated": 1633107676804,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Удаление Workspace",
                    "updated": 1638345770499
                },
                {
                    "language": "DE",
                    "text": "Workspaces löschen",
                    "updated": 1639347055020
                },
                {
                    "language": "EL",
                    "text": "Deleting Workspaces (Διαγραφή Χώρων Εργασίας)",
                    "updated": 1641830201923
                },
                {
                    "language": "TR",
                    "text": "Çalışma Alanlarını Silmek",
                    "updated": 1654763025181
                },
                {
                    "language": "PT",
                    "text": "Apagar  Áreas de Trabalho (Workspace)",
                    "updated": 1711488445981
                }
            ]
        },
        {
            "style": "Text",
            "text": "To delete a workspace, delete the corresponding workspace file from within the file system application of your operating system.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Para borrar un Workspace, borre el correspondiente archivo del Workspace dentro de la aplicación del sistema de archivos de su sistema operativo.",
                    "updated": 1633107728584,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Чтобы удалить рабочее пространство, удалите соответствующий файл рабочего пространства из приложения файловой системы вашей операционной системы.",
                    "updated": 1638345786254
                },
                {
                    "language": "DE",
                    "text": "Um einen Workspace zu löschen, löschen Sie die entsprechende workspace datei in der Dateisystemanwendung(Datei verwaltung/File system) Ihres Betriebssystems.",
                    "updated": 1639347139221
                },
                {
                    "language": "EL",
                    "text": "Για να διαγράψετε έναν χώρο εργασίας, διαγράψτε το αντίστοιχο αρχείο χώρου εργασίας μέσα από την εφαρμογή συστήματος αρχείων του λειτουργικού σας συστήματος.",
                    "updated": 1641830192466
                },
                {
                    "language": "TR",
                    "text": "Bir çalışma alanını silmek için, işletim sisteminizin dosya sistemi uygulaması içinden ilgili çalışma alanı dosyasını silin.",
                    "updated": 1654763041517
                },
                {
                    "language": "PT",
                    "text": "Para excluir um Área de Trabalho (Workspace), apague o ficheiro correspondente do Área de Trabalho (Workspace) dentro da aplicação de gestão de arquivos do seu OS, sistema operacional.",
                    "updated": 1711488563163
                }
            ]
        }
    ],
    "definition": {
        "text": "A workspace is an entity storing all system and user-generated information, excluding the state and contents of plugins. In technical terms, a workspace is a JSON file.",
        "updated": 1610620463347,
        "translations": [
            {
                "language": "ES",
                "text": "Un Workspace  (espacio de trabajo) es una entidad que almacena toda la información generada por el usuario y el sistema, excluyendo el estado y el contenido de los complementos. En términos técnicos, un espacio de trabajo es un archivo JSON.",
                "updated": 1633089108346,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Workspace - это объект, хранящий всю системную и пользовательскую информацию, за исключением состояния и содержимого плагинов. С технической точки зрения рабочее пространство - это файл JSON.",
                "updated": 1638344554135
            },
            {
                "language": "DE",
                "text": "Ein Workspace (=Arbeitsbereich) ist eine Entität, in der alle System- und benutzergenerierten Informationen gespeichert werden, mit Ausnahme des Status und der Inhalte von Plugins. Technisch gesehen ist ein Arbeitsbereich eine JSON-Datei.",
                "updated": 1639344118881
            },
            {
                "language": "TR",
                "text": "Çalışma alanı, eklentilerin durumu ve içeriği hariç, sistem ve kullanıcı tarafından oluşturulan bilgileri depolayan bir alandır. Teknik açıdan, çalışma alanı bir JSON dosyasıdır.",
                "updated": 1639233230804
            },
            {
                "language": "EL",
                "text": "Ο χώρος εργασίας είναι μια οντότητα που αποθηκεύει όλες τις πληροφορίες που δημιουργούνται από το σύστημα και τους χρήστες, εξαιρουμένης της κατάστασης και των περιεχομένων των προσθηκών. Από τεχνική άποψη, ένας χώρος εργασίας είναι ένα αρχείο JSON.",
                "updated": 1641829753699
            },
            {
                "language": "PT",
                "text": "Uma Área de Trabalho (Workspace) é uma entidade que armazena todas as informações geradas pelo sistema e pelo utilizador, excluindo o estado e o conteúdo dos plugins. Em termos técnicos, um espaço de trabalho é um arquivo JSON.",
                "updated": 1711485822687
            }
        ]
    }
}