{
    "type": "Workspace",
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1610620673078
        },
        {
            "style": "Text",
            "text": "A workspace stores information about:",
            "translations": [
                {
                    "language": "RU",
                    "text": "В рабочем пространстве хранится информация:",
                    "updated": 1638344605651
                },
                {
                    "language": "DE",
                    "text": "Ein Workspace enthält Daten über:",
                    "updated": 1639344135929
                },
                {
                    "language": "TR",
                    "text": "Bir çalışma alanı aşağıdakilerle ilgili bilgileri depolar:",
                    "updated": 1639746801749
                }
            ]
        },
        {
            "style": "List",
            "text": "Any hierarchy that is not included as a plugin.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Toda hierarchy (jerarquía) que no esté incluida como plugin (enchufe).",
                    "updated": 1633089492790,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Любая иерархия, не включенная в качестве плагина.",
                    "updated": 1638344601117
                },
                {
                    "language": "DE",
                    "text": "Jede Hierarchie, die nicht als Plugin enthalten ist.",
                    "updated": 1639344152746
                },
                {
                    "language": "TR",
                    "text": "Eklenti olmayan her türlü hiyerarşi.",
                    "updated": 1639746876427
                },
                {
                    "language": "EL",
                    "text": "Οποιαδήποτε ιεραρχία που δεν περιλαμβάνεται ως πρόσθετο.",
                    "updated": 1641829782309
                }
            ]
        },
        {
            "style": "List",
            "text": "Nodes that may be floating around, detached from hierarchies.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Nodos que puedan estar flotando por ahí, desconectados de jerarquías",
                    "updated": 1633089543104,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Узлы, которые могут находиться в плавающем состоянии, отделены от иерархий.",
                    "updated": 1638344663875
                },
                {
                    "language": "DE",
                    "text": "Nodes, die sich losgelöst von Hierarchien im Umlauf befinden können.",
                    "updated": 1639344198115
                },
                {
                    "language": "TR",
                    "text": "Hiyerarşilerden kopuk, etrafta yüzen düğümler.",
                    "updated": 1639746892148
                },
                {
                    "language": "EL",
                    "text": "Κόμβοι που μπορεί να επιπλέουν, αποκομμένοι από ιεραρχίες.",
                    "updated": 1641829796376
                }
            ]
        },
        {
            "style": "List",
            "text": "Information regarding the physical position and state of all nodes within the design space, even those detached from hierarchies.",
            "updated": 1615891174248,
            "translations": [
                {
                    "language": "ES",
                    "text": "nformación relacionada a la posición física y al estado de todos los nodos dentro del espacio de diseño, incluyendo aquellos nodos sueltos.",
                    "updated": 1633089604851,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Информация о физическом положении и состоянии всех узлов в пространстве проектирования Design Space, даже тех, которые отделены от иерархий.",
                    "updated": 1638344705517
                },
                {
                    "language": "DE",
                    "text": "Informationen über die physische Position und den Zustand aller Knoten innerhalb des Entwurfsraums(design space), auch derjenigen, die von Hierarchien losgelöst sind.",
                    "updated": 1639344266368
                },
                {
                    "language": "TR",
                    "text": "Tasarım alanı içindeki tüm düğümlerin, hatta hiyerarşilerden ayrılanların bile fiziksel konumu ve durumu ile ilgili bilgiler.",
                    "updated": 1639746907339
                },
                {
                    "language": "EL",
                    "text": "Πληροφορίες σχετικά με τη φυσική θέση και την κατάσταση όλων των κόμβων εντός του σχεδιαστικού χώρου, ακόμη και εκείνων που είναι αποκομμένοι από ιεραρχίες.",
                    "updated": 1641829810443
                }
            ]
        },
        {
            "style": "Text",
            "text": "A workspace is not part of any of the hierarchies; instead, it contains them.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Un workspace no es parte de ninguna jerarquía, por el contrario, las contiene.",
                    "updated": 1633089633238,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Рабочее пространство не является частью какой-либо иерархии; вместо этого он их содержит.",
                    "updated": 1638344728568
                },
                {
                    "language": "DE",
                    "text": "Ein Workspace ist nicht Teil einer der Hierarchien, sondern enthält sie.",
                    "updated": 1639344339043
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanı, hiyerarşilerin (Düğümlerin) hiçbirinin parçası değildir; tam tersine çalışma alanı hiyerarşileri (Düğümleri) içeris",
                    "updated": 1639746963024
                },
                {
                    "language": "EL",
                    "text": "Ένας χώρος εργασίας δεν αποτελεί μέρος καμίας από τις ιεραρχίες. Αντίθετα, τις περιέχει.",
                    "updated": 1641829822166
                }
            ]
        },
        {
            "style": "Title",
            "text": "Loading Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Loading Workspaces  (Subiendo espacios de trabajo)",
                    "updated": 1633089674625,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Загрузка Workspace",
                    "updated": 1638344760638
                },
                {
                    "language": "DE",
                    "text": "Workspaces laden",
                    "updated": 1639344347107
                },
                {
                    "language": "TR",
                    "text": "Çalışma Alanlarını Yükleme",
                    "updated": 1639746981742
                },
                {
                    "language": "EL",
                    "text": "Loading Workspaces (Φόρτωση Χώρων Εργασίας)",
                    "updated": 1641829840251
                }
            ]
        },
        {
            "style": "Text",
            "text": "Users may manage multiple workspaces, but only one workspace may be loaded in the system at any point.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Los usuarios pueden trabajar en muchos workspaces al mismo tiempo, pero uno solo debe ser subido al sistema en cualquier  momento.",
                    "updated": 1633089722388,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Пользователи могут управлять несколькими рабочими пространствами, но в любой момент в систему может быть загружено только одно рабочее пространство.",
                    "updated": 1638344784954
                },
                {
                    "language": "DE",
                    "text": "Benutzer können mehrere workspaces verwalten, aber es kann immer nur ein workspace im System geladen sein.",
                    "updated": 1639344394941
                },
                {
                    "language": "TR",
                    "text": "Kullanıcılar birden fazla çalışma alanınına sahip olabilir ve yönetebilirler, ancak sisteme yalnızca bir çalışma alanı yüklenebilir. İkinci bie çalışma alanı açma şansınız yoktur. Çalıştığınız çalışma alanını kapatarak yeni bir çalışma alanı yüklersiniz.",
                    "updated": 1639747065664
                },
                {
                    "language": "EL",
                    "text": "Οι χρήστες μπορούν να διαχειρίζονται πολλούς χώρους εργασίας, αλλά μόνο ένας χώρος εργασίας μπορεί να φορτωθεί στο σύστημα σε οποιοδήποτε σημείο.",
                    "updated": 1641829867667
                }
            ]
        },
        {
            "style": "Text",
            "text": "To load a workspace, click the workspaces tab on the left-hand side of the screen and select one of the available files.",
            "updated": 1624469374859,
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы загрузить рабочее пространство, щелкните вкладку Workspaces в левой части экрана и выберите один из доступных файлов.",
                    "updated": 1638344838274
                },
                {
                    "language": "DE",
                    "text": "Um einen Workspace zu laden, klicken Sie auf die Registerkarte \"Workspaces\" auf der linken Seite des Bildschirms und wählen eine der verfügbaren Dateien aus.",
                    "updated": 1639344445509
                },
                {
                    "language": "TR",
                    "text": "Bir çalışma alanı yüklemek için ekranın sol tarafındaki çalışma alanları (Workspaces) sekmesine tıklayın ve mevcut dosyalardan birini seçin.",
                    "updated": 1639747628768
                },
                {
                    "language": "EL",
                    "text": "Για να φορτώσετε έναν χώρο εργασίας, κάντε κλικ στην καρτέλα Χώροι Εργασίας στην αριστερή πλευρά της οθόνης και επιλέξτε ένα από τα διαθέσιμα αρχεία.",
                    "updated": 1641829880312
                }
            ]
        },
        {
            "style": "Success",
            "text": "To load a workspace you got from a third party, you may place the file in the My-Workspaces folder so that you may open it from the workspaces tab. You may also drag the file and drop it on the design space.",
            "updated": 1615892822939,
            "translations": [
                {
                    "language": "ES",
                    "text": "El workspace que obtenga de un tercero puede incluirlo en su carpeta de mis workspaces, para poderlos abrir desde el tabulador. También puedes sostener el archivo y soltarlo en el workspace",
                    "updated": 1633106859191,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Чтобы загрузить рабочее пространство, полученное от третьего лица, вы можете поместить файл в папку My-Workspaces, чтобы его можно было открывать на вкладке Worcspaces. Вы также можете перетащить файл в пространство проектирования.",
                    "updated": 1638344920643
                },
                {
                    "language": "DE",
                    "text": "Um einen Workspace zu laden, den Sie von einem \"Drittanbieter\" erhalten haben, können Sie die Datei im Ordner My-Workspaces ablegen, so dass Sie sie über die Registerkarte Workspaces öffnen können. Sie können die Datei auch in den Design Space ziehen und dort ablegen.",
                    "updated": 1639344555403
                },
                {
                    "language": "TR",
                    "text": "Üçüncü şahıslardan edindiğiniz bir çalışma alanını yüklemek için dosyayı Çalışma Alanlarım klasörüne yerleştirebilir ve çalışma alanları sekmesinden açabilirsiniz. Ayrıca dosyayı sürükleyip tasarım alanına bırakabilirsiniz.",
                    "updated": 1639747661767
                },
                {
                    "language": "EL",
                    "text": "Για να φορτώσετε έναν χώρο εργασίας που λάβατε από τρίτο μέρος, μπορείτε να τοποθετήσετε το αρχείο στο φάκελο My-Workspaces, ώστε να μπορείτε να το ανοίξετε από την καρτέλα Χώροι εργασίας. Μπορείτε επίσης να σύρετε το αρχείο και να το αποθέσετε στον χώρο σχεδίασης.",
                    "updated": 1641829891511
                }
            ]
        },
        {
            "style": "Warning",
            "text": "It is not recommended to launch multiple instances of the UI in separate browser tabs to load different workspaces at the same time. The system is not prepared to handle this type of use and it may behave erratically as a consequence.",
            "updated": 1629892156573,
            "translations": [
                {
                    "language": "RU",
                    "text": "Не рекомендуется запускать несколько экземпляров пользовательского интерфейса UI на отдельных вкладках браузера для одновременной загрузки разных рабочих пространств. Система не подготовлена ​​к такому типу использования и, как следствие, может работать нестабильно.",
                    "updated": 1638344959315
                },
                {
                    "language": "DE",
                    "text": "Es wird nicht empfohlen, mehrere Instanzen der Benutzeroberfläche(UI) in separaten Browser-Tabs zu starten, um verschiedene Workspaces gleichzeitig zu laden. Das System ist auf diese Art der Nutzung nicht vorbereitet und kann sich infolgedessen fehlerhaft verhalten.",
                    "updated": 1639344694210
                },
                {
                    "language": "TR",
                    "text": "Farklı çalışma alanlarını aynı anda yüklemek için farklı tarayıcı sekmelerinde birden çok UI örneğini başlatmanız önerilmez. Sistem bu tür bir kullanımı işlemeye hazır değildir ve sonuç olarak kararsız davranabilir.",
                    "updated": 1639747682544
                },
                {
                    "language": "EL",
                    "text": "Δεν συνιστάται η εκκίνηση πολλαπλών παρουσιών της διεπαφής χρήστη σε ξεχωριστές καρτέλες του προγράμματος περιήγησης για τη φόρτωση διαφορετικών χώρων εργασίας ταυτόχρονα. Το σύστημα δεν είναι προετοιμασμένο να χειριστεί αυτόν τον τύπο χρήσης και ως συνέπεια μπορεί να συμπεριφέρεται ακανόνιστα.",
                    "updated": 1641829921156
                }
            ]
        },
        {
            "style": "Title",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Saving Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Saving Workspaces   (Guardando espacios de trabajo)",
                    "updated": 1633107199561,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Сохранение Workspace",
                    "updated": 1638344990478
                },
                {
                    "language": "DE",
                    "text": "Workspaces speichern",
                    "updated": 1639344719336
                },
                {
                    "language": "TR",
                    "text": "Çalışma Alanlarının Kaydedilmesi",
                    "updated": 1639747716343
                },
                {
                    "language": "EL",
                    "text": "Saving Workspaces (Αποθήκευση Xώρων Eργασίας)",
                    "updated": 1641829933201
                }
            ]
        },
        {
            "style": "Text",
            "text": "Any workspace that is saved by the user is a User Workspace.",
            "updated": 1622634912210,
            "translations": [
                {
                    "language": "ES",
                    "text": "Todo workspace que sea grabado por un usuario es un user workspace.",
                    "updated": 1633106992641,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Любая рабочее пространство, сохраненная пользователем, является пользовательским рабочим пространством.",
                    "updated": 1638345038084
                },
                {
                    "language": "DE",
                    "text": "Jeder Workspace, der vom Benutzer gespeichert wird, ist ein User Workspace",
                    "updated": 1639344751205
                },
                {
                    "language": "TR",
                    "text": "Kullanıcı tarafından kaydedilen herhangi bir çalışma alanı, bir Kullanıcı Çalışma Alanıdır.",
                    "updated": 1639747701144
                },
                {
                    "language": "EL",
                    "text": "Κάθε χώρος εργασίας που αποθηκεύεται από τον χρήστη είναι ένας User Workspace (Χώρος Εργασίας Χρήστη).",
                    "updated": 1641829969120
                }
            ]
        },
        {
            "style": "Note",
            "text": "User workspaces feature a purple background in the workspaces tab.",
            "updated": 1624469335347,
            "translations": [
                {
                    "language": "ES",
                    "text": "Todo user workspace tiene fondo violeta en el menú de los workspaces a la izquierda.",
                    "updated": 1633107024679,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Пользовательские рабочие пространства имеют фиолетовый фон на вкладке рабочих пространств.",
                    "updated": 1638345054880
                },
                {
                    "language": "DE",
                    "text": "User workspaces haben einen violetten Hintergrund auf der Registerkarte Workspaces.",
                    "updated": 1639344782730
                },
                {
                    "language": "TR",
                    "text": "Kullanıcı çalışma alanları, çalışma alanları sekmesinde mor bir arka plana sahiptir.",
                    "updated": 1639747731565
                },
                {
                    "language": "EL",
                    "text": "Οι χώροι εργασίας χρήστη διαθέτουν μωβ φόντο στην καρτέλα χώρων εργασίας.",
                    "updated": 1641829982552
                }
            ]
        },
        {
            "style": "Text",
            "text": "Workspaces are saved as JSON files in the My-Workspaces folder.",
            "updated": 1615891202642,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los  workspaces son guardados como archivos JSON en la carpeta My-workspaces.",
                    "updated": 1633107047310,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Рабочие пространства сохраняются в виде файлов JSON в папке My-Workspaces.",
                    "updated": 1638345077867
                },
                {
                    "language": "DE",
                    "text": "Workspaces werden als JSON-Dateien im Ordner My-Workspaces gespeichert.",
                    "updated": 1639344889249
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanları, My-Workspaces klasörüne JSON dosyaları olarak kaydedilir.",
                    "updated": 1639748878847
                },
                {
                    "language": "EL",
                    "text": "Οι Workspaces (Χώροι Εργασίας) αποθηκεύονται ως αρχεία JSON στο φάκελο My-Workspaces.",
                    "updated": 1641829997794
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may save a workspace manually using the following hot-key combination:",
            "updated": 1629892197901,
            "translations": [
                {
                    "language": "ES",
                    "text": "Puede guardar un  workspace manualmente utilizando la siguiente combinación de teclas:",
                    "updated": 1633107089375,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Вы можете сохранить рабочее пространство вручную, используя следующую комбинацию горячих клавиш:",
                    "updated": 1638345094211
                },
                {
                    "language": "DE",
                    "text": "Sie können einen Workspace manuell mit der folgenden Tastenkombination speichern:",
                    "updated": 1639344930505
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki kısayol tuşu kombinasyonunu kullanarak bir çalışma alanını kaydedebilirsiniz:",
                    "updated": 1639748905406
                },
                {
                    "language": "EL",
                    "text": "Μπορείτε να αποθηκεύσετε χειροκίνητα έναν χώρο εργασίας χρησιμοποιώντας τον ακόλουθο συνδυασμό πλήκτρων συντόμευσης:",
                    "updated": 1641830020438
                }
            ]
        },
        {
            "style": "Text",
            "text": "Ctrl or Cmd + Shift + Alt + Key-S",
            "updated": 1631372841724
        },
        {
            "style": "Success",
            "text": "Backing up a workspace downloads the same file to your local Downloads folder. This is a good way to store sequential versions in case you ever need to go back to a previous state of affairs.",
            "updated": 1615892985307,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si hace un  backup de un  workspace se bajará el mismo archivo a su carpeta de Downloads. Este es un buen modo de almacenar versiones secuencialmente en caso de que alguna vez necesite regresar a una versión anterior.",
                    "updated": 1633107143583,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "При резервном копировании рабочего пространства этот же файл загружается в локальную папку Downloads. Это хороший способ сохранить последовательные версии на случай, если вам когда-нибудь понадобится вернуться к предыдущему состоянию дел.",
                    "updated": 1638345134303
                },
                {
                    "language": "TR",
                    "text": "Bir çalışma alanını yedeklemek, dosyayı yerel İndirilenler klasörünüze indirir. Bu, önceki bir duruma geri dönmeniz gerekmesi ihtimaline karşı sıralı sürümleri saklamanın iyi bir yoludur.",
                    "updated": 1639748938597
                },
                {
                    "language": "EL",
                    "text": "Η δημιουργία αντιγράφων ασφαλείας ενός χώρου εργασίας κατεβάζει το ίδιο αρχείο στον τοπικό σας φάκελο \"Λήψεις\". Αυτός είναι ένας καλός τρόπος αποθήκευσης διαδοχικών εκδόσεων σε περίπτωση που χρειαστεί να επιστρέψετε σε μια προηγούμενη κατάσταση πραγμάτων.",
                    "updated": 1641830034677
                }
            ]
        },
        {
            "style": "Title",
            "text": "Plugin Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Plugin Workspaces ( Conectando espacios de trabajo)",
                    "updated": 1633107189340,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Плагины Workspace",
                    "updated": 1638345161193
                },
                {
                    "language": "EL",
                    "text": "Plugin Workspaces (Χώροι Εργασίας Πρόσθετων)",
                    "updated": 1641830046311
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos ships with several Plugin Workspaces. These are pre-configured workspaces built for specific purposes, for example, to host tutorials, demo strategies, specific projects, and so on.",
            "updated": 1629893908384,
            "translations": [
                {
                    "language": "ES",
                    "text": "Superalgos incluye un abanico de plugin workspaces. Estos son workspaces pre-configurados montados para propósitos determinados, por ejemplo, para contener tutoriales, estrategias demo, proyectos específicos, y otros.",
                    "updated": 1633107236673,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Superalgos поставляется с несколькими рабочими пространствами плагинов Plugin Workspaces. Это предварительно настроенные рабочие пространства, созданные для определенных целей, например, для размещения учебных пособий, демонстрационных стратегий, конкретных проектов и т. д.",
                    "updated": 1638345229136
                },
                {
                    "language": "DE",
                    "text": "Superalgos wird mit mehreren Plugin-Workspaces ausgeliefert. Dies sind vorkonfigurierte Workspaces, die für bestimmte Zwecke erstellt wurden, z. B. um Tutorials, Demostrategien, bestimmte Projekte usw. zu hosten.",
                    "updated": 1639345052372
                },
                {
                    "language": "EL",
                    "text": "Το Superalgos έρχεται με πολλούς Plugin Workspaces (Χώρους Εργασίας Πρόσθετων). Αυτοί είναι προ διαμορφωμένοι χώροι εργασίας που έχουν δημιουργηθεί για συγκεκριμένους σκοπούς, για παράδειγμα, για τη φιλοξενία σεμιναρίων, στρατηγικών επίδειξης, συγκεκριμένων έργων και ούτω καθεξής.",
                    "updated": 1641830073316
                }
            ]
        },
        {
            "style": "Note",
            "text": "In the workspaces tab, plugin workspaces are marked with the words \"Plugin Workspace\", and feature a black background so that you may differentiate them from your own workspaces.",
            "updated": 1622634983432,
            "translations": [
                {
                    "language": "ES",
                    "text": "En el tabulador de workspaces, los plugin workspaces estan mencionados así sobre un fondo negro que los diferencia de tus propios workspaces.",
                    "updated": 1633107278282,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "На вкладке \"Workspaces\" отмечены словами «Plugin Workspaces» и имеют черный фон, чтобы вы могли отличить их от ваших собственных рабочих пространств.",
                    "updated": 1638345341385
                },
                {
                    "language": "DE",
                    "text": "Auf der Registerkarte \"Workspaces\" sind Plugin Workspaces mit den Worten \"Plugin Workspace\" gekennzeichnet und haben einen schwarzen Hintergrund, damit Sie sie von Ihren eigenen Workspaces unterscheiden können.",
                    "updated": 1639345123503
                },
                {
                    "language": "EL",
                    "text": "Στην καρτέλα Χώροι εργασίας, οι χώροι εργασίας των πρόσθετων επισημαίνονται με τις λέξεις \"χώρος εργασίας προσθήκης\" και διαθέτουν μαύρο φόντο, ώστε να μπορείτε να τους διαφοροποιήσετε από τους δικούς σας χώρους εργασίας.",
                    "updated": 1641830085955
                }
            ]
        },
        {
            "style": "Important",
            "text": "When you load, modify, and save a Plugin Workspace, the actual plugin file remains intact, that is, the plugin is not modified. Instead, a new file is created in the My-Workspaces folder. This file is a copy of the plugin workspace featuring the modifications you introduced. The copy is saved with the name of the Workspace node, which is usually the same name as the plugin. To save the workspace with a different name, you must change the name of the Workspace node and save.",
            "updated": 1629894244406,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando sube, modifica y guarda un plugin workspace, el plugin permanece intacto, esto significa que el plugin no se modifica sino que un nuevo archivo se crea en tu carpeta de My-workspaces. Este archivo es una copia del plugin con las modificaciones que ha introducido. La copia está guardada con el nombre del nodo de workspace, que normalmente es el mismo nombre del plugin. Para grabarlo con un nombre diferente debe cambiar el título del nodo y guardarlo",
                    "updated": 1633107369531,
                    "style": "Important"
                },
                {
                    "language": "RU",
                    "text": "Когда вы загружаете, изменяете и сохраняете Plugin Workspace, фактический файл плагина остается нетронутым, то есть плагин не изменяется. Вместо этого в папке «My-Workspaces» создается новый файл. Этот файл является копией рабочего пространства плагина с внесенными вами изменениями. Копия сохраняется с именем узла Workspace, имя обычно совпадает с названием плагина. Чтобы сохранить рабочее пространство под другим именем, необходимо изменить имя узла рабочего пространства и сохранить.",
                    "updated": 1638345532766
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie einen Plugin Workspace laden, ändern und speichern, bleibt die eigentliche Plugin-Datei intakt, d. h. das Plugin wird nicht geändert. Stattdessen wird eine neue Datei im Ordner My-Workspaces erstellt. Diese Datei ist eine Kopie des Plugin-Arbeitsbereichs mit den von Ihnen vorgenommenen Änderungen. Die Kopie wird unter dem Namen der Node  Workspace gespeichert, der in der Regel derselbe ist wie der Name des Plugins. Um den Workspace unter einem anderen Namen zu speichern, müssen Sie den Namen der Workspace Node ändern und speichern.",
                    "updated": 1639345443024
                },
                {
                    "language": "EL",
                    "text": "Όταν φορτώνετε, τροποποιείτε και αποθηκεύετε έναν Plugin Workspace (Χώρο Εργασίας Πρόσθετων), το πραγματικό αρχείο του πρόσθετου παραμένει άθικτο, δηλαδή, το πρόσθετο δεν τροποποιείται. Αντίθετα, δημιουργείται ένα νέο αρχείο στο φάκελο My-Workspaces. Αυτό το αρχείο είναι ένα αντίγραφο του χώρου εργασίας του πρόσθετου που περιλαμβάνει τις τροποποιήσεις που εισαγάγατε. Το αντίγραφο αποθηκεύεται με το όνομα του κόμβου Χώρου Εργασίας, το οποίο είναι συνήθως το ίδιο όνομα με το πρόσθετο. Για να αποθηκεύσετε το χώρο εργασίας με διαφορετικό όνομα, πρέπει να αλλάξετε το όνομα του κόμβου του χώρου εργασίας και να το αποθηκεύσετε.",
                    "updated": 1641830110805
                }
            ]
        },
        {
            "style": "Title",
            "text": "Creating Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Creating Workspaces    (Creando workspaces)",
                    "updated": 1633107483723,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Создание Workspace",
                    "updated": 1638345553252
                },
                {
                    "language": "DE",
                    "text": "Workspaces erstellen:",
                    "updated": 1639346933048
                },
                {
                    "language": "EL",
                    "text": "Creating Workspaces (Δημιουργία Χώρων Εργασίας)",
                    "updated": 1641830128218
                }
            ]
        },
        {
            "style": "Text",
            "text": "To create a new workspace, rename any of the existing workspaces by changing the label of the workspace node, and save it as explained above. After you change the label and once the workspace is saved (by any of the usual means), a new file is stored in the My-Workspaces folder.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы создать новое рабочее пространство, переименуйте любое из существующих рабочих пространств, изменив метку узла рабочего пространства, и сохраните его, как описано выше. После изменения метки и сохранения рабочего пространства (любым из обычных способов) новый файл сохраняется в папке My-Workspaces.",
                    "updated": 1638345612276
                },
                {
                    "language": "DE",
                    "text": "Um einen neuen Workspace zu erstellen, benennen Sie einen der vorhandenen Workspaces um, indem Sie die Bezeichnung der Workspace Node ändern, und speichern Sie ihn wie oben beschrieben. Nach dem Ändern der Bezeichnung und dem Speichern des Workspaces (auf einem der üblichen Wege) wird eine neue Datei im Ordner My-Workspaces gespeichert.",
                    "updated": 1639347021732
                },
                {
                    "language": "EL",
                    "text": "Για να δημιουργήσετε έναν νέο χώρο εργασίας, μετονομάστε οποιονδήποτε από τους υπάρχοντες χώρους εργασίας αλλάζοντας την ετικέτα του κόμβου χώρου εργασίας και αποθηκεύστε τον όπως εξηγήθηκε παραπάνω. Αφού αλλάξετε την ετικέτα και αφού αποθηκευτεί ο χώρος εργασίας (με οποιοδήποτε από τα συνήθη μέσα), αποθηκεύεται ένα νέο αρχείο στο φάκελο My-Workspaces.",
                    "updated": 1641830146595
                }
            ]
        },
        {
            "style": "Success",
            "text": "The Blank Template Plugin Workspace is the best to start with if you wish to create your own setup.",
            "updated": 1629894382983,
            "translations": [
                {
                    "language": "RU",
                    "text": "Для начала лучше всего использовать шаблон Blank Template Plugin Workspace, если вы хотите создать свою собственную настройку.",
                    "updated": 1638345758533
                },
                {
                    "language": "DE",
                    "text": "Der Blank Template Plugin Workspace eignet sich am besten für den Anfang, wenn Sie Ihr eigenes Setup erstellen möchten.",
                    "updated": 1639347042936
                },
                {
                    "language": "EL",
                    "text": "Το Πρόσθετο Κενό Πρότυπο Χώρου Εργασίας είναι το καλύτερο για να ξεκινήσετε εάν θέλετε να δημιουργήσετε τη δική σας σύνθεση.",
                    "updated": 1641830213361
                }
            ]
        },
        {
            "style": "Title",
            "text": "Deleting Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Deleting Workspaces      ( Borrando workspaces)",
                    "updated": 1633107676804,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Удаление Workspace",
                    "updated": 1638345770499
                },
                {
                    "language": "DE",
                    "text": "Workspaces löschen",
                    "updated": 1639347055020
                },
                {
                    "language": "EL",
                    "text": "Deleting Workspaces (Διαγραφή Χώρων Εργασίας)",
                    "updated": 1641830201923
                }
            ]
        },
        {
            "style": "Text",
            "text": "To delete a workspace, delete the corresponding workspace file from within the file system application of your operating system.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Para borrar un Workspace, borre el correspondiente archivo del Workspace dentro de la aplicación del sistema de archivos de su sistema operativo.",
                    "updated": 1633107728584,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Чтобы удалить рабочее пространство, удалите соответствующий файл рабочего пространства из приложения файловой системы вашей операционной системы.",
                    "updated": 1638345786254
                },
                {
                    "language": "DE",
                    "text": "Um einen Workspace zu löschen, löschen Sie die entsprechende workspace datei in der Dateisystemanwendung(Datei verwaltung/File system) Ihres Betriebssystems.",
                    "updated": 1639347139221
                },
                {
                    "language": "EL",
                    "text": "Για να διαγράψετε έναν χώρο εργασίας, διαγράψτε το αντίστοιχο αρχείο χώρου εργασίας μέσα από την εφαρμογή συστήματος αρχείων του λειτουργικού σας συστήματος.",
                    "updated": 1641830192466
                }
            ]
        }
    ],
    "definition": {
        "text": "A workspace is an entity storing all system and user-generated information, excluding the state and contents of plugins. In technical terms, a workspace is a JSON file.",
        "updated": 1610620463347,
        "translations": [
            {
                "language": "ES",
                "text": "Un Workspace  (espacio de trabajo) es una entidad que almacena toda la información generada por el usuario y el sistema, excluyendo el estado y el contenido de los complementos. En términos técnicos, un espacio de trabajo es un archivo JSON.",
                "updated": 1633089108346,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Workspace - это объект, хранящий всю системную и пользовательскую информацию, за исключением состояния и содержимого плагинов. С технической точки зрения рабочее пространство - это файл JSON.",
                "updated": 1638344554135
            },
            {
                "language": "DE",
                "text": "Ein Workspace (=Arbeitsbereich) ist eine Entität, in der alle System- und benutzergenerierten Informationen gespeichert werden, mit Ausnahme des Status und der Inhalte von Plugins. Technisch gesehen ist ein Arbeitsbereich eine JSON-Datei.",
                "updated": 1639344118881
            },
            {
                "language": "TR",
                "text": "Çalışma alanı, eklentilerin durumu ve içeriği hariç, sistem ve kullanıcı tarafından oluşturulan bilgileri depolayan bir alandır. Teknik açıdan, çalışma alanı bir JSON dosyasıdır.",
                "updated": 1639233230804
            },
            {
                "language": "EL",
                "text": "Ο χώρος εργασίας είναι μια οντότητα που αποθηκεύει όλες τις πληροφορίες που δημιουργούνται από το σύστημα και τους χρήστες, εξαιρουμένης της κατάστασης και των περιεχομένων των προσθηκών. Από τεχνική άποψη, ένας χώρος εργασίας είναι ένα αρχείο JSON.",
                "updated": 1641829753699
            }
        ]
    }
}