{
    "type": "Workspace",
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1610620673078
        },
        {
            "style": "Text",
            "text": "A workspace stores information about:",
            "translations": [
                {
                    "language": "RU",
                    "text": "В рабочей области хранится информация:",
                    "updated": 1638344605651
                }
            ]
        },
        {
            "style": "List",
            "text": "Any hierarchy that is not included as a plugin.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Toda hierarchy (jerarquía) que no esté incluida como plugin (enchufe).",
                    "updated": 1633089492790,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Любая иерархия, не включенная в качестве плагина.",
                    "updated": 1638344601117
                }
            ]
        },
        {
            "style": "List",
            "text": "Nodes that may be floating around, detached from hierarchies.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Nodos que puedan estar flotando por ahí, desconectados de jerarquías",
                    "updated": 1633089543104,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Узлы, которые могут находиться в плавающем состоянии, отделены от иерархий.",
                    "updated": 1638344663875
                }
            ]
        },
        {
            "style": "List",
            "text": "Information regarding the physical position and state of all nodes within the design space, even those detached from hierarchies.",
            "updated": 1615891174248,
            "translations": [
                {
                    "language": "ES",
                    "text": "nformación relacionada a la posición física y al estado de todos los nodos dentro del espacio de diseño, incluyendo aquellos nodos sueltos.",
                    "updated": 1633089604851,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Информация о физическом положении и состоянии всех узлов в пространстве дизайна Design Space, даже тех, которые отделены от иерархий.",
                    "updated": 1638344705517
                }
            ]
        },
        {
            "style": "Text",
            "text": "A workspace is not part of any of the hierarchies; instead, it contains them.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Un workspace no es parte de ninguna jerarquía, por el contrario, las contiene.",
                    "updated": 1633089633238,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Рабочее пространство не является частью какой-либо иерархии; вместо этого он их содержит.",
                    "updated": 1638344728568
                }
            ]
        },
        {
            "style": "Title",
            "text": "Loading Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Loading Workspaces  (Subiendo espacios de trabajo)",
                    "updated": 1633089674625,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Загрузка Workspace",
                    "updated": 1638344760638
                }
            ]
        },
        {
            "style": "Text",
            "text": "Users may manage multiple workspaces, but only one workspace may be loaded in the system at any point.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Los usuarios pueden trabajar en muchos workspaces al mismo tiempo, pero uno solo debe ser subido al sistema en cualquier  momento.",
                    "updated": 1633089722388,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Пользователи могут управлять несколькими рабочими пространствами, но в любой момент в систему может быть загружено только одно рабочее пространство.",
                    "updated": 1638344784954
                }
            ]
        },
        {
            "style": "Text",
            "text": "To load a workspace, click the workspaces tab on the left-hand side of the screen and select one of the available files.",
            "updated": 1624469374859,
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы загрузить рабочее пространство, щелкните вкладку Workspaces в левой части экрана и выберите один из доступных файлов.",
                    "updated": 1638344838274
                }
            ]
        },
        {
            "style": "Success",
            "text": "To load a workspace you got from a third party, you may place the file in the My-Workspaces folder so that you may open it from the workspaces tab. You may also drag the file and drop it on the design space.",
            "updated": 1615892822939,
            "translations": [
                {
                    "language": "ES",
                    "text": "El workspace que obtenga de un tercero puede incluirlo en su carpeta de mis workspaces, para poderlos abrir desde el tabulador. También puedes sostener el archivo y soltarlo en el workspace",
                    "updated": 1633106859191,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Чтобы загрузить рабочее пространство, полученное от третьего лица, вы можете поместить файл в папку My-Workspaces, чтобы его можно было открывать на вкладке Worcspaces. Вы также можете перетащить файл в область дизайна.",
                    "updated": 1638344920643
                }
            ]
        },
        {
            "style": "Warning",
            "text": "It is not recommended to launch multiple instances of the UI in separate browser tabs to load different workspaces at the same time. The system is not prepared to handle this type of use and it may behave erratically as a consequence.",
            "updated": 1629892156573,
            "translations": [
                {
                    "language": "RU",
                    "text": "Не рекомендуется запускать несколько экземпляров пользовательского интерфейса UI на отдельных вкладках браузера для одновременной загрузки разных рабочих пространств. Система не подготовлена ​​к такому типу использования и, как следствие, может работать нестабильно.",
                    "updated": 1638344959315
                }
            ]
        },
        {
            "style": "Title",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Saving Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Saving Workspaces   (Guardando espacios de trabajo)",
                    "updated": 1633107199561,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Сохранение Workspace",
                    "updated": 1638344990478
                }
            ]
        },
        {
            "style": "Text",
            "text": "Any workspace that is saved by the user is a User Workspace.",
            "updated": 1622634912210,
            "translations": [
                {
                    "language": "ES",
                    "text": "Todo workspace que sea grabado por un usuario es un user workspace.",
                    "updated": 1633106992641,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Любая рабочая область, сохраненная пользователем, является пользовательской рабочей областью.",
                    "updated": 1638345038084
                }
            ]
        },
        {
            "style": "Note",
            "text": "User workspaces feature a purple background in the workspaces tab.",
            "updated": 1624469335347,
            "translations": [
                {
                    "language": "ES",
                    "text": "Todo user workspace tiene fondo violeta en el menú de los workspaces a la izquierda.",
                    "updated": 1633107024679,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Пользовательские рабочие области имеют фиолетовый фон на вкладке рабочих пространств.",
                    "updated": 1638345054880
                }
            ]
        },
        {
            "style": "Text",
            "text": "Workspaces are saved as JSON files in the My-Workspaces folder.",
            "updated": 1615891202642,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los  workspaces son guardados como archivos JSON en la carpeta My-workspaces.",
                    "updated": 1633107047310,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Рабочие области сохраняются в виде файлов JSON в папке My-Workspaces.",
                    "updated": 1638345077867
                }
            ]
        },
        {
            "style": "Text",
            "text": "You may save a workspace manually using the following hot-key combination:",
            "updated": 1629892197901,
            "translations": [
                {
                    "language": "ES",
                    "text": "Puede guardar un  workspace manualmente utilizando la siguiente combinación de teclas:",
                    "updated": 1633107089375,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Вы можете сохранить рабочее пространство вручную, используя следующую комбинацию горячих клавиш:",
                    "updated": 1638345094211
                }
            ]
        },
        {
            "style": "Text",
            "text": "Ctrl or Cmd + Shift + Alt + Key-S",
            "updated": 1631372841724
        },
        {
            "style": "Success",
            "text": "Backing up a workspace downloads the same file to your local Downloads folder. This is a good way to store sequential versions in case you ever need to go back to a previous state of affairs.",
            "updated": 1615892985307,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si hace un  backup de un  workspace se bajará el mismo archivo a su carpeta de Downloads. Este es un buen modo de almacenar versiones secuencialmente en caso de que alguna vez necesite regresar a una versión anterior.",
                    "updated": 1633107143583,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "При резервном копировании рабочей области этот же файл загружается в локальную папку Downloads. Это хороший способ сохранить последовательные версии на случай, если вам когда-нибудь понадобится вернуться к предыдущему состоянию дел.",
                    "updated": 1638345134303
                }
            ]
        },
        {
            "style": "Title",
            "text": "Plugin Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Plugin Workspaces ( Conectando espacios de trabajo)",
                    "updated": 1633107189340,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Плагины Workspace",
                    "updated": 1638345161193
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos ships with several Plugin Workspaces. These are pre-configured workspaces built for specific purposes, for example, to host tutorials, demo strategies, specific projects, and so on.",
            "updated": 1629893908384,
            "translations": [
                {
                    "language": "ES",
                    "text": "Superalgos incluye un abanico de plugin workspaces. Estos son workspaces pre-configurados montados para propósitos determinados, por ejemplo, para contener tutoriales, estrategias demo, proyectos específicos, y otros.",
                    "updated": 1633107236673,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Superalgos поставляется с несколькими рабочими областями плагинов Plugin Workspaces. Это предварительно настроенные рабочие пространства, созданные для определенных целей, например, для размещения учебных пособий, демонстрационных стратегий, конкретных проектов и т. д.",
                    "updated": 1638345229136
                }
            ]
        },
        {
            "style": "Note",
            "text": "In the workspaces tab, plugin workspaces are marked with the words \"Plugin Workspace\", and feature a black background so that you may differentiate them from your own workspaces.",
            "updated": 1622634983432,
            "translations": [
                {
                    "language": "ES",
                    "text": "En el tabulador de workspaces, los plugin workspaces estan mencionados así sobre un fondo negro que los diferencia de tus propios workspaces.",
                    "updated": 1633107278282,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "На вкладке \"Workspaces\" отмечены словами «Plugin Workspaces» и имеют черный фон, чтобы вы могли отличить их от ваших собственных рабочих пространств.",
                    "updated": 1638345341385
                }
            ]
        },
        {
            "style": "Important",
            "text": "When you load, modify, and save a Plugin Workspace, the actual plugin file remains intact, that is, the plugin is not modified. Instead, a new file is created in the My-Workspaces folder. This file is a copy of the plugin workspace featuring the modifications you introduced. The copy is saved with the name of the Workspace node, which is usually the same name as the plugin. To save the workspace with a different name, you must change the name of the Workspace node and save.",
            "updated": 1629894244406,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando sube, modifica y guarda un plugin workspace, el plugin permanece intacto, esto significa que el plugin no se modifica sino que un nuevo archivo se crea en tu carpeta de My-workspaces. Este archivo es una copia del plugin con las modificaciones que ha introducido. La copia está guardada con el nombre del nodo de workspace, que normalmente es el mismo nombre del plugin. Para grabarlo con un nombre diferente debe cambiar el título del nodo y guardarlo",
                    "updated": 1633107369531,
                    "style": "Important"
                },
                {
                    "language": "RU",
                    "text": "Когда вы загружаете, изменяете и сохраняете Plugin Workspace, фактический файл плагина остается нетронутым, то есть плагин не изменяется. Вместо этого в папке «My-Workspaces» создается новый файл. Этот файл является копией рабочей области плагина с внесенными вами изменениями. Копия сохраняется с именем узла Workspace, имя обычно совпадает с названием плагина. Чтобы сохранить рабочую область под другим именем, необходимо изменить имя узла рабочей области и сохранить.",
                    "updated": 1638345532766
                }
            ]
        },
        {
            "style": "Title",
            "text": "Creating Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Creating Workspaces    (Creando workspaces)",
                    "updated": 1633107483723,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Создание Workspace",
                    "updated": 1638345553252
                }
            ]
        },
        {
            "style": "Text",
            "text": "To create a new workspace, rename any of the existing workspaces by changing the label of the workspace node, and save it as explained above. After you change the label and once the workspace is saved (by any of the usual means), a new file is stored in the My-Workspaces folder.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы создать новое рабочее пространство, переименуйте любое из существующих рабочих пространств, изменив метку узла рабочего пространства, и сохраните его, как описано выше. После изменения метки и сохранения рабочего пространства (любым из обычных способов) новый файл сохраняется в папке My-Workspaces.",
                    "updated": 1638345612276
                }
            ]
        },
        {
            "style": "Success",
            "text": "The Blank Template Plugin Workspace is the best to start with if you wish to create your own setup.",
            "updated": 1629894382983,
            "translations": [
                {
                    "language": "RU",
                    "text": "Для начала лучше всего использовать шаблон Blank Template Plugin Workspace, если вы хотите создать свою собственную настройку.",
                    "updated": 1638345758533
                }
            ]
        },
        {
            "style": "Title",
            "text": "Deleting Workspaces",
            "translations": [
                {
                    "language": "ES",
                    "text": "Deleting Workspaces      ( Borrando workspaces)",
                    "updated": 1633107676804,
                    "style": "Title"
                },
                {
                    "language": "RU",
                    "text": "Удаление Workspace",
                    "updated": 1638345770499
                }
            ]
        },
        {
            "style": "Text",
            "text": "To delete a workspace, delete the corresponding workspace file from within the file system application of your operating system.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Para borrar un Workspace, borre el correspondiente archivo del Workspace dentro de la aplicación del sistema de archivos de su sistema operativo.",
                    "updated": 1633107728584,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Чтобы удалить рабочее пространство, удалите соответствующий файл рабочего пространства из приложения файловой системы вашей операционной системы.",
                    "updated": 1638345786254
                }
            ]
        }
    ],
    "definition": {
        "text": "A workspace is an entity storing all system and user-generated information, excluding the state and contents of plugins. In technical terms, a workspace is a JSON file.",
        "updated": 1610620463347,
        "translations": [
            {
                "language": "ES",
                "text": "Un Workspace  (espacio de trabajo) es una entidad que almacena toda la información generada por el usuario y el sistema, excluyendo el estado y el contenido de los complementos. En términos técnicos, un espacio de trabajo es un archivo JSON.",
                "updated": 1633089108346,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Workspace - это объект, хранящий всю системную и пользовательскую информацию, за исключением состояния и содержимого плагинов. С технической точки зрения рабочее пространство - это файл JSON.",
                "updated": 1638344554135
            }
        ]
    }
}