{
    "type": "WASM Backend",
    "definition": {
        "text": "TensorFlow.js provides a WebAssembly backend (wasm), which offers CPU acceleration and can be used as an alternative to the vanilla JavaScript CPU (cpu) and WebGL accelerated (webgl) backends.",
        "updated": 1613058813729,
        "translations": [
            {
                "language": "RU",
                "text": "TensorFlow.js предоставляет бэкенд WebAssembly (wasm), который обеспечивает ускорение процессора и может использоваться в качестве альтернативы ванильным бэкендам JavaScript CPU (cpu) и WebGL с ускорением (webgl).",
                "updated": 1645252733508
            },
            {
                "language": "TR",
                "text": "TensorFlow.js, CPU hızlandırması sunan ve vanilla JavaScript CPU (cpu) ve WebGL hızlandırılmış (webgl) arka uçlarına alternatif olarak kullanılabilen bir WebAssembly arka ucu (wasm) sağlar.",
                "updated": 1666694039665
            },
            {
                "language": "DE",
                "text": "TensorFlow.js bietet ein WebAssembly-Backend (wasm), das CPU-Beschleunigung bietet und als Alternative zu den Vanilla-JavaScript-CPU- (cpu) und WebGL-beschleunigten (webgl) Backends verwendet werden kann.",
                "updated": 1705145290806
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645252738365
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1666693982787
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1705145299030
                }
            ]
        }
    ]
}