{
    "type": "API Map Reference",
    "definition": {
        "text": "This node allows users to define a reference to an API Map. When the bot is run, it will use the referenced API Map to extract data from the API.",
        "updated": 1622896481536,
        "translations": [
            {
                "language": "RU",
                "text": "Этот узел позволяет пользователям определять ссылку на API Map. Когда бот запущен, он будет использовать указанную API Map для извлечения данных из API.",
                "updated": 1638627316773
            },
            {
                "language": "DE",
                "text": "Mit dieser Node können Benutzer einen Verweis(reference) auf eine API Map definieren. Wenn der Bot ausgeführt wird, verwendet er die referenzierte API Map, um Daten aus der API zu extrahieren.",
                "updated": 1639495580426
            },
            {
                "language": "TR",
                "text": "Bu düğüm, kullanıcıların bir API Haritasına referans tanımlamasına olanak tanır. Bot çalıştırıldığında, API'den veri almak için başvurulan API Haritasını kullanacaktır.",
                "updated": 1654391262784
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Important",
            "text": "For this node to be correctly installed and a reference established to the API Data Mine using the Install New Market procedure, both the Data Mine and the API Data Map needs to have exactly the same config property codeName, otherwise, this node will be created but you will have to establish the reference manually.",
            "updated": 1622896540326,
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы этот узел был правильно установлен и была установлена ​​ссылка на API Data Mine с помощью процедуры Install New Market, Data Mine и API Data Map должны иметь точно такое же свойство конфигурации codeName, в противном случае этот узел будет создан, но вам придется установить ссылку вручную.",
                    "updated": 1638627386496
                },
                {
                    "language": "DE",
                    "text": "Damit diese Node korrekt installiert und ein Verweis auf die API Data Mine mit der Prozedur \"Install New Market\" hergestellt werden kann, müssen sowohl die Data Mine als auch die API Data Map genau die gleiche config property codeName (Konfigurationseigenschaft Code Name) haben. Andernfalls wird diese Node zwar erstellt, aber Sie müssen den Verweis manuell herstellen.",
                    "updated": 1639495749093
                },
                {
                    "language": "TR",
                    "text": "Bu düğümün doğru bir şekilde kurulması ve Yeni Market Yükle prosedürü kullanılarak API Veri Madeni'ne bir referans oluşturulması için, hem Veri Madeni hem de API Veri Haritası'nın tam olarak aynı yapılandırma özelliği codeName'e sahip olması gerekir, aksi takdirde bu düğüm oluşturulur ancak referansı manuel olarak oluşturmanız gerekir.",
                    "updated": 1654391269074,
                    "style": "Important"
                }
            ]
        },
        {
            "style": "Text",
            "text": "For a more indepth description of what an API Map is please see the API Map page.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Более подробное описание того, что такое API Map, смотрите на странице API Map.",
                    "updated": 1638627614020
                },
                {
                    "language": "DE",
                    "text": "Eine ausführlichere Beschreibung der API Map finden Sie auf der Seite API Map.",
                    "updated": 1639495776478
                },
                {
                    "language": "TR",
                    "text": "API Haritasının ne olduğuna dair daha derin bir açıklama için lütfen API Haritası sayfasına bakın.",
                    "updated": 1654391275140,
                    "style": "Text"
                }
            ]
        }
    ]
}