{
    "tutorial": "Developers Intro",
    "pageNumber": 21,
    "type": "Tutorial Topic - Parting Thoughts...",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": ""
        },
        "text": "As you can see, Superalgos is  much more than a trading bot. It's a holistic infrastructure to manage complexity in the easiest way possible for users.",
        "translations": [
            {
                "language": "RU",
                "text": "Как видите, Superalgos - это гораздо больше, чем просто торговый бот. Это целостная инфраструктура для управления сложностями самым простым для пользователей способом.",
                "updated": 1640932109754
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This introduction covered the highest level topics of the system in the hope it may help you understand the foundations on which the system is being built.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Это введение охватывает темы самого высокого уровня в надежде, что оно поможет вам понять основы, на которых строится система.",
                    "updated": 1640932129152
                }
            ]
        },
        {
            "style": "Callout",
            "text": "We hope you agree it's a good idea to reuse this infrastructure to build trading intelligence rather than code a trading bot from scratch. We hope more devs will join us",
            "translations": [
                {
                    "language": "RU",
                    "text": "Мы надеемся, что вы согласны с тем, что это хорошая идея - использовать эту инфраструктуру для создания торгового интеллекта, а не создавать торгового бота с нуля. Мы надеемся, что к нам присоединится больше разработчиков",
                    "updated": 1640932145724
                }
            ]
        },
        {
            "style": "Success",
            "text": "If you like the project, there are many ways to contribute. Take a look at this page featuring the roadmap to becoming a part of the team.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вам нравится проект, есть много способов внести свой вклад. Взгляните на эту страницу, где представлена дорожная карта для того, чтобы стать частью команды.",
                    "updated": 1640932177605
                }
            ]
        }
    ]
}