{
    "tutorial": "Developers Intro",
    "pageNumber": 4,
    "type": "Tutorial Topic - Client",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": ""
        },
        "text": "Is a collection of servers running on a single Node.js process.",
        "translations": [
            {
                "language": "DE",
                "text": "Ist eine Sammlung von Servern, die auf einem einzigen Node.js-Prozess laufen.",
                "updated": 1641729279193
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The servers are:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Server sind:",
                    "updated": 1641729286974
                }
            ]
        },
        {
            "style": "List",
            "text": "Web Server: Serves all the JS files that form the User Interface to the browser.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Web Server: Liefert alle JS-Dateien, die die Benutzeroberfläche bilden, an den Browser.",
                    "updated": 1641729295065
                }
            ]
        },
        {
            "style": "List",
            "text": "Web Sockets Server: Enables the UI to reach the Client via WS.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Web Sockets Server: Ermöglicht es der Benutzeroberfläche, den Client über WS zu erreichen.",
                    "updated": 1641729303749
                }
            ]
        },
        {
            "style": "List",
            "text": "Events Server: Enables the UI to communicate with the Task Manager Server and all of the Task Servers process instances via events over WS.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Events Server: Ermöglicht der Benutzeroberfläche die Kommunikation mit dem Task-Manager-Server und allen Prozessinstanzen des Task-Servers über Ereignisse über WS.",
                    "updated": 1641729315949
                }
            ]
        },
        {
            "style": "List",
            "text": "Task Manager Server: Manges Task Servers processes based on users commands.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Task Manager Server: Ändert die Prozesse des Task-Servers auf der Grundlage von Benutzerbefehlen.",
                    "updated": 1641729323973
                }
            ]
        },
        {
            "style": "Note",
            "text": "All of these servers are custom built&mdash;in-house&mdash;for Superalgos. We prefer to build on top of rock-solid, widely-used, low-level libraries only, like WS, for instance.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Alle diese Server wurden speziell für Superalgos entwickelt. Wir ziehen es vor, nur auf grundsoliden, weit verbreiteten Low-Level-Bibliotheken aufzubauen, wie z.B. WS.",
                    "updated": 1641729330917
                }
            ]
        }
    ]
}