{
    "tutorial": "Developers Intro",
    "pageNumber": 18,
    "type": "Tutorial Step - Tutorial Space",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": ""
        },
        "text": "Enables running tutorials. It is not based on the HTML canvas, but on HTML + CSS.",
        "translations": [
            {
                "language": "DE",
                "text": "Ermöglicht die Durchführung von Tutorials. Er basiert nicht auf dem HTML-Canvas, sondern auf HTML + CSS.",
                "updated": 1641736573750
        },
        {                "language": "RU",
                "text": "Позволяет запускать учебные пособия. Он основан не на HTML canvas, а на HTML + CSS.",
                "updated": 1640931706945
            },
            {
                "language": "TR",
                "text": "Özet: Eğiticilerin çalıştırılmasını sağlar. HTML tuvalini değil, HTML + CSS'yi temel alır.",
                "updated": 1643203358071
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Tutorial Space is the highest top-tier layer of all the system since its rendered above everything else. It can manipulate other spaces based on the configuration of each tutorial topic and step.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Tutorial-Bereich ist die oberste Ebene des gesamten Systems, da er über allem anderen gerendert wird. Er kann andere Bereiche auf der Grundlage der Konfiguration der einzelnen Tutorial-Themen und -Schritte manipulieren.",
                    "updated": 1641736580652
        },
        {                    "language": "RU",
                    "text": "Tutorial Space - это самый верхний уровень всей системы, поскольку оно отображается выше всего остального. Оно может манипулировать другими пространствами на основе конфигурации каждой темы и шага обучения.",
                    "updated": 1640931783169
                },
                {
                    "language": "TR",
                    "text": "Eğitim Alanı ( Tutorial Space ) , her şeyin üzerinde oluşturulduğundan beri tüm sistemin en üst düzey katmanıdır. Her öğretici konu ve adımın yapılandırmasına göre diğer alanları değiştirebilir.",
                    "updated": 1643203410540
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Not only may tutorials move the user around the UI, but may also take most actions users themselves may take, like, for instance, running tasks of any kind.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Tutorials können den Benutzer nicht nur auf der Benutzeroberfläche bewegen, sondern auch die meisten Aktionen ausführen, die der Benutzer selbst durchführen kann, wie z. B. das Ausführen von Aufgaben jeglicher Art.",
                    "updated": 1641736590095
        },
        {                    "language": "RU",
                    "text": "Учебники могут не только перемещать пользователя по пользовательскому интерфейсу, но и выполнять большинство действий, которые могут выполнять сами пользователи, например, запускать задачи любого рода.",
                    "updated": 1640931801687
                },
                {
                    "language": "TR",
                    "text": "Öğreticiler yalnızca kullanıcıyı kullanıcı arayüzünde ( UI ) hareket ettirmekle kalmaz, aynı zamanda, örneğin herhangi bir türdeki görevleri çalıştırmak gibi, kullanıcıların kendilerinin gerçekleştirebilecekleri çoğu eylemi de gerçekleştirebilir.",
                    "updated": 1643203456751
                }
            ]
        },
        {
            "style": "Note",
            "text": "The Tutorial Space is a new addition to the system. For that reason, few tutorials exist today, but we expect this to change in the future.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Tutorial-Bereich ist eine neue Ergänzung des Systems. Aus diesem Grund gibt es heute nur wenige Tutorials, aber wir erwarten, dass sich dies in Zukunft ändern wird.",
                    "updated": 1641736596282
        },
        {                    "language": "RU",
                    "text": "Пространство учебников (Tutorial Space) - это новое дополнение к системе. По этой причине на сегодняшний день существует мало учебных пособий, но мы ожидаем, что в будущем ситуация изменится.",
                    "updated": 1640931833127
                },
                {
                    "language": "TR",
                    "text": "Not: Eğitim Alanı sisteme yeni bir eklemedir. Bu nedenle, bugün birkaç öğretici ( Tutorial ) var, ancak bunun gelecekte değişmesini bekliyoruz.",
                    "updated": 1643203523090
                }
            ]
        }
    ]
}