{
    "tutorial": "Developers Intro",
    "pageNumber": 14,
    "type": "Tutorial Step - Design Space",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": ""
        },
        "text": "Manages the core concept of nodes which, when attached to one another, may form vast definitions easily made and maintained by users.",
        "translations": [
            {
                "language": "DE",
                "text": "Verwaltet das Kernkonzept der Knoten, die, wenn sie miteinander verbunden werden, umfangreiche Definitionen bilden können, die von den Benutzern leicht erstellt und gepflegt werden können.",
                "updated": 1641735783104
            },
            {
                "language": "RU",
                "text": "Управляет основной схемой узлов, которые, будучи присоединенными друг к другу, могут образовывать обширные определения, легко создаваемые и поддерживаемые пользователями.",
                "updated": 1640931112373
            },
            {
                "language": "TR",
                "text": "Özet: Birbirine eklendiğinde, kullanıcılar tarafından kolaylıkla yapılan ve sürdürülen geniş tanımlar oluşturabilen çekirdek düğüm kavramını yönetir.",
                "updated": 1643202258879
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The system features a file called App Schema which has the rules about the existing types of nodes, which nodes may be the child of other nodes, and which may reference other nodes and which. It also defines the menu items of nodes. All these rules are enforced on the Design Space.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Das System verfügt über eine Datei namens App Schema, die die Regeln für die vorhandenen Knotentypen enthält, welche Knoten das Kind anderer Knoten sein können und welche Knoten auf andere Knoten verweisen können. Sie definiert auch die Menüpunkte der Knoten. All diese Regeln werden im Design Space durchgesetzt.",
                    "updated": 1641735800885
                },
                {           
                    "language": "RU",
                    "text": "В системе имеется файл под названием App Schema, который содержит правила о существующих типах узлов, о том, какие узлы могут быть дочерними по отношению к другим узлам, какие узлы могут ссылаться на другие узлы, а какие нет. Он также определяет пункты меню узлов. Все эти правила применяются в пространстве проектирования (Design Space).",
                    "updated": 1640931154257
                },
                {
                    "language": "TR",
                    "text": "Sistem, varolan düğüm türleri, hangi düğümlerin diğer düğümlerin alt öğesi olabileceği ve diğer düğümlere ve hangi düğümlere başvurulabileceği hakkında kurallara sahip Uygulama Şeması ( App Schema ) adlı bir dosyaya sahiptir. Ayrıca düğümlerin menü öğelerini tanımlar. Tüm bu kurallar Tasarım Alanı'nda (  Design Space ) uygulanır.",
                    "updated": 1643202465834
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Users may then attach nodes, establish references between nodes, select menu items,  and more...",
            "translations": [
                {
                    "language": "DE",
                    "text": "Benutzer können dann Knoten anhängen, Verweise zwischen Knoten herstellen, Menüpunkte auswählen und vieles mehr...",
                    "updated": 1641735807974
                },
                {    
                    "language": "RU",
                    "text": "Пользователи могут присоединять узлы, устанавливать ссылки между узлами, выбирать пункты меню и многое другое...",
                    "updated": 1640931176660
                },
                {
                    "language": "TR",
                    "text": "Kullanıcılar daha sonra düğümler ekleyebilir, düğümler arasında referanslar oluşturabilir, menü öğelerini seçebilir ve daha fazlasını yapabilir...",
                    "updated": 1643202492299
                }
            ]
        },
        {
            "style": "Note",
            "text": "The Design Space is tightly coupled with the Floating Space.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Design Space ist eng mit dem Floating Space gekoppelt.",
                    "updated": 1641735814787
                },
                {           
                    "language": "RU",
                    "text": "Design Space тесно связано с Floating Space.",
                    "updated": 1640931199401
                },
                {
                    "language": "TR",
                    "text": "Not: Tasarım Alanı ( Design Space ) , Kayan Alan ile sıkı bir şekilde bağlantılıdır.",
                    "updated": 1643202548550
                }
            ]
        }
    ]
}
