{
    "tutorial": "Developers Intro",
    "pageNumber": 20,
    "type": "Tutorial Topic - Files Component",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": ""
        },
        "text": "Encapsulates different data providers able to read datasets organized in different ways.",
        "translations": [
            {
                "language": "DE",
                "text": "Kapselt verschiedene Datenanbieter, die in der Lage sind, auf unterschiedliche Weise organisierte Datensätze zu lesen.",
                "updated": 1641736740604
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The system defines these types of data providers:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Das System definiert diese Arten von Datenanbietern:",
                    "updated": 1641736749444
                }
            ]
        },
        {
            "style": "List",
            "text": "Market Files: For time-frames of 1 hour and above, it is convenient to have a single file with all the data of the whole market.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Market Files: Für Zeitrahmen von 1 Stunde und mehr ist es praktisch, eine einzige Datei mit allen Daten des gesamten Marktes zu haben.",
                    "updated": 1641736760116
                }
            ]
        },
        {
            "style": "List",
            "text": "Daily Files: For time-frames below 1 hour, up to 1 minute, it is convenient to split market data into one file per day.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Daily Files: Für Zeitrahmen unter 1 Stunde, bis zu 1 Minute, ist es sinnvoll, die Marktdaten in eine Datei pro Tag aufzuteilen.",
                    "updated": 1641736768188
                }
            ]
        },
        {
            "style": "List",
            "text": "Single File: Sometimes a process may generate a single file irrespective of the time-frame.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Single File: Manchmal kann ein Prozess eine einzige Datei erzeugen, unabhängig vom Zeitrahmen.",
                    "updated": 1641736776487
                }
            ]
        },
        {
            "style": "Text",
            "text": "Files Sequence: Some processes may produce a sequence of files.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Einige Prozesse können eine Reihe von Dateien erzeugen.",
                    "updated": 1641736788142
                }
            ]
        },
        {
            "style": "Note",
            "text": "Daily Files are managed by a File Cursor which dynamically loads the files of one day and its neighboring days.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Tägliche Dateien werden von einem Dateicursor verwaltet, der dynamisch die Dateien eines Tages und seiner Nachfolgetage lädt.",
                    "updated": 1641736822077
                }
            ]
        }
    ]
}