{
    "type": "Crypto Exchange",
    "definition": {
        "text": "A crypto exchange node holds the definitions of assets and markets in a specific exchange.",
        "translations": [
            {
                "language": "ES",
                "text": "Un nodo crypto exchange contiene las definiciones de assets y mercados en un exchange.",
                "updated": 1636383115048
            },
            {
                "language": "RU",
                "text": "Crypto Exchange содержит определения активов и рынков конкретной биржи.",
                "updated": 1638648355387
            },
            {
                "language": "TR",
                "text": "Bir kripto Exchange düğümü, belirli bir borsadaki varlıkların ve pazarların tanımlarını tutar.",
                "updated": 1652799015108
            },
            {
                "language": "DE",
                "text": "Ein Krypto-Börsenknoten enthält die Definitionen von Vermögenswerten und Märkten an einer bestimmten Börse.",
                "updated": 1708265562633
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Tested Exchanges",
            "updated": 1615200855230,
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверенные биржи",
                    "updated": 1638648375474
                },
                {
                    "language": "TR",
                    "text": "Test Edilen Exchange'ler",
                    "updated": 1652799056133
                },
                {
                    "language": "DE",
                    "text": "Getestete Exchanges",
                    "updated": 1708265562805,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "Text",
            "text": "In theory, Superalgos supports dozens of exchanges. However, each exchange must go through a testing process, as not all of them conform to the standard proposed by the CCXT library.",
            "updated": 1615201479524,
            "translations": [
                {
                    "language": "ES",
                    "text": "En teoría, Superalgos soporta docenas de exchanges. De todas formas, cada exchange debe ir a través de un proceso de testeo, ya que no todos ellos están conformados  bajo los estándares propuestos por la  biblioteca CCXT.",
                    "updated": 1636383259902
                },
                {
                    "language": "RU",
                    "text": "Теоретически Superalgos поддерживает десятки бирж. Однако каждый обмен должен проходить процесс тестирования, так как не все из них соответствуют стандарту, предложенному библиотекой CCXT.",
                    "updated": 1638648390810
                },
                {
                    "language": "TR",
                    "text": "Teorik olarak, Superalgos düzinelerce borsayı destekler. Ancak, hepsi CCXT kitaplığı tarafından önerilen standarda uymadığından, her değişim bir test sürecinden geçmelidir.",
                    "updated": 1652799075432
                },
                {
                    "language": "DE",
                    "text": "Theoretisch unterstützt Superalgos Dutzende von Börsen. Allerdings muss jede Börse einen Testprozess durchlaufen, da nicht alle dem von der CCXT-Bibliothek vorgeschlagenen Standard entsprechen.",
                    "updated": 1708265562914,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "List",
            "text": "Binance Test Status",
            "updated": 1615203667257,
            "translations": [
                {
                    "language": "TR",
                    "text": "Binance Test Durumu",
                    "updated": 1654391518307,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Binance Test Status",
                    "updated": 1708265563087,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Binance Futures USDⓈ-M/COIN-M Test Status",
            "updated": 1615203667257,
            "translations": [
                {
                    "language": "TR",
                    "text": "Binance Vadeli İşlemleri USDⓈ-M/COIN-M Test Durumu",
                    "updated": 1654391523838,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Binance Futures USDⓈ-M/COIN-M Teststatus",
                    "updated": 1708265563196,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Binance-US Test Status",
            "translations": [
                {
                    "language": "TR",
                    "text": "Binance-ABD Test Durumu",
                    "updated": 1654391530627,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Binance-US Test Status",
                    "updated": 1708265563337,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Bitfinex Test Status",
            "translations": [
                {
                    "language": "TR",
                    "text": "Bitfinex Test Durumu",
                    "updated": 1654391537736,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Bitfinex Test Status",
                    "updated": 1708265563462,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Bittrex Test Status",
            "translations": [
                {
                    "language": "TR",
                    "text": "Bittrex Test Durumu",
                    "updated": 1654391543303,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Bittrex Test Status",
                    "updated": 1708265563587,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "CoinbasePro Test Status",
            "translations": [
                {
                    "language": "TR",
                    "text": "CoinbasePro Test Durumu",
                    "updated": 1654391549262,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "CoinbasePro Test Status",
                    "updated": 1708265563681,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "FTX Test Status",
            "updated": 1615203669878,
            "translations": [
                {
                    "language": "TR",
                    "text": "FTX Test Durumu",
                    "updated": 1654391555993,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "FTX-Teststatus",
                    "updated": 1708265563806,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Kraken Test Status",
            "updated": 1615453046113,
            "translations": [
                {
                    "language": "TR",
                    "text": "Kraken Test Durumu",
                    "updated": 1654391561963,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Kraken Test Status",
                    "updated": 1708265563915,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Kucoin Test Status",
            "translations": [
                {
                    "language": "TR",
                    "text": "Kucoin Test Durumu",
                    "updated": 1654391569616,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Kucoin Test Status",
                    "updated": 1708265564025,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Luno Test Status",
            "translations": [
                {
                    "language": "TR",
                    "text": "Luno Test Durumu",
                    "updated": 1654391576496,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Luno Test Status",
                    "updated": 1708265564150,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Title",
            "text": "Crypto Exchange Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Crypto Exchange",
                    "updated": 1638648412109
                },
                {
                    "language": "TR",
                    "text": "Kripto Exchange Yapılandırma",
                    "updated": 1652799127267
                },
                {
                    "language": "DE",
                    "text": "Konfiguration der Krypto-Börse",
                    "updated": 1708265564259,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Each exchange may require a very specific configuration. This is determined during the exchange testing process. Consult the page of each exchange as listed above. If you are interested in testing a new exchange, go to the How to Test New Exchanges page.",
            "updated": 1615201685376,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada exchange puede requerir una configuración muy específica. Esta se determina durante el proceso de testeo del exchange. Consulta la página de cada exchange como está listado aquí arriba. Si está interesado en testear un nuevo exchange, ve a la página de How to Test New Exchanges ( como testear un nuevo exchange).",
                    "updated": 1636383451633
                },
                {
                    "language": "RU",
                    "text": "Для каждой биржи может потребоваться очень специфическая конфигурация. Это определяется в процессе тестирования биржи. Проконсультируйтесь со страницей каждой биржи, как указано выше. Если вы заинтересованы в тестировании новой биржи, перейдите на страницу Test New Exchanges.",
                    "updated": 1638648473771
                },
                {
                    "language": "TR",
                    "text": "Her Exchange çok özel bir konfigürasyon gerektirebilir. Bu, değişim testi sürecinde belirlenir. Yukarıda listelenen her borsanın sayfasına bakın. Yeni bir değişimi test etmekle ilgileniyorsanız, Yeni Değişimler Nasıl Test Edilir ( How to Test New Exchanges ) sayfasına gidin.",
                    "updated": 1652799182432
                },
                {
                    "language": "DE",
                    "text": "Jede Börse kann eine ganz bestimmte Konfiguration erfordern. Dies wird bei der Prüfung des Austauschs festgestellt. Konsultieren Sie die Seite der jeweiligen Börse, wie oben aufgeführt. Wenn Sie eine neue Börse testen möchten, gehen Sie auf die Seite How to Test New Exchanges.",
                    "updated": 1708265564400,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Properties and Parameters",
            "updated": 1650623361424,
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства и параметры",
                    "updated": 1661275343252
                },
                {
                    "language": "TR",
                    "text": "Özellikler ve Parametreler",
                    "updated": 1652799193595
                },
                {
                    "language": "DE",
                    "text": "Eigenschaften und Parameter",
                    "updated": 1708265564572,
                    "style": "Subtitle"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos uses CCXT (CryptoCurrency eXchange Trading Library) to connect to exchanges. It supports hundreds of exchanges to which it connects through APIs created on the exchange by the user. One of the best feature of ccxt is that it is exchange agnostic. Whether you trade on FTX or Bybit the process to connect to the exchange is the same. The library accepts many parameters to fine tune the connection when needed. For well supported exchanges like Binance, all you need to connect to the exchange is to declare the codeName that is the name of the exchange you want to use, usually in lowercase letters.",
            "updated": 1650806161770,
            "translations": [
                {
                    "language": "TR",
                    "text": "Superalgos, borsalara bağlanmak için CCXT'yi (CryptoCurrency eXchange Trading Library) kullanır. Kullanıcı tarafından exchange üzerinde oluşturulan API'ler aracılığıyla bağlandığı yüzlerce exchange'i destekler. ccxt'nin en iyi özelliklerinden biri, exchange agnostik olmasıdır. İster FTX'te ister Bybit'te işlem yapın, borsaya bağlanma süreci aynıdır. Kitaplık, gerektiğinde bağlantıya ince ayar yapmak için birçok parametreyi kabul eder. Binance gibi iyi desteklenen borsalar için borsaya bağlanmak için tek yapmanız gereken kullanmak istediğiniz borsanın adı olan codeName'i genellikle küçük harflerle bildirmektir.",
                    "updated": 1652799206992
                },
                {
                    "language": "DE",
                    "text": "Superalgos verwendet CCXT (CryptoCurrency eXchange Trading Library), um sich mit Börsen zu verbinden. Sie unterstützt Hunderte von Börsen, mit denen sie sich über APIs verbindet, die vom Benutzer an der Börse erstellt werden. Eine der besten Eigenschaften von ccxt ist, dass es börsenunabhängig ist. Ob Sie nun an FTX oder Bybit handeln, der Prozess der Verbindung zur Börse ist derselbe. Die Bibliothek akzeptiert viele Parameter, um die Verbindung bei Bedarf fein abzustimmen. Bei gut unterstützten Börsen wie Binance müssen Sie nur den CodeName angeben, der der Name der Börse ist, die Sie verwenden möchten, normalerweise in Kleinbuchstaben.",
                    "updated": 1708265564682,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "List",
            "text": "codeName is the name of the exchange as handled in the code of the system.",
            "translations": [
                {
                    "language": "ES",
                    "text": "codeName es el nombre del exchange como se maneja en el código del sistema.",
                    "updated": 1636383499342
                },
                {
                    "language": "RU",
                    "text": "codeName - это название биржи, которое обрабатывается в коде системы.",
                    "updated": 1638648511499
                },
                {
                    "language": "TR",
                    "text": "codeName, sistem kodunda işlendiği şekliyle Exchange adıdır.",
                    "updated": 1652799238746
                },
                {
                    "language": "DE",
                    "text": "codeName ist der Name des Austauschs, wie er im Code des Systems behandelt wird.",
                    "updated": 1708265564901,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "sandBox some exchanges have a so called testnet/sandBox mode that enables traders to try out all the exchange features in a simulated environment. Set it to true to enable it. Please note that some exchanges (like Bittrex for example) can throw an error with this parameter set to false. Simply delete that line in such cases.",
            "updated": 1650635009708,
            "translations": [
                {
                    "language": "RU",
                    "text": "sandBox некоторые биржи имеют так называемый режим testnet/sandBox, который позволяет трейдерам опробовать все возможности биржи в симулированной среде. Установите значение true, чтобы включить этот режим. Обратите внимание, что некоторые биржи (например, Bittrex) могут выдать ошибку, если этот параметр установлен в false. В таких случаях просто удалите эту строку.",
                    "updated": 1661275422115
                },
                {
                    "language": "TR",
                    "text": "sandBox bazı borsalarda, tüccarların simüle edilmiş bir ortamda tüm borsa özelliklerini denemelerini sağlayan testnet/sandBox modu vardır. Etkinleştirmek için true olarak ayarlayın. Lütfen bazı borsaların (örneğin Bittrex gibi) bu parametrenin false olarak ayarlanmasıyla hata verebileceğini unutmayın. Bu gibi durumlarda o satırı silmeniz yeterlidir.",
                    "updated": 1652799269237
                },
                {
                    "language": "DE",
                    "text": "sandBox Einige Börsen verfügen über einen so genannten Testnet/SandBox-Modus, der es Händlern ermöglicht, alle Funktionen der Börse in einer simulierten Umgebung auszuprobieren. Setzen Sie ihn auf true, um ihn zu aktivieren. Bitte beachten Sie, dass einige Börsen (wie z.B. Bittrex) einen Fehler ausgeben können, wenn dieser Parameter auf false gesetzt ist. Löschen Sie diese Zeile in solchen Fällen einfach.",
                    "updated": 1708265565041,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "maxRate sets the maximum number of OHCLV that is pulled before the data is saved. This is only to be used when the exchange is kicking out the data-mine randomly and to allow to the user to save the data more often allowing for the data mining to move forward.",
            "updated": 1650806325108,
            "translations": [
                {
                    "language": "RU",
                    "text": "maxRate устанавливает максимальное количество OHCLV, которое будет извлечено перед сохранением данных. Этот параметр следует использовать только в том случае, если биржа выбрасывает data-mine случайным образом, чтобы позволить пользователю сохранять данные чаще, позволяя продвигаться вперед. ",
                    "updated": 1661275465625
                },
                {
                    "language": "TR",
                    "text": "maxRate, veriler kaydedilmeden önce çekilen maksimum OHCLV sayısını ayarlar. Bu, yalnızca borsa veri madenciliğini rastgele başlattığında ve kullanıcının verileri daha sık kaydetmesine ve veri madenciliğinin ilerlemesine izin verdiğinde kullanılmalıdır.",
                    "updated": 1652799278482
                },
                {
                    "language": "DE",
                    "text": "maxRate legt die maximale Anzahl von OHCLV fest, die gezogen werden, bevor die Daten gespeichert werden. Dies ist nur zu verwenden, wenn die Börse die Data-Mine willkürlich auswirft und es dem Benutzer ermöglicht, die Daten häufiger zu speichern, damit die Data-Mine fortschreiten kann.",
                    "updated": 1708265565307,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "rateLimit to override the default value set by ccxt library.",
            "updated": 1650806392602,
            "translations": [
                {
                    "language": "TR",
                    "text": "ccxt kitaplığı tarafından ayarlanan varsayılan değeri geçersiz kılmak için rateLimit.",
                    "updated": 1652799286994
                },
                {
                    "language": "DE",
                    "text": "rateLimit, um den von der ccxt-Bibliothek festgelegten Standardwert außer Kraft zu setzen.",
                    "updated": 1708265565526,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "limit: could be required by some exchanges in order to properly connect.",
            "updated": 1650806388686,
            "translations": [
                {
                    "language": "TR",
                    "text": "limit: düzgün bağlanmak için bazı borsalar tarafından gerekli olabilir.",
                    "updated": 1652799302057
                },
                {
                    "language": "DE",
                    "text": "Limit: könnte von einigen Börsen verlangt werden, um eine ordnungsgemäße Verbindung herzustellen.",
                    "updated": 1708265565682,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "options: used as an object to pass aditional parameters to the exchange, for example when trading an inverse pair.",
            "updated": 1650806383621,
            "translations": [
                {
                    "language": "TR",
                    "text": "seçenekler: örneğin ters bir çiftle işlem yaparken, borsaya ek parametreleri iletmek için bir nesne olarak kullanılır.",
                    "updated": 1652799310476
                },
                {
                    "language": "DE",
                    "text": "options: wird als Objekt zur Übergabe zusätzlicher Parameter an die Börse verwendet, z.B. beim Handel mit einem umgekehrten Paar.",
                    "updated": 1708265565838,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "hostname: to set custom hostname for the exchange.",
            "updated": 1650806377985,
            "translations": [
                {
                    "language": "TR",
                    "text": "ana bilgisayar adı: değişim için özel ana bilgisayar adı ayarlamak için.",
                    "updated": 1652799318231
                },
                {
                    "language": "DE",
                    "text": "hostname: zum Festlegen eines eigenen Hostnamens für die Börse.",
                    "updated": 1708265566011,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Example of use:",
            "translations": [
                {
                    "language": "TR",
                    "text": "Kullanım örneği:",
                    "updated": 1652799329113
                },
                {
                    "language": "DE",
                    "text": "Beispiel für die Verwendung:",
                    "updated": 1708265566168,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n    \"codeName\": \"bybit\",\n    \"limit\": 50,\n    \"options\": {\n        \"adjustForTimeDifference\": \"true\",\n        \"defaultType\": \"inverse\"\n    }\n}",
            "updated": 1650640075422
        },
        {
            "style": "Note",
            "text": "For well known exchanges setting up the correct codeName is enough to enable the connection and no additional parameters are usually needed!",
            "updated": 1650806420539,
            "translations": [
                {
                    "language": "TR",
                    "text": "Not: Bilinen değiş tokuşlar için, bağlantıyı etkinleştirmek için doğru kodAdı'nı ayarlamak yeterlidir ve genellikle ek parametreye gerek yoktur!",
                    "updated": 1652799337547
                },
                {
                    "language": "DE",
                    "text": "Bei bekannten Börsen genügt es, den korrekten Codenamen einzugeben, um die Verbindung zu aktivieren, und es sind in der Regel keine weiteren Parameter erforderlich!",
                    "updated": 1708265566277,
                    "style": "Note"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Some exchanges do not accept a standard configuration for fetching candles. In this case a possible solution can be to use a different method to fetch candles. API holds a series of definitions used only in the case in which the sensor bot fetches trades (using the Historic-Trades process) instead of the OHLCV process that fetches one-minute candles and is the current default. In such a case, finding the right set of parameters to work with a specific exchange may be challenging and involves understanding how the exchanges API and the CCXT Library API work. In other words, there is no hard rule as of what each of the values should be. Determining each of this values requires exploring the exchange's API documentation, as well as the documentation of the CCXT Library. To enable the API use, first declare its use to have access to all its parameters.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Bazı borsalar, mumları getirmek için standart bir yapılandırmayı kabul etmez. Bu durumda mum getirmek için farklı bir yöntem kullanmak olası bir çözüm olabilir. API, bir dakikalık mumları getiren ve mevcut varsayılan olan OHLCV süreci yerine, yalnızca sensör botunun alım satımları (Tarihi-Ticaret sürecini kullanarak) getirmesi durumunda kullanılan bir dizi tanımı içerir. Böyle bir durumda, belirli bir değişim ile çalışmak için doğru parametre setini bulmak zor olabilir ve değişim API'sinin ve CCXT Kitaplık API'sinin nasıl çalıştığını anlamayı gerektirir. Başka bir deyişle, değerlerin her birinin ne olması gerektiğine dair kesin bir kural yoktur. Bu değerlerin her birinin belirlenmesi, değiş tokuşun API belgelerinin yanı sıra CCXT Kitaplığının belgelerinin araştırılmasını gerektirir. API kullanımını etkinleştirmek için, önce tüm parametrelerine erişim için kullanımını bildirin.",
                    "updated": 1652799346422
                },
                {
                    "language": "DE",
                    "text": "Einige Börsen akzeptieren keine Standardkonfiguration für den Abruf von Kerzen. In diesem Fall kann eine mögliche Lösung darin bestehen, eine andere Methode zum Abrufen von Kerzen zu verwenden. API enthält eine Reihe von Definitionen, die nur in dem Fall verwendet werden, in dem der Sensor-Bot Trades abruft (unter Verwendung des Historic-Trades-Prozesses) anstelle des OHLCV-Prozesses, der einminütige Kerzen abruft und die aktuelle Standardeinstellung ist. In einem solchen Fall kann es schwierig sein, die richtigen Parameter zu finden, um mit einer bestimmten Börse zu arbeiten, und man muss verstehen, wie die Börsen-API und die CCXT Library API funktionieren. Mit anderen Worten: Es gibt keine feste Regel, wie die einzelnen Werte lauten sollten. Um die einzelnen Werte zu ermitteln, müssen Sie die API-Dokumentation der Börse sowie die Dokumentation der CCXT-Bibliothek studieren. Um die Verwendung der API zu aktivieren, müssen Sie zunächst ihre Verwendung deklarieren, um Zugriff auf alle Parameter zu erhalten.",
                    "updated": 1708265566480,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "List",
            "text": "API.method fetch_ohlcv is required to enable the API parameters use",
            "updated": 1650646783132,
            "translations": [
                {
                    "language": "TR",
                    "text": "API parametrelerinin kullanımını etkinleştirmek için API.method fetch_ohlcv gereklidir",
                    "updated": 1652799355867
                },
                {
                    "language": "DE",
                    "text": "Die API.methode fetch_ohlcv ist erforderlich, um die Verwendung der API-Parameter zu aktivieren.",
                    "updated": 1708265566777,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "API.class is used for declaring the \"exchangeId\"",
            "updated": 1650646792335,
            "translations": [
                {
                    "language": "TR",
                    "text": "API.class, \"exchangeId\" bildirmek için kullanılır",
                    "updated": 1652799363355
                },
                {
                    "language": "DE",
                    "text": "API.class wird für die Deklaration der \"exchangeId\" verwendet",
                    "updated": 1708265566949,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "API.fetchOHLCVsMethod to use the fetchOHLCVsMethod",
            "updated": 1650629783776,
            "translations": [
                {
                    "language": "TR",
                    "text": "API.fetchOHLCVs fetchOHLCVsYöntemini kullanma yöntemi",
                    "updated": 1652799370821
                },
                {
                    "language": "DE",
                    "text": "API.fetchOHLCVsMethod, um die Methode fetchOHLCVsMethod zu verwenden",
                    "updated": 1708265567091,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "API.firstId to declare the firstId",
            "updated": 1650629788135,
            "translations": [
                {
                    "language": "TR",
                    "text": "API.firstId, ilk kimliği bildirmek için",
                    "updated": 1652799378676
                },
                {
                    "language": "DE",
                    "text": "API.firstId zur Deklaration der firstId",
                    "updated": 1708265567231,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "API.rateLimit to change the default rateLimit",
            "updated": 1650629792154,
            "translations": [
                {
                    "language": "TR",
                    "text": "Varsayılan rateLimit'i değiştirmek için API.rateLimit",
                    "updated": 1652799387406
                },
                {
                    "language": "DE",
                    "text": "API.rateLimit, um das Standard-RateLimit zu ändern",
                    "updated": 1708265567372,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "API.limit to change the default exchange limit parameter",
            "updated": 1650629796143,
            "translations": [
                {
                    "language": "TR",
                    "text": "API.hostname varsayılan ana bilgisayar adını değiştirmek için",
                    "updated": 1652799410949
                },
                {
                    "language": "DE",
                    "text": "API.limit, um den Standardparameter für die Umtauschgrenze zu ändern",
                    "updated": 1708265567513,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "API.hostname to change the default hostname",
            "updated": 1650629800326,
            "translations": [
                {
                    "language": "TR",
                    "text": "API.hostname varsayılan ana bilgisayar adını değiştirmek için",
                    "updated": 1652799414732
                },
                {
                    "language": "DE",
                    "text": "API.hostname zum Ändern des Standard-Hostnamens",
                    "updated": 1708265567653,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "API.fetchType is used in combination with API.useFetchTradesForFetchOHLCVs",
            "updated": 1650629806813,
            "translations": [
                {
                    "language": "TR",
                    "text": "API.fetchType, API.useFetchTradesForFetchOHLCVs ile birlikte kullanılır",
                    "updated": 1652799424949
                },
                {
                    "language": "DE",
                    "text": "API.fetchType wird in Kombination mit API.useFetchTradesForFetchOHLCVs verwendet",
                    "updated": 1708265567794,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "API.maxTradesPerFetch to set the maxRate when using API",
            "updated": 1650629811132,
            "translations": [
                {
                    "language": "TR",
                    "text": "API kullanırken maxRate değerini ayarlamak için API.maxTradesPerFetch",
                    "updated": 1652799432735
                },
                {
                    "language": "DE",
                    "text": "API.maxTradesPerFetch zum Festlegen der maxRate bei Verwendung von API",
                    "updated": 1708265567973,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Example of use:",
            "translations": [
                {
                    "language": "TR",
                    "text": "Kullanım örneği:",
                    "updated": 1652799441752
                },
                {
                    "language": "DE",
                    "text": "Beispiel für die Verwendung:",
                    "updated": 1708265568129,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n    \"codeName\": \"exchangeName\",\n    \"API\": [\n        {\n            \"method\": \"fetch_ohlcv\",\n            \"limit\": 100\n        }\n    ]\n}",
            "updated": 1650646759978
        }
    ]
}