{
    "type": "Feature Formula",
    "definition": {
        "text": "A formula that allows users to specify an input value of a Data Feature, using any of the Data Structures provided by Superalgos to access indicators.",
        "updated": 1615896367911,
        "translations": [
            {
                "language": "RU",
                "text": "Формула, которая позволяет пользователям указать входное значение характеристики данных, используя любую из структур данных, предоставляемых Superalgos для доступа к показателям.",
                "updated": 1645247949249
            },
            {
                "language": "TR",
                "text": "Kullanıcıların, göstergelere erişmek için Superalgos tarafından sağlanan Veri Yapılarından herhangi birini kullanarak bir Veri Özelliğinin giriş değerini belirtmelerine olanak tanıyan bir formül.",
                "updated": 1654397114503
            },
            {
                "language": "DE",
                "text": "Eine Formel, die es dem Benutzer ermöglicht, einen Eingabewert für ein Datenmerkmal (Data Feature) anzugeben und dabei eine der von Superalgos bereitgestellten Datenstrukturen für den Zugriff auf Indikatoren zu verwenden.",
                "updated": 1707239610955
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645247957722
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397120600,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1707239620885
                }
            ]
        }
    ]
}