{
    "type": "Trading Mines Data",
    "definition": {
        "text": "Trading Mines Data refers to data that is generated as a consequence of running a trading session, that is, data the trading bot instance generates while running backtesting, paper trading, forward testing, or live trading sessions.",
        "updated": 1609667925651,
        "translations": [
            {
                "language": "RU",
                "text": "Trading Mines Data - это данные, которые генерируются в результате запуска торговой сессии, то есть данные, создаваемые экземпляром торгового бота во время тестирования на истории, торговли на бумаге, форвард-тестирования или торговых сессий в реальном времени.",
                "updated": 1639149111742
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Trading mines data is sorted by exchange, market, the corresponding trading session, and the corresponding trading mine, trading bot, and bot product. That is, most of the nodes in this section of the hierarchy play an organizational role.",
            "updated": 1609667942769,
            "translations": [
                {
                    "language": "RU",
                    "text": "Данные Trading Mine сортируются по бирже, рынку, соответствующей торговой сессии и соответствующему Trading Mine, торговому боту и продукту бота. То есть большинство узлов в этом разделе иерархии играют организационную роль.",
                    "updated": 1639149240506
                }
            ]
        },
        {
            "style": "Text",
            "text": "Many of them require references to the nodes that delimit the context for which the data is applicable. For example, the exchange trading products node must reference one of the installed exchanges, in particular, the exchange on which the trading operation is run. These references help other entities understand the context to which the data belongs to.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Многие из них требуют ссылок на узлы, которые ограничивают контекст, для которого применимы данные. Например, узел Trading Products биржи должен ссылаться на одну из установленных бирж, в частности на биржу, на которой выполняется торговая операция. Эти ссылки помогают другим сущностям понять контекст, которому принадлежат данные.",
                    "updated": 1639149750055
                }
            ]
        },
        {
            "style": "Text",
            "text": "Whenever you create trading tasks manually from within the Network hierarchy (as opposed to using the install market function under the exchange markets node of the Crypto Ecosystem hierarchy",
            "translations": [
                {
                    "language": "RU",
                    "text": "Всякий раз, когда вы создаете торговые задачи вручную из иерархии Network (в отличие от использования функции установки рынка в узле Exchange иерархии Crypto Ecosystem",
                    "updated": 1639149684119
                }
            ]
        }
    ]
}