{
    "topic": "Order Management",
    "pageNumber": "1",
    "type": "Overview of the Management Issue",
    "definition": {
        "text": "The Low-Frequency trading bot manages live orders, produces a simulation that is synchronized with the events occurring at the exchange, and does the accounting to keep all trading information in order.",
        "updated": 1610219490073,
        "translations": [
            {
                "language": "RU",
                "text": "Низкочастотный торговый бот управляет реальными ордерами, создает симуляцию, синхронизированную с событиями, происходящими на бирже, и ведет учет для поддержания всей торговой информации в порядке.",
                "updated": 1640152203531
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The management of orders is at the heart of the Low-Frequency trading bot’s competency.",
            "updated": 1610219504082,
            "translations": [
                {
                    "language": "RU",
                    "text": "Управление ордерами лежит в основе компетенции низкочастотного торгового бота.",
                    "updated": 1640152321797
                }
            ]
        },
        {
            "style": "Text",
            "text": "The process has some intricacies, as it involves handling orders at the exchange as well as producing a simulation. The system must be synchronized with what happens at the exchange so that the on-screen monitoring of the trading session, the accounts, and all trading information reflects reality.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Этот процесс имеет некоторые тонкости, поскольку он включает в себя обработку ордеров на бирже, а также создание симуляции. Система должна быть синхронизирована с тем, что происходит на бирже, чтобы мониторинг торговой сессии на экране, счета и вся торговая информация отражали реальность.",
                    "updated": 1640152348637
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Understanding how the trading bot manages orders will help you make the most out of Superalgos. This knowledge will allow you to transcend simple trading system setups, and stretch the limits of what you may do with more elaborate or unusual definitions.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Понимание того, как торговый бот управляет ордерами, поможет вам извлечь максимальную пользу из Superalgos. Эти знания позволят вам выйти за рамки простых настроек торговых систем и расширить границы возможного с помощью более сложных или необычных определений.",
                    "updated": 1640152380182
                }
            ]
        },
        {
            "style": "Text",
            "text": "The following pages feature a chronological description of the life of an order, from the moment in which the trading system definitions of orders are read, until the accounting is done.",
            "translations": [
                {
                    "language": "RU",
                    "text": "На следующих страницах представлено хронологическое описание жизни ордера, начиная с момента считывания определений ордеров в торговой системе и заканчивая ведением учета.",
                    "updated": 1640152409916
                }
            ]
        },
        {
            "style": "Text",
            "text": "Once an order is created, it is maintained on each execution of the trading bot. At this point, the bot handles two parallel jobs:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Как только ордер создан, он сохраняется при каждом запуске торгового бота. В этот момент бот обрабатывает два параллельных задания:",
                    "updated": 1640152496860
                }
            ]
        },
        {
            "style": "List",
            "text": "In the case of forward testing and live trading sessions, the maintenance of orders involves dealing with the exchange and live orders.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В случае форвардного тестирования и реальных торговых сессий обслуживание ордеров предполагает работу с биржей и реальными ордерами.",
                    "updated": 1640152512567
                }
            ]
        },
        {
            "style": "List",
            "text": "In the case of backtesting and paper trading sessions, the bot simulates those interactions, while dealing with simulated orders.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В случае бэктестинга и бумажных торговых сессий бот имитирует эти взаимодействия, работая с имитированными ордерами.",
                    "updated": 1640152529220
                }
            ]
        },
        {
            "style": "Important",
            "text": "This whole section assumes that you are familiar with trading systems. Make sure you read about them first in case you are not.",
            "updated": 1610219545354,
            "translations": [
                {
                    "language": "RU",
                    "text": "Весь этот раздел предполагает, что вы знакомы с торговыми системами. Обязательно прочитайте о них сначала, если вы не знакомы.",
                    "updated": 1640152551814
                }
            ]
        },
        {
            "style": "Success",
            "text": "The rest of the pages in this section are a detailed, step-by-step account of the actions the Low-Frequency trading bot performs while dealing with orders. You would make the most out of this content if you read the whole sequence of pages in the proposed order.",
            "updated": 1610219534393,
            "translations": [
                {
                    "language": "RU",
                    "text": "Остальные страницы этого раздела представляют собой подробный, пошаговый отчет о действиях, которые выполняет низкочастотный торговый бот при работе с ордерами. Вы получите максимальную пользу от этого содержания, если прочитаете всю последовательность страниц в предложенном порядке.",
                    "updated": 1640152576402
                }
            ]
        }
    ]
}