{
    "topic": "Order Management",
    "pageNumber": "8",
    "type": "Maintaining Simulated Orders",
    "definition": {
        "text": "The maintenance of simulated orders follows the same kind of logic as the maintenance of real orders, using definitions in the trading session parameters and in the trading system to complete the required assumption",
        "updated": 1610222218174
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The pages in this section describe how the trading bot simulates the maintenance of orders in the case of backtesting and paper trading sessions.",
            "updated": 1610222228462
        },
        {
            "style": "Success",
            "text": "It is highly recommended that you read the Maintaining Live Orders section first, as the explanations on what is calculated and why are more extensive and detailed there.",
            "updated": 1610222251113
        },
        {
            "style": "Text",
            "text": "When on backtesting or paper trading sessions, there is no exchange involved as orders are not actually placed, but live within the simulation only."
        },
        {
            "style": "Text",
            "text": "However, to make simulations as realistic and as accurate as possible, the system goes through a similar process as when it’s interacting with an exchange, performs similar checks, does similar calculations, and keeps similar accounts—while simulating the response from the exchange according to the definitions in the trading system."
        },
        {
            "style": "Text",
            "text": "The definitions that affect simulations directly are:"
        },
        {
            "style": "List",
            "text": "The slippage and fee structure parameters at the level of the trading session."
        },
        {
            "style": "List",
            "text": "The simulated exchange events at the level of the trading system, where a simulated partial fill, a simulated actual rate, and a simulated fees paid may be defined."
        }
    ]
}