{
    "topic": "How to Automate Actions at The Design Space",
    "pageNumber": 4,
    "type": "Automating Actions - Adding your Function",
    "definition": {
        "text": "Take a look at how other functions are implemented in the Function Library and try to follow the same format.",
        "updated": 1628257476029,
        "translations": [
            {
                "language": "DE",
                "text": "Schauen Sie sich an, wie andere Funktionen in der Function Library implementiert sind, und versuchen Sie, demselben Format zu folgen.",
                "updated": 1674163504549
            },
            {
                "language": "RU",
                "text": "Посмотрите, как реализованы другие функции в библиотеке функций, и постарайтесь следовать тому же формату.",
                "updated": 1640761689725
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The basic procedure is quite straight forward. First add the function name to the thisObject and then write your function at the most appropriate place at the Function Library.",
            "updated": 1628257461177,
            "translations": [
                {
                    "language": "DE",
                    "text": "Das grundlegende Verfahren ist recht einfach. Fügen Sie zunächst den Funktionsnamen (function name) zu thisObject hinzu und schreiben Sie sich dann Ihre Funktion an einer passenden Stelle in der Function Library (Funktionsbibliothek)auf.",
                    "updated": 1674163926078
                },
                {
                    "language": "RU",
                    "text": "Основная процедура довольно проста. Сначала добавьте имя функции к объекту thisObject, а затем напишите свою функцию в наиболее подходящем месте в библиотеке функций.",
                    "updated": 1640761714491
                }
            ]
        },
        {
            "style": "Important",
            "text": "Please document your function the best you can, even if you see other functions implemented at the same library poorly documented. See if you can make your function the best documented in the whole library.",
            "updated": 1628257493687,
            "translations": [
                {
                    "language": "DE",
                    "text": "Important: Bitte dokumentieren Sie Ihre Funktion so gut Sie können, auch wenn Sie sehen, dass andere Funktionen, die in derselben Bibliothek implementiert sind, schlecht dokumentiert sind. Dokumentieren Sie ihre Funktion so gut wie möglich in der gesamten Bibliothek (library).",
                    "updated": 1674164071834
                },
                {
                    "language": "RU",
                    "text": "Пожалуйста, документируйте свою функцию как можно лучше, даже если вы видите, что другие функции, реализованные в той же библиотеке, плохо документированы. Попробуйте сделать так, чтобы ваша функция была документирована лучше всех во всей библиотеке.",
                    "updated": 1640761750332
                }
            ]
        },
        {
            "style": "Title",
            "text": "Example of thisObject",
            "translations": [
                {
                    "language": "DE",
                    "text": "Beispiel für: thisObject",
                    "updated": 1638038740760
                },
                {
                    "language": "RU",
                    "text": "Пример объекта thisObject",
                    "updated": 1640761762015
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "    thisObject = {\n        addMissingExchanges: addMissingExchanges,\n        addMissingAssets: addMissingAssets,\n        addMissingMarkets: addMissingMarkets,\n        installMarket: installMarket,\n        uninstallMarket: uninstallMarket\n    }",
            "updated": 1614929327521
        },
        {
            "style": "Title",
            "text": "Function Parameters",
            "translations": [
                {
                    "language": "DE",
                    "text": "Funktionsparameter (Function Parameters):",
                    "updated": 1638038773277
                },
                {
                    "language": "RU",
                    "text": "Параметры функции",
                    "updated": 1640761771173
                }
            ]
        },
        {
            "style": "Text",
            "text": "Your function will receive some parameters, including the Node object that hosted the Menu Item that triggered your Action. The exact list of parameters will be defined by yourself later at the step Automating Actions - Adding an Action Switch Case. Here is a short list of the most common parameters you might later include:",
            "updated": 1614931548904,
            "translations": [
                {
                    "language": "DE",
                    "text": "Ihre Funktion erhält einige Parameter, darunter das Node object, das den Menüpunkt enthielt, der Ihre Aktion ausgelöst hat. Die genaue Liste der Parameter (parameters) wird später im Schritt Automating Actions - Adding an Action Switch Case von Ihnen selbst festgelegt. Hier ist eine kurze Übersicht der häufigsten Parameter, die Sie später einbeziehen können:",
                    "updated": 1674164221286
                },
                {
                    "language": "RU",
                    "text": "Ваша функция будет получать некоторые параметры, включая объект Node, в котором расположен пункт меню, вызывающий ваше действие. Точный список параметров вы определите сами позже на шаге Automating Actions - Adding an Action Switch Case. Вот краткий список наиболее распространенных параметров, которые вы можете включить в функцию:",
                    "updated": 1640762026327
                }
            ]
        },
        {
            "style": "List",
            "text": "node: the node object that hosted the Menu Item that triggered your Action",
            "translations": [
                {
                    "language": "DE",
                    "text": "node: das Knotenpunkt-Objekt, dass den Menüpunkt enthielt, der Ihre Aktion ausgelöst hat",
                    "updated": 1674164289838
                },
                {
                    "language": "RU",
                    "text": "node: объект узла, в котором размещен пункт меню, вызывающий ваше действие",
                    "updated": 1640762048890
                }
            ]
        },
        {
            "style": "List",
            "text": "rootNodes: An array of nodes that are floating at the Design Space without parents. This includes all hierarchy heads.",
            "updated": 1614931639516,
            "translations": [
                {
                    "language": "DE",
                    "text": "rootNodes: Ein Array von Knoten, die sich im Design Space ohne Eltern-Knoten befinden. Dazu gehören alle Hierarchieleitern.",
                    "updated": 1674164381050
                },
                {
                    "language": "RU",
                    "text": "rootNodes: массив узлов, которые находятся в пространстве проектирования без родительских узлов. Сюда входят все вершины иерархий.",
                    "updated": 1640762173744
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}