{
    "topic": "How to Automate Actions at The Design Space",
    "pageNumber": 7,
    "type": "Automating Actions - Using the Workspace",
    "definition": {
        "text": "The workspace object will give you access to all the hierarchies of nodes, and once there you will be able to manipulate those structures at will.",
        "updated": 1614941811976,
        "translations": [
            {
                "language": "RU",
                "text": "Объект рабочего пространства даст вам доступ ко всем иерархиям узлов, и, попав туда, вы сможете манипулировать этими структурами по своему усмотрению.",
                "updated": 1640764865030
            },
            {
                "language": "TR",
                "text": "Çalışma alanı nesnesi size tüm düğüm hiyerarşilerine erişim sağlayacak ve bir kez orada bu yapıları istediğiniz gibi düzenleyebilirsiniz.",
                "updated": 1673806397763
            },
            {
                "language": "DE",
                "text": "Die Arbeitsumgebung (Workspace) des Objektes gibt Ihnen den Zugang zu allen Knotenhierarchien. In diesem können Sie die Strukturen nach Belieben bearbeiten .",
                "updated": 1676497208315
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You can access to the workspace object in this way:",
            "updated": 1614931075101,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете получить доступ к объекту рабочего пространства таким образом:",
                    "updated": 1640764880192
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanı nesnesine bu şekilde erişebilirsiniz:",
                    "updated": 1673806417684
                },
                {
                    "language": "DE",
                    "text": "Sie können auf diese Weise auf die Arbeitsumgebung des Objektes zugreifen:",
                    "updated": 1676494367577
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "UI.projects.workspaces.spaces.designSpace.workspace",
            "updated": 1614931100393
        },
        {
            "style": "Text",
            "text": "Check for the functions defined at thisObject what can be useful in your case. ",
            "updated": 1614931205528,
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверьте, какие функции, определенные в thisObject, могут быть полезны в вашем случае.",
                    "updated": 1640764901852
                },
                {
                    "language": "TR",
                    "text": "thisObject'te tanımlanan işlevlerden sizin için yararlı olabilecekleri kontrol edin.",
                    "updated": 1673806443580
                },
                {
                    "language": "DE",
                    "text": "Prüfen Sie welche Funktionen bei thisObject definiert sind und in Ihrem Fall nützlich sein können.",
                    "updated": 1676494387324
                }
            ]
        },
        {
            "style": "Text",
            "text": "It is not very common to use the Workspace object from an Action, since you have access to the rootNodes array directly as a parameter of your Action function. Useful Workspace function for this use case might be:",
            "updated": 1614931466216,
            "translations": [
                {
                    "language": "RU",
                    "text": "Использование объекта Workspace из Action не очень распространено, поскольку вы имеете доступ к массиву rootNodes непосредственно как к параметру вашей функции Action. Полезной функцией Workspace для этого случая может быть:",
                    "updated": 1640764922490
                },
                {
                    "language": "TR",
                    "text": "Aksiyon ( Action ) işlevinizin bir parametresi olarak rootNodes dizisine doğrudan erişebildiğiniz için, bir Aksiyon ( Action ) 'dan Çalışma Alanı ( Workspace ) nesnesini kullanmak çok yaygın değildir. Bu kullanım durumu için kullanışlı Çalışma Alanı ( Workspace ) işlevi şöyle olabilir:",
                    "updated": 1673806616171
                },
                {
                    "language": "DE",
                    "text": "Es ist nicht üblich, das Workspace -Objekt von einer Action aus zu verwenden, da Sie als Parameter Ihrer Action-Funktion direkt auf das rootNodes Array zugreifen können. Eine nützliche Workspace-Funktion für diesen Anwendungsfall könnte sein:  ",
                    "updated": 1676497172345
                }
            ]
        },
        {
            "style": "List",
            "text": "getProjectsHeads",
            "updated": 1614931357766
        },
        {
            "style": "List",
            "text": "getHierarchyHeads",
            "updated": 1614931364737
        },
        {
            "style": "List",
            "text": "getHierarchyHeadsById",
            "updated": 1614931372173
        },
        {
            "style": "List",
            "text": "getHierarchyHeadByNodeType",
            "updated": 1614931380751
        },
        {
            "style": "List",
            "text": "getNodeThatIsOnFocus",
            "updated": 1614931389528
        },
        {
            "style": "List",
            "text": "getNodeByShortcutKey",
            "updated": 1614931399849
        },
        {
            "style": "List",
            "text": "getNodeById",
            "updated": 1614931406224
        }
    ]
}