{
    "type": "Data Mine Data Dependencies",
    "definition": {
        "text": "Data mine data dependencies are references established with entire data mines to facilitate establishing data dependencies with multiple datasets in the given data mine.",
        "translations": [
            {
                "language": "RU",
                "text": "Data Mine Data Dependencies - это ссылки, установленные для всех хранилищ данных, чтобы облегчить установление зависимостей данных с несколькими наборами данных в данном хранилище данных.",
                "updated": 1638730257267
            },
            {
                "language": "TR",
                "text": "Veri madeni veri bağımlılıkları, belirli bir veri madenindeki birden fazla veri kümesiyle veri bağımlılıkları kurmayı kolaylaştırmak için tüm veri madenleriyle kurulan referanslardır.",
                "updated": 1654391650689
            },
            {
                "language": "DE",
                "text": "Data-Mine-Datenabhängigkeiten sind Referenzen, die mit ganzen Data-Mines hergestellt werden, um die Herstellung von Datenabhängigkeiten mit mehreren Datensätzen in der gegebenen Data Mine zu erleichtern.",
                "updated": 1708265571179
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The node may be used as an organizational device, simply to arrange bot data dependencies. However, the smart use of the node involves automating the deployment of multiple data dependencies and their references.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел может использоваться как организационное устройство, просто для упорядочивания зависимостей данных бота. Однако разумное использование узла включает автоматизацию развертывания множественных зависимостей данных и их ссылок.",
                    "updated": 1638730294227
                },
                {
                    "language": "TR",
                    "text": "Düğüm, sadece bot veri bağımlılıklarını düzenlemek için organizasyonel bir cihaz olarak kullanılabilir. Ancak düğümün akıllıca kullanımı, birden fazla veri bağımlılığının ve bunların referanslarının dağıtımının otomatikleştirilmesini içerir.",
                    "updated": 1654391656768,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Der Knoten kann als organisatorisches Hilfsmittel verwendet werden, um einfach Datenabhängigkeiten zu ordnen. Die intelligente Nutzung des Knotens beinhaltet jedoch die Automatisierung der Bereitstellung mehrerer Datenabhängigkeiten und ihrer Referenzen.",
                    "updated": 1708265571382,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Configuring Data Mine Data Dependencies",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Data Mine Data Dependencies",
                    "updated": 1638730306177
                },
                {
                    "language": "TR",
                    "text": "Veri Madeni Veri Bağımlılıklarını Yapılandırma",
                    "updated": 1654391662219,
                    "style": "Title"
                },
                {
                    "language": "DE",
                    "text": "Konfigurieren von Data-Mine-Datenabhängigkeiten",
                    "updated": 1708265571554,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Select Configure on the menu to access the configuration.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Выберите Configure в меню, чтобы получить доступ к конфигурации.",
                    "updated": 1638730337448
                },
                {
                    "language": "TR",
                    "text": "Yapılandırmaya erişmek için menüden Yapılandır'ı seçin.",
                    "updated": 1654391668139,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wählen Sie im Menü Konfigurieren, um auf die Konfiguration zuzugreifen.",
                    "updated": 1708265571695,
                    "style": "Text"
                }
            ]
        }
    ]
}