{
    "type": "Default Exchange",
    "definition": {
        "text": "The Default Exchange is the one referenced by the Exchange Data Tasks, Exchange Trading Tasks, and Exchange Learning Tasks nodes from which a certain Task descends. The Trading Bot Instance running under that Task will consider the referenced Crypto Exchange to be the Default Exchange for the said Task.",
        "updated": 1617616790868,
        "translations": [
            {
                "language": "RU",
                "text": "Default Exchange - это та биржа, на которую ссылаются узлы Exchange Data Tasks, Exchange Trading Tasks и Exchange Learning Tasks, от которых происходит определенная задача Task. Торговый бот Trading Bot Instance, работающий под этой задачей Task, будет рассматривать указанную криптобиржу (Crypto Exchange), как биржу по умолчанию (Default Exchange), для указанной задачи Task.",
                "updated": 1638282190948
            },
            {
                "language": "TR",
                "text": "Varsayılan Borsa, belirli bir Görevin ( Task ) indiği Borsa Veri Görevleri ( Exchange Data Tasks ), Borsa Alım Satım Görevleri ( Exchange Trading Tasks ) ve Borsa Öğrenme Görevleri ( Exchange Learning Tasks ) düğümleri tarafından referans verilen borsadır. Bu Görev ( Task ) altında çalışan Ticaret Botu Örneği ( Trading Bot Instance ), başvurulan Kripto Borsasını ( Crypto Exchange ) söz konusu Görev ( Task ) için Varsayılan Borsa olarak kabul edecektir.",
                "updated": 1671643762180
            },
            {
                "language": "DE",
                "text": "Die Standardbörse ist diejenige, auf die die Knoten der Exchange Data Tasks, Exchange Trading Tasks und Exchange Learning Tasks verweisen, von denen eine bestimmte Aufgabe abstammt. Die Handelsroboter-Instanz ( Trading Bot Instance) , die unter dieser Aufgabe läuft, betrachtet die referenzierte Kryptobörse ( Crypto Exchange ) als Standardbörse für die besagte Aufgabe.",
                "updated": 1696955463209
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode. Then you can use docs.save to save your changes and app.contribute to send it to the main repository.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования. Затем вы можете использовать docs.save для сохранения изменений и app.contribute для отправки их в основной репозиторий.",
                    "updated": 1638282222866
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek ve bu metni değiştirmek için sağ tıklayın ve Düzenle deyin. Yeni paragraflar yazmak için ENTER tuşuna basın. Düzenleme modundan çıkmak için ESC. Daha sonra değişikliklerinizi kaydetmek için docs.save ve ana depoya göndermek için app.contribute kullanabilirsiniz.",
                    "updated": 1654390953303,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen. Dann können Sie docs.save verwenden, um Ihre Änderungen zu speichern und app.contribute, um sie an das Haupt-Repository zu senden.",
                    "updated": 1696955463462,
                    "style": "Text"
                }
            ]
        }
    ]
}