{
    "topic": "Trading Logic",
    "pageNumber": "4",
    "type": "Accessing Trading System Definitions and Session Parameters",
    "definition": {
        "text": "The Trading System may access it's own definitions as well as Session Parameters from any Formula or Condition.",
        "updated": 1610217064031,
        "translations": [
            {
                "language": "RU",
                "text": "Торговая система может получить доступ к своим собственным определениям, а также к параметрам сессии Session Parameters из любой формулы Formula или условия Condition.",
                "updated": 1640094939978
            },
            {
                "language": "TR",
                "text": "Trading system, kendi tanımlarına ve Oturum Parametrelerine herhangi bir Formül veya Koşuldan erişebilir.",
                "updated": 1654004038404
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Trading System definitions and Trading Session Parameters are accessible from within conditions and formulas, pretty much like conditions and formulas may access the values of indicators, or the Trading Engine hierarchy.",
            "updated": 1610217113377,
            "translations": [
                {
                    "language": "RU",
                    "text": "Определения торговой системы и параметры торговой сессии Trading Session доступны из условий и формул, точно так же, как условия и формулы могут получить доступ к значениям индикаторов или иерархии Trading Engine.",
                    "updated": 1640095083242
                },
                {
                    "language": "TR",
                    "text": "Ticaret Sistemi (Trading System) tanımlarına ve İşlem Oturumu Parametrelerine (Trading Session Parameters), koşullar ve formüller gibi, göstergelerin değerlerine veya Ticaret Motoru hiyerarşisine erişebileceği gibi, koşullar ve formüller içindende erişilebilir.",
                    "updated": 1654004130909
                }
            ]
        },
        {
            "style": "Note",
            "text": "This is a technical feature mostly oriented to developers. Practical use cases are few for less technically oriented individuals.",
            "updated": 1610217120684,
            "translations": [
                {
                    "language": "RU",
                    "text": "Это техническая функция, ориентированная в основном на разработчиков. Практические случаи использования для менее технически ориентированных людей немногочисленны.",
                    "updated": 1640095107277
                },
                {
                    "language": "TR",
                    "text": "Bu, çoğunlukla geliştiricilere yönelik teknik bir özelliktir. Pratik kullanım durumları daha az teknik yönelimli bireyler için zordur.",
                    "updated": 1654004176725
                }
            ]
        },
        {
            "style": "Title",
            "text": "Syntax",
            "translations": [
                {
                    "language": "RU",
                    "text": "Синтаксис",
                    "updated": 1640095114292
                },
                {
                    "language": "TR",
                    "text": "Sözdizimi",
                    "updated": 1654004183445
                }
            ]
        },
        {
            "style": "Text",
            "text": "To access a trading system definition, follow the path given by the trading system structure. For example, to access a condition in the take position event, use:",
            "updated": 1610217151294,
            "translations": [
                {
                    "language": "RU",
                    "text": "Чтобы получить доступ к определению торговой системы, следуйте пути, указанному в структуре торговой системы. Например, чтобы получить доступ к условию в событии занятия позиции, используйте:",
                    "updated": 1640095153050
                },
                {
                    "language": "TR",
                    "text": "Bir ticaret sistemi tanımına erişmek için ticaret sistemi yapısı tarafından verilen yolu izleyin. Örneğin, pozisyon alma olayındaki bir koşula erişmek için şunu kullanın:",
                    "updated": 1654004209826
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "tradingSystem.tradingStrategies[i].triggerStage.takePositionEvent.situations[n].conditions[m].code"
        },
        {
            "style": "Text",
            "text": "To access a trading session parameter, use the syntax starting with sessionParameters followed by the name of the parameter, and the name of the specific parameter in the configuration. For example, to access the taker parameter in the fee structure, use:",
            "updated": 1610217182677,
            "translations": [
                {
                    "language": "RU",
                    "text": "Для доступа к параметру торговой сессии используйте синтаксис, начинающийся с sessionParameters, за которым следует название параметра и название конкретного параметра в конфигурации. Например, чтобы получить доступ к параметру taker в структуре комиссии, используйте:",
                    "updated": 1640095180389
                },
                {
                    "language": "TR",
                    "text": "Bir ticaret oturumu parametresine erişmek için, sessionParameters ile başlayan sözdizimini ve ardından parametrenin adını ve yapılandırmadaki belirli parametrenin adını kullanın. Örneğin, ücret yapısındaki taker parametresine erişmek için şunları kullanın:",
                    "updated": 1654004922587
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "sessionParameters.feeStructure.config.taker",
            "updated": 1610217195909
        },
        {
            "style": "Title",
            "text": "Example",
            "translations": [
                {
                    "language": "RU",
                    "text": "Пример",
                    "updated": 1640095187176
                },
                {
                    "language": "TR",
                    "text": "Örnek",
                    "updated": 1654004930408
                }
            ]
        },
        {
            "style": "Text",
            "text": "Such a feature may be useful, for instance, to include such definitions or parameters on Telegram announcement messages, as in:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Такая возможность может быть полезной, например, для включения таких определений или параметров оповещения в Telegram, как в:",
                    "updated": 1640095323144
                },
                {
                    "language": "TR",
                    "text": "Böyle bir özellik, örneğin, Telegram duyuru mesajlarına aşağıdaki gibi tanımları veya parametreleri dahil etmek için yararlı olabilir:",
                    "updated": 1654004960615
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "\"The condition with the following code: \" + \ntradingSystem.tradingStrategies[tradingEngine.tradingCurrent.strategy.index.value].triggerStage.takePositionEvent.situations[0].conditions[0].code +\n\" triggered the take position event.\"",
            "updated": 1610217276846
        },
        {
            "style": "Text",
            "text": "Notice that...",
            "updated": 1610217314692,
            "translations": [
                {
                    "language": "RU",
                    "text": "Обратите внимание, что...",
                    "updated": 1640095345122
                },
                {
                    "language": "TR",
                    "text": "Dikkat edin...",
                    "updated": 1654004986091
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "[tradingEngine.tradingCurrent.strategy.index.value]"
        },
        {
            "style": "Text",
            "text": "... corresponds to the syntax deriving from the trading engine hierarchy.",
            "translations": [
                {
                    "language": "RU",
                    "text": "... соответствует синтаксису, вытекающему из иерархии Trading Engine.",
                    "updated": 1640095425809
                }
            ]
        }
    ]
}