{
    "topic": "Beta 11 Claims",
    "pageNumber": "1",
    "type": "Beta 11 Claim - Governance System",
    "definition": {
        "text": "Governance of the Superalgos Project is distributed among all members of the Superalgos Community willing to participate. The Governance System is built-in the Superalgos Platform, so participating is quite straightforward.",
        "updated": 1628249171408,
        "translations": [
            {
                "language": "ES",
                "text": "La gobernanza del proyecto de Superalgos Project es distribuída entre todos los miembros de la Superalgos Community que deseen participar. El Governance System ( sistema de gobernanza) se construye en la Superalgos Platform, por lo que es bastante sencillo participar.",
                "updated": 1636038871200,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Overview",
            "updated": 1628249311062
        },
        {
            "style": "Subtitle",
            "text": "Participate"
        },
        {
            "style": "Text",
            "text": "To participate in governance, community members leverage their Superalgos SA Token holdings, exerting influence proportional to their Token Power. The combined influence of all token holders participating in governance determines how the token is distributed upon each release.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Para participar en la gobernanza, los miembros de la comunidad, promedian su tentencia de  Superalgos SA Token, ejerciendo una influencia proporcional a su Token Power. La influencia combinada de todos los que tienen token participando en la gobernanza determina como el token se distribuye encada liberación.",
                    "updated": 1633533342249,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Success",
            "text": "Even if you have no tokens to start with, the Community will delegate Token Power to your profile so that you may get started!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Aún cuando no tenga tokens para comenzar, la comunidad delegará Token Power a su profile para que pueda comenzar!",
                    "updated": 1633533429717,
                    "style": "Success"
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Influence",
            "updated": 1628249266133
        },
        {
            "style": "List",
            "text": "What Positions, Features, Assets, or project-development activities, in general, are incentivized and how.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Qué Positions, Features, Assets, o actividades de desarrollo del proyecto, en general, son incentivados y cómo.",
                    "updated": 1633533525021,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Which Contributors are compensated for which Contributions.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Qué Contribuyentes son recompensados y por cuáles contribuciones.",
                    "updated": 1633533586785,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "What Programs are funded and how.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Qué Programs son creados y cómo.",
                    "updated": 1633533612445,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Text",
            "text": "Governance is designed as a flexible system that allows the Community to dynamically direct influence in arbitrary directions.",
            "translations": [
                {
                    "language": "ES",
                    "text": "La gobernanza está diseñada como un sistema flexible que  la comunidad dinámicamente dirija influencia en direcciones arbitrarias.",
                    "updated": 1633533779710,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Earn Tokens",
            "updated": 1628249282185
        },
        {
            "style": "Text",
            "text": "A Community engaged in governance is crucial for the development of the project, therefore participation is incentivized. In other words, you will earn Superalgos SA Tokens simply by taking part in the governance of Superalgos.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Una Community comprometida en la gobernanza es crucial para el desarrollo del proyecto, por lo tanto se incentiva la participación. En otras palabras, ganará Superalgos SA Tokens simplemente por ser parte de la gobernanza de Superalgos.",
                    "updated": 1633542770033,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "The system allows governance to evolve with the project. It also encourages permissionless innovation, as Contributors may propose new areas of development and rally the Community to incentivize expansion along new lines.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El sistema permite que la gobernanza evolucione con el proyecto. Tambien motiva a la innovación sin permiso, ya que los contribuyentes pueden proponer nuevas áreas de desarrollo y manejar a  la comunidad para que se motive para expandir nuevas lineas.",
                    "updated": 1633543011570,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Title",
            "text": "Included in this Claim"
        },
        {
            "style": "Text",
            "text": "The Governance System was built from scracth as a new Software Project within the Superalgos Codebase.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El sistema de gobierno fue construído sobre los bocetos de un nuevo proyecto de Software incluído en el código de base de Superalgos.",
                    "updated": 1633543179992,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Text",
            "text": "The following Governance Programs were developed at this time:",
            "translations": [
                {
                    "language": "ES",
                    "text": "Los siguientes programas de Governance Programs fueron desarrollados en este tiempo:",
                    "updated": 1633543245169,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Onboarding Programs"
        },
        {
            "style": "List",
            "text": "Airdrop Program"
        },
        {
            "style": "List",
            "text": "Github Program"
        },
        {
            "style": "Subtitle",
            "text": "Community Building Programs"
        },
        {
            "style": "List",
            "text": "Referral Program"
        },
        {
            "style": "List",
            "text": "Support Program"
        },
        {
            "style": "List",
            "text": "Mentroship Program"
        },
        {
            "style": "List",
            "text": "Influencer Program"
        },
        {
            "style": "Subtitle",
            "text": "Votes and Claims Programs"
        },
        {
            "style": "List",
            "text": "Votes Program"
        },
        {
            "style": "List",
            "text": "Claims Program"
        },
        {
            "style": "Subtitle",
            "text": "Financial Programs"
        },
        {
            "style": "List",
            "text": "Staking Program"
        },
        {
            "style": "List",
            "text": "Delegation Program"
        },
        {
            "style": "Subtitle",
            "text": "The following concepts were introduced"
        },
        {
            "style": "List",
            "text": "Pools"
        },
        {
            "style": "List",
            "text": "Assets"
        },
        {
            "style": "List",
            "text": "Features"
        },
        {
            "style": "List",
            "text": "Positions"
        }
    ]
}