{
    "type": "Unfreeze Structure of Nodes",
    "definition": {
        "text": "Clicking the unfreeze option unfreezes connections. If you click the option to unfreeze a node and the node does not change its status, it may be because a higher node in the hierarchy is still frozen.",
        "updated": 1610028960421,
        "translations": [
            {
                "language": "RU",
                "text": "При выборе параметра «Размораживание» соединения размораживаются. Если вы щелкнете по опции разморозить узел и этот узел не изменит своего статуса, это может быть связано с тем, что более высокий узел в иерархии все еще заморожен.",
                "updated": 1638299985769
            },
            {
                "language": "TR",
                "text": "Dondurmayı çöz seçeneğine tıklandığında bağlantılar çözülür. Bir düğümün çözme seçeneğine tıkladığınızda düğümün durumu değişmiyorsa, bunun nedeni hiyerarşideki daha yüksek bir düğümün hala donmuş olması olabilir.",
                "updated": 1666869962320
            },
            {
                "language": "DE",
                "text": "Wenn Sie auf die Option zum Aufheben des Einfrierens klicken, wird das Einfrieren von Verbindungen aufgehoben. Wenn Sie auf die Option zum Aufheben der Fixierung eines Knotens klicken und der Knoten seinen Status nicht ändert, liegt das möglicherweise daran, dass ein höherer Knoten in der Hierarchie noch fixiert ist.",
                "updated": 1701012870837
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите Edit, чтобы войти в режим редактирования и изменить этот текст. ENTER, чтобы написать новые абзацы. ESC для выхода из режима редактирования.",
                    "updated": 1638299998130
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen.",
                    "updated": 1701012881361
                }
            ]
        }
    ]
}