{
    "topic": "TS Trading Session Errors",
    "pageNumber": "4",
    "type": "TS Trading Session Error - Time Frame Node Missing",
    "definition": {
        "text": "A Time Frame Node is expected and needed in order to run a Trading Session.",
        "updated": 1611331109699,
        "translations": [
            {
                "language": "RU",
                "text": "Узел Time Frame необходим и ожидается для проведения торговой сессии.",
                "updated": 1645628227419
            },
            {
                "language": "TR",
                "text": "Özet: Bir Ticaret Oturumu ( Trading Session ) yürütmek için bir Zaman Çerçevesi ( Time Frame ) Düğümü beklenir ve gereklidir.",
                "updated": 1647099792262
            },
            {
                "language": "DE",
                "text": "Ein Time Frame Node wird erwartet und benötigt, um eine Trading Session durchzuführen.",
                "updated": 1701115943524
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "Add a Time Frame Node at the Trading Parameters Node where this error popped up, check it's config and try running the Trading Session again.",
            "updated": 1611331091819,
            "translations": [
                {
                    "language": "RU",
                    "text": "Добавьте узел Time Frame в узел Trading Parameters, где возникла эта ошибка, проверьте его конфигурацию и попробуйте запустить торговую сессию снова.",
                    "updated": 1645628241421
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bu hatanın ortaya çıktığı Ticaret Parametreleri ( Trading Parameters ) Düğümünde bir Zaman Çerçevesi ( Time Frame ) Düğümü ekleyin, yapılandırmasını kontrol edin ve Ticaret Oturumunu ( Trading Session ) yeniden çalıştırmayı deneyin.",
                    "updated": 1647099896252
                },
                {
                    "language": "DE",
                    "text": "Fügen Sie einen Zeitrahmenknoten (Time Frame Node) an dem Knoten mit den Handelsparametern (Trading Parameters Node) hinzu, an dem dieser Fehler auftrat, überprüfen Sie dessen Konfiguration und versuchen Sie, die Handelssitzung (Trading Session) erneut auszuführen.",
                    "updated": 1701116021206
                }
            ]
        }
    ]
}