{
    "topic": "TS Trading Session Errors",
    "pageNumber": "11",
    "type": "TS Trading Session Error - Exchange Account Key Node Missing",
    "definition": {
        "text": "An Exchange Account Key Node is expected and needed in order to run a Live Trading Session or an Forward Testing Session.",
        "updated": 1611392704049,
        "translations": [
            {
                "language": "RU",
                "text": "Узел Exchange Account Key Node ожидается и необходим для запуска реальной торговой сессии или сессии форвардного тестирования.",
                "updated": 1645628595249
            },
            {
                "language": "TR",
                "text": "Özet: Canlı Ticaret Oturumu ( Live Trading Session ) veya İleri Test Oturumu ( Forward Testing Session ) çalıştırmak için bir Exchange Hesabı Anahtar ( Exchange Account Key ) Düğümü beklenir ve gereklidir.",
                "updated": 1647101306321
            },
            {
                "language": "DE",
                "text": "Ein Exchange Account Key Node wird erwartet und benötigt, um eine Live Trading Session oder eine Forward Testing Session durchzuführen.",
                "updated": 1701116877449
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "From the Key Reference Node where this error popped up, you need to reference an Account Exchange Key holding your keys to access your account at the Exchange.",
            "updated": 1611392779124,
            "translations": [
                {
                    "language": "RU",
                    "text": "Из узла Key Reference Node, где появилась эта ошибка, вам нужно сослаться на Account Exchange Key, содержащий ваши ключи для доступа к вашей учетной записи на бирже.",
                    "updated": 1645628605637
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bu hatanın ortaya çıktığı Anahtar Referans Düğümünden ( Key Reference Node ), Exchange'deki hesabınıza erişmek için anahtarlarınızı tutan bir Hesap Değişim Anahtarına başvurmanız gerekir.",
                    "updated": 1647101364705
                },
                {
                    "language": "DE",
                    "text": "Vom Schlüsselreferenzknoten (Key Reference Node) aus, bei dem dieser Fehler auftrat, müssen Sie auf einen Kontoaustauschschlüssel (Account Exchange Key holding) verweisen, der Ihre Schlüssel enthält, um auf Ihr Konto bei der Börse zuzugreifen.",
                    "updated": 1701116916588
                }
            ]
        }
    ]
}