{
    "topic": "TS Trading Session Errors",
    "pageNumber": "7",
    "type": "TS Trading Session Error - Session Base Asset Node Missing",
    "definition": {
        "text": "A Session Base Asset Node is expected and needed in order to run a Trading Session.",
        "updated": 1611331205570,
        "translations": [
            {
                "language": "RU",
                "text": "Узел Session Base Asset ожидается и необходим для проведения торговой сессии.",
                "updated": 1645628409618
            },
            {
                "language": "TR",
                "text": "Özet: Bir Ticaret Oturumu ( Trading Session ) yürütmek için bir Oturum Temel Varlık Düğümü ( Session Base Asset Node  ) beklenir ve gereklidir.",
                "updated": 1647100424785
            },
            {
                "language": "DE",
                "text": "Ein Session Base Asset Node wird erwartet und benötigt, um eine Trading Session durchzuführen.",
                "updated": 1701116502636
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "Add a Session Base Asset Node at the Trading Parameters Node where this error popped up, check it's config and try running the Trading Session again.",
            "updated": 1611331221697,
            "translations": [
                {
                    "language": "RU",
                    "text": "Добавьте узел Session Base Asset в узел Trading Parameters, где возникла эта ошибка, проверьте его конфигурацию и попробуйте запустить торговую сессию снова.",
                    "updated": 1645628423003
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bu hatanın ortaya çıktığı Ticaret Parametreleri Düğümünde ( Trading Parameters Node ) bir Oturum Temel Varlık Düğümü ( Session Base Asset Node ) ekleyin, yapılandırmasını kontrol edin ve Ticaret Oturumunu ( Trading Session ) yeniden çalıştırmayı deneyin.",
                    "updated": 1647100536555
                },
                {
                    "language": "DE",
                    "text": "Fügen Sie einen Session Base Asset -Knoten (Session Base Asset Node) an dem Handelsparameter-Knoten (Trading Parameters Node) hinzu, an dem der Fehler auftrat, überprüfen Sie seine Konfiguration und versuchen Sie, die Handelssitzung (Trading Session) erneut auszuführen.",
                    "updated": 1701116610588
                }
            ]
        }
    ]
}