{
    "topic": "TS Trading Session Errors",
    "pageNumber": "8",
    "type": "TS Trading Session Error - Session Quoted Asset Node Missing",
    "definition": {
        "text": "A Session Quoted Asset Node is expected and needed in order to run a Trading Session.",
        "updated": 1611331335567,
        "translations": [
            {
                "language": "RU",
                "text": "Для проведения торговой сессии ожидается и необходим узел Session Quoted Asset.",
                "updated": 1645628444695
            },
            {
                "language": "TR",
                "text": "Özet: Bir Ticaret Oturumu ( Trading Session ) yürütmek için bir Oturum Koteli Varlık Düğümü ( Session Quoted Asset Node ) beklenir ve gereklidir.",
                "updated": 1647100605752
            },
            {
                "language": "DE",
                "text": "Ein Session Quoted Asset Node wird erwartet und benötigt, um eine Trading Session durchzuführen.",
                "updated": 1701116649868
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "Add a Session Quoted Asset Node at the Trading Parameters Node where this error popped up, check it's config and try running the Trading Session again.",
            "updated": 1611331377674,
            "translations": [
                {
                    "language": "RU",
                    "text": "Добавьте узел Session Quoted Asset в узел Trading Parameters, где возникла эта ошибка, проверьте его конфигурацию и попробуйте запустить торговую сессию снова.",
                    "updated": 1645628465093
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bu hatanın ortaya çıktığı Ticaret Parametreleri Düğümünde bir Oturum Koteli Varlık Düğümü ( Session Quoted Asset Node ) ekleyin, yapılandırmasını kontrol edin ve Ticaret Oturumunu ( Trading Session ) yeniden çalıştırmayı deneyin.",
                    "updated": 1647100690468
                },
                {
                    "language": "DE",
                    "text": "Fügen Sie einen Session Quoted Asset Node an dem Trading Parameters Node hinzu, an dem der Fehler auftrat, überprüfen Sie dessen Konfiguration und versuchen Sie, die Trading Session erneut auszuführen.",
                    "updated": 1701116679373
                }
            ]
        }
    ]
}