{
    "topic": "TS Trading Session Errors",
    "pageNumber": "3",
    "type": "TS Trading Session Error - Invalid Final Datetime Property Value",
    "definition": {
        "text": "The finalDatetime property configured at the Time Range node is not recognized as a valid Javascript Datetime.",
        "updated": 1611323471271,
        "translations": [
            {
                "language": "RU",
                "text": "Свойство finalDatetime, настроенное в узле Time Range, не распознается как действительное Javascript Datetime.",
                "updated": 1645628132539
            },
            {
                "language": "TR",
                "text": "Özet: Zaman Aralığı ( Time Range ) düğümünde yapılandırılan finalDatetime özelliği, geçerli bir Javascript Datetime olarak tanınmıyor.",
                "updated": 1647097344633
            },
            {
                "language": "DE",
                "text": "Die Eigenschaft finalDatetime, die am Knoten Zeitbereich (Time Range) konfiguriert ist, wird nicht als gültige Javascript Datetime erkannt.",
                "updated": 1701115874330
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The validation of sessionParameters.timeRange.config.finalDatetime did not pass, and therefore the Trading Session can not run.",
            "updated": 1611323500247,
            "translations": [
                {
                    "language": "RU",
                    "text": "Проверка sessionParameters.timeRange.config.finalDatetime не прошла, и поэтому торговая сессия не может быть запущена.",
                    "updated": 1645628148268
                },
                {
                    "language": "TR",
                    "text": "SessionParameters.timeRange.config.finalDatetime doğrulaması geçemedi ve bu nedenle Ticaret Oturumu ( Trading Session ) çalışamıyor.",
                    "updated": 1647097479848
                },
                {
                    "language": "DE",
                    "text": "Die Validierung von sessionParameters.timeRange.config.finalDatetime hat nicht bestanden, und daher kann die Trading Session nicht ausgeführt werden.",
                    "updated": 1701115894173
                }
            ]
        },
        {
            "style": "Success",
            "text": "Check Node JS Javascript docs to learn how to correctly express a datetime value.",
            "updated": 1611323848427,
            "translations": [
                {
                    "language": "RU",
                    "text": "Обратитесь к документации Node JS Javascript, чтобы узнать, как правильно выразить значение datetime.",
                    "updated": 1645628155083
                },
                {
                    "language": "TR",
                    "text": "Tip: İpucu: Bir tarih saat değerinin nasıl doğru şekilde ifade edileceğini öğrenmek için Node JS Javascript belgelerine bakın.",
                    "updated": 1647097512815
                },
                {
                    "language": "DE",
                    "text": "In den Node JS Javascript-Dokumenten erfahren Sie, wie Sie einen Datetime-Wert korrekt ausdrücken.",
                    "updated": 1701115915004
                }
            ]
        },
        {
            "style": "Title",
            "text": "Current Value",
            "translations": [
                {
                    "language": "RU",
                    "text": "Текущее значение",
                    "updated": 1645628200881
                },
                {
                    "language": "TR",
                    "text": "Mevcut değer",
                    "updated": 1647097522349
                },
                {
                    "language": "DE",
                    "text": "Aktueller Wert",
                    "updated": 1701115919101
                }
            ]
        },
        {
            "style": "Text",
            "text": "The property at the moment has the following value. Note that a value will be shown below only if you received this error, not when you navigate to this error page via other means.",
            "updated": 1611335188490,
            "translations": [
                {
                    "language": "RU",
                    "text": "На данный момент свойство имеет следующее значение. Обратите внимание, что значение будет показано ниже только в том случае, если вы получили эту ошибку, а не при переходе на эту страницу ошибки другими способами.",
                    "updated": 1645628190460
                },
                {
                    "language": "TR",
                    "text": "Şu andaki özellik aşağıdaki değere sahiptir. Aşağıda, başka yollarla bu hata sayfasına gittiğinizde değil, yalnızca bu hatayı aldığınızda bir değer gösterileceğini unutmayın.",
                    "updated": 1647097533019
                },
                {
                    "language": "DE",
                    "text": "Die Eigenschaft hat im Moment den folgenden Wert. Beachten Sie, dass der Wert unten nur angezeigt wird, wenn Sie diesen Fehler erhalten haben, nicht aber, wenn Sie diese Fehlerseite auf anderem Wege aufrufen.",
                    "updated": 1701115926504
                }
            ]
        },
        {
            "style": "Placeholder",
            "text": "currentValue"
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}