{
    "topic": "TS Trading Session Errors",
    "pageNumber": "6",
    "type": "TS Trading Session Error - Invalid Label Property Value",
    "definition": {
        "text": "This property expects you to define the Time Frame in which the Trading Session is going to run. The current value assigned to the property is not recognized as a valid value.",
        "updated": 1611333049475,
        "translations": [
            {
                "language": "RU",
                "text": "Это свойство позволяет определить таймфрейм, на котором будет работать торговая сессия. Текущее значение, присвоенное свойству, не распознается как допустимое.",
                "updated": 1645628346161
            },
            {
                "language": "TR",
                "text": "Özet: Bu özellik, Ticaret Oturumunun ( Trading Session ) yürütüleceği Zaman Çerçevesini ( Time Frame  ) tanımlamanızı bekler. Özelliğe atanan mevcut değer, geçerli bir değer olarak tanınmadı.",
                "updated": 1647100143421
            },
            {
                "language": "DE",
                "text": "Diese Eigenschaft erwartet, dass Sie den Zeitrahmen (Time Frame) festlegen, in dem die Handelssitzung (Trading Session) ablaufen soll. Der der Eigenschaft zugewiesene aktuelle Wert wird nicht als gültiger Wert anerkannt.",
                "updated": 1701116445507
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "The value you currently have is invalid. You need to change it and run the Trading Session again.",
            "updated": 1611333073771,
            "translations": [
                {
                    "language": "RU",
                    "text": "Значение, которое вы сейчас имеете, недействительно. Вам необходимо изменить его и снова запустить торговую сессию.",
                    "updated": 1645628356869
                },
                {
                    "language": "TR",
                    "text": "İpucu: Şu anda sahip olduğunuz değer geçersiz. Bunu değiştirmeniz ve Ticaret Oturumunu yeniden çalıştırmanız gerekir.",
                    "updated": 1647100182097
                },
                {
                    "language": "DE",
                    "text": "Der aktuell eingestellte Wert ist ungültig. Sie müssen ihn ändern und die Trading Session erneut durchführen.",
                    "updated": 1701116458379
                }
            ]
        },
        {
            "style": "Title",
            "text": "Current Value",
            "translations": [
                {
                    "language": "RU",
                    "text": "Текущее значение",
                    "updated": 1645628363172
                },
                {
                    "language": "TR",
                    "text": "Mevcut değer",
                    "updated": 1647100299028
                },
                {
                    "language": "DE",
                    "text": "Aktueller Wert",
                    "updated": 1701116464659
                }
            ]
        },
        {
            "style": "Text",
            "text": "The property at the moment has the following value. Note that a value will be shown below only if you received this error, not when you navigate to this error page via other means.",
            "updated": 1611335162269,
            "translations": [
                {
                    "language": "RU",
                    "text": "На данный момент свойство имеет следующее значение. Обратите внимание, что значение будет показано ниже только в том случае, если вы получили эту ошибку, а не при переходе на эту страницу ошибки другими способами.",
                    "updated": 1645628373471
                },
                {
                    "language": "TR",
                    "text": "Şu anda mülk aşağıdaki değere sahiptir. Aşağıda, başka yollarla bu hata sayfasına gittiğinizde değil, yalnızca bu hatayı aldıysanız bir değerin gösterileceğini unutmayın.",
                    "updated": 1647100304986
                },
                {
                    "language": "DE",
                    "text": "Die Eigenschaft hat im Moment den folgenden Wert. Beachten Sie, dass der Wert unten nur angezeigt wird, wenn Sie diesen Fehler erhalten haben, nicht aber, wenn Sie diese Fehlerseite auf anderem Wege aufrufen.",
                    "updated": 1701116473652
                }
            ]
        },
        {
            "style": "Placeholder",
            "text": "currentValue"
        },
        {
            "style": "Title",
            "text": "Possible Values",
            "translations": [
                {
                    "language": "RU",
                    "text": "Возможные значения",
                    "updated": 1645628383567
                },
                {
                    "language": "TR",
                    "text": "Muhtemel Değerler",
                    "updated": 1647100321983
                },
                {
                    "language": "DE",
                    "text": "Mögliche Werte",
                    "updated": 1701116480853
                }
            ]
        },
        {
            "style": "Json",
            "text": "        \"24-hs\",\n        \"12-hs\",\n        \"08-hs\",\n        \"06-hs\",\n        \"04-hs\",\n        \"03-hs\",\n        \"02-hs\",\n        \"01-hs\"\n        \"45-min\",\n        \"40-min\",\n        \"30-min\",\n        \"20-min\",\n        \"15-min\",\n        \"10-min\",\n        \"05-min\",\n        \"04-min\",\n        \"03-min\",\n        \"02-min\",\n        \"01-min\"",
            "updated": 1611332924603
        }
    ]
}