{
    "topic": "Gov Commands Messages",
    "pageNumber": "2",
    "type": "Gov Message - Processing Pull Requests",
    "definition": {
        "text": "Hold on while this process checks all the open PRs at the Superalgos repository at GitHub.com and merges all the ones that can be merged according to the PRs Processing Rules. You will get a new message when the operation is complete.",
        "updated": 1611002766659,
        "translations": [
            {
                "language": "DE",
                "text": "You will get a new message when the operation is complete.\nZusammenfassung: Warten Sie, während dieser Prozess alle offenen PRs im Superalgos-Repository auf GitHub.com überprüft und alle zusammenführt, die gemäß den PRs-Verarbeitungsregeln zusammengeführt werden können. Sie werden eine neue Nachricht erhalten, wenn der Vorgang abgeschlossen ist.",
                "updated": 1700772664714
            },
            {
                "language": "RU",
                "text": "Подождите, пока этот процесс проверит все открытые PR в репозитории Superalgos на GitHub.com и объединит все те, которые могут быть объединены в соответствии с Правилами обработки PR. Вы получите новое сообщение, когда операция будет завершена.",
                "updated": 1645626878766
            },
            {
                "language": "TR",
                "text": "Özet: Bu işlem, GitHub.com'daki Superalgos deposundaki tüm açık PR'leri kontrol ederken ve PR'lerin İşleme Kurallarına göre birleştirilebileceklerin hepsini birleştirirken bekleyin. İşlem tamamlandığında yeni bir mesaj alacaksınız.",
                "updated": 1646741090208
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "What's next?",
            "updated": 1609940971059,
            "translations": [
                {
                    "language": "DE",
                    "text": "Was kommt als Nächstes?",
                    "updated": 1700772691175
                },
                {
                    "language": "RU",
                    "text": "Что дальше?",
                    "updated": 1645626884105
                },
                {
                    "language": "TR",
                    "text": "Sıradaki Ne?",
                    "updated": 1646741122544
                }
            ]
        },
        {
            "style": "Text",
            "text": "No further action from you is required. In a few seconds / minutes you should be able to see the result of this process.",
            "updated": 1611128895749,
            "translations": [
                {
                    "language": "DE",
                    "text": "Sie brauchen nichts weiter zu tun. In wenigen Sekunden/Minuten sollten Sie das Ergebnis dieses Vorgangs sehen können.",
                    "updated": 1700772705400
                },
                {
                    "language": "RU",
                    "text": "От вас не требуется никаких дополнительных действий. Через несколько секунд/минут вы сможете увидеть результат этого процесса.",
                    "updated": 1645626893705
                },
                {
                    "language": "TR",
                    "text": "Sizden başka bir işlem yapmanız gerekmez. Birkaç saniye/dakika içinde bu işlemin sonucunu görebilmelisiniz.",
                    "updated": 1646741125911
                }
            ]
        }
    ]
}