{
    "type": "UI",
    "definition": {
        "text": "UI is an abbreviation for User Interface, which refers to the operation screen and operation method of the software. In Superalgos the UI is a Web App that runs on an Internet Browser.",
        "updated": 1622192912866,
        "translations": [
            {
                "language": "ES",
                "text": "UI es una abreviatura de \"Interfaz de usuario\" (user Interface), que se refiere a la pantalla de operación y al método de operación del software. En Superalgos, el UI es una aplicación web que se ejecuta en un navegador de Internet.",
                "updated": 1624282520607,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "UI - это аббревиатура пользовательского интерфейса, которая относится к экрану управления и способу работы программного обеспечения. В Superalgos пользовательский интерфейс представляет собой веб-приложение, которое запускается в Интернет-браузере.",
                "updated": 1635580805809
            },
            {
                "language": "TR",
                "text": "UI, yazılımın çalışma ekranı ve çalışma yöntemini ifade eden Kullanıcı Arayüzü'nün kısaltmasıdır ve internet tarayıcısında çalışan bir web Uygulamasıdır.",
                "updated": 1639119430661
            },
            {
                "language": "DE",
                "text": "UI ist eine Abkürzung für User Interface, was sich auf die Bedienoberfläche und die Arbeitsweise der Software bezieht. In Superalgos ist die UI eine Web-App, die auf einem Internet-Browser läuft.",
                "updated": 1701012728080
            },
            {
                "language": "PT",
                "text": "UI é uma abreviação para Interface do Utilizador, que se refere ao ecrã de trabalho e ao método de utilização do software. No Superalgos, a UI é uma Aplicação Web que é executada num Navegador de Internet, preferencialmente o Chrome e Safari.",
                "updated": 1711481837076
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and Edit to enter edit mode and change this text. ENTER to write new paragraphs. ESC to exit edit mode.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste auf \"Bearbeiten\", um in den Bearbeitungsmodus zu gelangen und diesen Text zu ändern. ENTER, um neue Absätze zu schreiben. ESC, um den Bearbeitungsmodus zu verlassen.",
                    "updated": 1701012743944
                },
                {
                    "language": "PT",
                    "text": "Para entrar no modo de edição e alterar este texto, clique com o botão direito do rato e selecione \"Editar\". Pressione ENTER para escrever novos parágrafos e ESC para sair do modo de edição.",
                    "updated": 1711481892199
                }
            ]
        }
    ]
}