{
    "type": "Verbose",
    "definition": {
        "text": "Verbose mode is an option available in many computer operating systems and programming languages that provides additional details as to what the computer is doing and what drivers and software it is loading during startup or in programming it would produce detailed output for diagnostic purposes thus makes a program easier to debug.",
        "updated": 1615895950551,
        "translations": [
            {
                "language": "RU",
                "text": "Режим Verbose - это опция, доступная во многих компьютерных операционных системах и языках программирования, которая предоставляет дополнительную информацию о том, что делает компьютер, какие драйверы и программное обеспечение загружаются во время запуска или программирования, что позволяет получить подробный вывод в диагностических целях и облегчает отладку программы.",
                "updated": 1645252678227
            },
            {
                "language": "TR",
                "text": "\nAyrıntılı mod, bilgisayarın ne yaptığı ve hangi sürücüleri ve yazılımları yüklediği hakkında ek ayrıntılar sağlayan birçok bilgisayar işletim sisteminde ve programlama dilinde bulunan bir seçenektir. hata ayıklamak daha kolaydır.",
                "updated": 1666694400316
            },
            {
                "language": "DE",
                "text": "Der Verbose-Modus ist eine Option, die in vielen Computer-Betriebssystemen und Programmiersprachen zur Verfügung steht und zusätzliche Details darüber liefert, was der Computer tut und welche Treiber und Software er beim Start oder bei der Programmierung lädt, so dass detaillierte Ausgaben zu Diagnosezwecken erzeugt werden, was die Fehlersuche in einem Programm erleichtert.",
                "updated": 1705144768127
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645252683006
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1666694333499
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1705144779087
                }
            ]
        }
    ]
}