{
    "tutorial": "Install a New Market",
    "pageNumber": 11,
    "type": "Tutorial Step - Set Up the Market 4",
    "definition": {
        "icon": {
            "name": "Market/market",
            "project": "Foundations"
        },
        "text": "Label the Market with the ticker names corresponding to the Market Base Asset and the Market Quoted Asset, just like the exchange listing. ",
        "updated": 1617212204904,
        "translations": [
            {
                "language": "ES",
                "text": "Etiqueta el Market con los nombres de ticker correspondientes a el Market Base Asset ay el Market Quoted Asset, al igual que la lista de exchange.",
                "updated": 1629247010585
            },
            {
                "language": "DE",
                "text": "Beschriften Sie den Market mit den Tickernamen, die dem Market Base Asset und dem Market Quoted Asset entsprechen, genau wie bei der Börsennotierung.",
                "updated": 1636093674049
            },
            {
                "language": "TR",
                "text": "Özet: Borsayı ( Market ), tıpkı hisse senedi listeleme için yaptığınız gibi, Borsa Temel Varlığına ( Market Base Asset ) ve Piyasa Kote Varlığına ( Market Quoted Asset ) karşılık gelen hisse senedi adlarıyla etiketleyin.",
                "updated": 1642149245712
            },
            {
                "language": "RU",
                "text": "Пометьте Market тикерными именами, соответствующими Market Base Asset и Market Quoted Asset, подобно биржевому листингу.",
                "updated": 1643090585605
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Note",
            "text": "For example: ETH/USDT.",
            "updated": 1617212210997,
            "translations": [
                {
                    "language": "ES",
                    "text": "Por ejemplo: ETH/USDT.",
                    "updated": 1629247028876
                },
                {
                    "language": "DE",
                    "text": "Zum Beispiel: ETH/USDT",
                    "updated": 1636093747607
                },
                {
                    "language": "TR",
                    "text": "Not: Not: Örneğin: ETH/USDT.",
                    "updated": 1642149266099
                },
                {
                    "language": "RU",
                    "text": "Например: ETH/USDT.",
                    "updated": 1643090594424
                }
            ]
        },
        {
            "style": "Success",
            "text": "Keeping a tidy Workspace with proper labels for significant nodes helps in managing large operations and administering complexity. These labels may be used by other nodes!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Manteniendo un ordenado Workspace con etiquetas adecuadas para nodos importantes, ayuda a gestionar grandes operaciones y a administrar la complejidad. ¡Estas etiquetas pueden ser utilizadas por otros nodos!",
                    "updated": 1629247073143
                },
                {
                    "language": "DE",
                    "text": "Ein aufgeräumter Workspace mit den richtigen Bezeichnungen für wichtige Knoten hilft bei der Verwaltung großer Vorgänge und der Beherrschung der Komplexität. Diese Bezeichnungen können von anderen Knoten verwendet werden!",
                    "updated": 1636093838222
                },
                {
                    "language": "TR",
                    "text": "İpucu: Önemli düğümler için uygun etiketlerle düzenli bir çalışma alanı ( Workspace ) sağlamak, büyük operasyonların yönetilmesine ve karmaşıklığın yönetilmesine yardımcı olur. Bu etiketler diğer düğümler tarafından kullanılabilir!",
                    "updated": 1642150737186
                },
                {
                    "language": "RU",
                    "text": "Поддержание опрятного рабочего пространства с соответствующими метками для значимых узлов помогает в управлении большими операциями и администрировании сложностей. Эти метки могут быть использованы другими узлами!",
                    "updated": 1643090610545
                }
            ]
        }
    ]
}
