{
    "tutorial": "Install a New Market",
    "pageNumber": 6,
    "type": "Tutorial Step - Add the Assets 3",
    "definition": {
        "icon": {
            "name": "Market/asset",
            "project": "Foundations"
        },
        "text": "Label the assets with the descriptive name of the coin or token, for ease of use. For example: Ether.",
        "translations": [
            {
                "language": "ES",
                "text": "Etiqueta los assets con el nombre descriptivo de la moneda o ficha, para facilitar su uso. Por ejemplo: Ether.",
                "updated": 1629163866099,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Beschriften Sie die Vermögenswerte mit dem beschreibenden Namen des Coins oder des Tokens, um die Verwendung zu erleichtern. Zum Beispiel: Ether.",
                "updated": 1635742793479
            },
            {
                "language": "TR",
                "text": "Özet: Varlıkları, kullanım kolaylığı için madeni paranın veya jetonun açıklayıcı adıyla etiketleyin. Örneğin: Eter.",
                "updated": 1642143792944
            },
            {
                "language": "RU",
                "text": "Пометьте активы описательным названием монеты или токена для удобства использования. Например: Ether.",
                "updated": 1643090384126
            },
            {
                "language": "NL",
                "text": "Label de token met de beschrijvende naam van de munt of token, voor gebruiksgemak. Bijvoorbeeld: ether.",
                "updated": 1676121120490
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "Step 3: Label Nodes",
            "translations": [
                {
                    "language": "ES",
                    "text": "Step 3: Etiqueta los nodos",
                    "updated": 1682426153403,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Schritt 3: Knoten beschriften",
                    "updated": 1635742900320
                },
                {
                    "language": "TR",
                    "text": "Adım: Düğümleri etiketleyin",
                    "updated": 1642143906796
                },
                {
                    "language": "RU",
                    "text": "Шаг 3: Маркировка узлов",
                    "updated": 1643090403296
                },
                {
                    "language": "NL",
                    "text": "Stap 3: Label de knooppunten",
                    "updated": 1676121141479
                }
            ]
        },
        {
            "style": "Success",
            "text": "Keeping a tidy Workspace with proper labels for significant nodes helps in managing large operations and administering complexity.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Mantener un espacio de trabajo ordenado con etiquetas adecuadas para nodos importantes ayuda a gestionar grandes operaciones y a administrar la complejidad.",
                    "updated": 1629163971957,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Ein aufgeräumter Workspace mit ordnungsgemäßen Bezeichnungen für wichtige Knoten hilft bei der Verwaltung umfangreicher Vorgänge und der Beherrschung der Komplexität.",
                    "updated": 1635742978205
                },
                {
                    "language": "TR",
                    "text": "İpucu: Anahtar düğümler için uygun etiketlere sahip düzenli bir çalışma alanı ( Workspace ), büyük operasyonların ve karmaşıklığın yönetilmesine yardımcı olur.",
                    "updated": 1642144011452
                },
                {
                    "language": "RU",
                    "text": "Поддержание опрятного рабочего пространства с соответствующими метками для значимых узлов помогает в управлении большими операциями и администрировании сложностей.",
                    "updated": 1643090419182
                },
                {
                    "language": "NL",
                    "text": "Een opgeruimde Workspace met de juiste labels voor belangrijke knooppunten helpt bij het beheren van grote bewerkingen en het beheren van complexiteit.",
                    "updated": 1676121164207
                }
            ]
        }
    ]
}