{
    "tutorial": "Install a New Market",
    "pageNumber": 18,
    "type": "Tutorial Topic - Charts Verification",
    "definition": {
        "icon": {
            "name": "Charting-Space/charting-space",
            "project": "Foundations"
        },
        "text": "Beyond the data structures set up in the Network hierarchy, the Install Market function also sets up charts matching the trading sessions created.",
        "translations": [
            {
                "language": "ES",
                "text": "Más allá de las estructuras de datos configuradas en la jerarquía de la Network, la función Install Market también configura gráficos que coinciden las sesiones de trading creadas.",
                "updated": 1629250291168
            },
            {
                "language": "DE",
                "text": "Neben den Datenstrukturen, die in der Netzwerkhierarchie eingerichtet werden, richtet die Funktion Market installieren auch Charts ein, die zu den erstellten Handelssitzungen passen.",
                "updated": 1636469963838
            },
            {
                "language": "TR",
                "text": "Özet: Ağ hiyerarşisinde yapılandırılan veri yapılarının ötesinde, Install Market işlevi, oluşturulan ticaret oturumlarıyla eşleşen çizelgeleri de yapılandırır.",
                "updated": 1642162166271
            },
            {
                "language": "RU",
                "text": "Помимо структур данных, установленных в иерархии Network, функция Install Market также устанавливает графики, соответствующие созданным торговым сессиям.",
                "updated": 1643091292185
            },
            {
                "language": "NL",
                "text": "Naast de gegevensstructuren die zijn ingesteld in de netwerkhiërarchie, stelt de Install Market functie ook de grafieken in, die overeenkomen met de gemaakte handelssessies.",
                "updated": 1676128399115
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "In the next few steps you will verify that the expected data structures were created successfully.",
            "translations": [
                {
                    "language": "ES",
                    "text": "En los siguientes pasos, comprobarás que las estructuras de datos esperadas se hayan creado correctamente.",
                    "updated": 1682428141280
                },
                {
                    "language": "DE",
                    "text": "In den nächsten Schritten werden Sie überprüfen, ob die erwarteten Datenstrukturen erfolgreich erstellt wurden.",
                    "updated": 1636470004914
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki adımlarda, beklenen veri yapılarının doğru şekilde oluşturulduğunu doğrulayın.",
                    "updated": 1642162214228
                },
                {
                    "language": "RU",
                    "text": "На следующих нескольких шагах вы убедитесь, что ожидаемые структуры данных были успешно созданы.",
                    "updated": 1643091300683
                },
                {
                    "language": "NL",
                    "text": "In de volgende paar stappen verifieer je of de verwachte datastructuren met succes zijn gemaakt.",
                    "updated": 1676128424371
                }
            ]
        },
        {
            "style": "Callout",
            "text": "The charts created allow working with each of the trading sessions independently.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Los gráficos creados permiten trabajar con las Trading Session de forma independiente.",
                    "updated": 1629250720714
                },
                {
                    "language": "DE",
                    "text": "Die erstellten Charts ermöglichen es, mit jeder der Handelssitzungen unabhängig zu arbeiten.",
                    "updated": 1636470034665
                },
                {
                    "language": "TR",
                    "text": "Oluşturulan çizelgeler, İşlem Oturumları ile bağımsız olarak çalışılmasına izin verir.",
                    "updated": 1642162360887
                },
                {
                    "language": "RU",
                    "text": "Созданные графики позволяют работать с каждой из торговых сессий независимо.",
                    "updated": 1643091308290
                },
                {
                    "language": "NL",
                    "text": "De gemaakte grafieken maken het mogelijk om onafhankelijk van elkaar met elk van de handelssessies te werken.",
                    "updated": 1676128450241
                }
            ]
        },
        {
            "style": "Success",
            "text": "Notice from the organization of the charts that Superalgos allows scaling up your operation to unlimited trading systems and charts.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Observa desde la organización de los gráficos que Superalgos permite escalar tu operación a gráficos y sistemas comerciales ilimitados.",
                    "updated": 1629250466323
                },
                {
                    "language": "DE",
                    "text": "Beachten Sie bei der Organisation der Charts, dass Superalgos die Skalierung Ihrer Operation auf eine unbegrenzte Anzahl von Handelssystemen und Charts ermöglicht.",
                    "updated": 1636470077906
                },
                {
                    "language": "TR",
                    "text": "İpucu: Superalgos'un operasyonunuzu sınırsız çizelgelere ve ticaret sistemlerine ölçeklendirmenize izin verdiği çizelgelerin düzenlenmesinden gözlemleyin.",
                    "updated": 1642162436008
                },
                {
                    "language": "RU",
                    "text": "Обратите внимание на организацию графиков, что Superalgos позволяет масштабировать вашу работу до неограниченного количества торговых систем и графиков.",
                    "updated": 1643091320255
                },
                {
                    "language": "NL",
                    "text": "Merk op dat door de manier van organiseren van de grafieken, Superalgos het mogelijk maakt om uw operatie op te schalen naar onbeperkte handelssystemen en grafieken.",
                    "updated": 1676128522100
                }
            ]
        }
    ]
}