{
    "tutorial": "Install a New Market",
    "pageNumber": 12,
    "type": "Tutorial Topic - Install the Market",
    "definition": {
        "icon": {
            "name": "Market/market",
            "project": "Foundations"
        },
        "text": "You finished the setup required to install the market! The rest is fully automated!",
        "updated": 1617212322242,
        "translations": [
            {
                "language": "ES",
                "text": "¡Terminaste la configuración requerida para instalar el mercado! ¡El resto está completamente automatizado!",
                "updated": 1629247436746
            },
            {
                "language": "DE",
                "text": "Sie haben die für die Installation des Marktes erforderliche Einrichtung abgeschlossen! Der Rest ist vollständig automatisiert!",
                "updated": 1636093926793
            },
            {
                "language": "TR",
                "text": "Özet: Marketi kurmak için gerekli konfigürasyonu tamamladınız! Gerisi tamamen otomatik!",
                "updated": 1642151003650
            },
            {
                "language": "RU",
                "text": "Вы завершили настройку, необходимую для установки рынка! Остальное полностью автоматизировано!",
                "updated": 1643090622827
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Click the Install Market button on the Market node you just finished setting up. Now that the Market is set up, installing it is just a click away.",
            "updated": 1617212281868,
            "translations": [
                {
                    "language": "ES",
                    "text": "Haz clic en el botón Install Market en el nodo Market que acabas de terminar de configurar. Ahora que el Market está configurado, instalarlo está a solo un clic de distancia.",
                    "updated": 1629247557848
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf die Schaltfläche Install Market auf dem Market Knoten, den Sie gerade eingerichtet haben. Jetzt, wo der Market eingerichtet ist, ist die Installation nur noch einen Klick entfernt.",
                    "updated": 1636094308147
                },
                {
                    "language": "TR",
                    "text": "Kurulumu yeni tamamladığınız Market düğümündeki Market'i (Install Market button) Yükle düğmesini tıklayın. Market kurulduğuna göre, yüklemek sadece bir tık uzağınızda.",
                    "updated": 1642151142341
                },
                {
                    "language": "RU",
                    "text": "Нажмите кнопку Install Market (Установить Маркет) на узле Market, который вы только что закончили настраивать. Теперь, когда рынок настроен, установить его можно одним щелчком мыши.",
                    "updated": 1643090651401
                }
            ]
        },
        {
            "style": "Note",
            "text": "The Install Market function sets up many data structures in the local Network Node and in the Charting Space. The next few steps in the tutorial will help you get familiar with the installation.",
            "translations": [
                {
                    "language": "ES",
                    "text": "La Install Market La función configura muchas estructuras de datos en el local Network Node y en el Charting Space. Los siguientes pasos del tutorial te ayudarán a familiarizarse con la instalación.",
                    "updated": 1629247622619
                },
                {
                    "language": "DE",
                    "text": "Die Funktion Install Market richtet viele Datenstrukturen im lokalen Netzwerk Node und im Charting Space ein. Die nächsten Schritte des Tutorials werden Ihnen helfen, sich mit der Installation vertraut zu machen.",
                    "updated": 1636094597272
                },
                {
                    "language": "TR",
                    "text": "İpucu: Borsayı Yükle işlevi( Install Market), yerel Ağ Düğümünde (local Network Node) ve Grafik Alanında (Charting Space) birçok veri yapısını yapılandırır. Aşağıdaki eğitim adımları, yüklemeye aşina olmanıza yardımcı olacaktır.",
                    "updated": 1642151362357
                },
                {
                    "language": "RU",
                    "text": "Функция Install Market устанавливает множество структур данных в локальном узле сети и в пространстве графиков. Следующие несколько шагов в учебнике помогут вам ознакомиться с установкой.",
                    "updated": 1643090676476
                }
            ]
        }
    ]
}
