{
    "tutorial": "Install a New Market",
    "pageNumber": 3,
    "type": "Tutorial Topic - Add the Assets",
    "definition": {
        "icon": {
            "name": "Market/asset",
            "project": "Foundations"
        },
        "text": "If the assets you wish to work with are not listed under Exchange Assets, you must add and configure them first.",
        "translations": [
            {
                "language": "ES",
                "text": "Si los activos con los que deseas trabajar no se enumeran en Activos de Exchange, primero debes agregarlos y configurarlos.",
                "updated": 1682427228985,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wenn die Vermögenswerte, mit denen Sie arbeiten möchten, nicht unter Exchange Assets aufgeführt sind, müssen Sie sie zunächst hinzufügen und konfigurieren.\n",
                "updated": 1635738895005
            },
            {
                "language": "TR",
                "text": "Özet: Çalışmak istediğiniz varlıklar Exchange Varlıkları ( Exchange Assets ) altında listelenmiyorsa, önce bunları ekleyip yapılandırmanız gerekir.",
                "updated": 1642085426458
            },
            {
                "language": "RU",
                "text": "Если активы, с которыми вы хотите работать, не перечислены в разделе Exchange Assets, вы должны сначала добавить и настроить их.",
                "updated": 1643090228970
            },
            {
                "language": "NL",
                "text": "Als de tokens waarmee u wilt werken niet worden vermeld onder Exchange Assets, moet u deze eerst toevoegen en configureren.",
                "updated": 1676120620240
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "In this section of the tutorial, you will learn to define which assets you wish to work with.",
            "updated": 1617210801606,
            "translations": [
                {
                    "language": "ES",
                    "text": "En esta sección del tutorial, aprenderás a definir con qué Assets deseas trabajar.",
                    "updated": 1682427238739,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "In diesem Abschnitt des Tutorials lernen Sie, wie Sie festlegen, mit welchen Vermögenswerte Sie arbeiten möchten.",
                    "updated": 1635739057875
                },
                {
                    "language": "TR",
                    "text": "Eğitimin bu bölümünde, hangi varlıklarla çalışmak istediğinizi tanımlamayı öğreneceksiniz.",
                    "updated": 1642085440738
                },
                {
                    "language": "RU",
                    "text": "В этом разделе учебника вы научитесь определять, с какими активами вы хотите работать.",
                    "updated": 1643090238384
                },
                {
                    "language": "NL",
                    "text": "In dit gedeelte van de zelfstudie leert u definiëren met welke middelen u wilt werken.",
                    "updated": 1676120641232
                }
            ]
        },
        {
            "style": "Success",
            "text": "Each exchange may list hundreds of assets, however, you will likely be interested in just a few. Some automated operations may feed on your definitions, so keeping them free of junk is always a good idea.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Cada Exchange puede enumerar cientos de assets, sin embargo, es probable que solo te interesen unos pocos. Algunas operaciones automatizadas pueden alimentarse de tus definiciones, por lo que mantenerlas libres de chatarra es siempre una buena idea.",
                    "updated": 1682427351252,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Jede Börse kann Hunderte von Vermögenswerten auflisten, aber Sie werden wahrscheinlich nur an einigen wenigen interessiert sein. Einige automatisierte Vorgänge können sich auf Ihre Definitionen stützen, daher ist es immer eine gute Idee, sie frei von Gerümpel zu halten.",
                    "updated": 1635739405026
                },
                {
                    "language": "TR",
                    "text": "İpucu: Her borsa yüzlerce varlık listeleyebilir, ancak yalnızca birkaçıyla ilgilenebilirsiniz. Bazı otomatik işlemler tanımlarınızı besleyebilir, bu nedenle onları diğerlerinden ayrı tutmak her zaman iyi bir fikirdir.",
                    "updated": 1642085528723
                },
                {
                    "language": "RU",
                    "text": "На каждой бирже могут быть представлены сотни активов, однако вас, скорее всего, будут интересовать лишь некоторые из них. Некоторые автоматизированные операции могут питаться вашими определениями, поэтому держать их свободными от мусора - всегда хорошая идея.",
                    "updated": 1643090267732
                },
                {
                    "language": "NL",
                    "text": "Elke beurs kan honderden tokens bevatten, maar u zult waarschijnlijk in slechts een paar geïnteresseerd zijn. Sommige geautomatiseerde bewerkingen kunnen uw definities voeden, dus het is altijd een goed idee om ze vrij van rommel te houden.",
                    "updated": 1676120704128
                }
            ]
        }
    ]
}