{
    "tutorial": "Install a New Market",
    "pageNumber": 21,
    "type": "Tutorial Topic - You Made It!",
    "definition": {
        "icon": {
            "name": "Tutorial/tutorial",
            "project": "Foundations"
        },
        "text": "Congratulations... you have reached the end of this tutorial!",
        "translations": [
            {
                "language": "ES",
                "text": "Felicitaciones ... ¡has llegado al final de este tutorial!",
                "updated": 1629251820232
            },
            {
                "language": "DE",
                "text": "Herzlichen Glückwunsch... Sie haben das Ende des Tutorials erreicht!",
                "updated": 1636470750188
            },
            {
                "language": "TR",
                "text": "Özet: Tebrikler... Bu eğitimin sonuna geldiniz!",
                "updated": 1642164236434
            },
            {
                "language": "RU",
                "text": "Поздравляем... вы дошли до конца этого руководства!",
                "updated": 1643091529294
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "You may revisit this tutorial at any point. If you select the Play option on the menu, you start right from the beginning. If you select the Resume option instead, you start where you last left, or where you last skipped a step.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Puedes volver a visitar este tutorial en cualquier momento. Si seleccionas el Play en el menú, comienza desde el principio. Si seleccionas el Resume en su lugar, comienzas donde lo dejaste por última vez o donde saltaste un paso por última vez.",
                    "updated": 1629251900929
                },
                {
                    "language": "DE",
                    "text": "Sie können dieses Lernprogramm jederzeit wieder aufrufen. Wenn Sie im Menü die Option Play wählen, beginnen Sie direkt am Anfang. Wenn Sie stattdessen die Option Resume wählen, beginnen Sie dort, wo Sie zuletzt aufgehört haben oder wo Sie zuletzt einen Schritt übersprungen haben.",
                    "updated": 1636470883959
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bu öğreticiyi istediğiniz zaman tekrar ziyaret edebilirsiniz. Menüden Oynat seçeneğini seçerseniz, en baştan başlarsınız. Bunun yerine Sürdür seçeneğini belirlerseniz, en son kaldığınız yerden veya en son atladığınız adım'dan başlarsınız.",
                    "updated": 1642164304986
                },
                {
                    "language": "RU",
                    "text": "Вы можете вернуться к этому уроку в любой момент. Если вы выберете в меню опцию Play, вы начнете с самого начала. Если вы выберете опцию Resume, то начнете с того места, где остановились в последний раз или пропустили шаг.",
                    "updated": 1643091555511
                }
            ]
        }
    ]
}
