{
    "tutorial": "Install a New Market",
    "pageNumber": 17,
    "type": "Tutorial Step - Network Verification 4",
    "definition": {
        "icon": {
            "name": "Data/data-storage",
            "project": "Foundations"
        },
        "text": "Verify that the Data Storage nodes for the corresponding Market were created successfully.",
        "translations": [
            {
                "language": "ES",
                "text": "Verifica que los nodo Data Storage para el Market correspondiente se crearon con éxito.",
                "updated": 1629249917009
            },
            {
                "language": "DE",
                "text": "Überprüfen Sie, ob die Datenspeicherknoten für den entsprechenden Market erfolgreich erstellt wurden.",
                "updated": 1636469629780
            },
            {
                "language": "TR",
                "text": "İlgili Borsa ( Market ) için Veri Depolama ( Data Storage ) düğümlerinin başarıyla oluşturulduğunu doğrulayın.",
                "updated": 1642160301351
            },
            {
                "language": "RU",
                "text": "Убедитесь, что узлы Data Storage для соответствующего Market были успешно созданы.",
                "updated": 1643091232090
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Look for the following data structures:",
            "translations": [
                {
                    "language": "ES",
                    "text": "Busque las siguientes estructuras de datos:",
                    "updated": 1629249952621
                },
                {
                    "language": "DE",
                    "text": "Suchen Sie nach den folgenden Datenstrukturen:",
                    "updated": 1636469658454
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki veri yapılarını bulun:",
                    "updated": 1642160677378
                },
                {
                    "language": "RU",
                    "text": "Найдите следующие структуры данных:",
                    "updated": 1643091238108
                }
            ]
        },
        {
            "style": "List",
            "text": "A Market Data Products node under Data Mines Data, with a Data Mine Products node for each Data Mine in the workspace.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Un nodo Market Data Products  bajo Data Mines Data, con un nodo Data Mine Products para cada Data Mine en el espacio de trabajo.",
                    "updated": 1629250030704
                },
                {
                    "language": "DE",
                    "text": "Ein Knoten Market Data Products unter Data Mines Data, mit einem Knoten Data Mine Products  für jede Data Mine  im Arbeitsbereich.",
                    "updated": 1636469847598
                },
                {
                    "language": "TR",
                    "text": "Çalışma alanındaki her Veri Madeni ( Data mine ) için bir Veri Madeni Ürünleri ( Data mine Products ) düğümü ile Veri Madeni Verileri ( Data Mines Data ) altındaki bir Borsa Veri Ürünleri ( Market Data Products )  düğümü.",
                    "updated": 1642161841489
                },
                {
                    "language": "RU",
                    "text": "Узел Market Data Products в разделе Data Mines Data, с узлом Data Mine Products для каждого Data Mine в рабочем пространстве.",
                    "updated": 1643091251687
                }
            ]
        },
        {
            "style": "List",
            "text": "A Market Trading Products node under Trading Mines Data, with a Trading Session Reference for each trading session in the testing and production environments.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Un nodo Market Trading Products bajo Trading Mines Data, con un Trading Session Reference para cada sesión de trading en los entornos de prueba y producción.",
                    "updated": 1629250105046
                },
                {
                    "language": "DE",
                    "text": "Ein Knoten Market Trading Products unter Trading Mines Data, mit einer Trading Session Reference für jede Handelssitzung in den Test- und Produktionsumgebungen.",
                    "updated": 1636469864913
                },
                {
                    "language": "TR",
                    "text": "Test ve üretim ortamlarındaki her bir ticaret oturumu için bir Ticaret Oturumu Referansı ( Trading Session Reference ) ile Ticaret Maden Verileri ( Trading Mines Data ) altındaki bir Borsa Ticaret Ürünleri ( Market Trading Products ) düğümü.",
                    "updated": 1642162046060
                },
                {
                    "language": "RU",
                    "text": "Узел Market Trading Products в разделе Trading Mines Data с ссылкой на торговую сессию для каждой торговой сессии в тестовых и производственных окружениях.",
                    "updated": 1643091279396
                }
            ]
        }
    ]
}
