{
    "tutorial": "Install a New Market",
    "pageNumber": 9,
    "type": "Tutorial Step - Set Up the Market 2",
    "definition": {
        "icon": {
            "name": "Market/asset",
            "project": "Foundations"
        },
        "text": "Establish a reference from the Market Base Asset node in the Market you just defined to the corresponding Asset node defined under Exchange Assets.",
        "translations": [
            {
                "language": "ES",
                "text": "Establecer una referencia de el nodo Market Base Asset en el Market que acabas de definir a el correspondiente nodo Asset definido bajo Exchange Assets.",
                "updated": 1629165785229,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Stellen Sie einen Verweis vom Knoten Market Base Asset im soeben definierten Market auf den entsprechenden Asset Knoten unter Exchange Assets her.",
                "updated": 1635832090712
            },
            {
                "language": "TR",
                "text": "Özet: Az önce tanımladığınız Market'teki Market Base Asset düğümünü, Exchange Assets altındaki ilgili Varlık düğümüne yönlendirin.",
                "updated": 1642147781613
            },
            {
                "language": "RU",
                "text": "Установите ссылку от узла Market Base Asset на только что определенном рынке к соответствующему узлу Asset, определенному в разделе Exchange Assets.",
                "updated": 1643090538100
            },
            {
                "language": "NL",
                "text": "Breng een referentie tot stand van het Market Base Asset knooppunt in de markt die u zojuist hebt gedefinieerd naar het corresponderende Asset knooppunt dat is gedefinieerd onder Exchange Assets.",
                "updated": 1676124594557
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Note",
            "text": "If you are not familiar with establishing references, please read about the topic in the documentation.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si no estás familiarizado con el establecimiento de referencias, lee sobre el tema en la documentación.",
                    "updated": 1629165919563,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie mit der Erstellung von Verweisen nicht vertraut sind, lesen Sie bitte in der Dokumentation über dieses Thema.",
                    "updated": 1635832150842
                },
                {
                    "language": "TR",
                    "text": "Not: Bağlantı oluşturma konusunda bilginiz yoksa, lütfen bu konudaki belgelere bakın.",
                    "updated": 1642147983857
                },
                {
                    "language": "RU",
                    "text": "Если вы не знакомы с созданием ссылок, пожалуйста, прочитайте об этом в документации.",
                    "updated": 1643090547251
                },
                {
                    "language": "NL",
                    "text": "Als u niet bekend bent met het leggen van referenties, lees dan meer over het onderwerp in de documentatie.",
                    "updated": 1676124614789
                }
            ]
        }
    ]
}