{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 14,
    "type": "Tutorial Step - BB On the Charts!",
    "definition": {
        "icon": {
            "name": "Layer\\layer-bands",
            "project": "Foundations"
        },
        "text": "Let's take a look at the Bollinger Bands! If it's not on already, find the Bollinger Bands layer in the Masters layer manager.",
        "translations": [
            {
                "language": "DE",
                "text": "Werfen wir einen Blick auf die Bollinger-Bands! Falls er noch nicht aktiviert ist, finden Sie die Ebene Bollinger Bands im Masters layer manager.",
                "updated": 1639252176396
            },
            {
                "language": "RU",
                "text": "Давайте посмотрим на полосы Боллинджера! Если он еще не включен, найдите слой Bollinger Bands в менеджере слоев Masters.",
                "updated": 1640890274542
            },
            {
                "language": "TR",
                "text": "Özet: Bollinger Gruplarına bir göz atalım! Henüz açık değilse, Masters katman yöneticisinde Bollinger Bantları katmanını bulun.",
                "updated": 1640870342350
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The indicator features a 20-period moving average in the center. It features a line on top located two standard deviations above the moving average. We call this line the upper band. And it also features a line two standard deviations below the moving average. We call this one the lower band. Together, they are the Bollinger Bands.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Indikator enthält in der Mitte einen gleitenden Durchschnitt über 20 Perioden. Darüber befindet sich eine Linie, die zwei Standardabweichungen über dem gleitenden Durchschnitt liegt. Wir nennen diese Linie das obere Band. Außerdem gibt es eine Linie, die zwei Standardabweichungen unterhalb des gleitenden Durchschnitts verläuft. Wir nennen diese Linie das untere Band. Zusammen bilden sie die Bollinger Bands.",
                    "updated": 1639252193350
                },
                {
                    "language": "RU",
                    "text": "В центре индикатора находится 20-периодная скользящая средняя. Сверху имеется линия, расположенная на два стандартных отклонения выше скользящей средней. Мы называем эту линию верхней полосой. Также имеется линия, расположенная на два стандартных отклонения ниже скользящей средней. Эту линию мы называем нижней полосой. Вместе они представляют собой полосы Боллинджера.",
                    "updated": 1640890308663
                },
                {
                    "language": "TR",
                    "text": "Gösterge, merkezde 20 dönemlik hareketli bir ortalamaya sahiptir. Üstte hareketli ortalamanın üzerinde iki standart sapma bulunan bir çizgiye sahiptir. Bu hatta üst bant diyoruz. Ayrıca hareketli ortalamanın iki standart sapma çizgisine sahiptir. Buna alt bant diyoruz. Bollinger Grupları.",
                    "updated": 1640871715867
                }
            ]
        },
        {
            "style": "Note",
            "text": "Notice how the price ranges sideways bouncing off the upper and the lower bands. Sometimes it may go out of the boundaries of the bands, either higher or lower, but most of the time it stays within the range of the bands.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Beachten Sie, wie der Kurs seitwärts schwankt und an den oberen und unteren Bändern abprallt. Manchmal verlässt er die Grenzen der Bänder, entweder nach oben oder nach unten, aber meistens bleibt er innerhalb des Bereichs der Bänder.",
                    "updated": 1639252200054
                },
                {
                    "language": "RU",
                    "text": "Обратите внимание, как цена колеблется в боковом диапазоне, отскакивая от верхней и нижней полос. Иногда она может выходить за границы полос, либо выше, либо ниже, но большую часть времени она остается в пределах диапазона полос.",
                    "updated": 1640890343579
                },
                {
                    "language": "TR",
                    "text": "Not: Fiyatın üst ve alt bantlardan yanlara doğru nasıl sıçradığına dikkat edin. Bazen daha yüksek veya daha düşük bant sınırlarının dışına çıkabilir, ancak çoğu zaman bantların aralığında kalır.",
                    "updated": 1640871777739
                }
            ]
        }
    ]
}