{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": "15",
    "type": "Tutorial Step - Bollinger Bands Rules",
    "definition": {
        "text": "Now that you've seen the bands on the charts, let's go through the rules that teach us how to interpret and use them!",
        "icon": {
            "name": "Layer\\layer-bands",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "DE",
                "text": "Nun, da Sie die Bänder auf den Charts gesehen haben, lassen Sie uns die Regeln durchgehen, die uns lehren, wie man sie interpretiert und verwendet!",
                "updated": 1639252227486
            },
            {
                "language": "RU",
                "text": "Теперь, когда вы увидели полосы на графиках, давайте рассмотрим правила, которые учат нас интерпретировать и использовать их!",
                "updated": 1640890363138
            },
            {
                "language": "TR",
                "text": "Özet: Artık listelerdeki grupları gördüğünüze göre, bunları nasıl yorumlayıp kullanacağımızı öğreten kuralları gözden geçirelim!",
                "updated": 1640871846120
            },
            {
                "language": "ES",
                "text": "Ahora que has visto las bandas en los gráficos, ¡vamos a repasar las reglas que nos enseñan a interpretarlas y utilizarlas!",
                "updated": 1675205794856
            },
            {
                "language": "IT",
                "text": "Ora che hai visto le band sul grafico, passiamo alle regole che ci insegnano come interpretarle e usarle!",
                "updated": 1669895914399
            },
            {
                "language": "NL",
                "text": "Nu je de banden in de grafieken hebt gezien, laten we de regels doornemen die ons leren hoe we ze moeten interpreteren en gebruiken!",
                "updated": 1670784890247
            },
            {
                "language": "ID",
                "text": "Sekarang setelah kamu melihat band-band di chart, mari kita lihat aturan yang mengajari kita cara menafsirkan dan menggunakannya!",
                "updated": 1674690437273
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If you are not familiar with this indicator, it's definitely worth spending a few minutes reading the rules,",
            "updated": 1622458251795,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn Sie mit diesem Indikator nicht vertraut sind, lohnt es sich auf jeden Fall, ein paar Minuten mit den Regeln zu verbringen,",
                    "updated": 1639252237240
                },
                {
                    "language": "RU",
                    "text": "Если вы не знакомы с этим индикатором, стоит потратить несколько минут на ознакомление с этими правилами",
                    "updated": 1640890438811
                },
                {
                    "language": "TR",
                    "text": "Bu göstergeye aşina değilseniz, kuralları okumak için kesinlikle birkaç dakika harcamaya değer,aşağıdaki link'i inceleyebilirsiniz.",
                    "updated": 1640871944748
                },
                {
                    "language": "ES",
                    "text": "Si no estas familiarizado con este indicador, merece la pena que dediques unos minutos a leer las reglas,",
                    "updated": 1675205786194
                },
                {
                    "language": "IT",
                    "text": "Se non hai familiarità con questo indicatore, vale sicuramente la pena dedicare qualche minuto alla lettura delle regole,",
                    "updated": 1669895934814
                },
                {
                    "language": "NL",
                    "text": "Als u niet bekend bent met deze indicator, is het zeker de moeite waard om een paar minuten te besteden aan het lezen van de regels,",
                    "updated": 1670784906151
                },
                {
                    "language": "ID",
                    "text": "Jika kamu tidak terbiasa dengan indikator ini, ada baiknya meluangkan beberapa menit untuk membaca aturannya,",
                    "updated": 1674690444570
                }
            ]
        },
        {
            "style": "Link",
            "text": "as defined by John Bollinger himself!->www.bollingerbands.com/bollinger-band-rules?ref=superalgos",
            "updated": 1622458339543,
            "translations": [
                {
                    "language": "DE",
                    "text": "wie sie von John Bollinger selbst definiert wurden!->www.bollingerbands.com/bollinger-band-rules?ref=superalgos",
                    "updated": 1639252431140
                },
                {
                    "language": "TR",
                    "text": "John Bollinger tarafından tanımlandığı gibi!->www.bollingerbands.com/bollinger-band-rules?ref=superalgos",
                    "updated": 1654393952600,
                    "style": "Link"
                },
                {
                    "language": "ES",
                    "text": "tal y como las define el propio John Bollinger!->www.bollingerbands.com/bollinger-band-rules?ref=superalgos",
                    "updated": 1668190751611
                },
                {
                    "language": "IT",
                    "text": "come definite da John Bollinger stesso!->www.bollingerbands.com/bollinger-band-rules?ref=superalgos",
                    "updated": 1669895961454
                },
                {
                    "language": "NL",
                    "text": "zoals gedefinieerd door John Bollinger zelf!->www.bollingerbands.com/bollinger-band-rules?ref=superalgos",
                    "updated": 1670784929534
                },
                {
                    "language": "ID",
                    "text": "seperti yang didefinisikan oleh John Bollinger sendiri!->www.bollingerbands.com/bollinger-band-rules?ref=superalgos",
                    "updated": 1674690428902
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Please, read what John Bollinger has to say about how to interpret this popular indicator!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Bitte lesen Sie, was John Bollinger über die Interpretation dieses beliebten Indikators zu sagen hat!",
                    "updated": 1639252249929
                },
                {
                    "language": "RU",
                    "text": "Пожалуйста, прочитайте, что говорит Джон Боллинджер о том, как интерпретировать этот популярный индикатор!",
                    "updated": 1640890459663
                },
                {
                    "language": "TR",
                    "text": "Lütfen, John Bollinger'ın bu popüler göstergeyi nasıl yorumlanacağı hakkındaki söylediklerini okuyun!",
                    "updated": 1640872013666
                },
                {
                    "language": "NL",
                    "text": "Lees alstublieft wat John Bollinger te zeggen heeft over hoe u deze populaire indicator moet interpreteren!",
                    "updated": 1670784942543
                },
                {
                    "language": "ID",
                    "text": "Tolong, baca apa yang dikatakan John Bollinger tentang bagaimana menafsirkan indikator populer ini!",
                    "updated": 1674690470937
                },
                {
                    "language": "ES",
                    "text": "Por favor, lee lo que John Bollinger tiene que decir sobre cómo interpretar este popular indicador.",
                    "updated": 1675205765912
                }
            ]
        },
        {
            "style": "Note",
            "text": "Rules 6 to 8 are of particular significance to what we will be attempting later on!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Regeln 6 bis 8 sind für das, was wir später versuchen werden, von besonderer Bedeutung!",
                    "updated": 1639252258018
                },
                {
                    "language": "RU",
                    "text": "Правила 6-8 имеют особое значение для того, что мы будем делать в дальнейшем!",
                    "updated": 1640890476983
                },
                {
                    "language": "TR",
                    "text": "Not: 6'dan 8'e kadar olan kurallar, daha sonra deneyeceğimiz şey için özel bir öneme sahiptir!",
                    "updated": 1640872123653
                },
                {
                    "language": "ES",
                    "text": "¡Las reglas 6 a 8 son de particular importancia para lo que intentaremos más adelante!",
                    "updated": 1668190782250
                },
                {
                    "language": "IT",
                    "text": "Le regole da 6 a 8 sono di particolare importanza per ciò che tenteremo in seguito!",
                    "updated": 1669895989656
                },
                {
                    "language": "NL",
                    "text": "Regels 6 tot 8 zijn van bijzonder belang voor wat we later zullen proberen!",
                    "updated": 1670784955664
                },
                {
                    "language": "ID",
                    "text": "Aturan 6 sampai 8 sangat penting untuk apa yang akan kita coba nanti!",
                    "updated": 1674690495029
                }
            ]
        }
    ]
}