{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 8,
    "type": "Tutorial Step - The Appropriate Context",
    "definition": {
        "icon": {
            "name": "Layer\\layer-trends",
            "project": "Foundations"
        },
        "text": "The second important dimension to define is the general context that the hypothesis is aimed at.",
        "translations": [
            {
                "language": "DE",
                "text": "Die zweite wichtige Dimension, die es zu definieren gilt, ist der allgemeine Kontext, auf den die Hypothese ausgerichtet ist.",
                "updated": 1639251726373
            },
            {
                "language": "RU",
                "text": "Во-вторых, важно определить общий контекст, на который направлена гипотеза.",
                "updated": 1640888972280
            },
            {
                "language": "TR",
                "text": "Özet: Tanımlanması gereken ikinci önemli ölçü, varsayımın hedeflendiği genel bağlamdır.",
                "updated": 1640866693545
            },
            {
                "language": "ES",
                "text": "La segunda dimensión importante que hay que definir es el contexto general al que se dirige la hipótesis.",
                "updated": 1668188981988
            },
            {
                "language": "IT",
                "text": "La seconda dimensione importante da definire è il contesto generale a cui si rivolge l'ipotesi.",
                "updated": 1669887574606
            },
            {
                "language": "NL",
                "text": "De tweede belangrijke dimensie die moet worden gedefinieerd, is de algemene context waarop de hypothese is gericht.",
                "updated": 1670783762196
            },
            {
                "language": "ID",
                "text": "Dimensi penting kedua yang harus didefinisikan adalah konteks umum yang dituju oleh hipotesis.",
                "updated": 1674688396934
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Few&mdash;if any&mdash;technical analysis-based strategies perform consistently on undefined market situations.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Nur wenige - wenn überhaupt - auf der technischen Analyse basierende Strategien erzielen in undefinierten Marktsituationen konsistente Ergebnisse.",
                    "updated": 1639251739728
                },
                {
                    "language": "RU",
                    "text": "Лишь немногие стратегии, основанные на техническом анализе, или вообще никакие, не работают стабильно в неопределенных рыночных ситуациях.",
                    "updated": 1640888995274
                },
                {
                    "language": "TR",
                    "text": "Teknik analize dayalı stratejiler, tanımlanmamış piyasa durumlarında tutarlı bir şekilde performans gösterir.",
                    "updated": 1640867069015
                },
                {
                    "language": "ES",
                    "text": "Pocas estrategias basadas en el análisis técnico, si es que hay alguna, funcionan de forma consistente en situaciones de mercado no definidas.",
                    "updated": 1668189007571
                },
                {
                    "language": "IT",
                    "text": "Poche strategie basate sull'analisi tecnica, se non nessuna, si comportano in modo coerente in situazioni di mercato indefinite.",
                    "updated": 1669887597665
                },
                {
                    "language": "NL",
                    "text": "Weinig of geen op technische analyse gebaseerde strategieën presteren consistent op ongedefinieerde marktsituaties.",
                    "updated": 1670783795634
                },
                {
                    "language": "ID",
                    "text": "Sedikit — jika ada — strategi berbasis analisis teknikal bekerja secara konsisten pada situasi market yang tidak menentu.",
                    "updated": 1674688402955
                }
            ]
        },
        {
            "style": "Callout",
            "text": "The minimum required definition is as to whether the hypothesis targets downtrends, uptrends, or sideways markets.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Es muss zumindest definiert werden, ob die Hypothese auf Abwärtstrends, Aufwärtstrends oder Seitwärtsmärkte abzielt.",
                    "updated": 1639251746659
                },
                {
                    "language": "RU",
                    "text": "Минимально необходимое определение - это определение того, на какие рынки направлена гипотеза: нисходящие, восходящие или боковые.",
                    "updated": 1640889023401
                },
                {
                    "language": "TR",
                    "text": "Gerekli minimum tanım, varsayımınızın düşüş trendlerini mi, yükseliş trendlerini mi yoksa yan yönlü piyasaları mı hedeflediğidir.",
                    "updated": 1640867252493
                },
                {
                    "language": "ES",
                    "text": "La definición mínima requerida es si la hipótesis se apunta a las tendencias bajistas, a las tendencias alcistas o a los mercados laterales.",
                    "updated": 1668189046273
                },
                {
                    "language": "IT",
                    "text": "La definizione minima richiesta riguarda se l'ipotesi si rivolge a trend al ribasso, al rialzo o ai mercati laterali.",
                    "updated": 1669887617798
                },
                {
                    "language": "NL",
                    "text": "De minimaal vereiste definitie is of de hypothese gericht is op neerwaartse, opwaartse of zijwaartse markten.",
                    "updated": 1670783808208
                },
                {
                    "language": "ID",
                    "text": "Definisi minimum yang diperlukan adalah apakah hipotesis menargetkan market downtrend, uptrend, atau sideways.",
                    "updated": 1674688408713
                }
            ]
        },
        {
            "style": "Text",
            "text": "The usual resource is a multi-time frame analysis based on one or more indicators that determine what the existing trend is at different time frames, and any other factors that may be of importance to the specific strategy, for example, volume or volatility.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Das übliche Hilfsmittel ist eine Multi-Time-Frame-Analyse, die auf einem oder mehreren Indikatoren basiert, die den bestehenden Trend in verschiedenen Zeitrahmen bestimmen, sowie alle anderen Faktoren, die für die spezifische Strategie von Bedeutung sein können, z. B. Volumen oder Volatilität.",
                    "updated": 1639251753848
                },
                {
                    "language": "RU",
                    "text": "Обычный ресурс - это многотаймфреймовый анализ, основанный на одном или нескольких индикаторах, определяющих существующий тренд на разных таймфреймах, а также любые другие факторы, которые могут иметь значение для конкретной стратегии, например, объем или волатильность.",
                    "updated": 1640889051373
                },
                {
                    "language": "TR",
                    "text": "Olağan kaynak, mevcut eğilimin farklı zaman dilimlerinde ne olduğunu belirleyen bir veya daha fazla göstergeye ve belirli strateji için önemli olabilecek diğer faktörlere (örneğin hacim veya oynaklık) dayanan çok zaman çerçeveli bir analizdir.",
                    "updated": 1640867331944
                },
                {
                    "language": "ES",
                    "text": "El recurso habitual es un análisis multitemporal basado en uno o varios indicadores que determinan cuál es la tendencia existente en diferentes marcos temporales, y cualquier otro factor que pueda ser importante para la estrategia concreta, por ejemplo, el volumen o la volatilidad.",
                    "updated": 1668189128865
                },
                {
                    "language": "NL",
                    "text": "De gebruikelijke bron is een multi-time frame-analyse op basis van een of meer indicatoren die bepalen wat de bestaande trend is op verschillende tijdframes, en alle andere factoren die van belang kunnen zijn voor de specifieke strategie, bijvoorbeeld volume of volatiliteit.",
                    "updated": 1670783831001
                },
                {
                    "language": "ID",
                    "text": "Sumber daya yang biasa adalah analisis multi timeframe berdasarkan satu atau lebih indikator yang menentukan tren yang ada pada timeframe yang berbeda, dan faktor lain yang mungkin penting untuk strategi tertentu, misalnya volume atau volatilitas.",
                    "updated": 1674688424099
                }
            ]
        }
    ]
}