{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 7,
    "type": "Tutorial Step - The Trading Process",
    "definition": {
        "icon": {
            "name": "Trading\\trading-system",
            "project": "Foundations"
        },
        "text": "The first dimension we should define is what type of strategy the hypothesis is aimed at.",
        "translations": [
            {
                "language": "ES",
                "text": "La primera dimensión que debemos definir es a qué tipo de estrategia se dirige la hipótesis.",
                "updated": 1636724926593
            },
            {
                "language": "DE",
                "text": "Die erste Dimension, die wir definieren sollten, ist die Art der Strategie, auf die die Hypothese ausgerichtet ist.",
                "updated": 1639251677275
            },
            {
                "language": "RU",
                "text": "Для начала следует определить, на какой тип стратегии направлена гипотеза.",
                "updated": 1640888862690
            },
            {
                "language": "TR",
                "text": "Özet: Tanımlamamız gereken ilk ölçü, varsayımlarınızın nasıl bir stratejiyi amaçladığıdır.",
                "updated": 1640865650405
            },
            {
                "language": "IT",
                "text": "La prima dimensione che dovremmo definire è a quale tipo di strategia è rivolta l'ipotesi.",
                "updated": 1669887364484
            },
            {
                "language": "NL",
                "text": "De eerste dimensie die we moeten definiëren, is op welk type strategie de hypothese gericht is.",
                "updated": 1670783648259
            },
            {
                "language": "ID",
                "text": "Dimensi pertama yang harus kita definisikan adalah jenis strategi apa yang menjadi sasaran hipotesis.",
                "updated": 1674688184627
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "A simple rule-of-thumb is determining if it is a scalping, day-trading, swing trading, or position trading strategy.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Una regla empírica simple es determinar si es una estrategia scalping, day-trading, swing trading, o position trading",
                    "updated": 1636724992046
                },
                {
                    "language": "DE",
                    "text": "Eine einfache Faustregel ist die Feststellung, ob es sich um eine Scalping-, Daytrading-, Swingtrading- oder Positionshandelsstrategie handelt.",
                    "updated": 1639251689695
                },
                {
                    "language": "RU",
                    "text": "Простое правило - определить, является ли эта стратегия скальпингом, дневной торговлей, свинг-трейдингом или позиционной торговлей.",
                    "updated": 1640888880408
                },
                {
                    "language": "TR",
                    "text": "Basit bir kuralı, bunun bir scalping, günlük alım satım, salınımlı alım satım veya pozisyon alım satım stratejisi olup olmadığını belirlemektir.",
                    "updated": 1640866047879
                },
                {
                    "language": "IT",
                    "text": "Una semplice regola empirica è determinare se si tratta di una strategia di scalping, day-trading, swing trading o position trading.",
                    "updated": 1669887380780
                },
                {
                    "language": "NL",
                    "text": "Een eenvoudige vuistregel bepaalt of het een scalpeer-, daghandel-, swinghandel- of positiehandelstrategie is.",
                    "updated": 1670783666508
                },
                {
                    "language": "ID",
                    "text": "Aturan praktis yang sederhana adalah menentukan apakah itu strategi scalping, day-trading, swing trading, atau position trading.",
                    "updated": 1674688191829
                }
            ]
        },
        {
            "style": "Callout",
            "text": "This definition provides a notion of the expected holding period, that is, the average time range expected for each position to be open.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Esta definición proporciona una noción del período de tenencia esperado, es decir, el rango de tiempo promedio esperado para que cada posición esté abierta.",
                    "updated": 1636725015797
                },
                {
                    "language": "DE",
                    "text": "Diese Definition liefert eine Vorstellung von der erwarteten Haltedauer, d. h. der durchschnittlichen Zeitspanne, die für jede offene Position erwartet wird.",
                    "updated": 1639251697939
                },
                {
                    "language": "RU",
                    "text": "Это определение дает представление об ожидаемом периоде удержания, то есть о среднем диапазоне времени, в течение которого каждая позиция будет оставаться открытой.",
                    "updated": 1640888906826
                },
                {
                    "language": "TR",
                    "text": "Bu tanım, beklenen elde tutma süresi, yani her pozisyonun açık olması için beklenen ortalama zaman aralığı hakkında bir fikir sağlar.",
                    "updated": 1640866290158
                },
                {
                    "language": "IT",
                    "text": "Questa definizione fornisce un'idea del periodo di detenzione previsto, ovvero l'intervallo di tempo medio previsto per l'apertura di ciascuna posizione.",
                    "updated": 1669887395707
                },
                {
                    "language": "NL",
                    "text": "Deze definitie geeft een idee van de verwachte periode van bezit, dat wil zeggen het gemiddelde tijdsbestek dat verwacht wordt voor elke openstaande positie.",
                    "updated": 1670783699104
                },
                {
                    "language": "ID",
                    "text": "Definisi ini memberikan pengertian mengenai ekspektasi holding period, yaitu rentang waktu rata-rata yang diharapkan untuk setiap posisi terbuka.",
                    "updated": 1674688199031
                }
            ]
        },
        {
            "style": "Text",
            "text": "The value of such a definition is that it provides a guideline as to what time frames to analyze to determine the existence of trends.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El valor de tal definición es que proporciona una guía sobre qué marcos de tiempo analizar para determinar la existencia de tendencias.",
                    "updated": 1636725046243
                },
                {
                    "language": "DE",
                    "text": "Der Wert einer solchen Definition besteht darin, dass sie einen Leitfaden dafür liefert, welche Zeitrahmen zu analysieren sind, um das Vorhandensein von Trends festzustellen.",
                    "updated": 1639251706996
                },
                {
                    "language": "RU",
                    "text": "Ценность такого определения заключается в том, что оно дает ориентир в отношении того, какие таймфреймы следует анализировать, чтобы определить наличие тенденций.",
                    "updated": 1640888944173
                },
                {
                    "language": "TR",
                    "text": "Böyle bir tanımın değeri, eğilimlerin varlığını belirlemek için hangi zaman dilimlerinin analiz edileceğine dair bir kılavuz sağlamasıdır.",
                    "updated": 1640866425834
                },
                {
                    "language": "IT",
                    "text": "Il valore di una tale definizione è che fornisce una linea guida su quali intervalli di tempo analizzare per determinare l'esistenza di tendenze.",
                    "updated": 1669887411445
                },
                {
                    "language": "NL",
                    "text": "De waarde van een dergelijke definitie is dat het een richtlijn biedt voor de tijdsbestekken die moeten worden geanalyseerd om het bestaan van trends vast te stellen.",
                    "updated": 1670783719027
                },
                {
                    "language": "ID",
                    "text": "NIlai dari definisi semacam itu adalah memberikan panduan tentang time frame apa yang harus dianalisis untuk menentukan keberadaan tren.",
                    "updated": 1674688233490
                }
            ]
        }
    ]
}