{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 18,
    "type": "Tutorial Step - What Else is Going On?",
    "definition": {
        "icon": {
            "name": "Layer\\layer-candles",
            "project": "Foundations"
        },
        "text": "We just took note of what happened after this breakdown of the bands on the 1H chart... What else is going on with the market?",
        "translations": [
            {
                "language": "DE",
                "text": "Wir haben soeben zur Kenntnis genommen, was nach diesem Zusammenbruch der Bänder auf dem 1H-Chart passiert ist... Was ist sonst noch auf dem Markt los?",
                "updated": 1639252841552
            },
            {
                "language": "RU",
                "text": "Мы только что обратили внимание на то, что произошло после пробоя полос на графике 1H... Что еще происходит с рынком?",
                "updated": 1640890844270
            },
            {
                "language": "TR",
                "text": "Özet: 1H grafiğindeki grupların bu dağılımından sonra neler olduğunu not ettik... Piyasada başka neler oluyor?",
                "updated": 1640947793962
            },
            {
                "language": "ES",
                "text": "Acabamos de tomar nota de lo que ha sucedido después de esta ruptura de las bandas en el gráfico 1H... ¿Qué más está pasando con el mercado?",
                "updated": 1668191200497
            },
            {
                "language": "IT",
                "text": "Abbiamo appena preso nota di quello che è successo dopo questa ripartizione delle bande nella classifica 1H... Cos'altro sta succedendo con il mercato?\"",
                "updated": 1669900556205
            },
            {
                "language": "NL",
                "text": "We hebben zojuist kennis genomen van wat er gebeurde na deze neerwaartse uitbraak van de banden op de 1H-grafiek... Wat is er nog meer aan de hand met de markt?",
                "updated": 1670785506780
            },
            {
                "language": "ID",
                "text": "Kita baru saja memperhatikan apa yang terjadi setelah breakdown dari band di chart 1H... Apa lagi yang terjadi dengan market?",
                "updated": 1674693704635
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Take a look at the price action a few candles earlier!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Werfen Sie einen Blick auf die Kursentwicklung ein paar Kerzen zuvor!",
                    "updated": 1639252848647
                },
                {
                    "language": "RU",
                    "text": "Посмотрите на ценовое движение несколькими свечами ранее!",
                    "updated": 1640890863068
                },
                {
                    "language": "TR",
                    "text": "Birkaç mum öncesi fiyat hareketine bir bakın!",
                    "updated": 1640947810515
                },
                {
                    "language": "ES",
                    "text": "¡Echa un vistazo a la acción del precio unas velas antes!",
                    "updated": 1668191217087
                },
                {
                    "language": "IT",
                    "text": "Dai un'occhiata all'azione dei prezzi qualche candela prima!",
                    "updated": 1669900571783
                },
                {
                    "language": "NL",
                    "text": "Kijk een paar candles eerder naar de prijsactie!",
                    "updated": 1670785524379
                },
                {
                    "language": "ID",
                    "text": "Lihat price action beberapa candle sebelumnya!",
                    "updated": 1674693697435
                }
            ]
        },
        {
            "style": "Note",
            "text": "There were two breakdowns previous to the one we checked, one on April 9th at 12 hs, and before that, another one on April 7th at 21 hs. Both breakdowns were significant, in the sense that the candles closed way lower than the lower band. However, in both cases price bounced back into the bands.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Es gab zwei Durchbrüche vor dem von uns überprüften, einen am 9. April um 12 Uhr, und davor einen weiteren am 7. April um 21 Uhr. Beide Durchbrüche waren insofern signifikant, als die Kerzen weit unter dem unteren Band schlossen. In beiden Fällen stieg der Kurs jedoch wieder in die Bänder zurück.",
                    "updated": 1639252858517
                },
                {
                    "language": "RU",
                    "text": "До проверяемого нами пробоя было два пробоя, один 9 апреля на 12 часах, а до этого еще один 7 апреля на 21 часе. Оба пробоя были значительными, в том смысле, что свечи закрылись намного ниже нижней полосы. Однако в обоих случаях цена отскочила обратно к диапазонам.",
                    "updated": 1640890890149
                },
                {
                    "language": "TR",
                    "text": "Not: Kontrol Ettiğimizden önce iki arıza vardı, biri 9 Nisan'da saat 12'de, diğeri 7 Nisan'da saat 21'de. Her iki arıza da, mumların alt banttan çok daha düşük kapanması anlamında önemliydi. Ancak, her iki durumda da fiyat bantlara geri döndü.",
                    "updated": 1640947826988
                },
                {
                    "language": "ES",
                    "text": "Hubo dos rupturas anteriores a la que revisamos, una el 9 de abril a las 12 hs, y antes, otra el 7 de abril a las 21 hs. Ambas rupturas fueron significativas, en el sentido de que las velas cerraron muy por debajo de la banda inferior. Sin embargo, en ambos casos el precio rebotó dentro de las bandas.",
                    "updated": 1668191262918
                },
                {
                    "language": "NL",
                    "text": "Er waren twee neerwaartse uitbraken voorafgaand aan degene die we controleerden, een op 9 april om 12.00 uur en daarvoor nog een op 7 april om 21.00 uur. Beide uitsplitsingen waren significant, in die zin dat de candles veel lager sloten dan de onderste band. In beide gevallen stuiterde de prijs echter terug in de bands.",
                    "updated": 1670785567206
                },
                {
                    "language": "ID",
                    "text": "Ada dua breakdown sebelumnya yang kita periksa, satu pada 9 April pukul 12 hs, dan sebelumnya, satu lagi pada 7 April pukul 21 hs. Kedua breakdown tersebut signifikan, dalam arti bahwa candle ditutup jauh lebih rendah daripada lower band. Namun, dalam kedua kasus harga memantul kembali ke band.",
                    "updated": 1674693692061
                }
            ]
        }
    ]
}