{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 2,
    "type": "Tutorial - Defining a Trading Idea",
    "definition": {
        "icon": {
            "name": "Trading\\trading-strategy",
            "project": "Foundations"
        },
        "text": "Before you may build a Trading Strategy, you first need to come up with a clear and testable trading idea.",
        "updated": 1630376091762,
        "translations": [
            {
                "language": "ES",
                "text": "Antes de que puedas crear una estrategia de trading, primero debes tener una idea de trading clara y comprobable.",
                "updated": 1675205030378
            },
            {
                "language": "DE",
                "text": "Bevor Sie eine Trading Strategy entwickeln können, müssen Sie zunächst eine klare und überprüfbare Handelsidee entwickeln.",
                "updated": 1639251297105
            },
            {
                "language": "RU",
                "text": "Прежде чем строить торговую стратегию, сначала нужно придумать четкую и проверяемую торговую идею.",
                "updated": 1640887479031
            },
            {
                "language": "TR",
                "text": "Özet: Bir Ticaret Stratejisi ( Trading Strategy ) oluşturmadan önce, net ve test edilebilir bir ticaret fikri bulmanız gerekir.",
                "updated": 1640858579634
            },
            {
                "language": "IT",
                "text": "Prima di poter costruire una Trading Strategy, devi prima trovare un'idea di trading chiara e verificabile.",
                "updated": 1669885262513
            },
            {
                "language": "NL",
                "text": "Voordat u een Trading Strategy kunt opstellen, moet u eerst met een duidelijk en testbaar handelsidee komen.",
                "updated": 1670783046377
            },
            {
                "language": "ID",
                "text": "Sebelum kamu dapat membangun Trading Strategy, pertama-tama kamu harus memiliki ide trading yang jelas dan dapat diuji.",
                "updated": 1674638112509
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "A trading idea is a precursor to a trading strategy. While a complete strategy entails the rules for taking, managing and exiting a position, a trading idea is concerned with the first of those issues only.",
            "updated": 1630376114821,
            "translations": [
                {
                    "language": "ES",
                    "text": "Una idea trading es un precursor de una estrategia de trading. Si bien una estrategia completa implica las reglas para tomar, administrar y salir de una posición, una idea trading se ocupa únicamente del primero de esos aspectos.",
                    "updated": 1675205055733
                },
                {
                    "language": "DE",
                    "text": "Eine Handelsidee ist der Vorläufer einer Trading Strategy. Während eine vollständige Strategie die Regeln für das Eingehen, Verwalten und Verlassen einer Position enthält, befasst sich eine Trading-Idee nur mit dem ersten dieser Punkte.",
                    "updated": 1639251307779
                },
                {
                    "language": "RU",
                    "text": "Торговая идея - это предшественник торговой стратегии. В то время как полная стратегия включает в себя правила взятия, управления и выхода из позиции, торговая идея касается только первого из этих вопросов.",
                    "updated": 1640887505405
                },
                {
                    "language": "TR",
                    "text": "Bir ticaret fikri, bir ticaret stratejisinin habercisidir. Eksiksiz bir strateji, bir pozisyonu alma, yönetme ve pozisyondan çıkma kurallarını içerirken, bir ticaret fikri sadece bu konulardan ilkiyle ilgilenir.",
                    "updated": 1640858655481
                },
                {
                    "language": "IT",
                    "text": "Un'idea di trading è il precursore di una strategia di trading. Mentre una strategia completa comporta le regole per prendere, gestire ed uscire da una posizione, un'idea di trading riguarda solo la prima di queste questioni.",
                    "updated": 1669885284956
                },
                {
                    "language": "NL",
                    "text": "Een handelsidee is een voorloper van een handelsstrategie. Hoewel een volledige strategie de regels omvat voor het innemen, beheren en verlaten van een positie, heeft een handelsidee alleen betrekking op de eerste van deze kwesties.",
                    "updated": 1670783074649
                },
                {
                    "language": "ID",
                    "text": "Ide trading adalah pendahulu untuk trading strategy. Sementara strategi lengkap memerlukan aturan untuk mengambil, mengelola, dan keluar dari posisi, ide trading hanya berkaitan dengan masalah pertama saja.",
                    "updated": 1674638147492
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Testing a trading idea before committing to building a complete strategy is the logical approach because managing and exiting failed entries is not what you should be aiming for!",
            "updated": 1630376167390,
            "translations": [
                {
                    "language": "ES",
                    "text": "Probar una idea trading antes de comprometerse a construir una estrategia completa es el enfoque lógico porque administrar y salir de las entradas fallidas no es lo que debería apuntar.",
                    "updated": 1630376759318
                },
                {
                    "language": "DE",
                    "text": "Es ist logisch, eine Handelsidee zu testen, bevor Sie eine vollständige Strategie entwickeln, denn das Verwalten und Verlassen von fehlgeschlagenen Eingängen ist nicht das, was Sie anstreben sollten!",
                    "updated": 1639251321051
                },
                {
                    "language": "RU",
                    "text": "Тестирование торговой идеи перед тем, как приступить к построению полной стратегии, является логичным подходом, потому что управление и выход из неудачных входов - это не то, к чему вы должны стремиться!",
                    "updated": 1640887524270
                },
                {
                    "language": "TR",
                    "text": "Eksiksiz bir strateji oluşturmaya karar vermeden önce bir ticaret fikrini test etmek mantıklı bir yaklaşımdır çünkü hedeflediğiniz şey başarısız girişleri yönetmek ve bunlardan çıkmak değildir!",
                    "updated": 1640858741535
                },
                {
                    "language": "IT",
                    "text": "Testare un'idea di trading prima di impegnarsi a costruire una strategia completa è l'approccio logico perché la gestione e l'uscita dalle entrate fallite non è ciò a cui dovresti mirare!",
                    "updated": 1669885293742
                },
                {
                    "language": "NL",
                    "text": "Het is een logische aanpak om een handelsidee te testen alvorens een complete strategie op te bouwen, omdat het beheren en beëindigen van mislukte transacties niet is waar u naar zou moeten streven!",
                    "updated": 1670783101261
                },
                {
                    "language": "ID",
                    "text": "Menguji ide trading sebelum berkomitmen untuk membangun strategi yang lengkap adalah pendekatan logis karena mengelola dan keluar dari entri yang gagal bukanlah tujuanmu!",
                    "updated": 1674638126729
                }
            ]
        },
        {
            "style": "Text",
            "text": "This tutorial explains how to properly formulate a trading idea that may later be tested.",
            "updated": 1630376190150,
            "translations": [
                {
                    "language": "ES",
                    "text": "Este tutorial explica cómo formular correctamente una idea trading que luego pueda ser probada.",
                    "updated": 1675205087339
                },
                {
                    "language": "DE",
                    "text": "In diesem Lehrgang wird erklärt, wie man eine Handelsidee richtig formuliert, die später getestet werden kann.",
                    "updated": 1639251327572
                },
                {
                    "language": "RU",
                    "text": "Этот учебник объясняет, как правильно сформулировать торговую идею, которая впоследствии может быть протестирована.",
                    "updated": 1640887538516
                },
                {
                    "language": "TR",
                    "text": "Bu eğitim, daha sonra test edilebilecek bir ticaret fikrinin nasıl düzgün bir şekilde formüle edileceğini açıklar.",
                    "updated": 1640858782623
                },
                {
                    "language": "IT",
                    "text": "Questo tutorial spiega come formulare correttamente un'idea di trading che potrebbe essere successivamente testata.",
                    "updated": 1669885315689
                },
                {
                    "language": "NL",
                    "text": "In deze tutorial wordt uitgelegd hoe u een handelsidee op de juiste manier formuleert dat later kan worden getest.",
                    "updated": 1670783113868
                },
                {
                    "language": "ID",
                    "text": "Tutorial ini menjelaskan cara merumuskan ide trading dengan benar yang nantinya dapat diuji.",
                    "updated": 1674638137223
                }
            ]
        }
    ]
}