{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 23,
    "type": "Tutorial Step - Wouldn't It Be Nice?",
    "definition": {
        "icon": {
            "name": "Layer\\layer-candles",
            "project": "Foundations"
        },
        "text": "How cool would it be to be able to predict the continuation of a downturn once the trend is already established?",
        "translations": [
            {
                "language": "DE",
                "text": "Wie cool wäre es, die Fortsetzung eines Abschwungs vorhersagen zu können, wenn der Trend bereits etabliert ist?",
                "updated": 1639253233680
            },
            {
                "language": "RU",
                "text": "Как здорово было бы уметь предсказывать продолжение спада, когда тренд уже установился?",
                "updated": 1640891568625
            },
            {
                "language": "TR",
                "text": "Summary: Özet: Trend zaten belirlendikten sonra bir düşüşün devamını tahmin edebilmek ne kadar havalı olurdu?",
                "updated": 1640949310633
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Predicting the reversal of a well-established trend is a very tricky task. The analysis we just did for April 10th is a good example: while the breakdown in the 1H and 4H time frames marked a trend reversal in the intermediate-term, the long-term trend remained intact.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Vorhersage der Umkehrung eines gut etablierten Trends ist eine sehr schwierige Aufgabe. Die Analyse, die wir gerade für den 10. April durchgeführt haben, ist ein gutes Beispiel: Während der Zusammenbruch im 1H- und 4H-Zeitrahmen eine mittelfristige Trendumkehr markierte, blieb der langfristige Trend intakt.",
                    "updated": 1639253247472
                },
                {
                    "language": "RU",
                    "text": "Предсказать разворот устоявшегося тренда - очень сложная задача. Анализ, который мы только что провели для 10 апреля, является хорошим примером: хотя пробой на часовом и 4-х часовом таймфреймах ознаменовал разворот тренда в среднесрочной перспективе, долгосрочный тренд остался нетронутым.",
                    "updated": 1640891705535
                },
                {
                    "language": "TR",
                    "text": "İyi kurulmuş bir trendin tersine döneceğini tahmin etmek çok zor bir iştir. Az önce 10 Nisan için yaptığımız analiz iyi bir örnek: 1H ve 4H zaman dilimlerindeki kırılma orta vadede bir trendin tersine dönmesini işaret ederken, uzun vadeli trend bozulmadan kaldı.",
                    "updated": 1640948801348
                }
            ]
        },
        {
            "style": "Callout",
            "text": "A safer approach to trading is predicting the continuation of a trend that is already established! <br/><br/>Remember Rule 8? Closes outside the Bollinger Bands are initially continuation signals!",
            "translations": [
                {
                    "language": "RU",
                    "text": "Более безопасный подход к торговле - это прогнозирование продолжения уже установившегося тренда! Помните 8-е правило? Закрытия за пределами полос Боллинджера изначально являются сигналами продолжения!",
                    "updated": 1640891768184
                },
                {
                    "language": "DE",
                    "text": "Ein sicherer Ansatz für den Handel ist die Vorhersage der Fortsetzung eines Trends, der sich bereits etabliert hat!<br><br>Erinnern Sie sich an Regel 8? Schlusskurse außerhalb der Bollinger Bänder sind zunächst Signale für die Fortsetzung des Trends!",
                    "updated": 1640903079150
                },
                {
                    "language": "TR",
                    "text": "Ticarete daha güvenli bir yaklaşım, halihazırda kurulmuş olan bir trendin devamını tahmin etmektir!     Kural 8'i hatırlıyor musun? Bollinger Bantlarının dışındaki kapanışlar başlangıçta devam sinyalleridir!",
                    "updated": 1640949333106
                }
            ]
        }
    ]
}