{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 22,
    "type": "Tutorial Step - Look to Your Left!",
    "definition": {
        "icon": {
            "name": "Layer\\layer-candles",
            "project": "Foundations"
        },
        "text": "Does the price action to your left ring a bell? Do you recognize this major market crash?",
        "translations": [
            {
                "language": "DE",
                "text": "Kommt Ihnen das Kursgeschehen zu Ihrer Linken bekannt vor? Erkennen Sie diesen großen Marktcrash?",
                "updated": 1639253115528
            },
            {
                "language": "RU",
                "text": "Вам ничего не напоминает ценовое движение слева от вас? Узнаете ли вы этот крупный обвал рынка?",
                "updated": 1640891287814
            },
            {
                "language": "TR",
                "text": "Özet: Solunuzdaki fiyat hareketi bir şey çağrıştırıyor mu? Bu büyük piyasa çöküşlerini hatırlıyor musun?",
                "updated": 1640948706186
            },
            {
                "language": "ES",
                "text": "¿Te suena la acción del precio a tu izquierda? ¿Reconoces este derrumbe importante del mercado?",
                "updated": 1675205920559
            },
            {
                "language": "IT",
                "text": "L'azione dei prezzi alla tua sinistra suona un campanello? Riconosci questo grave crollo del mercato?",
                "updated": 1669900921142
            },
            {
                "language": "NL",
                "text": "Doet de prijsactie links van je een belletje rinkelen? Herkent u deze grote marktcrash?",
                "updated": 1670786179410
            },
            {
                "language": "ID",
                "text": "Apakah price action di sebelah kiri kamu menarik perhatian? Apakah kamu mengenali major market crash ini?",
                "updated": 1674698296242
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "You're looking at the March 12-13th, 2020 ~50% pandemic market crash! Spend a few minutes analyzing the daily chart!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Sie schauen auf den 12-13 März 2020 ~50% pandemischen Marktcrash! Nehmen Sie sich ein paar Minuten Zeit und analysieren Sie den Tages-Chart!",
                    "updated": 1639253128723
                },
                {
                    "language": "RU",
                    "text": "Перед вами 12-13 марта 2020 года ~50% пандемический крах рынка! Потратьте несколько минут на анализ дневного графика!",
                    "updated": 1640891306931
                },
                {
                    "language": "TR",
                    "text": "12-13 Mart 2020 ~%50 pandemik piyasa çöküşüne bakıyorsunuz! Günlük grafiği analiz etmek için birkaç dakika ayırın!",
                    "updated": 1640948725727
                },
                {
                    "language": "ES",
                    "text": "¡Estás viendo la caída del mercado pandémico del-50%, el 12-13 de marzo de 2020! ¡Dedica unos minutos a analizar el gráfico diario!",
                    "updated": 1668192216225
                },
                {
                    "language": "IT",
                    "text": "Stai osservando il crollo del mercato pandemico del 12-13 marzo 2020 ~ 50%! Dedica qualche minuto all'analisi del grafico giornaliero!",
                    "updated": 1669900937489
                },
                {
                    "language": "NL",
                    "text": "U kijkt naar de pandemische marktcrash van 12-13 maart 2020 van ~50%! Besteed een paar minuten aan het analyseren van de daggrafiek!",
                    "updated": 1670786196698
                },
                {
                    "language": "ID",
                    "text": "Kamu sedang melihat market crash akibat pandemi 12-13 Maret 2020 ~50%! Luangkan beberapa menit untuk menganalisis chart daily ini!",
                    "updated": 1674698301889
                }
            ]
        },
        {
            "style": "Text",
            "text": "In short, we can see that the market was in a downtrend since February 25th&mdash;if we take the turning south of the moving average and the breakdown of the bands as an indication of the beginning of the trend.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Kurz gesagt, wir können sehen, dass sich der Markt seit dem 25. Februar in einem Abwärtstrend befand - wenn wir die Drehung des gleitenden Durchschnitts nach Süden und den Zusammenbruch der Bänder als Hinweis auf den Beginn des Trends nehmen.",
                    "updated": 1639253150059
                },
                {
                    "language": "RU",
                    "text": "Короче говоря, мы видим, что рынок находился в нисходящем тренде с 25 февраля - если принять разворот к югу от скользящей средней и пробой полос за признак начала тренда.",
                    "updated": 1640891357796
                },
                {
                    "language": "TR",
                    "text": "Kısacası, hareketli ortalamanın güneyine yöneldiğini ve bantların kırılmasını trendin başlangıcının bir göstergesi olarak alırsak, piyasanın 25 Şubat'tan beri düşüş trendinde olduğunu görebiliriz.",
                    "updated": 1640948743841
                },
                {
                    "language": "ES",
                    "text": "En resumen, podemos ver que el mercado estaba en una tendencia bajista desde el 25 de febrero, si tomamos el giro hacia el sur de la media móvil y la ruptura de las bandas como una indicación del inicio de la tendencia.",
                    "updated": 1668192350723
                },
                {
                    "language": "IT",
                    "text": "In breve, possiamo vedere che il mercato era in una tendenza al ribasso dal 25 febbraio, se consideriamo la svolta a sud della media mobile e la rottura delle bande come indicazione dell'inizio della tendenza.",
                    "updated": 1669900955249
                },
                {
                    "language": "NL",
                    "text": "Kortom, we kunnen zien dat de markt sinds 25 februari in een neerwaartse trend zat - als we de afslag naar het zuiden van het voortschrijdend gemiddelde en de neerwaartse doorbraak van de banden nemen als een indicatie van het begin van de trend.",
                    "updated": 1670786324681
                },
                {
                    "language": "ID",
                    "text": "Singkatnya, kita dapat melihat bahwa market berada dalam tren turun sejak 25 Februari—jika kita melihat ketidak untungan dari moving average dan breakdown dari band sebagai indikasi awal tren.",
                    "updated": 1674698310288
                }
            ]
        },
        {
            "style": "Success",
            "text": "Take a look at the lower time frames too!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Werfen Sie auch einen Blick auf die unteren Zeitrahmen!",
                    "updated": 1639253156624
                },
                {
                    "language": "RU",
                    "text": "Посмотрите также на более низкие таймфреймы!",
                    "updated": 1640891389511
                },
                {
                    "language": "TR",
                    "text": "İpucu: Daha düşük zaman dilimlerine de bir göz atın",
                    "updated": 1640948755759
                },
                {
                    "language": "ES",
                    "text": "¡Mira también los marcos temporales más bajos!",
                    "updated": 1668192281911
                },
                {
                    "language": "NL",
                    "text": "Kijk ook eens naar de lagere tijdframes!",
                    "updated": 1670786339169
                },
                {
                    "language": "ID",
                    "text": "Lihatlah timeframe yang lebih rendah juga!",
                    "updated": 1674698316022
                }
            ]
        }
    ]
}