{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 20,
    "type": "Tutorial Step - The Big Picture!",
    "definition": {
        "icon": {
            "name": "Time\\time-frame",
            "project": "Foundations"
        },
        "text": "The 4H chart showed a clear shift in the trend after the breakdown, but... what about the long-term? Let's check the daily chart!",
        "translations": [
            {
                "language": "DE",
                "text": "Der 4H-Chart zeigt eine klare Trendwende nach dem Zusammenbruch, aber... wie sieht es langfristig aus? Werfen wir einen Blick auf den Tages-Chart!",
                "updated": 1639252940834
            },
            {
                "language": "RU",
                "text": "Четырехчасовой график показал явное изменение тренда после пробоя, но... что насчет долгосрочной перспективы? Давайте проверим дневной график!",
                "updated": 1640891087092
            },
            {
                "language": "TR",
                "text": "Özet: 4 saatlik grafik, düşüşten sonra trendde net bir değişim gösterdi, ancak... peki ya uzun vadeli? Günlük grafiği kontrol edelim!",
                "updated": 1640947962763
            },
            {
                "language": "ES",
                "text": "El gráfico de 4H mostró un claro cambio de tendencia tras la ruptura, pero... ¿qué pasa con el largo plazo? Revisemos el gráfico diario.",
                "updated": 1668191695631
            },
            {
                "language": "IT",
                "text": "Il grafico 4H ha mostrato un netto cambiamento di tendenza dopo il crollo, ma... per quanto riguarda il lungo termine? Controlliamo il grafico giornaliero!",
                "updated": 1669900748385
            },
            {
                "language": "NL",
                "text": "De 4H-grafiek toonde een duidelijke verschuiving in de trend na de neerwaartse beweging, maar... hoe zit het met de lange termijn? Laten we de daggrafiek eens bekijken!",
                "updated": 1670785862699
            },
            {
                "language": "ID",
                "text": "Chart 4H menunjukkan pergeseran tren yang jelas setelah breakdown, tapi... bagaimana dengan jangka panjang? Mari kita periksa chart harian (daily chart)!",
                "updated": 1674694466569
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Find the April 10th candle and take a minute to think of what it meant&mdash;in the big picture&mdash;what we just analyzed in the lower time frames. This is what I see:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Suchen Sie die Kerze vom 10. April und nehmen Sie sich eine Minute Zeit, um darüber nachzudenken, was sie im großen Bild bedeutet - was wir gerade in den unteren Zeitrahmen analysiert haben. Ich sehe das so:",
                    "updated": 1639252957612
                },
                {
                    "language": "RU",
                    "text": "Найдите свечу от 10 апреля и потратьте минуту на то, чтобы подумать, что она означает в общей картине - то, что мы только что проанализировали на более низких таймфреймах. Вот что я вижу:",
                    "updated": 1640891117581
                },
                {
                    "language": "TR",
                    "text": "10 Nisan mumunu bulun ve daha düşük zaman dilimlerinde az önce analiz ettiğimiz şeyin büyük resimde ne anlama geldiğini düşünmek için bir dakikanızı ayırın. Benim gördüğüm şu:",
                    "updated": 1640948082107
                },
                {
                    "language": "ES",
                    "text": "Busque la vela del 10 de abril y tómese un minuto para pensar en lo que significa -en el panorama general- lo que acabamos de analizar en los marcos temporales inferiores. Esto es lo que veo:",
                    "updated": 1668191726119
                },
                {
                    "language": "IT",
                    "text": "Trova la candela del 10 aprile e prenditi un minuto per pensare a cosa significava, nel quadro generale, ciò che abbiamo appena analizzato nei tempi inferiori. Questo è quello che vedo:",
                    "updated": 1669900762994
                },
                {
                    "language": "NL",
                    "text": "Zoek de candle van 10 april en neem even de tijd om na te denken over wat het betekende - in het grote geheel - wat we zojuist in de lagere tijdsbestekken hebben geanalyseerd. Dit is wat ik zie:",
                    "updated": 1670785889963
                },
                {
                    "language": "ID",
                    "text": "Temukan candle 10 April dan luangkan waktu sejenak untuk memikirkan apa artinya—dalam gambaran besar—apa yang baru saja kita analisis dalam timeframe yang lebih rendah. Inilah yang saya lihat:",
                    "updated": 1674694475526
                }
            ]
        },
        {
            "style": "List",
            "text": "The walk: The ranging period we saw from the 7th until the 10th of April was in fact a little walk on the daily upper band. By the BB rules, this means that price is relatively high in this time frame.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Wanderung: Die Schwankungsperiode, die wir vom 7. bis zum 10. April gesehen haben, war in der Tat ein kleiner Spaziergang auf dem oberen Tagesband. Nach den BB-Regeln bedeutet dies, dass der Preis in diesem Zeitrahmen relativ hoch ist.",
                    "updated": 1639252969821
                },
                {
                    "language": "RU",
                    "text": "Прогулка: Период колебаний, который мы наблюдали с 7 по 10 апреля, на самом деле был небольшой прогулкой по дневной верхней полосе. По правилам BB это означает, что цена находится относительно высоко на данном временном интервале.",
                    "updated": 1640891156757
                },
                {
                    "language": "TR",
                    "text": "İlerleyiş: 7'den 10 Nisan'a kadar gördüğümüz değişen dönem, aslında günlük üst bantta biraz ilerleme oldu. BB kurallarına göre bu, bu zaman diliminde fiyatın nispeten yüksek olduğu anlamına gelir.",
                    "updated": 1640948168912
                },
                {
                    "language": "ES",
                    "text": "El paseo: El período de oscilación que vimos desde el 7 hasta el 10 de abril fue de hecho un pequeño paseo en la banda superior diaria. Según las reglas del BB, esto significa que el precio es relativamente alto en este marco de tiempo.",
                    "updated": 1668191784150
                },
                {
                    "language": "IT",
                    "text": "La passeggiata: Il periodo che abbiamo visto dal 7 al 10 aprile è stato infatti una piccola passeggiata sulla fascia alta giornaliera. Secondo le regole BB, ciò significa che il prezzo è relativamente alto in questo lasso di tempo.",
                    "updated": 1669900778238
                },
                {
                    "language": "NL",
                    "text": "The walk: De variërende periode die we zagen van 7 tot 10 april was eigenlijk een kleine wandeling op de dagelijkse bovenband. Volgens de BB-regels betekent dit dat de prijs in dit tijdsbestek relatief hoog is.",
                    "updated": 1670785921515
                },
                {
                    "language": "ID",
                    "text": "The walk:  Periode mulai yang kami lihat dari tanggal 7 hingga 10 April sebenarnya adalah sedikit perubahan di upper band harian. Menurut aturan BB, ini berarti harga relatif tinggi dalam timeframe ini.",
                    "updated": 1674694488554
                }
            ]
        },
        {
            "style": "List",
            "text": "Pullback: The breakdown in the lower time frames marked the pullback from the daily upper band.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Rückschlag: Der Zusammenbruch in den unteren Zeitrahmen markierte den Pullback vom oberen Tagesband.",
                    "updated": 1639252984757
                },
                {
                    "language": "RU",
                    "text": "Откат: Пробой в нижних временных рамках ознаменовал откат от дневной верхней полосы.",
                    "updated": 1640891171298
                },
                {
                    "language": "TR",
                    "text": "Geri Çekilme: alt zaman dilimlerindeki kırılma, günlük üst banttan geri çekilmeyi işaret etti.",
                    "updated": 1640948190508
                },
                {
                    "language": "ES",
                    "text": "Retroceso: La ruptura en los marcos temporales inferiores marcó el pullback desde la banda superior diaria.",
                    "updated": 1668191798545
                },
                {
                    "language": "IT",
                    "text": "Pullback: la rottura nei time frame inferiori ha segnato il pullback dalla banda superiore giornaliera.",
                    "updated": 1669900796852
                },
                {
                    "language": "NL",
                    "text": "Pullback: De neerwaartse beweging in de lagere tijdframes markeerde een verlaging van de dagelijkse bovenste band.",
                    "updated": 1670785973331
                },
                {
                    "language": "ID",
                    "text": "Pullback: Breakdown pada time frame bawah menandai pullback dari upper band harian.",
                    "updated": 1674694506330
                }
            ]
        },
        {
            "style": "List",
            "text": "Continuation: The price action in the larger time frame ended up being a normal pullback and continuation, barely crossing the moving average.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Fortsetzung: Die Kursbewegung im größeren Zeitrahmen endete als normaler Rückzug und Fortsetzung, wobei der gleitende Durchschnitt kaum überschritten wurde.",
                    "updated": 1639253028336
                },
                {
                    "language": "RU",
                    "text": "Продолжение: Ценовое движение на более крупном таймфрейме закончилось обычным откатом и продолжением, едва пересекая скользящую среднюю.",
                    "updated": 1640891206145
                },
                {
                    "language": "TR",
                    "text": "Devam: Daha geniş bir zaman dilimindeki fiyat hareketi, hareketli ortalamayı zar zor geçerek normal bir geri çekilme ve devam etme haline geldi.",
                    "updated": 1640948209405
                },
                {
                    "language": "ES",
                    "text": "Continuación: La acción del precio en el marco de tiempo mayor terminó siendo un retroceso normal y una continuación, apenas cruzando la media móvil.",
                    "updated": 1668191823413
                },
                {
                    "language": "NL",
                    "text": "Continuation: De prijsactie in het grotere tijdsbestek werd uiteindelijk een normale terugval en voortzetting, die nauwelijks het voortschrijdend gemiddelde overschreed.",
                    "updated": 1670786008858
                },
                {
                    "language": "ID",
                    "text": "Continuation: Price range dalam timeframe yang lebih besar akhirnya menjadi pullback dan kelanjutan yang normal (continuation), hampir tidak melewati moving average.",
                    "updated": 1674694540499
                }
            ]
        }
    ]
}