{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 31,
    "type": "Tutorial Step - Ready For The Next One..?",
    "definition": {
        "icon": {
            "name": "Tutorial\\tutorial",
            "project": "Foundations"
        },
        "text": "The tutorial to the right is the next in the series about designing trading systems. Shall we keep going?",
        "translations": [
            {
                "language": "DE",
                "text": "Das Tutorial auf der rechten Seite ist das nächste in der Reihe über die Entwicklung von Trading Systemen. Sollen wir weitermachen?",
                "updated": 1639253799245
            },
            {
                "language": "RU",
                "text": "Учебник справа - следующий в серии о проектировании торговых систем. Продолжим?",
                "updated": 1640892488897
            },
            {
                "language": "TR",
                "text": "Özet: Sağdaki öğretici, ticaret sistemleri tasarlamakla ilgili serinin bir sonraki öğreticisi. Devam elim mi?\n",
                "updated": 1640953504830
            },
            {
                "language": "ES",
                "text": "El tutorial de la derecha es el siguiente de la serie sobre el diseño de sistemas de trading. ¿Continuamos?",
                "updated": 1668194163913
            },
            {
                "language": "IT",
                "text": "Il tutorial a destra è il successivo della serie sulla progettazione di sistemi di trading. Continuiamo?",
                "updated": 1669901978758
            },
            {
                "language": "NL",
                "text": "De tutorial aan de rechterkant is de volgende in de serie over het ontwerpen van handelssystemen. Zullen we doorgaan?",
                "updated": 1670787769003
            },
            {
                "language": "ID",
                "text": "Tutorial di sebelah kanan adalah seri berikutnya tentang merancang sistem trading. Akankah kita terus lanjut?",
                "updated": 1674701417093
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "The next tutorial in the series is about implementing the ideas we just came up with on a Trading System so that they may be tested.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Im nächsten Tutorial der Serie geht es darum, die Ideen, die wir gerade entwickelt haben, in einem Trading System umzusetzen, um sie zu testen.",
                    "updated": 1639253809021
                },
                {
                    "language": "RU",
                    "text": "Следующий урок в этой серии посвящен реализации идей, которые мы только что придумали, в торговой системе, чтобы их можно было проверить.",
                    "updated": 1640892507099
                },
                {
                    "language": "TR",
                    "text": "Serideki bir sonraki öğretici, test edilebilmesi için yeni bulduğumuz fikirleri bir Ticaret Sisteminde ( Trading System ) uygulamakla ilgilidir.",
                    "updated": 1640953541935
                },
                {
                    "language": "ES",
                    "text": "El siguiente tutorial de la serie trata sobre la implementación de las ideas que acabamos de concebir en un sistema de trading (Trading System) para poder probarlas.",
                    "updated": 1668194200867
                },
                {
                    "language": "IT",
                    "text": "Il prossimo tutorial della serie riguarda l'implementazione delle idee che abbiamo appena avuto su un Trading System in modo che possano essere testate.",
                    "updated": 1669901998322
                },
                {
                    "language": "NL",
                    "text": "De volgende zelfstudie in de serie gaat over het implementeren van de ideeën die we zojuist hebben bedacht in een Trading System, zodat ze kunnen worden getest.",
                    "updated": 1670787818998
                },
                {
                    "language": "ID",
                    "text": "Tutorial berikutnya dalam seri ini adalah tentang mengimplementasikan ide-ide yang baru saja kita dapatkan pada Trading System sehingga dapat diuji.",
                    "updated": 1674701422704
                }
            ]
        },
        {
            "style": "Success",
            "text": "Click Next to finish this tutorial, and select Play in the next one when you are ready!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Klicken Sie auf \"Next\", um dieses Tutorial zu beenden, und wählen Sie \"Play\" im nächsten Tutorial, wenn Sie bereit sind!",
                    "updated": 1639253837290
                },
                {
                    "language": "RU",
                    "text": "Нажмите кнопку Next, чтобы закончить этот урок, и выберите Play для следующего урока, когда будете готовы!",
                    "updated": 1640892580865
                },
                {
                    "language": "TR",
                    "text": "İpucu: Bu öğreticiyi bitirmek için İleri'ye tıklayın ve hazır olduğunuzda bir sonraki öğreticide Oynat'ı seçin!",
                    "updated": 1640953581708
                },
                {
                    "language": "ES",
                    "text": "Haz clic en Next para terminar este tutorial, y seleccione Play en el siguiente cuando estés listo.",
                    "updated": 1675206149255
                },
                {
                    "language": "IT",
                    "text": "Fai clic su Avanti per terminare questo tutorial e seleziona Riproduci nel prossimo quando sei pronto!",
                    "updated": 1669902015140
                },
                {
                    "language": "NL",
                    "text": "Click Next om deze zelfstudie te beëindigen, en selecteer Play in de volgende als je er klaar voor bent!",
                    "updated": 1670787890238
                },
                {
                    "language": "ID",
                    "text": "Klik Next untuk menyelesaikan tutorial ini, dan pilih Play di tutorial berikutnya saat kamu siap!",
                    "updated": 1674701429292
                }
            ]
        }
    ]
}