{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 27,
    "type": "Tutorial Step - Let's Define the First Two!",
    "definition": {
        "icon": {
            "name": "Layer\\layer-trends",
            "project": "Foundations"
        },
        "text": "Let's advance with the definition of the trading process and the context in which these ideas should operate.",
        "translations": [
            {
                "language": "DE",
                "text": "Beginnen wir mit der Definition des Handelsprozesses und dem Kontext, in dem diese Ideen funktionieren sollten.",
                "updated": 1639253595335
            },
            {
                "language": "RU",
                "text": "Давайте начнем с определения процесса торговли и контекста, в котором эти идеи должны работать.",
                "updated": 1640892165815
            },
            {
                "language": "TR",
                "text": "Özet: Ticaret sürecinin tanımıyla ve bu fikirlerin çalışması gereken bağlamla ilerleyeceğiz.",
                "updated": 1640950911067
            },
            {
                "language": "ES",
                "text": " Avancemos con la definición del proceso de trading y el contexto en el que deben operar estas ideas.",
                "updated": 1668193438103
            },
            {
                "language": "IT",
                "text": "Andiamo avanti con la definizione del processo di trading e del contesto in cui queste idee dovrebbero operare.",
                "updated": 1669901675099
            },
            {
                "language": "NL",
                "text": "Laten we verder gaan met de definitie van het handelsproces en de context waarin deze ideeën zouden moeten werken.",
                "updated": 1670787220165
            },
            {
                "language": "ID",
                "text": "Mari kita lanjutkan dengan definisi proses trading dan konteks di mana ide-ide ini harus beroperasi.",
                "updated": 1674700664046
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "Trading process: Since we rely on trends in the 24H charts, this will be a swing strategy, with positions open&mdash;potentially&mdash;for several days.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Handelsprozess: Da wir uns auf Trends in den 24-Stunden-Charts verlassen, wird dies eine Swing-Strategie sein, mit offenen Positionen - möglicherweise für mehrere Tage.",
                    "updated": 1639253609069
                },
                {
                    "language": "RU",
                    "text": "Торговый процесс: Поскольку мы полагаемся на тренды на 24-часовых графиках, это будет свинг-стратегия, с открытыми позициями - потенциально на несколько дней.",
                    "updated": 1640892194310
                },
                {
                    "language": "TR",
                    "text": "İşlem süreci ( trading process ): 24 saatlik çizelgelerdeki trendlere güvendiğimiz için bu, pozisyonların -potansiyel olarak- birkaç gün boyunca açık olduğu bir salınım stratejisi olacaktır.",
                    "updated": 1640950998948
                },
                {
                    "language": "ES",
                    "text": "Proceso de Trading: Dado que nos basamos en las tendencias de los gráficos de 24H, esta será una estrategia swing, con posiciones abiertas -potencialmente- durante varios días.",
                    "updated": 1668193480562
                },
                {
                    "language": "IT",
                    "text": "Processo di trading: poiché ci affidiamo alle tendenze nei grafici 24H, questa sarà una strategia swing, con posizioni aperte, potenzialmente, per diversi giorni.",
                    "updated": 1669901703466
                },
                {
                    "language": "NL",
                    "text": "Trading process: Aangezien we vertrouwen op trends in de 24H-grafieken, wordt dit een swingstrategie, met posities die mogelijk meerdere dagen openstaan.",
                    "updated": 1670787239150
                },
                {
                    "language": "ID",
                    "text": "Proses trading: Karena kita mengandalkan tren di chart 24H, ini akan menjadi strategi swing, dengan open position—berpotensi—selama beberapa hari.",
                    "updated": 1674700672222
                }
            ]
        },
        {
            "style": "List",
            "text": "Context: The first hypothesis is for uptrends in the 24H chart. The second, for downtrends and likely for ranging markets as well. We will leave the definition as of how the trends are to be determined for later on, once you become familiar with the tools available in Superalgos.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Kontext: Die erste Hypothese bezieht sich auf Aufwärtstrends auf dem 24-Stunden-Chart. Die zweite für Abwärtstrends und wahrscheinlich auch für schwankende Märkte. Die Definition, wie die Trends zu bestimmen sind, überlassen wir einem späteren Zeitpunkt, wenn Sie sich mit den in Superalgos verfügbaren Tools vertraut gemacht haben.",
                    "updated": 1639253621062
                },
                {
                    "language": "RU",
                    "text": "Контекст: Первая гипотеза предназначена для восходящих трендов на 24-часовом графике. Вторая - для нисходящих трендов и, вероятно, для колеблющихся рынков. Определение того, как определяются тренды, мы оставим на потом, когда вы познакомитесь с инструментами, доступными в Superalgos.",
                    "updated": 1640892221691
                },
                {
                    "language": "TR",
                    "text": "Bağlam: İlk hipotez, 24 saatlik grafikteki yükseliş trendleri içindir. İkincisi, düşüş trendleri ve muhtemelen değişen pazarlar için. Superalgos'ta mevcut olan araçlara aşina olduğunuzda, trendlerin nasıl belirleneceğini daha sonra tanımlayacağız.",
                    "updated": 1640951767615
                },
                {
                    "language": "ES",
                    "text": "Contexto: La primera hipótesis es para tendencias alcistas en el gráfico de 24H. La segunda, para tendencias bajistas y probablemente también para mercados oscilantes. Dejaremos la definición de cómo se determinan las tendencias para más adelante, cuando se familiarice con las herramientas disponibles en Superalgos.",
                    "updated": 1668193548570
                },
                {
                    "language": "IT",
                    "text": "Contesto: la prima ipotesi è per i trend rialzisti nel grafico a 24 ore. Il secondo, per le tendenze al ribasso e probabilmente anche per i mercati variabili. Lasceremo la definizione di come determinare le tendenze per dopo, una volta acquisita familiarità con gli strumenti disponibili in Superalgos.",
                    "updated": 1669901716964
                },
                {
                    "language": "NL",
                    "text": "Context: De eerste hypothese is voor opwaartse trends in de 24H-grafiek. De tweede, voor neerwaartse trends en waarschijnlijk ook voor verschillende markten. We laten de definitie van hoe de trends moeten worden bepaald voor later, zodra u bekend raakt met de tools die beschikbaar zijn in Superalgos.",
                    "updated": 1670787264061
                },
                {
                    "language": "ID",
                    "text": "Konteks: Hipotesis pertama adalah untuk uptrend di chart 24H. Yang kedua, untuk downtrend dan kemungkinan juga untuk ranging market. Kita akan meninggalkan definisi tentang bagaimana tren ditentukan untuk nantinya, setelah kamu terbiasa dengan alat yang tersedia di Superalgos.",
                    "updated": 1674700679806
                }
            ]
        },
        {
            "style": "Note",
            "text": "The goal of the idea is to accumulate bitcoin selling BTC to rebuy at a cheaper price.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Das Ziel dieser Idee ist es, Bitcoin zu akkumulieren, indem man BTC verkauft, um sie zu einem günstigeren Preis wieder zu kaufen.",
                    "updated": 1639253628676
                },
                {
                    "language": "RU",
                    "text": "Цель идеи - накапливать биткоин, продавая BTC для повторной покупки по более дешевой цене.",
                    "updated": 1640892237140
                },
                {
                    "language": "TR",
                    "text": "Not: Fikrin amacı, bitcoin'i daha ucuz bir fiyata yeniden satın almak.",
                    "updated": 1640951904063
                },
                {
                    "language": "ES",
                    "text": "El objetivo de la idea es acumular bitcoin vendiendo BTC para volver a comprar a un precio más barato.",
                    "updated": 1668193557416
                },
                {
                    "language": "IT",
                    "text": "L'obiettivo dell'idea è accumulare bitcoin vendendo BTC per riacquistare a un prezzo più conveniente.",
                    "updated": 1669901731779
                },
                {
                    "language": "NL",
                    "text": "Het doel van het idee is om bitcoin te verzamelen door BTC te verkopen om tegen een lagere prijs opnieuw te kopen.",
                    "updated": 1670787284183
                },
                {
                    "language": "ID",
                    "text": "Tujuan dari ide ini adalah untuk akumulasi bitcoin yang menjual BTC untuk dibeli kembali dengan harga yang lebih murah.",
                    "updated": 1674700693247
                }
            ]
        }
    ]
}