{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 5,
    "type": "Tutorial Step - Let's Mine Some Data..!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "run"
        },
        "text": "Now that you understand the implications of running this data mining operation, let's get on with it!",
        "translations": [
            {
                "language": "ES",
                "text": "Ahora que comprendes las implicaciones de ejecutar esta operación de minería de datos, ¡sigamos adelante!",
                "updated": 1675205383523
            },
            {
                "language": "DE",
                "text": "Nachdem Sie nun verstanden haben, was es bedeutet, diese Data-Mining-Operation auszuführen, lassen Sie uns loslegen!",
                "updated": 1639251547741
            },
            {
                "language": "RU",
                "text": "Теперь, когда вы понимаете последствия проведения операции по добыче данных, давайте приступим к делу!",
                "updated": 1640888062641
            },
            {
                "language": "TR",
                "text": "Artık bu veri madenciliği operasyonunu yürütmenin sonuçlarını anladığınıza göre, başlayalım!",
                "updated": 1640863987889
            },
            {
                "language": "IT",
                "text": "Ora che comprendi le implicazioni dell'esecuzione di questa operazione di data mining, procediamo!",
                "updated": 1669885648657
            },
            {
                "language": "NL",
                "text": "Nu u de implicaties begrijpt van het uitvoeren van deze dataminingoperatie, laten we ermee aan de slag gaan!",
                "updated": 1670783376204
            },
            {
                "language": "ID",
                "text": "Sekarang setelah kamu memahami implikasi menjalankan operasi data mining ini, mari kita lanjutkan!",
                "updated": 1674638831703
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Select \"Run All Project Data Tasks\" on the Data Tasks node menu!",
            "updated": 1622447060448,
            "translations": [
                {
                    "language": "ES",
                    "text": "Selecciona \"Run All Project Data Tasks\"en el menú Data Tasks!",
                    "updated": 1675205389068
                },
                {
                    "language": "DE",
                    "text": "Wählen Sie \"Run All Project Data Tasks\" im Menü des Knotens Data Tasks!",
                    "updated": 1639251562329
                },
                {
                    "language": "RU",
                    "text": "Выберите \" Run All Project Data Tasks\" в меню узла Data Tasks!",
                    "updated": 1640888078457
                },
                {
                    "language": "TR",
                    "text": "Veri Görevleri ( Data Tasks ) düğüm menüsünde \"Tüm Proje Veri Görevlerini ( Project Data Tasks ) Çalıştır\"ı seçin!",
                    "updated": 1640864070221
                },
                {
                    "language": "IT",
                    "text": "Seleziona \"Run All Project Data Tasks\" sul menù del nodo Data Tasks !",
                    "updated": 1669885666250
                },
                {
                    "language": "NL",
                    "text": "Selecteer \"Run All Project Data Tasks\" in het knooppuntmenu Data Tasks!",
                    "updated": 1670783416736
                },
                {
                    "language": "ID",
                    "text": "Pilih \"Run All Project Data Tasks\" pada menu Data Tasks node!",
                    "updated": 1674638838265
                }
            ]
        },
        {
            "style": "Note",
            "text": "If you are doing this tutorial after doing other tutorials, chances are you may already have part of the data required, which may make things faster! Either way, no need to wait for the data mining to get to the present time... you may keep going with the tutorial!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si estás realizando este tutorial después de realizar otros tutoriales, es probable que ya tengas parte de los datos necesarios, ¡lo que puede hacer las cosas más rápido! De cualquier manera, no es necesario esperar a que la minería de datos llegue al presente... ¡puedes continuar con el tutorial!",
                    "updated": 1675205412797
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie dieses Tutorial nach anderen Tutorials machen, haben Sie vielleicht schon einen Teil der benötigten Daten, was die Sache beschleunigen kann! In jedem Fall brauchen Sie nicht zu warten, bis die Datenerfassung zum jetzigen Zeitpunkt abgeschlossen ist... Sie können mit dem Lernprogramm fortfahren!",
                    "updated": 1639251571526
                },
                {
                    "language": "RU",
                    "text": "Если вы изучаете этот учебник после изучения других учебников, есть вероятность того, что у вас уже есть часть необходимых данных, что может ускорить процесс! В любом случае, нет необходимости ждать, пока добыча данных дойдет до настоящего времени... вы можете продолжать заниматься по этому учебнику!",
                    "updated": 1640888209034
                },
                {
                    "language": "TR",
                    "text": "Not: Bu öğreticiyi diğer öğreticileri yaptıktan sonra yapıyorsanız, gereken verilerin bir kısmına zaten sahip olabilirsiniz, bu da işleri daha hızlı hale getirebilir! Her iki durumda da, veri madenciliğinin şimdiki zamana gelmesini beklemenize gerek yok... öğreticiye devam edebilirsiniz!",
                    "updated": 1640864703636
                },
                {
                    "language": "NL",
                    "text": "Als je deze zelfstudie doet nadat je andere zelfstudies hebt gedaan, is de kans groot dat je al een deel van de vereiste gegevens hebt, waardoor dingen sneller kunnen gaan! Hoe dan ook, u hoeft niet te wachten tot de datamining de huidige tijd bereikt... u kunt doorgaan met de tutorial!",
                    "updated": 1670783452588
                },
                {
                    "language": "ID",
                    "text": "Jika kamu melakukan tutorial ini setelah melakukan tutorial lainnya, kemungkinan besar kamu sudah memiliki sebagian dari data yang diperlukan, yang dapat membuat segalanya lebih cepat! Adapun lainnya, tidak perlu menunggu data mine sampai saat ini... kamu dapat melanjutkan dengan tutorialnya!",
                    "updated": 1674687740293
                }
            ]
        }
    ]
}