{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 13,
    "type": "Tutorial Step - Are We Up to Date..?",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "indicator-process-instance"
        },
        "text": "By now, all processes should be at 100%. We need the data to be ready so that we can go and do some work on the charts!",
        "translations": [
            {
                "language": "DE",
                "text": "Inzwischen sollten alle Prozesse auf 100 % stehen. Die Daten müssen fertig sein, damit wir mit den Diagrammen arbeiten können!",
                "updated": 1639252044935
            },
            {
                "language": "RU",
                "text": "К этому моменту все процессы должны быть на 100%. Нам нужно, чтобы данные были готовы, чтобы мы могли пойти и немного поработать с графиками!",
                "updated": 1640890202922
            },
            {
                "language": "TR",
                "text": "Şimdiye kadar, tüm işlemler %100 olmalıdır. Gidip grafikler üzerinde biraz çalışabilmemiz için verilerin hazır olmasına ihtiyacımız var!",
                "updated": 1640869840820
            },
            {
                "language": "ES",
                "text": "En este momento, todos los procesos deberían estar al 100%. Necesitamos que los datos estén listos para poder ir a trabajar en los gráficos.",
                "updated": 1668189996012
            },
            {
                "language": "IT",
                "text": "Ormai tutti i processi dovrebbero essere al 100%. Abbiamo bisogno che i dati siano pronti in modo da poter andare a lavorare sui grafici!",
                "updated": 1669895717989
            },
            {
                "language": "NL",
                "text": "Inmiddels zouden alle processen op 100% moeten staan. We hebben de gegevens nodig, zodat we wat werk aan de grafieken kunnen gaan doen!",
                "updated": 1670784560456
            },
            {
                "language": "ID",
                "text": "Sekarang, semua proses seharusnya 100%. Kita membutuhkan data untuk kesiapan sehingga kita dapat pergi dan melakukan beberapa pekerjaan pada chart!",
                "updated": 1674690042068
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Look around and see if all processes are at 100%. If all of them are, then stop the data mining!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Schauen Sie sich um und prüfen Sie, ob alle Prozesse bei 100 % sind. Wenn das der Fall ist, beenden Sie das Data Mining!",
                    "updated": 1639252053189
                },
                {
                    "language": "RU",
                    "text": "Оглянитесь вокруг и посмотрите, все ли процессы работают на 100%. Если все, то прекратите добычу данных!",
                    "updated": 1640890220124
                },
                {
                    "language": "TR",
                    "text": "Etrafınıza bakın ve tüm işlemlerin %100 olup olmadığını görün. Hepsi %100 ise, veri madenciliğini durdurun!",
                    "updated": 1640869956806
                },
                {
                    "language": "ES",
                    "text": "Revisa todos los procesos y comprueba si están al 100%. Si todos lo están, ¡Clic Stop en el Data Tasks Node!",
                    "updated": 1675205604013
                },
                {
                    "language": "IT",
                    "text": "Guardati intorno e vedi se tutti i processi sono al 100%. Se lo sono tutti, allora interrompi il data mining!",
                    "updated": 1669895735643
                },
                {
                    "language": "NL",
                    "text": "Kijk rond en kijk of alle processen op 100% staan. Als ze dat allemaal zijn, stop dan de datamining!",
                    "updated": 1670784588128
                },
                {
                    "language": "ID",
                    "text": "Lihatlah ke sekeliling dan lihat apakah semua proses berada pada 100%. Jika semuanya sudah, maka hentikan data mining!",
                    "updated": 1674690033303
                }
            ]
        },
        {
            "style": "Note",
            "text": "Wait until all processes reach the 100% mark before continuing!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Warten Sie, bis alle Prozesse die 100%-Marke erreicht haben, bevor Sie fortfahren!",
                    "updated": 1639252062570
                },
                {
                    "language": "RU",
                    "text": "Подождите, пока все процессы достигнут отметки 100%, прежде чем продолжить!",
                    "updated": 1640890233571
                },
                {
                    "language": "TR",
                    "text": "Not: Devam etmeden önce tüm işlemlerin %100 işaretine ulaşmasını bekleyin!",
                    "updated": 1640870047711
                },
                {
                    "language": "ES",
                    "text": "¡Espera hasta que todos los procesos estén al 100% antes de continuar!",
                    "updated": 1675205614528
                },
                {
                    "language": "IT",
                    "text": "Attendere che tutti i processi raggiungano il 100% prima di continuare!",
                    "updated": 1669895774750
                },
                {
                    "language": "NL",
                    "text": "Wacht tot alle processen de 100%-markering hebben bereikt voordat u verder gaat!",
                    "updated": 1670784600644
                },
                {
                    "language": "ID",
                    "text": "Tunggu hingga semua proses mencapai tanda 100% sebelum melanjutkan!",
                    "updated": 1674690050196
                }
            ]
        },
        {
            "style": "Success",
            "text": "In the next step we are going to the charts to check the Bollinger Bands so that we can discuss the trading idea we will test!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Im nächsten Schritt gehen wir zu den Charts, um die Bollinger Bands zu überprüfen, damit wir die Handelsidee diskutieren können, die wir testen werden!",
                    "updated": 1639252083855
                },
                {
                    "language": "RU",
                    "text": "На следующем этапе мы переходим к графикам для проверки полос Боллинджера, чтобы мы могли обсудить торговую идею, которую мы будем тестировать!",
                    "updated": 1640890248262
                },
                {
                    "language": "TR",
                    "text": " İpucu: Bir sonraki adımda Bollinger Bantlarını kontrol etmek için grafiklere gidiyoruz, böylece test edeceğimiz ticaret fikrini tartışabiliriz!",
                    "updated": 1640870153849
                },
                {
                    "language": "ES",
                    "text": "En el siguiente paso vamos a los gráficos y miraremos las Bandas de Bollinger para poder discutir la idea de trading que vamos a probar.",
                    "updated": 1668190165911
                },
                {
                    "language": "NL",
                    "text": "In de volgende stap gaan we naar de grafieken om de Bollinger Bands te controleren, zodat we het handelsidee kunnen bespreken dat we zullen testen!",
                    "updated": 1670784632487
                },
                {
                    "language": "ID",
                    "text": "Pada langkah selanjutnya kita akan melihat chart untuk memeriksa Bollinger Bands sehingga kita dapat mendiskusikan ide trading yang akan kita uji!",
                    "updated": 1674690056710
                }
            ]
        }
    ]
}