{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 19,
    "type": "Tutorial Step - Let's Zoom Out!",
    "definition": {
        "icon": {
            "name": "Time\\time-frame",
            "project": "Foundations"
        },
        "text": "We've got an idea of what's going on in the 1H time frame. Let's zoom out a bit and take a look at the intermediate-term.",
        "translations": [
            {
                "language": "DE",
                "text": "Wir haben eine Vorstellung davon, was im 1-Stunden-Zeitrahmen vor sich geht. Zoomen wir ein wenig heraus und werfen einen Blick auf den mittelfristigen Bereich.",
                "updated": 1639252880126
            },
            {
                "language": "RU",
                "text": "Мы имеем представление о том, что происходит на часовом графике. Давайте немного увеличим масштаб и посмотрим на промежуточную перспективу.",
                "updated": 1640890947841
            },
            {
                "language": "TR",
                "text": "Özet: 1 saatlik zaman çerçevesinde neler olup bittiğine dair bir fikrimiz var. Biraz uzaklaşıp orta vadeye bir göz atalım.",
                "updated": 1640947862345
            },
            {
                "language": "ES",
                "text": "Tenemos una idea de lo que ocurre en el marco temporal de 1H. Vamos a alejarnos un poco y echar un vistazo al plazo intermedio.",
                "updated": 1668191372889
            },
            {
                "language": "IT",
                "text": "Abbiamo un'idea di cosa sta succedendo nel lasso di tempo di 1H. Rimpiccioliamo un po' e diamo un'occhiata al termine intermedio.",
                "updated": 1669900612474
            },
            {
                "language": "NL",
                "text": "We hebben een idee van wat er gaande is in het tijdsbestek van 1H. Laten we een beetje uitzoomen en naar de tussenliggende termijn kijken.",
                "updated": 1670785614091
            },
            {
                "language": "ID",
                "text": "Kita memiliki ide tentang apa yang terjadi dalam timeframe 1H. Mari perkecil sedikit dan lihat jangka menengahnya (intermediate-term).",
                "updated": 1674693995826
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I just brought you to the 4H chart, on the same dates. Notice the following:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Ich habe Sie soeben zum 4H-Chart mit denselben Daten gebracht. Beachten Sie das Folgende:",
                    "updated": 1639252893103
                },
                {
                    "language": "RU",
                    "text": "Я только что привел вам 4-часовой график, на те же даты. Обратите внимание на следующее:",
                    "updated": 1640890979297
                },
                {
                    "language": "TR",
                    "text": "Seni aynı tarihlerde 4H grafiğine getirdim. Aşağıdakilere dikkat edin:",
                    "updated": 1640947881342
                },
                {
                    "language": "ES",
                    "text": "Acabo de llevarle al gráfico de 4H, en las mismas fechas. Observa lo siguiente:",
                    "updated": 1668191436417
                },
                {
                    "language": "IT",
                    "text": "Ti ho appena portato al grafico 4H, nelle stesse date. Notare quanto segue:",
                    "updated": 1669900631986
                },
                {
                    "language": "NL",
                    "text": "Ik heb je zojuist naar de 4H-grafiek gebracht, op dezelfde data. Let op het volgende:",
                    "updated": 1670785644044
                },
                {
                    "language": "ID",
                    "text": "Aku baru saja membawamu ke chart 4H, pada tanggal yang sama. Perhatikan hal berikut:",
                    "updated": 1674694016064
                }
            ]
        },
        {
            "style": "List",
            "text": "Breakdown: The breakdown we saw in the 1H chart is evident in the 4H chart too.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Zusammenbruch: Der Zusammenbruch, den wir auf dem 1-Stunden-Chart gesehen haben, ist auch auf dem 4-Stunden-Chart zu erkennen.",
                    "updated": 1639252904620
                },
                {
                    "language": "RU",
                    "text": "Пробой: Пробой, который мы видели на графике 1H, также очевиден и на графике 4H.",
                    "updated": 1640891000194
                },
                {
                    "language": "TR",
                    "text": "Arıza: 1H çizelgesinde gördüğümüz arıza, 4H çizelgesinde de belirgindir.",
                    "updated": 1640947893385
                },
                {
                    "language": "ES",
                    "text": "Ruptura: La ruptura que vimos en el gráfico de 1H es evidente también en el gráfico de 4H.",
                    "updated": 1668191454650
                },
                {
                    "language": "IT",
                    "text": "Breakdown: il breakdown che abbiamo visto nel grafico 1H è evidente anche nel grafico 4H.",
                    "updated": 1669900651737
                },
                {
                    "language": "NL",
                    "text": "Breakdown: De neerwaartse uitbraak die we in de 1H-grafiek zagen, is ook duidelijk in de 4H-grafiek.",
                    "updated": 1670785690163
                },
                {
                    "language": "ID",
                    "text": "Breakdown: Breakdown yang kita lihat di chart 1H juga terlihat di chart 4H.",
                    "updated": 1674694009722
                }
            ]
        },
        {
            "style": "List",
            "text": "Immediate past: Before the breakdown on April 10th, the market had been ranging for a while.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Unmittelbare Vergangenheit: Vor dem Zusammenbruch am 10. April bewegte sich der Markt schon eine Weile.",
                    "updated": 1639252911166
                },
                {
                    "language": "RU",
                    "text": "Недалекое прошлое: До пробоя 10 апреля рынок некоторое время колебался.",
                    "updated": 1640891016578
                },
                {
                    "language": "TR",
                    "text": "Hemen geçmiş:10 Nisan'daki çöküş öncesi piyasa bir süredir hareketliydi.",
                    "updated": 1640947908913
                },
                {
                    "language": "ES",
                    "text": "Pasado inmediato: Antes de la ruptura del 10 de abril, el mercado había estado oscilando dentro de un rango durante un tiempo.",
                    "updated": 1668191512621
                },
                {
                    "language": "IT",
                    "text": "Passato immediato: prima del crollo del 10 aprile, il mercato oscillava da un po'.",
                    "updated": 1669900667426
                },
                {
                    "language": "NL",
                    "text": "Immediate past: Vóór de neerwaartse uitbraak op 10 april was de markt al een tijdje aan het schommelen.",
                    "updated": 1670785729803
                },
                {
                    "language": "ID",
                    "text": "Immediate past: Sebelum breakdown pada 10 April, market telah berkisar untuk sementara waktu.",
                    "updated": 1674694029456
                }
            ]
        },
        {
            "style": "List",
            "text": "Before that: The market was trending upwards&mdash;that is, the intermediate-term was in an uptrend.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Davor: Der Markt befand sich in einem Aufwärtstrend, d. h. der mittelfristige Trend war aufwärts gerichtet.",
                    "updated": 1639252918205
                },
                {
                    "language": "RU",
                    "text": "До этого: Рынок имел тенденцию к росту - то есть промежуточный краткосрочный тренд был восходящим.",
                    "updated": 1640891031767
                },
                {
                    "language": "TR",
                    "text": "Bundan önce: Piyasa yükseliş eğilimindeydi - yani orta vadeli bir yükseliş trendindeydi.",
                    "updated": 1640947927156
                },
                {
                    "language": "ES",
                    "text": "Antes de eso: El mercado tenía una tendencia ascendente, es decir, el plazo intermedio estaba en una tendencia alcista.",
                    "updated": 1668191551564
                },
                {
                    "language": "IT",
                    "text": "Prima di allora: il mercato era in rialzo, ovvero il termine intermedio era in rialzo.",
                    "updated": 1669900683345
                },
                {
                    "language": "NL",
                    "text": "Before that: De markt vertoonde een opwaartse trend, dat wil zeggen, de middellange termijn was in een opwaartse trend.",
                    "updated": 1670785753427
                },
                {
                    "language": "ID",
                    "text": "Before that: Market sedang dalam tren naik keatas—artinya, jangka menengah sedang dalam keadaan uptrend.",
                    "updated": 1674694088338
                }
            ]
        },
        {
            "style": "List",
            "text": "Downtrend: The breakdown on April 10th marked the start of a downtrend in the intermediate-term.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Abwärtstrend: Der Zusammenbruch am 10. April markierte den Beginn eines Abwärtstrends im mittelfristigen Bereich.",
                    "updated": 1639252924187
                },
                {
                    "language": "RU",
                    "text": "Нисходящий тренд: Пробой 10 апреля ознаменовал начало нисходящего тренда в среднесрочной перспективе.",
                    "updated": 1640891045651
                },
                {
                    "language": "TR",
                    "text": "Düşüş trendi: 10 Nisan'daki kırılma, orta vadede düşüş trendinin başlangıcını işaret etti.",
                    "updated": 1640947941113
                },
                {
                    "language": "ES",
                    "text": "Tendencia bajista: La ruptura del 10 de abril marcó el inicio de una tendencia bajista a medio plazo.",
                    "updated": 1668191566208
                },
                {
                    "language": "IT",
                    "text": "Trend ribassista: il crollo del 10 aprile ha segnato l'inizio di un trend ribassista a medio termine.",
                    "updated": 1669900698463
                },
                {
                    "language": "NL",
                    "text": "Downtrend: De neerwaartse uitbraak op 10 april markeerde het begin van een neerwaartse trend op de middellange termijn.",
                    "updated": 1670785780139
                },
                {
                    "language": "ID",
                    "text": "Downtrend: Breakdown pada 10 April menandai dimulainya tren turun dalam jangka menengah.",
                    "updated": 1674694059069
                }
            ]
        }
    ]
}