{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 25,
    "type": "Tutorial Step - We've got Two Hypotheses!",
    "definition": {
        "icon": {
            "name": "Nodes\\nodes-highlights",
            "project": "Foundations"
        },
        "text": "Let's recover our previous hypothesis and come up with a new one for the most recent observations!",
        "translations": [
            {
                "language": "DE",
                "text": "Lassen Sie uns unsere vorherige Hypothese wiederherstellen und eine neue Hypothese für die jüngsten Beobachtungen aufstellen!",
                "updated": 1639253454746
            },
            {
                "language": "RU",
                "text": "Давайте восстановим нашу предыдущую гипотезу и придумаем новую для последних наблюдений!",
                "updated": 1640891997877
            },
            {
                "language": "TR",
                "text": "Özet: Önceki varsayımımızı geri yükleyelim ve son gözlemler için yeni bir tane bulalım!",
                "updated": 1640949719690
            },
            {
                "language": "ES",
                "text": "Recuperemos nuestra hipótesis anterior e ideemos una nueva para las observaciones más recientes.",
                "updated": 1668193080527
            },
            {
                "language": "IT",
                "text": "Recuperiamo la nostra ipotesi precedente e ne inventiamo una nuova per le osservazioni più recenti!",
                "updated": 1669901147838
            },
            {
                "language": "NL",
                "text": "Laten we onze eerdere hypothese herstellen en een nieuwe bedenken voor de meest recente waarnemingen!",
                "updated": 1670786842936
            },
            {
                "language": "ID",
                "text": "Mari pulihkan hipotesis kita sebelumnya dan buat hipotesis baru untuk pengamatan terbaru!",
                "updated": 1674699207870
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "Hypothesis 1: In the context of an uptrend in the daily chart, a breakdown of the Bollinger Bands in the 1H chart may predict a reversal in the intermediate trend.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Hypothese 1: Im Rahmen eines Aufwärtstrends im Tages-Chart kann ein Durchbrechen der Bollinger Bänder im 1H-Chart eine Umkehrung des Zwischentrends vorhersagen.",
                    "updated": 1639253473443
                },
                {
                    "language": "RU",
                    "text": "Гипотеза 1: В контексте восходящего тренда на дневном графике, пробой полос Боллинджера на часовом графике может предсказать разворот промежуточного тренда.",
                    "updated": 1640892022350
                },
                {
                    "language": "TR",
                    "text": "Varsayım 1: Günlük grafikte bir yükseliş trendi bağlamında, 1H grafiğindeki Bollinger Bantlarının bir dökümü, ara trendde bir tersine dönüşü öngörebilir.",
                    "updated": 1640949950526
                },
                {
                    "language": "ES",
                    "text": "Hipótesis 1: En el contexto de una tendencia alcista en el gráfico diario, una ruptura de las Bandas de Bollinger en el gráfico 1H puede predecir una inversión de la tendencia intermedia.",
                    "updated": 1668193124428
                },
                {
                    "language": "IT",
                    "text": "Ipotesi 1: Nel contesto di un trend rialzista nel grafico giornaliero, una ripartizione delle bande di Bollinger nel grafico 1H potrebbe prevedere un'inversione del trend intermedio.",
                    "updated": 1669901161412
                },
                {
                    "language": "NL",
                    "text": "Hypothese 1: In de context van een uptrend in de daily chart, kan een uitbraak van de Bollinger Bands in de 1H chart een ommekeer in de tussenliggende trend voorspellen.",
                    "updated": 1670786952126
                },
                {
                    "language": "ID",
                    "text": "Hipotesis 1: Dalam konteks uptrend di chart harian, breakdown Bollinger Bands di chart 1H dapat memprediksi reversal dalam tren intermediate.",
                    "updated": 1674699354383
                }
            ]
        },
        {
            "style": "List",
            "text": "Hypothesis 2: In the context of a downtrend in the daily chart, a breakdown of the Bollinger Bands in the 1H chart may predict an acceleration of the downtrend.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Hypothese 2: Im Zusammenhang mit einem Abwärtstrend auf dem Tages-Chart kann ein Durchbruch der Bollinger Bänder auf dem 1H-Chart eine Beschleunigung des Abwärtstrends vorhersagen.",
                    "updated": 1639253490763
                },
                {
                    "language": "RU",
                    "text": "Гипотеза 2: В контексте нисходящего тренда на дневном графике, пробой полос Боллинджера на часовом графике может предсказать ускорение нисходящего тренда.",
                    "updated": 1640892042464
                },
                {
                    "language": "TR",
                    "text": "Varsayım 2: Günlük grafikteki düşüş trendi bağlamında, 1H grafiğindeki Bollinger Bantlarının bir dökümü düşüş trendinin hızlanmasını öngörebilir.",
                    "updated": 1640949976880
                },
                {
                    "language": "ES",
                    "text": "Hipótesis 2: En el contexto de una tendencia bajista en el gráfico diario, una ruptura de las Bandas de Bollinger en el gráfico 1H puede predecir una aceleración de la tendencia bajista.",
                    "updated": 1668193155013
                },
                {
                    "language": "IT",
                    "text": "Ipotesi 2: nel contesto di un trend ribassista nel grafico giornaliero, una ripartizione delle bande di Bollinger nel grafico 1H può prevedere un'accelerazione del trend ribassista.",
                    "updated": 1669901177830
                },
                {
                    "language": "NL",
                    "text": "Hypothese 2: In de context van een neerwaartse trend in de daily chart kan een uitbraak van de Bollinger Bands in de 1H-chart een versnelling van de downtrend voorspellen.",
                    "updated": 1670786974367
                },
                {
                    "language": "ID",
                    "text": "Hipotesis 2: Dalam konteks downtrend di chart harian, breakdown Bollinger Bands di chart 1H dapat memprediksi percepatan downtrend.",
                    "updated": 1674699379082
                }
            ]
        },
        {
            "style": "Callout",
            "text": "We may think of these two as the core of two different trading ideas! But that is not all, right?",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wir können diese beiden Hypothesen als den Kern zweier unterschiedlicher Handelsideen betrachten! Aber das ist noch nicht alles, oder?",
                    "updated": 1639253499863
                },
                {
                    "language": "RU",
                    "text": "Мы можем считать, что эти два понятия являются основой двух разных торговых идей! Но это еще не все, верно?",
                    "updated": 1640892057186
                },
                {
                    "language": "TR",
                    "text": "Bu ikisini iki farklı ticaret fikrinin özü olarak düşünebiliriz! Ama hepsi bu kadar değil, değil mi?",
                    "updated": 1640950094991
                },
                {
                    "language": "ES",
                    "text": "Podemos pensar en estos dos como el núcleo de dos ideas de trading diferentes. Pero eso no es todo, ¿verdad?",
                    "updated": 1668193176194
                },
                {
                    "language": "IT",
                    "text": "Potremmo pensare a questi due come al nucleo di due diverse idee di trading! Ma non è tutto, giusto?",
                    "updated": 1669901195819
                },
                {
                    "language": "NL",
                    "text": "We kunnen deze twee beschouwen als de kern van twee verschillende handelsideeën! Maar dat is niet alles, toch?",
                    "updated": 1670786989095
                },
                {
                    "language": "ID",
                    "text": "Kita mungkin menganggap keduanya sebagai inti dari dua ide trading yang berbeda! Tapi itu belum semuanya, kan?",
                    "updated": 1674699297867
                }
            ]
        }
    ]
}