{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 24,
    "type": "Tutorial Step - March 7th to March 12th",
    "definition": {
        "icon": {
            "name": "Layer\\layer-bands",
            "project": "Foundations"
        },
        "text": "Back in the 1H time frame, let's take a look at what happened between these dates in the context of a daily downtrend.",
        "translations": [
            {
                "language": "DE",
                "text": " Zurück im 1H-Zeitrahmen, lassen Sie uns einen Blick darauf werfen, was zwischen diesen Daten im Kontext eines täglichen Abwärtstrends geschah.",
                "updated": 1639253393145
            },
            {
                "language": "RU",
                "text": "Возвращаясь к часовому графику, давайте посмотрим, что произошло между этими датами в контексте дневного нисходящего тренда.",
                "updated": 1640891904085
            },
            {
                "language": "TR",
                "text": "Özet: 1H zaman çerçevesine geri dönersek, günlük düşüş trendi bağlamında bu tarihler arasında neler olduğuna bir göz atalım.",
                "updated": 1640948983504
            },
            {
                "language": "ES",
                "text": "Volviendo al marco temporal de 1H, veamos lo que ocurrió entre estas fechas en el contexto de una tendencia bajista diaria.",
                "updated": 1668192942684
            },
            {
                "language": "IT",
                "text": "Tornando al periodo 1H, diamo un'occhiata a cosa è successo tra queste date nel contesto di una tendenza al ribasso giornaliera.",
                "updated": 1669901056222
            },
            {
                "language": "NL",
                "text": "Laten we, terug in het tijdsbestek van 1 uur, eens kijken naar wat er tussen deze datums is gebeurd in de context van een dagelijkse neerwaartse trend.",
                "updated": 1670786656976
            },
            {
                "language": "ID",
                "text": "Kembali ke timeframe 1H, mari kita lihat apa yang terjadi antara tanggal-tanggal ini dalam konteks tren turun harian (daily downtrend).",
                "updated": 1674698983146
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "March 7th, 17 hs: A breakdown after a two-day-long volatility squeeze triggers a downtrend.",
            "translations": [
                {
                    "language": "DE",
                    "text": "7. März, 17 Uhr: Ein Zusammenbruch nach einem zweitägigen Volatilitäts-Squeeze löst einen Abwärtstrend aus.",
                    "updated": 1639253406227
                },
                {
                    "language": "RU",
                    "text": "7 марта, 17 часов: Пробой после двухдневного сжатия волатильности запускает нисходящий тренд.",
                    "updated": 1640891922693
                },
                {
                    "language": "TR",
                    "text": "7 Mart, 17 hs: İki günlük volatilite sıkışıklığının ardından bir kırılma, düşüş trendini tetikliyor",
                    "updated": 1640949026498
                },
                {
                    "language": "ES",
                    "text": "7 de marzo, 17 hs: Una ruptura después de un apretón de volatilidad de dos días desencadena una tendencia bajista.",
                    "updated": 1668192968366
                },
                {
                    "language": "IT",
                    "text": "7 marzo, 17:00: una rottura dopo una compressione della volatilità di due giorni innesca una tendenza al ribasso.",
                    "updated": 1669901072757
                },
                {
                    "language": "NL",
                    "text": "<b>7 maart, 17.00 uur:</b> Een uitbraak na een tweedaagse volatiliteitsdruk veroorzaakt een neerwaartse trend.",
                    "updated": 1670786700905
                },
                {
                    "language": "ID",
                    "text": "7 Maret, 17 hs: Breakdown setelah tekanan volatilitas selama dua hari mentrigger tren turun.",
                    "updated": 1674698991574
                }
            ]
        },
        {
            "style": "List",
            "text": "March 8th, 15 hs: Further breakdowns accelerate the downturn.",
            "translations": [
                {
                    "language": "DE",
                    "text": "8. März, 15 Uhr: Weitere Zusammenbrüche beschleunigen den Abwärtstrend.",
                    "updated": 1639253413244
                },
                {
                    "language": "RU",
                    "text": "8 марта, 15 часов: Дальнейшие пробои ускоряют спад.",
                    "updated": 1640891935102
                },
                {
                    "language": "TR",
                    "text": "8 Mart, 15 hs: Daha fazla arıza, gerilemeyi hızlandırıyor",
                    "updated": 1640949038389
                },
                {
                    "language": "ES",
                    "text": "8 de marzo, 15 hs: Nuevas caídas aceleran la tendencia bajista.",
                    "updated": 1668192990458
                },
                {
                    "language": "IT",
                    "text": "8 marzo, ore 15: ulteriori breakdown accelerano la recessione.",
                    "updated": 1669901089653
                },
                {
                    "language": "NL",
                    "text": "<b>8 maart, 15 uur:</b> Verdere uitbraken versnellen de neergang.",
                    "updated": 1670786729767
                },
                {
                    "language": "ID",
                    "text": "8 Maret, 15 hs: breakdown lebih lanjut mempercepat penurunan.",
                    "updated": 1674698999837
                }
            ]
        },
        {
            "style": "List",
            "text": "March 12th, 07 hs: Five hours before the biggest market crash in recent history, a series of breakdowns trigger a new downturn after three days of ranging price action.",
            "translations": [
                {
                    "language": "DE",
                    "text": "12. März, 07 Uhr: Fünf Stunden vor dem größten Börsencrash der jüngeren Geschichte löst eine Reihe von Zusammenbrüchen einen neuen Abwärtstrend aus, nachdem sich die Kurse drei Tage lang in einer Bandbreite bewegt haben.",
                    "updated": 1639253420383
                },
                {
                    "language": "RU",
                    "text": "12 марта, 07 часов: За пять часов до крупнейшего обвала рынка в новейшей истории серия пробоев вызывает новый спад после трех дней колебаний цен.",
                    "updated": 1640891972281
                },
                {
                    "language": "TR",
                    "text": "12 Mart, 07 hs: Yakın tarihin en büyük piyasa çöküşünden beş saat önce, bir dizi arıza, üç günlük değişen fiyat hareketinden sonra yeni bir düşüşü tetikler.",
                    "updated": 1640949055195
                },
                {
                    "language": "ES",
                    "text": "12 de marzo, 07 hs: Cinco horas antes de la mayor caída del mercado en la historia reciente, una serie de rupturas desencadenan una nueva caída después de tres días de acción de precios.",
                    "updated": 1668193020199
                },
                {
                    "language": "IT",
                    "text": "12 marzo, 07 hs: cinque ore prima del più grande crollo del mercato della storia recente, una serie di crolli innesca una nuova flessione dopo tre giorni di oscillazione dei prezzi.",
                    "updated": 1669901110745
                },
                {
                    "language": "NL",
                    "text": "<b>12 maart, 07.00 uur:</b> Vijf uur voor de grootste marktcrash in de recente geschiedenis veroorzaakt een reeks uitbraken een nieuwe neergang na drie dagen van variërende prijsactie.",
                    "updated": 1670786763567
                },
                {
                    "language": "ID",
                    "text": "12 Maret 07 hs: Lima jam sebelum market crash terbesar dalam sejarah baru-baru ini, serangkaian breakdown mentrigger penurunan baru setelah tiga hari price action hanya berkisar disana saja.",
                    "updated": 1674699033439
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Do you see the pattern? Can you formulate a hypothesis that we can test?",
            "translations": [
                {
                    "language": "DE",
                    "text": "Erkennen Sie das Muster? Können Sie eine Hypothese formulieren, die wir testen können?",
                    "updated": 1639253430255
                },
                {
                    "language": "RU",
                    "text": "Видите ли вы закономерность? Можете ли вы сформулировать гипотезу, которую мы могли бы проверить?",
                    "updated": 1640891984506
                },
                {
                    "language": "TR",
                    "text": "Deseni (pattern) görüyor musun? Test edebileceğimiz bir varsayım formüle edebilir misiniz?",
                    "updated": 1640949145571
                },
                {
                    "language": "ES",
                    "text": "¿Puedes ver el patrón? ¿Puedes formular una hipótesis que podamos comprobar?",
                    "updated": 1675205991172
                },
                {
                    "language": "IT",
                    "text": "Vedi lo schema? Puoi formulare un'ipotesi che possiamo testare?",
                    "updated": 1669901124340
                },
                {
                    "language": "NL",
                    "text": "<b>Zie je het patroon? Kun je een hypothese formuleren die we kunnen testen?</b>",
                    "updated": 1670786788080
                },
                {
                    "language": "ID",
                    "text": "Apakah kamu melihat polanya? Dapatkah kamu memformulasikan hipotesis yang dapat kita uji?",
                    "updated": 1674699046678
                }
            ]
        }
    ]
}