{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 30,
    "type": "Tutorial Step - Et Voilà..!",
    "definition": {
        "icon": {
            "name": "Nodes\\nodes-highlights",
            "project": "Foundations"
        },
        "text": "That's it! We finally have a proper hypothesis that we can test to decide if the idea is worth pursuing or not!",
        "translations": [
            {
                "language": "DE",
                "text": "Das war's! Wir haben endlich eine richtige Hypothese, die wir testen können, um zu entscheiden, ob es sich lohnt, die Idee weiterzuverfolgen oder nicht!",
                "updated": 1639253768165
            },
            {
                "language": "RU",
                "text": "Вот и все! Наконец-то у нас есть правильная гипотеза, которую мы можем проверить, чтобы решить, стоит ли реализовывать эту идею или нет!",
                "updated": 1640892410217
            },
            {
                "language": "TR",
                "text": "Özet: İşte bu! Sonunda, fikrin peşinden gitmeye değer olup olmadığına karar vermek için test edebileceğimiz uygun bir varsayımımız var!",
                "updated": 1640952844610
            },
            {
                "language": "ES",
                "text": "¡Y ya está! Por fin tenemos una hipótesis adecuada que podemos probar para decidir si la idea merece la pena o no.",
                "updated": 1668194019896
            },
            {
                "language": "IT",
                "text": "Questo è tutto! Finalmente abbiamo un'ipotesi corretta che possiamo testare per decidere se vale la pena perseguire o meno l'idea!",
                "updated": 1669901881243
            },
            {
                "language": "NL",
                "text": "Dat is het! We hebben eindelijk een goede hypothese die we kunnen testen om te beslissen of het idee de moeite waard is om na te streven of niet!",
                "updated": 1670787677564
            },
            {
                "language": "ID",
                "text": "Itu dia! Kita akhirnya memiliki hipotesis yang tepat yang dapat kita uji untuk memutuskan apakah ide tersebut layak untuk dikejar atau tidak!",
                "updated": 1674701271441
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "We'll take it from there in the next tutorial!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Im nächsten Tutorial geht es dann weiter!",
                    "updated": 1639253774285
                },
                {
                    "language": "RU",
                    "text": "Дальше мы разберемся с этим в следующем уроке!",
                    "updated": 1640892421110
                },
                {
                    "language": "TR",
                    "text": "Bir sonraki eğitimde devam edecekğiz!",
                    "updated": 1640953399711
                },
                {
                    "language": "ES",
                    "text": "Seguiremos a partir de este punto en el próximo tutorial.",
                    "updated": 1668193980991
                },
                {
                    "language": "IT",
                    "text": "Lo prenderemo da lì nel prossimo tutorial!",
                    "updated": 1669901900331
                },
                {
                    "language": "NL",
                    "text": "We nemen het vanaf daar over in de volgende zelfstudie!",
                    "updated": 1670787690277
                },
                {
                    "language": "ID",
                    "text": "Kita akan mengambilnya dari sana di tutorial berikutnya!",
                    "updated": 1674701277833
                }
            ]
        },
        {
            "style": "Note",
            "text": "In the next tutorial in the series, we will dive into how Superalgos guides you through the process of setting up the trading idea to be tested on historical data. We'll learn about the syntax to write conditions and formulas, about how to use indicators from within strategies, and whatever else we may need along the way!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Im nächsten Tutorial dieser Reihe werden wir uns damit beschäftigen, wie Superalgos Sie durch den Prozess der Erstellung einer Handelsidee führt, die anhand historischer Daten getestet werden soll. Wir werden etwas über die Syntax lernen, um Bedingungen und Formeln zu schreiben, über die Verwendung von Indikatoren innerhalb von Strategien und alles andere, was wir auf dem Weg dahin brauchen könnten!",
                    "updated": 1639253781970
                },
                {
                    "language": "RU",
                    "text": "В следующей серии уроков мы рассмотрим, как Superalgos проводит вас через процесс настройки торговой идеи для тестирования на исторических данных. Мы узнаем о синтаксисе для написания условий и формул, о том, как использовать индикаторы внутри стратегий, и обо всем остальном, что нам может понадобиться на этом пути!",
                    "updated": 1640892461676
                },
                {
                    "language": "TR",
                    "text": "Not: Serideki bir sonraki eğitimde, Superalgos'un geçmiş veriler üzerinde test edilecek alım satım fikrini oluşturma sürecinde size nasıl rehberlik ettiğini ele alacağız. Koşullar ve formüller yazmak için sözdizimi, stratejilerin içinden göstergelerin nasıl kullanılacağı ve yol boyunca ihtiyaç duyabileceğimiz başka ne varsa öğreneceğiz!",
                    "updated": 1640953435315
                },
                {
                    "language": "ES",
                    "text": "En el próximo tutorial de la serie, nos adentraremos en cómo Superalgos te guía a través del proceso de configuración de una idea de trading para ser probada en datos históricos. Aprenderemos sobre la sintaxis para escribir condiciones y fórmulas, sobre cómo usar indicadores desde dentro de las estrategias, ¡y cualquier otra cosa que podamos necesitar en el camino!",
                    "updated": 1668194072996
                },
                {
                    "language": "IT",
                    "text": "Nel prossimo tutorial della serie, approfondiremo il modo in cui Superalgos ti guida attraverso il processo di configurazione dell'idea di trading da testare sui dati storici. Impareremo la sintassi per scrivere condizioni e formule, come utilizzare gli indicatori all'interno delle strategie e qualsiasi altra cosa di cui potremmo aver bisogno lungo il percorso!",
                    "updated": 1669901916089
                },
                {
                    "language": "NL",
                    "text": "In de volgende zelfstudie in de serie zullen we ingaan op hoe Superalgos u begeleidt bij het opzetten van het handelsidee om te worden getest op historische gegevens. We leren over de syntaxis om voorwaarden en formules te schrijven, over het gebruik van indicatoren vanuit strategieën en alles wat we onderweg nog meer nodig hebben!",
                    "updated": 1670787718516
                },
                {
                    "language": "ID",
                    "text": "Dalam tutorial berikutnya dalam seri ini, kita akan mendalami bagaimana Superalgos memandu kamu melalui proses penyiapan ide trading untuk diuji pada data historis. Kita akan belajar tentang sintaks untuk menulis conditions dan formula, tentang cara menggunakan indikator dari dalam strategi, dan apa saja yang mungkin kita perlukan selama ini!",
                    "updated": 1674701283493
                }
            ]
        }
    ]
}