{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 28,
    "type": "Tutorial Step - Entry Rules",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "trigger-on-event"
        },
        "text": "The main entry rules were the focus of the analysis we did on the charts, but let's add a couple more considerations.",
        "translations": [
            {
                "language": "DE",
                "text": "Die wichtigsten Einstiegsregeln standen im Mittelpunkt der Analyse der Charts, aber wir wollen noch ein paar weitere Überlegungen hinzufügen.",
                "updated": 1639253648661
            },
            {
                "language": "RU",
                "text": "Основные правила входа были в центре внимания анализа, который мы провели на графиках, но давайте добавим еще пару соображений.",
                "updated": 1640892252577
            },
            {
                "language": "TR",
                "text": "Ana giriş kuralları, grafiklerde yaptığımız analizin odak noktasıydı, ancak birkaç husus daha ekleyelim.",
                "updated": 1640952128338
            },
            {
                "language": "ES",
                "text": "Las principales reglas de entrada fueron el foco del análisis que hicimos en los gráficos, pero añadamos un par de consideraciones más.",
                "updated": 1668193625163
            },
            {
                "language": "IT",
                "text": "Le principali regole di ingresso sono state al centro dell'analisi che abbiamo fatto sui grafici, ma aggiungiamo un altro paio di considerazioni.",
                "updated": 1669901755306
            },
            {
                "language": "NL",
                "text": "De belangrijkste instapregels waren de focus van de analyse die we op de grafieken deden, maar laten we nog een paar overwegingen toevoegen.",
                "updated": 1670787338076
            },
            {
                "language": "ID",
                "text": "Aturan entry utama adalah fokus analisis yang kita lakukan pada chart, tetapi mari tambahkan beberapa pertimbangan lagi.",
                "updated": 1674700866870
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "We found that a breakdown in the 1H chart may predict an intermediate-term reversal when on a daily uptrend,  and&mdash;when on a daily downtrend&mdash;an acceleration of the downturn. However, we also noticed several breakdowns that didn't produce either. This means that we should take a breakdown as a signal, not as a confirmation in and of itself.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wir haben festgestellt, dass ein Zusammenbruch im 1H-Chart eine mittelfristige Umkehr vorhersagen kann, wenn es sich um einen täglichen Aufwärtstrend handelt, und - wenn es sich um einen täglichen Abwärtstrend handelt - eine Beschleunigung des Abwärtstrends. Wir haben jedoch auch mehrere Zusammenbrüche festgestellt, die weder das eine noch das andere zur Folge hatten. Dies bedeutet, dass wir einen Durchbruch als Signal und nicht als Bestätigung für sich selbst betrachten sollten.",
                    "updated": 1639253663877
                },
                {
                    "language": "RU",
                    "text": "Мы обнаружили, что пробой на часовом графике может предсказать среднесрочный разворот при дневном восходящем тренде, а при дневном нисходящем тренде - ускорение нисходящего движения. Однако мы также заметили несколько пробоев, которые не дали ни того, ни другого. Это означает, что мы должны воспринимать пробой как сигнал, а не как подтверждение само по себе.",
                    "updated": 1640892285096
                },
                {
                    "language": "TR",
                    "text": "1H grafiğindeki bir dökümün, günlük bir yükseliş trendindeyken orta vadeli bir geri dönüşü ve - günlük bir düşüş trendindeyken - gerilemenin hızlanmasını öngörebileceğini bulduk. Ancak, aynı zamanda üretmeyen birkaç arıza da fark ettik. Bu, arızayı kendi başına bir onay olarak değil, bir sinyal olarak almamız gerektiği anlamına gelir.",
                    "updated": 1640952193325
                },
                {
                    "language": "ES",
                    "text": "Descubrimos que una ruptura en el gráfico 1H puede predecir una inversión a medio plazo cuando se trata de una tendencia diaria alcista, y -cuando se trata de una tendencia diaria bajista- una aceleración de la caída. Sin embargo, también observamos varias rupturas que no produjeron ninguna de las dos cosas. Esto significa que debemos tomar una ruptura como una señal, no como una confirmación en sí misma.",
                    "updated": 1668193695554
                },
                {
                    "language": "NL",
                    "text": "We ontdekten dat een uitbraak in de 1H-grafiek een omkering op de middellange termijn kan voorspellen bij een dagelijkse opwaartse trend, en - bij een dagelijkse neerwaartse trend - een versnelling van de neergang. We merkten echter ook verschillende uitbraken op die dat niet opleverden. Dit betekent dat we een uitbraak als een signaal moeten zien, niet als een bevestiging op zich.",
                    "updated": 1670787411053
                },
                {
                    "language": "ID",
                    "text": "Kita menemukan bahwa breakdown pada chart 1H dapat memprediksi reversal jangka menengah ketika berada pada tren naik harian, dan—ketika pada tren turun harian—percepatan penurunan. Namun, kita juga melihat beberapa breakdown yang tidak menghasilkan keduanya. Ini berarti bahwa kita harus menganggap breakdown sebagai sinyal, bukan sebagai konfirmasi itu sendiri.",
                    "updated": 1674700872089
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Our confirmation is a second consecutive breakdown in the 1H chart!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Unsere Bestätigung ist ein zweiter Durchbruch in Folge im 1H-Chart!",
                    "updated": 1639253669972
                },
                {
                    "language": "RU",
                    "text": "Наше подтверждение - второй последовательный пробой на часовом графике!",
                    "updated": 1640892307292
                },
                {
                    "language": "TR",
                    "text": "Onayımız 1H grafiğinde art arda ikinci bir arızadır!",
                    "updated": 1640952400804
                },
                {
                    "language": "ES",
                    "text": "¡Nuestra confirmación es una segunda ruptura consecutiva en el gráfico 1H!",
                    "updated": 1668193707465
                },
                {
                    "language": "NL",
                    "text": "Onze bevestiging is een tweede opeenvolgende uitbraak in de 1H-grafiek!",
                    "updated": 1670787428205
                },
                {
                    "language": "ID",
                    "text": "Konfirmasi kita adalah breakdown kedua berturut-turut di chart 1H!",
                    "updated": 1674700877604
                }
            ]
        }
    ]
}