{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 3,
    "type": "Tutorial Step - Before we start...",
    "definition": {
        "icon": {
            "name": "Bullet\\bullet-warning",
            "project": "Foundations"
        },
        "text": "Let me give you the heads up on a few matters you should consider before we start!",
        "translations": [
            {
                "language": "ES",
                "text": "¡Permíteme informarte sobre algunos asuntos que debes considerar antes de comenzar!",
                "updated": 1675205144814
            },
            {
                "language": "DE",
                "text": "Bevor wir beginnen, möchte ich Sie auf einige Dinge hinweisen, die Sie beachten sollten!",
                "updated": 1639251358018
            },
            {
                "language": "RU",
                "text": "Позвольте мне проинформировать вас о некоторых вопросах, которые вы должны рассмотреть до того, как мы начнем!",
                "updated": 1640887553284
            },
            {
                "language": "TR",
                "text": "Özet: Başlamadan önce göz önünde bulundurmanız gereken birkaç konuda size bilgi vereyim!",
                "updated": 1640859451125
            },
            {
                "language": "IT",
                "text": "Lascia che ti spieghi alcune questioni che dovresti considerare prima di iniziare!",
                "updated": 1669885345730
            },
            {
                "language": "NL",
                "text": "Laat me je op de hoogte brengen van een paar zaken die je moet overwegen voordat we beginnen!",
                "updated": 1670783144375
            },
            {
                "language": "ID",
                "text": "Biarkan aku memberimu beberapa hal yang harus kamu pertimbangkan sebelum kita mulai!",
                "updated": 1674638440122
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "Take any trading-related information for what it's worth! When I share trading concepts, take them with a grain of salt! I'm just a tutorial, not your financial advisor! I'm here to teach you Superalgos, not to tell you how to trade! If you are not a trader, you may pick up something of value, but always make sure you do your own research!",
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Toma cualquier información relacionada con el trading por lo que vale! Cuando comparta conceptos de trading, ¡tómalo con un grano de sal! ¡Soy solo un tutorial, no un asesor financiero! ¡Estoy aquí para enseñarte Superalgos, no para decirte cómo tradear! Si no eres un trader, puedes adquirir algo de valor, ¡pero asegúrate siempre de hacer tu propia investigación!",
                    "updated": 1675205301586
                },
                {
                    "language": "DE",
                    "text": "Nehmen Sie jede handelsbezogene Information für das, was sie wert ist! Wenn ich Handelskonzepte mit Ihnen teile, sollten Sie diese mit Vorsicht genießen! Ich bin nur ein Tutorial, nicht Ihr Finanzberater! Ich bin hier, um Ihnen Superalgos beizubringen, nicht um Ihnen zu sagen, wie Sie handeln sollen! Wenn Sie kein Trader sind, können Sie vielleicht etwas von Wert mitnehmen, aber stellen Sie immer sicher, dass Sie Ihre eigenen Nachforschungen anstellen!",
                    "updated": 1639251394203
                },
                {
                    "language": "RU",
                    "text": "Воспринимайте любую информацию, связанную с торговлей, так, как она того стоит! Когда я делюсь торговыми концепциями, принимайте их с долей сомнения! Я всего лишь учебник, а не ваш финансовый советник! Я здесь для того, чтобы ознакомить вас с Superalgos, а не для того, чтобы рассказать вам, как торговать! Если вы не являетесь трейдером, вы можете почерпнуть что-то ценное, но всегда убедитесь, что вы провели собственное исследование!",
                    "updated": 1640887702909
                },
                {
                    "language": "TR",
                    "text": "Ne kadar değerli olursa olsun, ticaretle ilgili her bir bilgiyi alın! Ticaret kavramlarını paylaştığımda, onları en küçük zerresine kadar aklınıza kazıyın! Ben sadece bir öğreticiyim, mali danışmanın değil! Buraya size Superalgo'u öğretmeye geldim, nasıl takas yapılacağını söylemeye değil! Bir tüccar değilseniz, değerli bir şey alabilirsiniz, ancak her zaman kendi araştırmanızı yaptığınızdan emin olun!",
                    "updated": 1640862680133
                },
                {
                    "language": "IT",
                    "text": "Prendi qualsiasi informazione relativa al trading per quello che vale! Quando condivido concetti di trading, prendili con le pinze! Sono solo un tutorial, non il tuo consulente finanziario! Sono qui per insegnarti Superalgos, non per dirti come fare trading! Se non sei un trader, potresti trovare qui informazioni valide, ma assicurati sempre di fare le tue ricerche!",
                    "updated": 1669885366756
                },
                {
                    "language": "NL",
                    "text": "Neem handelsgerelateerde informatie voor wat het waard is! Als ik handelsconcepten deel, neem ze dan met een korreltje zout! Ik ben slechts een zelfstudie, niet uw financieel adviseur! Ik ben hier om je Superalgos te leren, niet om je te vertellen hoe je moet handelen! Als u geen handelaar bent, kunt u iets van waarde oppikken, maar zorg er altijd voor dat u uw eigen onderzoek doet!",
                    "updated": 1670783171885
                },
                {
                    "language": "ID",
                    "text": "Ambil informasi terkait trading apa pun untuk apa nilainya! Ketika aku berbagi konsep trading, ambillah dengan tidak sepenuhnya mempercayai sesuatu yang diberitahukan kepadamu, karena menurutmu itu tidak mungkin benar! Aku hanya tutorial, bukan penasihat keuangan kamu! Aku di sini untuk mengajari kamu Superalgos, bukan untuk memberi tahu kamu cara trading! Jika kamu bukan seorang trader, kamu dapat mengambil sesuatu yang berharga, tetapi selalu pastikan kamu melakukan riset sendiri!",
                    "updated": 1674638446504
                }
            ]
        },
        {
            "style": "List",
            "text": "This tutorial is aimed at a wide audience! I'll take it easy and lay out concepts so that everyone may understand them. If you are a seasoned trader you may feel some explanations are too basic. In that case, feel free to skip this tutorial and go to the next one in the series.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Me lo tomaré con calma y expondré conceptos para que todos puedan entenderlos. Si eres es un trader experimentado, puedes sentir que algunas explicaciones son demasiado básicas. En ese caso, no dudes en omitir este tutorial y pasar al siguiente de la serie.",
                    "updated": 1675205290178
                },
                {
                    "language": "DE",
                    "text": "Dieses Tutorial ist für ein breites Publikum gedacht! Ich werde es einfach halten und die Konzepte so darlegen, dass jeder sie verstehen kann. Wenn Sie ein erfahrener Händler sind, werden Sie vielleicht das Gefühl haben, dass einige Erklärungen zu grundlegend sind. In diesem Fall können Sie diesen Lehrgang überspringen und zum nächsten der Reihe übergehen.",
                    "updated": 1639251376690
                },
                {
                    "language": "RU",
                    "text": "Этот учебник рассчитан на широкую аудиторию! Я не буду торопиться и изложу концепции так, чтобы каждый мог их понять. Если вы опытный трейдер, вам может показаться, что некоторые объяснения слишком просты. В таком случае смело пропускайте этот урок и переходите к следующему в этой серии.",
                    "updated": 1640887728309
                },
                {
                    "language": "TR",
                    "text": "Bu öğretici geniş bir kitleye yöneliktir! Herkesin anlayabileceği kavramlar hazırladım, böylece herkes onları anlayabilir. Tecrübeli bir trader, bazı açıklamaların çok temel olduğunu hissedebilirsiniz. Bu durumda, bu öğreticiyi atlamaktan ve serideki bir sonrakine geçmekten çekinmeyin.",
                    "updated": 1640863034548
                },
                {
                    "language": "IT",
                    "text": "Questo tutorial è rivolto a un vasto pubblico! La prenderò con calma ed esporrò i concetti in modo che tutti possano capirli. Se sei un trader esperto potresti ritenere che alcune spiegazioni siano troppo basilari. In tal caso, sentiti libero di saltare questo tutorial e passare a quello successivo della serie.",
                    "updated": 1669885383421
                },
                {
                    "language": "NL",
                    "text": "Deze zelfstudie is gericht op een breed publiek! Ik doe het rustig aan en formuleer concepten zodat iedereen ze kan begrijpen. Als u een doorgewinterde handelaar bent, vindt u sommige uitleg misschien te basaal. Sla in dat geval deze tutorial gerust over en ga naar de volgende in de serie.",
                    "updated": 1670783196757
                },
                {
                    "language": "ID",
                    "text": "Tutorial ini ditujukan untuk khalayak luas! Aku akan tenang dan menyusun konsep sehingga semua orang dapat memahaminya. Jika kamu seorang trader berpengalaman, kamu mungkin merasa beberapa penjelasan terlalu mendasar. Dalam hal ini, silakan lewati tutorial ini dan lanjutkan ke seri berikutnya.",
                    "updated": 1674638452520
                }
            ]
        }
    ]
}