{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 4,
    "type": "Tutorial Step - Ready to Mine..?",
    "definition": {
        "icon": {
            "name": "Data\\data-tasks",
            "project": "Foundations"
        },
        "text": "We'll mine some data to analyze a few events over the charts. We'll use the same data to test the trading idea in the next tutorial!",
        "translations": [
            {
                "language": "ES",
                "text": "Extraeremos algunos datos para analizar algunos eventos en los gráficos. ¡Usaremos los mismos datos para probar la idea comercial en el próximo tutorial!",
                "updated": 1630377229613
            },
            {
                "language": "DE",
                "text": "Wir werden einige Daten auswerten, um ein paar Events in den Charts zu analysieren. Wir werden die gleichen Daten verwenden, um die Handelsidee im nächsten Tutorial zu testen!",
                "updated": 1639251447394
            },
            {
                "language": "RU",
                "text": "Мы соберем некоторые данные, чтобы проанализировать несколько событий на графиках. Эти же данные мы будем использовать для проверки торговой идеи в следующем уроке!",
                "updated": 1640887746496
            },
            {
                "language": "TR",
                "text": "Özet: Tablolar üzerinde birkaç olayı analiz etmek için bazı veriler çıkaracağız. Bir sonraki eğitimde ticaret fikrini test etmek için aynı verileri kullanacağız!",
                "updated": 1640863230957
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Note",
            "text": "The sensor bot will run on the BTC/USDT market (Binance) from January 1st, 2020, along with the following indicators from the Masters data mine: Candles Volumes, Bollinger Bands, and Bollinger Channels.",
            "translations": [
                {
                    "language": "ES",
                    "text": "El robot sensor se ejecutará en el mercado BTC / USDT (Binance) a partir del 1 de enero de 2020, junto con los siguientes indicadores de la mina de datos Masters: Candles Volumes, Bollinger Bands y Bollinger Channels.",
                    "updated": 1630377249570
                },
                {
                    "language": "DE",
                    "text": "Der Sensor-Bot wird auf dem BTC/USDT-Markt (Binance) ab dem 1. Januar 2020 laufen, zusammen mit den folgenden Indikatoren aus der Master data mine: Candles Volumes, Bollinger Bands, and Bollinger Channels.",
                    "updated": 1639251511736
                },
                {
                    "language": "RU",
                    "text": "Сенсорный бот будет работать на рынке BTC/USDT (Binance) с 1 января 2020 года, вместе со следующими индикаторами из сборщиков данных Masters: Candles Volumes, Bollinger Bands и Bollinger Channels.",
                    "updated": 1640887926142
                },
                {
                    "language": "TR",
                    "text": "Not: Sensör botu, 1 Ocak 2020'den itibaren BTC/USDT piyasasında (Binance) Masters veri madeninden alınan şu göstergelerle birlikte çalışacak: Mum Hacimleri, Bollinger Bantları ve Bollinger Kanalları.",
                    "updated": 1640863260563
                }
            ]
        },
        {
            "style": "Warning",
            "text": "If you have data on this market/exchange but on a different time range, this may affect your data! Read the sensor bot documentation to learn how! If the data you have is not important, feel free to keep going!",
            "translations": [
                {
                    "language": "ES",
                    "text": "Si tiene datos en este mercado / intercambio pero en un rango de tiempo diferente, ¡esto puede afectar tus datos! ¡Lee la documentación del robot sensor para aprender cómo hacerlo! Si los datos que tiene no son importantes, ¡no dude en continuar!",
                    "updated": 1630377309627
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie Daten für diesen Markt/diese Börse haben, aber in einem anderen Zeitbereich, kann dies Ihre Daten beeinflussen! Lesen Sie die Dokumentation des Sensor-Bots, um zu erfahren, wie das geht! Wenn die Daten, die Sie haben, nicht wichtig sind, können Sie ruhig weitermachen!",
                    "updated": 1639251519030
                },
                {
                    "language": "RU",
                    "text": "Если у вас есть данные по этому рынку/бирже, но в другом временном диапазоне, это может повлиять на ваши данные! Прочтите документацию по сенсорному боту, чтобы узнать, как это сделать! Если данные, которые у вас есть, не так важны, не сомневайтесь продолжать!",
                    "updated": 1640888044748
                },
                {
                    "language": "TR",
                    "text": "Uyarı: Bu piyasa/borsa (market/exchange) ile ilgili ancak farklı bir zaman aralığında verileriniz varsa, bu durum verilerinizi etkileyebilir! Nasıl yapılacağını öğrenmek için sensör botu belgelerini okuyun! Sahip olduğunuz veriler önemli değilse, devam etmekten çekinmeyin!",
                    "updated": 1640863378593
                }
            ]
        }
    ]
}