{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 16,
    "type": "Tutorial Step - Can You Think of Any Ideas?",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "help"
        },
        "text": "You've seen the Bollinger Bands and you know how to read them... Can you think of a trading idea to build a strategy with?",
        "translations": [
            {
                "language": "DE",
                "text": "Sie haben die Bollinger Bands gesehen und wissen, wie man sie liest... Fällt Ihnen eine Handelsidee ein, mit der Sie eine Strategie aufbauen können?",
                "updated": 1639252535020
            },
            {
                "language": "RU",
                "text": "Вы видели полосы Боллинджера и знаете, как их читать... Можете ли вы придумать торговую идею для построения стратегии?",
                "updated": 1640890491546
            },
            {
                "language": "TR",
                "text": "Bollinger Bantlarını gördünüz ve onları nasıl okuyacağınızı biliyorsunuz... Bir strateji oluşturmak için bir ticaret fikri düşünebilir misiniz?",
                "updated": 1640947506140
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Take a few minutes roaming around this chart and see if you can come up with something!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Nehmen Sie sich ein paar Minuten Zeit, um in diesem Diagramm herumzustöbern und sehen Sie, ob Ihnen etwas einfällt!",
                    "updated": 1639252544363
                },
                {
                    "language": "RU",
                    "text": "Уделите несколько минут работе с этой таблицей и посмотрите, сможете ли вы что-нибудь придумать!",
                    "updated": 1640890564079
                },
                {
                    "language": "TR",
                    "text": "Bu çizelgede birkaç dakika dolaşın ve bir şeyler bulabilecek misiniz bir bakın!",
                    "updated": 1640947545847
                }
            ]
        },
        {
            "style": "Note",
            "text": "Indicators are usually built by analysts and traders to mathematically describe trading ideas.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Indikatoren werden normalerweise von Analysten und Händlern entwickelt, um Handelsideen mathematisch zu beschreiben.",
                    "updated": 1639252553967
                },
                {
                    "language": "RU",
                    "text": "Индикаторы обычно строятся аналитиками и трейдерами для математического описания торговых идей.",
                    "updated": 1640890575776
                },
                {
                    "language": "TR",
                    "text": "Not: Göstergeler genellikle ticaret fikirlerini matematiksel olarak tanımlamak için analistler ve trader'lar tarafından oluşturulur.",
                    "updated": 1640947566429
                }
            ]
        },
        {
            "style": "Success",
            "text": "The idea we will discuss next has to do with breakouts! But that is just one of the four or five popular ideas using this indicator!",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Idee, die wir als nächstes besprechen werden, hat mit Ausbrüchen zu tun! Aber das ist nur eine der vier oder fünf beliebten Ideen, die dieser Indikator liefert!",
                    "updated": 1639252562061
                },
                {
                    "language": "RU",
                    "text": "Идея, которую мы обсудим дальше, связана с прорывами! Но это лишь одна из четырех или пяти популярных идей с использованием этого индикатора!",
                    "updated": 1640890595887
                },
                {
                    "language": "TR",
                    "text": "İpucu: Daha sonra tartışacağımız fikir, kırılmalarla ilgili! Ancak bu, bu göstergeyi kullanan dört veya beş popüler fikirden yalnızca biri!",
                    "updated": 1640947587516
                }
            ]
        }
    ]
}