{
    "tutorial": "Defining a Trading Idea",
    "pageNumber": 14,
    "type": "Tutorial Step - BB On the Charts!",
    "definition": {
        "icon": {
            "name": "Layer\\layer-bands",
            "project": "Foundations"
        },
        "text": "Let's take a look at the Bollinger Bands! If it's not on already, find the Bollinger Bands layer in the Masters layer manager.",
        "translations": [
            {
                "language": "DE",
                "text": "Werfen wir einen Blick auf die Bollinger-Bands! Falls er noch nicht aktiviert ist, finden Sie die Ebene Bollinger Bands im Masters layer manager.",
                "updated": 1639252176396
            },
            {
                "language": "RU",
                "text": "Давайте посмотрим на полосы Боллинджера! Если он еще не включен, найдите слой Bollinger Bands в менеджере слоев Masters.",
                "updated": 1640890274542
            },
            {
                "language": "TR",
                "text": "Özet: Bollinger Gruplarına bir göz atalım! Henüz açık değilse, Masters katman yöneticisinde Bollinger Bantları katmanını bulun.",
                "updated": 1640870342350
            },
            {
                "language": "ES",
                "text": "Echemos un vistazo a las Bandas de Bollinger. Si aún no está activada, busca la capa de las Bandas de Bollinger en el gestor de capas Masters.",
                "updated": 1675205705661
            },
            {
                "language": "IT",
                "text": "Diamo un'occhiata alle Bande di Bollinger! Se non è già attivo, trova il layer Bollinger Bands nel gestore layer Masters.",
                "updated": 1669895834331
            },
            {
                "language": "NL",
                "text": "Laten we eens kijken naar de Bollinger Bands! Als het nog niet is ingeschakeld, zoek dan de Bollinger Bands-laag in de Masters layer manager.",
                "updated": 1670784761519
            },
            {
                "language": "ID",
                "text": "Mari kita lihat Bollinger Bands! Jika belum aktif, temukan layer Bollinger Bands di Masters layer manager.",
                "updated": 1674690302357
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The indicator features a 20-period moving average in the center. It features a line on top located two standard deviations above the moving average. We call this line the upper band. And it also features a line two standard deviations below the moving average. We call this one the lower band. Together, they are the Bollinger Bands.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Indikator enthält in der Mitte einen gleitenden Durchschnitt über 20 Perioden. Darüber befindet sich eine Linie, die zwei Standardabweichungen über dem gleitenden Durchschnitt liegt. Wir nennen diese Linie das obere Band. Außerdem gibt es eine Linie, die zwei Standardabweichungen unterhalb des gleitenden Durchschnitts verläuft. Wir nennen diese Linie das untere Band. Zusammen bilden sie die Bollinger Bands.",
                    "updated": 1639252193350
                },
                {
                    "language": "RU",
                    "text": "В центре индикатора находится 20-периодная скользящая средняя. Сверху имеется линия, расположенная на два стандартных отклонения выше скользящей средней. Мы называем эту линию верхней полосой. Также имеется линия, расположенная на два стандартных отклонения ниже скользящей средней. Эту линию мы называем нижней полосой. Вместе они представляют собой полосы Боллинджера.",
                    "updated": 1640890308663
                },
                {
                    "language": "TR",
                    "text": "Gösterge, merkezde 20 dönemlik hareketli bir ortalamaya sahiptir. Üstte hareketli ortalamanın üzerinde iki standart sapma bulunan bir çizgiye sahiptir. Bu hatta üst bant diyoruz. Ayrıca hareketli ortalamanın iki standart sapma çizgisine sahiptir. Buna alt bant diyoruz. Bollinger Grupları.",
                    "updated": 1640871715867
                },
                {
                    "language": "ES",
                    "text": "El indicador presenta una media móvil de 20 periodos en el centro. Cuenta con una línea en la parte superior situada dos desviaciones estándar por encima de la media móvil. A esta línea la llamamos banda superior. Y también presenta una línea dos desviaciones estándar por debajo de la media móvil. A ésta la llamamos banda inferior. Juntas, son las bandas de Bollinger.",
                    "updated": 1668190393270
                },
                {
                    "language": "IT",
                    "text": "L'indicatore presenta una media mobile a 20 periodi al centro. Presenta una linea in alto situata due deviazioni standard sopra la media mobile. Chiamiamo questa linea la banda superiore. E presenta anche una linea due deviazioni standard al di sotto della media mobile. Chiamiamo questa la banda inferiore. Insieme, sono le Bande di Bollinger.",
                    "updated": 1669895856430
                },
                {
                    "language": "NL",
                    "text": "De indicator heeft een voortschrijdend gemiddelde over 20 perioden in het midden. Het heeft een lijn bovenaan die zich twee standaarddeviaties boven het voortschrijdend gemiddelde bevindt. Deze lijn noemen we de bovenband. En het heeft ook een lijn twee standaarddeviaties onder het voortschrijdend gemiddelde. We noemen dit de onderste band. Samen vormen ze de Bollinger Bands.",
                    "updated": 1670784798223
                },
                {
                    "language": "ID",
                    "text": "Indikator menampilkan 20-period moving average di tengah. Ini fitur garis di atas terletak dua standar deviasi di atas moving average. Kita menyebut garis ini upper band. Dan itu juga menampilkan garis dua standar deviasi di bawah moving average. Kita menyebutnya lower band. Bersama-sama, mereka adalah Bollinger Bands.",
                    "updated": 1674690308412
                }
            ]
        },
        {
            "style": "Note",
            "text": "Notice how the price ranges sideways bouncing off the upper and the lower bands. Sometimes it may go out of the boundaries of the bands, either higher or lower, but most of the time it stays within the range of the bands.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Beachten Sie, wie der Kurs seitwärts schwankt und an den oberen und unteren Bändern abprallt. Manchmal verlässt er die Grenzen der Bänder, entweder nach oben oder nach unten, aber meistens bleibt er innerhalb des Bereichs der Bänder.",
                    "updated": 1639252200054
                },
                {
                    "language": "RU",
                    "text": "Обратите внимание, как цена колеблется в боковом диапазоне, отскакивая от верхней и нижней полос. Иногда она может выходить за границы полос, либо выше, либо ниже, но большую часть времени она остается в пределах диапазона полос.",
                    "updated": 1640890343579
                },
                {
                    "language": "TR",
                    "text": "Not: Fiyatın üst ve alt bantlardan yanlara doğru nasıl sıçradığına dikkat edin. Bazen daha yüksek veya daha düşük bant sınırlarının dışına çıkabilir, ancak çoğu zaman bantların aralığında kalır.",
                    "updated": 1640871777739
                },
                {
                    "language": "ES",
                    "text": "Observa cómo el precio oscila lateralmente rebotando en las bandas superior e inferior. A veces puede salirse de los límites de las bandas, ya sea por arriba o por abajo, pero la mayoría de las veces se mantiene dentro del rango de las bandas.",
                    "updated": 1675205727777
                },
                {
                    "language": "IT",
                    "text": "Nota come le fasce di prezzo rimbalzano lateralmente sulle bande superiore e inferiore. A volte può uscire dai confini delle bande, sia superiori che inferiori, ma la maggior parte delle volte rimane all'interno della gamma delle bande.",
                    "updated": 1669895875410
                },
                {
                    "language": "NL",
                    "text": "Merk op hoe de prijs bereiken zijwaarts stuiteren van de bovenste en onderste banden. Soms gaat het buiten de grenzen van de banden, hoger of lager, maar meestal blijft het binnen het bereik van de banden.",
                    "updated": 1670784839039
                },
                {
                    "language": "ID",
                    "text": "Perhatikan bagaimana price range sideways memantul dari upper dan lower band. Kadang-kadang mungkin keluar dari batas band, baik lebih tinggi atau lebih rendah, tetapi sebagian besar tetap berada dalam jangkauan band.",
                    "updated": 1674690314894
                }
            ]
        }
    ]
}