{
    "topic": "Alpha Data Mine",
    "pageNumber": 2,
    "type": "Average True Range (ATR) - Alpha Indicator",
    "definition": {
        "text": "The indicator features 2 different smoothing functions: ATR - SMA (simple moving average) / ATR - RMA (exponential moving average).",
        "updated": 1611653265149
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Average True Range On the Charts",
            "updated": 1611653284523
        },
        {
            "style": "Text",
            "text": "According to Investopedia, “The Average True Range (ATR) is a technical analysis indicator that measures market volatility by decomposing the entire range of an asset price for that period.” The ATR doesn’t indicate a direction of price movement but measures the strength of a movement.",
            "updated": 1611653385842
        },
        {
            "style": "Png",
            "text": "PNGs/Superalgos/Docs/indicators/alpha-bots-layers-00-ATR.png",
            "updated": 1611653349714
        },
        {
            "style": "Text",
            "text": "The True Range (TR) calculates an absolute value of the range between the high/low of the current period and the previous period close. Because absolute values are used, the True Range has only positive numbers indicating the volatility change from the previous period. The result of the true range is smoothed by the Average True Range (ATR). The Alpha data mine provides ATR indicators with 2 different smoothing function: ATR - SMA (simple moving average) / ATR - RMA (exponential moving average)",
            "updated": 1611653431040
        },
        {
            "style": "Text",
            "text": "The chart for this indicator shows the 3 lines of ATR values from different periods (2, 3, 14). Higher ATR values indicate higher market volatility, independent of price action direction. The bottom line is zero as the minimum value. The longer period provides a more general overview of the current market volatility and the lower periods react to short term movements."
        },
        {
            "style": "Text",
            "text": "The information panel shows the numeric value for each ATR value in the layer."
        },
        {
            "style": "Title",
            "text": "Average True Range Products & Properties"
        },
        {
            "style": "Text",
            "text": "There are two products available, each with different smoothing functions and different period configurations:"
        },
        {
            "style": "Table",
            "text": "| Product Name | Product Variable | Properties |\n| ATR - SMA | atrSMA | atr2, atr3, atr14 |\n| ATR - RMA | atrRMA | atr2, atr3, atr14 |",
            "updated": 1611653540033
        },
        {
            "style": "Text",
            "text": "Examples:",
            "updated": 1611653567081
        },
        {
            "style": "Javascript",
            "text": "chart.at24hs.atrSMA.atr3 > chart.at24hs.atrSMA.atr14",
            "updated": 1611653583042
        },
        {
            "style": "Text",
            "text": "Faster ATR (ATR-3) value above slower ATR (ATR-14) value indicates a higher volatility in the short term movement."
        },
        {
            "style": "Javascript",
            "text": "chart.at04hs.atrRMA.atr3 > chart.at04hs.atrRMA.atr14",
            "updated": 1611653589135
        },
        {
            "style": "Text",
            "text": "Same example as above but with RMA (Exponatial Moving Average) as the smoothing function."
        }
    ]
}