{
    "topic": "App Commands",
    "pageNumber": "1",
    "type": "App Contribute Command",
    "definition": {
        "text": "This command allows you to contribute work to the project. The contribution goes to the Superalgos repository via a Pull Request from your Superalgos fork.",
        "updated": 1610909304702
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This command will send all the changes you have made both at Docs pages but also at any file within the Superalgos Repository to your fork at Github.com and from there to the main Superalgos Repository. It will do it specifically from the Current Branch to the Contributions Branch mentioned at the footer of this page. ",
            "updated": 1615288848213
        },
        {
            "style": "Important",
            "text": "Contributions in most cases needs to come from the develop branch to the develop branch unless you have previously agreed with team members that you will send a contribution from master to master."
        },
        {
            "style": "Text",
            "text": "Master is our stable branch and it is very unlikely that we are going to merge contributions there. Instead all contributions are expected to go to the develop branch, where there are many users testing that branch every day, and the contribution will reach the master branch at the next relrease.",
            "updated": 1615288915134
        },
        {
            "style": "Note",
            "text": "It is also very unlikely that contributions coming from the master branch will be merged into the develop branch, since that can usually lead to merging conflicts. "
        },
        {
            "style": "Text",
            "text": "So be sure that your Current Branch is develop and the Contribution Branch is develop before submitting your contribution. "
        },
        {
            "style": "Title",
            "text": "Syntax"
        },
        {
            "style": "Javascript",
            "text": "app.contribute [Message]",
            "updated": 1615461375106
        },
        {
            "style": "Title",
            "text": "Parameters"
        },
        {
            "style": "List",
            "text": "Message: Enter a brief description of what your contribution is about. It is optional but appreciated.",
            "updated": 1610909386562
        },
        {
            "style": "Title",
            "text": "Example",
            "updated": 1609943733276
        },
        {
            "style": "Javascript",
            "text": "app.contribute Fixed typo.",
            "updated": 1615461382913
        },
        {
            "style": "Title",
            "text": "For Devs",
            "updated": 1609944102567
        },
        {
            "style": "Text",
            "text": "This is what the command does:",
            "updated": 1610909409653
        },
        {
            "style": "List",
            "text": "git.add: adds the changes you've made to contributable files to a git commit.",
            "updated": 1610909452789
        },
        {
            "style": "List",
            "text": "git.commit: commits all the changes."
        },
        {
            "style": "List",
            "text": "git.push: pushes the changes to your fork."
        },
        {
            "style": "List",
            "text": "github.createPullRequest: creates a Pull Request at the Superalgos repository, or add commits to an existing Pull Request."
        },
        {
            "style": "Block",
            "text": "Block Authentication",
            "updated": 1609945385299
        },
        {
            "style": "Title",
            "text": "Authentication"
        },
        {
            "style": "Text",
            "text": "For the App Contribute Command to run properly, two different authentications are required:",
            "updated": 1610909501561
        },
        {
            "style": "List",
            "text": "Git Authentication: The first time you run this command, Git will open a pop up window that will ask you for your Github.com credentials. This happens only once. Git will use these credentials to push the commit to your Superalgos fork at Github.com.",
            "updated": 1610909551187
        },
        {
            "style": "List",
            "text": "Github.com Authentication: The creation of the Pull Request is something that happens at Github.com and for this operation you need to authenticate too. To do this, you must generate a Personal Access Token and set it up at the Github Api node configuration in your active workspace.",
            "updated": 1610909615254
        },
        {
            "style": "Subtitle",
            "text": "GitHub.com Token"
        },
        {
            "style": "List",
            "text": "Create the token by following this link:",
            "updated": 1610909635250
        },
        {
            "style": "Link",
            "text": "GitHub.com New Token Page->github.com/settings/tokens/new",
            "updated": 1609944681129
        },
        {
            "style": "Subtitle",
            "text": "Github API Node"
        },
        {
            "style": "Text",
            "text": "Once you have your token, find the GitHub API node (you may search for it in the Documentation). The configuration looks like this:",
            "updated": 1610909728136
        },
        {
            "style": "Javascript",
            "text": "{\n    \"username\": \"\",\n    \"token\": \"\"\n}",
            "updated": 1609944956313
        },
        {
            "style": "Text",
            "text": "If you can't find the node by using the search box, it may not exist in the active workspace. The APIs hierarchy is included by default in the Getting Started workspace only. You may spawn a new APIs hierarchy from the Other Hierarchies node in the Superalgos Project hierarchy.",
            "updated": 1610909893231
        },
        {
            "style": "Subtitle",
            "text": "Properties"
        },
        {
            "style": "List",
            "text": "username: Type your GitHub.com username.",
            "updated": 1610909927500
        },
        {
            "style": "List",
            "text": "token: Paste the token you created.",
            "updated": 1610909948426
        },
        {
            "style": "Note",
            "text": "You may run the command any time after you made and saved changes.",
            "updated": 1610910009790
        },
        {
            "style": "Title",
            "text": "Troubleshooting Authentication Issues",
            "updated": 1610909171028
        },
        {
            "style": "Text",
            "text": "Some issues may arrise when you have more than one Git installation active in your OS.",
            "updated": 1610910061699
        },
        {
            "style": "Text",
            "text": "For example, if you see the following authentication screen, it means an older version of Git is trying to deal with the authentication:"
        },
        {
            "style": "Png",
            "text": "PNGs/Superalgos/Docs/third-parties/git-github-authentication.png",
            "updated": 1610910471806
        },
        {
            "style": "Text",
            "text": "The current authentication screen is similar to this one instead:",
            "updated": 1610910533633
        },
        {
            "style": "Png",
            "text": "PNGs/Superalgos/Docs/third-parties/sign-in-with-your-browser.png",
            "updated": 1610910579507
        },
        {
            "style": "Important",
            "text": "If you didn't install the latest version of Git before installing Superalgos, then that is likely the reason the authentication is not working. The latest version of Git is required.",
            "updated": 1610910817057
        },
        {
            "style": "Success",
            "text": "If you did install Git and you are experiencing the issue described above, restarting your PC may help things sort themselves out.",
            "updated": 1610910739376
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}