{
    "topic": "Community Trading Systems",
    "pageNumber": "1",
    "type": "BTC-USDT - Weak-hands Buster - WHB",
    "definition": {
        "text": "A trading system based on the break down of the Bollinger Bands idea, designed to accumulate Bitcoin, targeting major downward market moves.",
        "updated": 1611675437927
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Weak-hands Buster was released in the Superalgos Community Telegram group in August 2019 and has been trading live since. An evolution of the system is currently available as version 2. This page explains the trading system and analyzes its performance.",
            "updated": 1611675468833
        },
        {
            "style": "Text",
            "text": "The trading system conforms to the Superalgos Trading Protocol, therefore, it may function as a fully automated trading system. People not interested in trading automation may still obtain the strategy’s rules (situations, conditions, and formulas) from the design space and use the set of rules as they see fit."
        },
        {
            "style": "Note",
            "text": "Weak-hands Buster v2 is available on the Weak-Hands-Buster v2.json plugin workspace shipping with Superalgos.",
            "updated": 1611675482499
        },
        {
            "style": "Include",
            "text": "Superalgos->Concept->Reusable Snippets->Read Whole Page Warning",
            "updated": 1611676482873
        },
        {
            "style": "Title",
            "text": "WHB V.2 Performance in Backtests (Binance)",
            "updated": 1611676505532
        },
        {
            "style": "Text",
            "text": "The following was the performance in backtests at the time of publishing:"
        },
        {
            "style": "Table",
            "text": "| Details | Jan 2018 - Mar 2020 | 2020 Jan-Mar | 2019 | 2018 |\n| Trades: | 24 | 2 | 9 | 13 |\n| Hits: | 19 | 1 | 8 | 10 |\n| Fails: | 5 | 1 | 1 | 3 |\n| Hit Ratio: | 79 % | 50 % | 89 % | 77 % |\n| ROI: | 2,662 % | 75 % | 142 % | 551 % |",
            "updated": 1611676638676
        },
        {
            "style": "Subtitle",
            "text": "Notes on Backtests Performance",
            "updated": 1611676669651
        },
        {
            "style": "List",
            "text": "The table above shows the results for different periods tested independently."
        },
        {
            "style": "List",
            "text": "Each backtest starts with an initial capital. With the default configuration, the system reinvests accumulated profits on every trade (positionSize = balanceBaseAsset)."
        },
        {
            "style": "List",
            "text": "ROI is calculated over the initial capital for each backtest, and the result is rounded to the closest integer."
        },
        {
            "style": "List",
            "text": "Because the system reinvests accumulated profits, the sum of ROI in different periods is not the same as ROI for all periods run in one single test (first column)."
        },
        {
            "style": "Subtitle",
            "text": "Assumptions"
        },
        {
            "style": "List",
            "text": "Slippage: 0.1 % in all orders."
        },
        {
            "style": "List",
            "text": "Fees: 0.1 % in all orders."
        },
        {
            "style": "Title",
            "text": "Technical Sheet"
        },
        {
            "style": "Subtitle",
            "text": "Market"
        },
        {
            "style": "Text",
            "text": "USDT-BTC, with BTC as the base asset."
        },
        {
            "style": "Subtitle",
            "text": "Strategy Goal"
        },
        {
            "style": "Text",
            "text": "Accumulate bitcoin during bear markets and/or consolidation periods, with a conservative approach to minimize risk."
        },
        {
            "style": "Subtitle",
            "text": "Approach"
        },
        {
            "style": "Text",
            "text": "Split the goal into two fundamental notions:"
        },
        {
            "style": "List",
            "text": "Focus on potentially big market moves: The strategy is optimized for major trend reversals resulting in long bear markets. Significant consolidations during bull markets are targetted as well.",
            "updated": 1611676774411
        },
        {
            "style": "List",
            "text": "Take the clearest and most promising opportunities only: Pass on everything else to avoid fails and preserve capital.",
            "updated": 1611676784702
        },
        {
            "style": "Subtitle",
            "text": "Trading Idea"
        },
        {
            "style": "Text",
            "text": "The main trading idea is to identify short-term reversals as well as continuations and deepening of trends marked by a break down of the Bollinger Bands (BB) on the 1-hour chart, using the Percentage Bandwidth (%B) indicator, the Bollinger Bands Moving Average (BB MA) and the Bollinger Band deviation to assess momentum and volatility, optimize the take position event, and filter out late entries."
        },
        {
            "style": "Subtitle",
            "text": "Implementation"
        },
        {
            "style": "Text",
            "text": "The original system is dissected in a Coinmonks article: How to Increase your Bitcoin Holdings in a Bear Market. Version 2 maintains the trading idea and the take position event almost intact."
        },
        {
            "style": "Subtitle",
            "text": "Position Size"
        },
        {
            "style": "Text",
            "text": "The positionSize is set to balanceBaseAsset by default. This means that the trading system takes positions with the whole balance, that is, the initialBalance as defined in the configuration of the base asset parameter of the trading session, plus all accumulated profits if any. You may change this formula as you see fit."
        },
        {
            "style": "Important",
            "text": "Please take enough time to consider the implications of the above statement and make your own judgment about what setting may be appropriate for you.",
            "updated": 1611676831315
        },
        {
            "style": "Subtitle",
            "text": "Trading Frequency"
        },
        {
            "style": "Text",
            "text": "The strategy is designed with the one-hour time frame as the main decision-making instance, meaning that it makes trigger and take position decisions upon the closing of the one-hour candle."
        },
        {
            "style": "Text",
            "text": "That said, when running live on Superalgos, it should be run on the one-minute time frame to allow it to react fast to market moves when evaluating take profit and stop loss targets."
        },
        {
            "style": "Text",
            "text": "Because the strategy is rather conservative in its design, it doesn’t trade every opportunity that may occur. Instead, the strategy is quite selective and trades only the most promising ones."
        },
        {
            "style": "Text",
            "text": "As a consequence, and as you may infer from the number of trades in the backtesting report above and the live trading performance of WHB V1 described below, the strategy performs an average of about one trade per month."
        },
        {
            "style": "Subtitle",
            "text": "Required Bots"
        },
        {
            "style": "Text",
            "text": "The following bots must be running and up to date to run paper trading, forward testing, and live trading sessions:"
        },
        {
            "style": "Text",
            "text": "Masters Data Mine:"
        },
        {
            "style": "List",
            "text": "OHLCVs"
        },
        {
            "style": "List",
            "text": "Candles & Volumes"
        },
        {
            "style": "List",
            "text": "Bollinger Bands & Percentage Bandwith"
        },
        {
            "style": "List",
            "text": "Bollinger Channels & SubChannels"
        },
        {
            "style": "Text",
            "text": "Sparta Data Mine:"
        },
        {
            "style": "List",
            "text": "EMA (Popular)"
        },
        {
            "style": "Title",
            "text": "Changes on WHB V.2"
        },
        {
            "style": "List",
            "text": "The two different situations making up the take position event were split into two separate strategies operating under the same trading system. This means that take profit and stop targets may be managed separately for each take position situation. This is the first case of two complementary strategies running under the same trading system."
        },
        {
            "style": "List",
            "text": "An additional condition was implemented at the take position event of each strategy so that each specializes in two different volatility ranges. The Xtreme strategy works best in extreme volatility situations (e.g. ATH period in late 2017 and early 2018). The Steep strategy works best in normal (by BTC standards) volatility situations."
        },
        {
            "style": "List",
            "text": "Management of take profit implemented originally was greatly improved for the Steep strategy, with a few simple additions and checks on the conditions that determine the events that switch phases."
        },
        {
            "style": "List",
            "text": "The trailing stop for the Steep strategy was raised from 5 to 5.25% above the 20 MA. The trailing was delayed to kick-in only after the market has dropped 5%. The initial stop target remains the same at 3%."
        },
        {
            "style": "Title",
            "text": "Original WHB Live Performance"
        },
        {
            "style": "Table",
            "text": "| Details | Sep 2019 - Mar 2020 |\n| Trades: | 7 |\n| Hits: | 4 |\n| Fails: | 3 |\n| Hit Ratio: | 57% |\n| ROI: | 76% |",
            "updated": 1611676965907
        },
        {
            "style": "Title",
            "text": "Original WHB Main Live Trades",
            "updated": 1611676994942
        },
        {
            "style": "Subtitle",
            "text": "Sep 2019"
        },
        {
            "style": "Png",
            "text": "PNGs/Superalgos/Docs/trading-systems/whb-01.png",
            "updated": 1611677095937
        },
        {
            "style": "Subtitle",
            "text": "Nov 2019"
        },
        {
            "style": "Png",
            "text": "PNGs/Superalgos/Docs/trading-systems/whb-02.png",
            "updated": 1611677158974
        },
        {
            "style": "Subtitle",
            "text": "Mar 2020",
            "updated": 1611677186600
        },
        {
            "style": "Png",
            "text": "PNGs/Superalgos/Docs/trading-systems/whb-03.png",
            "updated": 1611677219965
        },
        {
            "style": "Title",
            "text": "Warning and Disclaimer"
        },
        {
            "style": "Include",
            "text": "Superalgos->Concept->Reusable Snippets->Live Trading Warning",
            "updated": 1611677308824
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Include",
            "text": "Superalgos->Concept->Reusable Snippets->Trading System Disclaimer",
            "updated": 1611677317072
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}