{
    "topic": "Data Mining",
    "pageNumber": 6,
    "type": "Data Mining - Data Mines",
    "definition": {
        "text": "Data Mines are user created packages of definitions. These definitions usually include Sensor Bot, Indicator Bot and Plotter definitions. The Data Mines shipped with Superalgos are packages contributed by users of the software.",
        "updated": 1621708561783
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "It is important to undestand that a Data Mine is a package of definitions. When users run a Bot, they do it inside a Task and they need to reference a Process Definition exisiting at one Data Mine. When the bot is launched inside the Task, it receives at that moment all the information regarding the Task that is being used to launch the bot, but at the same time it receives all the information regarding the the Bot's definitions at the Data Mine.",
            "updated": 1621709219036
        },
        {
            "style": "Text",
            "text": "With all that information the Bot is able to do it's job."
        },
        {
            "style": "Title",
            "text": "Who creates them?"
        },
        {
            "style": "Text",
            "text": "Data Mines are created by power users and contributed to the project (the ones shipping with the software). Users might create Data Mines for their personal use and never share them. If they share them, they receive SA tokens for that, and also for mantaining them to adapt them to every new release, if necesary.",
            "updated": 1622188509380
        },
        {
            "style": "Title",
            "text": "Supported Bots"
        },
        {
            "style": "Text",
            "text": "There are three types of bots that can hold their definitions at a Data Mine."
        },
        {
            "style": "List",
            "text": "Sensor Bots: used to fetch data from some source at the Internet by coding a specialized algorithm for that."
        },
        {
            "style": "List",
            "text": "API Data Fetcher Bots: used to fetch data from an Internet API without needing to code."
        },
        {
            "style": "List",
            "text": "Indicator Bots: used to process data."
        },
        {
            "style": "Title",
            "text": "Interdependency of Data Mines",
            "updated": 1621709799491
        },
        {
            "style": "Text",
            "text": "Data Mines might depend of other Data Mines if any of their bots depend on bots belonging to other Data Mines. You will learn further down this Topic how a bot can depend on other bots in detail. In a nutshell, they can depend in 3 ways. They can have a:",
            "updated": 1621903084681
        },
        {
            "style": "List",
            "text": "Data Dependency: This means that a Bot uses as an input the data produced by another bot."
        },
        {
            "style": "List",
            "text": "Status Dependency: This means that a Bot uses the status of another Bot as parameters for it's own process. The most common use case is when a Bot needs for instance the date where a market starts or ends. This information is automatically fetched from the Status Report of the bot that produces the raw data and knows which data is the oldest and the newest all the time."
        },
        {
            "style": "List",
            "text": "Execution Dependency: This means that a Bot depends on other Bot execution to finish in order for it to start it's own execution.",
            "updated": 1621709849717
        },
        {
            "style": "Note",
            "text": "When a Data Mine depends on another Data Mine, both need to be present at the Workspace where the Task defining the execution of the Bot is located.",
            "updated": 1621903174117
        }
    ]
}