{
    "topic": "Data Mining",
    "pageNumber": 11,
    "type": "Data Mining - Deployments",
    "definition": {
        "text": "Data Mining Bots can be deployed into one or many machines at the same time and they will automatically find the way too coordinate their actions.",
        "updated": 1622225530181
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Once you are done defining your data mining Bots, you can move the Tasks that execute them to other Network Nodes and some other node structures within the Network hierarchy. The bot's will still run even from different machines on the network.",
            "updated": 1622226742772
        },
        {
            "style": "Title",
            "text": "How Does Superalgos Know How  to Coordinate Bots?",
            "updated": 1622226151968
        },
        {
            "style": "Text",
            "text": "Everything that needs to be known is already defined at the Workspace.",
            "updated": 1621904768357
        },
        {
            "style": "List",
            "text": "In Data Mines: The definitions at the Data Mine contain the 3 types of relationships between Bots: Execution Dependency, Data Dependency and Status Dependency.",
            "updated": 1622226774180
        },
        {
            "style": "List",
            "text": "At the Network: The Network hierarchy contains all the information needed to know where the dependent bots are running. Looking at the Tasks on the network node, we can know which bots are running on a particular machine in the network. Looking at the Data Storage hierarchy, we can know where Datasets are being storied in the network.",
            "updated": 1622226083877
        },
        {
            "style": "Title",
            "text": "How Does a Bot Know Where Its Dependencies are Running?",
            "updated": 1622226168096
        },
        {
            "style": "Text",
            "text": "Everytime a Task is executed, the whole Network hierarchy, together with the bot definitions at the Data Mines are sent to the Task Server. This includes not only the running Bot's definition, but also all the definitions of the dependent bots.",
            "updated": 1622226410465
        },
        {
            "style": "Success",
            "text": "At runtime, Superalgos will provide the Bot with the Datasets defined at Data Depencies, the Status Reports defined as Status Dependencies, and if necessary, it will help the Bot wait for the Bot defined as an Execution Dependency, no matter where all those resources are within the physical network.",
            "updated": 1622226870002
        }
    ]
}