{
    "topic": "Data Mining",
    "pageNumber": 6,
    "type": "Data Mining - Data Mines",
    "definition": {
        "text": "Data Mines are user created packages of definitions. These definitions usually include Sensor Bot, Indicator Bot and Plotter definitions. The Data Mines shipped with Superalgos are packages contributed by users of the software.",
        "updated": 1621708561783
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "How Bots Use Data Mines",
            "updated": 1622228000451
        },
        {
            "style": "Text",
            "text": "It is important to undestand that a Data Mine is a package of definitions. When users run a Bot, they do it inside a Task. This task needs to know how to run the bot. In order to find this out, the bot within the task must have a reference to a Process Definition exisiting at a Data Mine. When the bot is launched inside the task, at that moment, it receives all the information regarding the task that is being used to launch the bot, while at the same time it also receives the information regarding the Bot's definition from the Data Mine."
        },
        {
            "style": "Important",
            "text": "Using both sides of this information (Task data and Bot definition) the Bot is able to do it's job.",
            "updated": 1622213831832
        },
        {
            "style": "Title",
            "text": "Who Creates Data Mines?",
            "updated": 1622213931643
        },
        {
            "style": "Text",
            "text": "Data Mines are created by power users and contributed to the project (the ones shipping with the software). Users might create Data Mines for their personal use and never share them. However, if they share them, they receive SA tokens for that, and also for adapting and mantaining them, if necessary, for each new release.",
            "updated": 1622214117754
        },
        {
            "style": "Title",
            "text": "Supported Bots"
        },
        {
            "style": "Text",
            "text": "There are three types of bots that can hold their definitions at a Data Mine."
        },
        {
            "style": "List",
            "text": "Sensor Bots: used to fetch data from some Internet source by coding a specialized algorithm.",
            "updated": 1622214170520
        },
        {
            "style": "List",
            "text": "API Data Fetcher Bots: used to fetch data from an Internet API without needing to code."
        },
        {
            "style": "List",
            "text": "Indicator Bots: used to process data."
        },
        {
            "style": "Title",
            "text": "Interdependency of Data Mines",
            "updated": 1621709799491
        },
        {
            "style": "Text",
            "text": "Data Mines might depend on other Data Mines. What this means is the bots within a Data Mine may depend on bots belonging to other Data Mines. Further on in this Topic, you will learn more about how a bot can depend on other bots in detail. In a nutshell, they can depend in 3 ways. They can have a:",
            "updated": 1622214335992
        },
        {
            "style": "List",
            "text": "Data Dependency: This means that a Bot uses as an input the data produced by another bot."
        },
        {
            "style": "List",
            "text": "Status Dependency: This means that a Bot uses the status of another Bot as parameters for it's own processing.",
            "updated": 1622214428120
        },
        {
            "style": "Success",
            "text": "The most common use case is when a Bot needs the date on which a market starts or ends. This information is automatically fetched from the Status Report of the bot that produces the raw data because it knows which data is the oldest and the newest at all times.",
            "updated": 1622214512428
        },
        {
            "style": "List",
            "text": "Execution Dependency: This means that a Bot depends on other Bot execution to finish in order for it to start it's own execution.",
            "updated": 1621709849717
        },
        {
            "style": "Important",
            "text": "When a Data Mine depends on another Data Mine, both need to be present at the Workspace where the Task executing the Bot is located.",
            "updated": 1622214646178
        }
    ]
}