{
    "topic": "Data Mining",
    "pageNumber": 3,
    "type": "Data Mining - Dataset Types",
    "definition": {
        "text": "Superalgos organizes data in datasets. These datasets are standardized across the system in different types.",
        "updated": 1622190798240
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Dataset List",
            "updated": 1622052318412
        },
        {
            "style": "Text",
            "text": "This is the complete list of Dataset types currently supported by the system:",
            "updated": 1622190817372
        },
        {
            "style": "List",
            "text": "Single-File: As the name suggest, this Dataset contains only one file with all the data in there. It is not frequently used. So far is the Dataset type where data coming from Webhooks is stored at. It is stored in this way because it is assumed that not a lot of data will come through this pipe, only signals produced by external systems. Webhooks feature is expected to evolve in the future managing the incoming data in another type of Dataset. This Dataset type can be plotted and its data consumed by and within Trading Strategies. The API Data Fetcher Bot also can save Raw Data in this type of dataset, if needed.",
            "updated": 1622190927687
        },
        {
            "style": "List",
            "text": "One-Min-Daily: This Dataset type organizes data in one file per day and, as the name suggests, expects the data itself to belong to time frames of one minute. This type of Dataset can not be plotted or its data consumed by Trading Strategies.",
            "updated": 1622191007219
        },
        {
            "style": "List",
            "text": "Multi-Time-Frame-Daily: This Dataset type organizes data in one file per day for each Time Frame ranging from 1 minute to 45 minutes. The data of this type of Dataset can be plotted and can be consumed by Trading Strategies.",
            "updated": 1622191043785
        },
        {
            "style": "List",
            "text": "Multi-Time-Frame-Market: This Dataset type organizes data in only one file for each Time Frame ranging from 1 hour to 24 hours. That means that the whole market history will be stored in one single file for each time frame. For example candles of 1 hour for a certain market, will be stored in a single file. The data of this type of Dataset can be plotted and can be consumed by Trading Strategies.",
            "updated": 1622191087786
        },
        {
            "style": "Note",
            "text": "By far, the most popular Dataset Types are Multi-Time-Frame-Daily and Multi-Time-Frame-Market. "
        }
    ]
}