{
    "topic": "Data Mines",
    "pageNumber": "11",
    "type": "How to Build an Indicator - Video Series",
    "definition": {
        "text": "This video series goes through the entire process of building an indicator, step by step.",
        "updated": 1611434001380
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This video series focuses on the “how to” aspect of building an indicator. It does not go through definitions nor does it explain the underlying concepts. Therefore, it is highly recommended to read the data mines page as well as the pages about indicator bots before attempting to build an indicator.",
            "updated": 1611434011723
        },
        {
            "style": "Note",
            "text": "Reading the whole documentation on indicators and plotters is certainly desirable and will save you time in the long run.",
            "updated": 1611434037598
        },
        {
            "style": "Important",
            "text": "The video series on how to build an indicator was produced for the Beta 5 version of the system; however, the functionality still works similarly. That said, there may be minor differences that are yet to be documented. Please drop by the Develop group and ask any questions you may have, particularly if something is not working as expected, or as instructed in the videos.",
            "updated": 1611434212027
        },
        {
            "style": "Title",
            "text": "Step 1 - Visual Definitions",
            "updated": 1611434706444
        },
        {
            "style": "Text",
            "text": "Setting up the multi-period-market and multi-period-daily process definitions, status and data dependencies, execution events, and dataset definitions for the main product.",
            "updated": 1611434720860
        },
        {
            "style": "Youtube",
            "text": "KXKKS_o8Zjw",
            "updated": 1611434740393
        },
        {
            "style": "Title",
            "text": "Step 2 - Code & Record Definition",
            "updated": 1611435476284
        },
        {
            "style": "Text",
            "text": "Reviewing common coding practice and configuring record properties and their formulas.",
            "updated": 1611435495283
        },
        {
            "style": "Youtube",
            "text": "zx5N5D2tkwo",
            "updated": 1611435834819
        },
        {
            "style": "Title",
            "text": "Step 3 - Testing & Troubleshooting",
            "updated": 1611435879103
        },
        {
            "style": "Text",
            "text": "Setting up a data mining task to run the bot instance, checking the dataset files for errors, and troubleshooting common issues with the code and the process definitions.",
            "updated": 1611435892931
        },
        {
            "style": "Youtube",
            "text": "gjv5lPmLVSI",
            "updated": 1611435919312
        },
        {
            "style": "Title",
            "text": "Step 4 - Plotters",
            "updated": 1611435948687
        },
        {
            "style": "Text",
            "text": "How to create the device that will interpret the dataset generated by the indicator and render a graphical representation over the charts.",
            "updated": 1611435955116
        },
        {
            "style": "Youtube",
            "text": "UBtUtUfZPk4",
            "updated": 1611436312247
        },
        {
            "style": "Title",
            "text": "Step 5 - Trading Bot Dependencies",
            "updated": 1611436344230
        },
        {
            "style": "Text",
            "text": "Before you may use the new indicator on a trading system, you must create the corresponding dependencies on the Low frequency trading bot.",
            "updated": 1611436373962
        },
        {
            "style": "Text",
            "text": "To call the properties of a new indicator from within the definitions of a trading system, you first need to let the Low Frequency trading bot that your data mine exists. To do this, you need to add the corresponding data dependencies at the trading bot’s Trading process definitions.",
            "updated": 1611436404033
        },
        {
            "style": "Gif",
            "text": "GIFs/Superalgos/Docs/design-space/how-to-build-an-indicator-step-5.gif",
            "updated": 1611436528224
        },
        {
            "style": "Important",
            "text": "Because the Low Frequency trading bot is a plugin, the modifications you make to the hierarchy do not persist after closing the frontend app. The workaround is to take a backup of the hierarchy after making the modifications, and replace the plugin file with the backup. Should you decide to contribute your data mine to the project, we will incorporate the dependencies in the official release.",
            "updated": 1611436549743
        }
    ]
}