{
    "topic": "Docs Commands",
    "pageNumber": "7",
    "type": "Docs Repaginate Command",
    "definition": {
        "text": "When you add a Docs Topic Page or a Docs Tutorial Page, you may define a page number. The number defines the position of the page within the table of contents. To add a page in-between other pages you may use decimal values. Use the Repaginate command to recalculate all page numbers and leave the whole set in integers.",
        "updated": 1610976158171
    },
    "paragraphs": [
        {
            "style": "Warning",
            "text": "Make sure you consult with the Superalgos Documentation Group before using the Docs Repaginate Command on existing topics or tutorials. The repagination changes all files in the collection. For that reason, the command may be prone to creating conflicts with other users that may be working on those files too.",
            "updated": 1616705086396
        },
        {
            "style": "Title",
            "text": "Syntax"
        },
        {
            "style": "Javascript",
            "text": "docs.repaginate Category from Project: Topic or Tutorial name."
        },
        {
            "style": "Title",
            "text": "Properties"
        },
        {
            "style": "List",
            "text": "Category: It must be either Topic or Tutorial."
        },
        {
            "style": "List",
            "text": "Project: Any existing already integrated project."
        },
        {
            "style": "List",
            "text": "Topic or Tutorial name: The name given tu the Topic or Tutorial that you want to repaginate."
        },
        {
            "style": "Title",
            "text": "Example"
        },
        {
            "style": "Javascript",
            "text": "docs.repaginate Topic from Superalgos: Docs Commands"
        },
        {
            "style": "Title",
            "text": "Usage"
        },
        {
            "style": "Text",
            "text": "After you repaginate a Topic or Tutorial, the best way to proceed it to manually delete from disk all the files associated with that Topic / Tutorial. After you delete them, you execute the repaginate command and then the docs.save command. "
        },
        {
            "style": "Text",
            "text": "The repagination flags all of the files of that Topic / Tutorial as changed, so you don't need to worry about the deleted files since they will be all recreated.",
            "updated": 1614942454596
        },
        {
            "style": "Text",
            "text": "After repagination, reload the UI to get into memory only the repaginated version."
        }
    ]
}