{
    "topic": "How To Debug Exchange Raw Data Sensor Bot",
    "pageNumber": "1",
    "type": "Exchange Raw Data - Your Favorite Exchange Is Not Working",
    "definition": {
        "text": "This is not really a surprise, since there are hundreds of exchanges and if noone tried to put the one you like most to work before, it will most likely don't work with the default configuration.",
        "updated": 1614590122351
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "CCXT Library",
            "updated": 1614590456998
        },
        {
            "style": "Text",
            "text": "CCXT is a popular open source library that acts as a gateway to exchanges API. It's goal is to standarize the access to diverse APIs so that software built using CCXT does not need to know the special dealings of each exchange. Even though it does a pretty good job, it is not perfect and there are still special configurations that needs to be applied to different exchanges."
        },
        {
            "style": "Text",
            "text": "The root of this problems is that there is no starndard at all across the industry and each exchange invents it's own way to deal with each functionality."
        },
        {
            "style": "Link",
            "text": "CCXT at Github->https://github.com/ccxt/ccxt",
            "updated": 1614590739125
        },
        {
            "style": "Title",
            "text": "Tested on Binance"
        },
        {
            "style": "Text",
            "text": "Superalgos a system develops fast but it leaves to its users te fine details and setups, and this is the most common case. We testes only Binance just because it is the most popular exchange as of today. It did not work by itself with the default configuration so a special setting was done and it is at the config of the Binance Crypto  Exchange node."
        },
        {
            "style": "Subtitle",
            "text": "Biance Config"
        },
        {
            "style": "Json",
            "text": "{\n    \"codeName\": \"binance\",\n    \"API\": [\n        {\n            \"method\": \"fetchTrades\",\n            \"fetchType\": \"by Id\",\n            \"fetchTradesMethod\": \"publicGetHistoricalTrades\",\n            \"firstId\": \"f\"\n        }\n    ]\n}",
            "updated": 1614590679126
        },
        {
            "style": "Title",
            "text": "Other Exchanges"
        },
        {
            "style": "Text",
            "text": "Over time some users tested Binanceus, which works with the same config as Binance and some other users ventured into others with unknown results. If you manage to put an exhange to work please let us know with which config so that we can move that exchange to the Tested Exchanges branch of the Crypto Ecosystem."
        },
        {
            "style": "Title",
            "text": "Getting Started"
        },
        {
            "style": "Text",
            "text": "We will assume for the rest of this guide, that you are currently at the Getting Started worksace that comes as a Plugin. If you are not, please load that workpace and close the tutorial that auto starts."
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}