{
    "topic": "Introduction",
    "pageNumber": "7",
    "type": "References",
    "definition": {
        "text": "A reference is a mechanism by which information in a node is related to, or accessed by, other nodes. The ability of a node to establish a reference with another node enables the first to access the information or features entailed in the second one.",
        "updated": 1609950165954
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Direction"
        },
        {
            "style": "Text",
            "text": "References have a direction property relative to each of the nodes involved in the reference: the node establishing the reference sets an outgoing reference, while the one accepting the reference sets an incoming reference."
        },
        {
            "style": "Text",
            "text": "For example, a Backtesting Session establishes an outgoing reference with a Trading System. This allows the session to access the information within the whole trading system hierarchy, including strategies. At the trading system level, the same reference is viewed as an incoming reference.",
            "updated": 1615795085518
        },
        {
            "style": "Note",
            "text": "A node may produce only one outgoing reference, however, it may take several incoming references."
        },
        {
            "style": "Title",
            "text": "Scope"
        },
        {
            "style": "Text",
            "text": "A reference established between nodes of any particular structure within a hierarchy is said to be an internal reference relative to the said structure of nodes. Similarly, a reference established with a node outside of the said structure, that is, in a different part of the hierarchy or in another hierarchy, is said to be an external reference."
        },
        {
            "style": "Text",
            "text": "Examples of internal references may be found in the Data Mine and Crypto Ecosystem hierarchies. For example, let’s briefly look into one such case within a Plotter Module.",
            "updated": 1615795128743
        },
        {
            "style": "Text",
            "text": "The capture below shows the Shapes node and several offspring nodes: on one hand, several Polygon nodes; on the other hand, the Chart Points node.",
            "updated": 1615795168459
        },
        {
            "style": "Gif",
            "text": "GIFs/Superalgos/Docs/design-space/shapes-node-references.gif",
            "updated": 1615796201734
        },
        {
            "style": "Text",
            "text": "Notice that vertices under each polygon reference to points under the chart points node."
        },
        {
            "style": "Text",
            "text": "This means that the node Shapes feature several internal references.",
            "updated": 1615796711778
        },
        {
            "style": "Note",
            "text": "The backup, clone and share operations make different uses of the properties of references. We will cover the three of them extensively so that you may make the most of these features.",
            "updated": 1615796558622
        },
        {
            "style": "Title",
            "text": "Graphical Representation",
            "updated": 1615796579270
        },
        {
            "style": "Text",
            "text": "References are graphically represented with faint grey dotted lines, but they are not visible by default. References become visible when you hover the mouse pointer on a node that has a reference, or when activating the display of all references with the following key combination: ",
            "updated": 1615827008604
        },
        {
            "style": "Text",
            "text": "Ctrl + Shift + Alt + Key-R"
        },
        {
            "style": "Note",
            "text": "For references to be visible, both nodes involved in the reference must be visible.",
            "updated": 1615796621593
        },
        {
            "style": "Anchor",
            "text": "How to Estabish and Remove References",
            "updated": 1609950438203
        },
        {
            "style": "Title",
            "text": "How to Estabish and Remove References"
        },
        {
            "style": "Include",
            "text": "Superalgos->Topic->Establish and Remove References->Definition"
        },
        {
            "style": "Include",
            "text": "Superalgos->Topic->Establish and Remove References->Content",
            "updated": 1609950361692
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}