{
    "topic": "Trading Farms",
    "pageNumber": "2",
    "type": "Trading Farms - Set Up a Network of Nodes",
    "definition": {
        "text": "Install Superalgos on each machine, to then create and set up a network node for each machine. ",
        "updated": 1614352888183
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This page does not go through the process of setting up a computer network. Instead, it assumes the network is already set up. So, do verify the local area network setup and make sure your computer network is functioning properly before starting.",
            "updated": 1611343358129
        },
        {
            "style": "Text",
            "text": "In a network of nodes, each node has it’s own web server, web sockets server, and task server."
        },
        {
            "style": "Note",
            "text": "The default web server and web sockets ports used by Superalgos are 34248 and 18041 respectively. If you wish to change these defaults, you must modify the.env file on the root folder, and also \\TaskServer\\.env.",
            "updated": 1611343376974
        },
        {
            "style": "Title",
            "text": "Before You Begin"
        },
        {
            "style": "Text",
            "text": "Make a quick list with the name you wish to give to each node and the corresponding IP address on the network. You will need those to configure each network node."
        },
        {
            "style": "Text",
            "text": "Also, you may want to plan what your operation should look like."
        },
        {
            "style": "Callout",
            "text": "First and foremost, you may want to decide on which node you will keep the workspace on which the network of nodes shall be configured. We call this, the home node."
        },
        {
            "style": "Text",
            "text": "This is not a requirement, as you may keep different workspaces in different nodes, and even set up different networks on different workspaces, but it’s the most usual setup."
        },
        {
            "style": "Text",
            "text": "Also, you may want to plan which nodes in the network should run which data-mining tasks, which nodes should run which trading sessions, and so on. As hinted in the fundamental concepts page, possibilities are endless, so we are not going to cover alternatives here. If you know exactly what you want to do, it should be easy to implement. That said, you are free to explore and experiment as well."
        },
        {
            "style": "Title",
            "text": "Start Here"
        },
        {
            "style": "Text",
            "text": "1. Set up Superalgos on each machine. Once Superalgos is installed, run the system for the first time using the node run noBrowser command. The noBrowser parameter runs the Client without firing up the UI."
        },
        {
            "style": "Success",
            "text": "On computers with 8 GB of RAM or less, such as minicomputers or single-board computers like the Raspberry Pi, use node run noBrowser minMemo to run the app. minMemo sets up the system to run with minimal RAM requirements.",
            "updated": 1611343440835
        },
        {
            "style": "Text",
            "text": "Leave the machine online, with the Client running."
        },
        {
            "style": "Text",
            "text": "2. Run the UI to access the home node."
        },
        {
            "style": "Text",
            "text": "You may access the home node locally, that is, running the browser on the machine where the home node is running, or you may run the browser on any other machine in the physical network—even one not running Superalgos—by navigating to the home node’s IP address."
        },
        {
            "style": "Note",
            "text": "If you are accessing the home node remotely, you need to configure the My Computer network node to use the machine’s IP address instead of localhost in the host parameter. This enables the web sockets connection.",
            "updated": 1611343511090
        },
        {
            "style": "Success",
            "text": "For organizational purposes and to avoid confusion later on, it is recommended to clean up the home node’s workspace uninstalling the markets that you don’t need.",
            "updated": 1611343505445
        },
        {
            "style": "Text",
            "text": "Click to learn how to uninstall an existing market"
        },
        {
            "style": "Text",
            "text": "3. Add and configure a network node for each machine."
        },
        {
            "style": "Subtitle",
            "text": "Adding a Network Node"
        },
        {
            "style": "Text",
            "text": "To add a network node, select Add Network Node on the Superalgos Network node menu. A network node is added along with the basic structure of nodes to set up a node."
        },
        {
            "style": "Subtitle",
            "text": "Configuring the Network Node"
        },
        {
            "style": "Text",
            "text": "Select Configure on the menu to access the configuration."
        },
        {
            "style": "Javascript",
            "text": "{\n\"host\": \"localhost\",\n\"webPort\": \"34248\",\n\"webSocketsPort\": \"18041\"\n}",
            "updated": 1611344373383
        },
        {
            "style": "List",
            "text": "host is the machine or hardware represented by the network node. The default parameter is localhost, but if you intend to access the Client services of this node from a remote computer, then you must change localhost for the IP Address of the machine on which the node is running, for example, to 147.0.0.1."
        },
        {
            "style": "List",
            "text": "webPort is the port used by the Web Server, at this stage 34248."
        },
        {
            "style": "List",
            "text": "webSocketsPort is the port used by the system to communicate over the local area network, by default set at 18041."
        },
        {
            "style": "Text",
            "text": "Configure the first node and hit F5 to refresh the page. Once the page reloads, a notice indicating the system is connecting with the new network node will show on the top of the screen. Repeat the process for each machine."
        }
    ]
}