{
    "topic": "Trading Farms",
    "pageNumber": "1",
    "type": "Trading Farms Fundamental Concepts",
    "definition": {
        "text": "How to set up a flexible and scalable crypto-trading farm running Superalgos distributed on multiple machines.",
        "updated": 1611343209935
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Superalgos is designed for coordinated, flexible, and scalable trading operations.",
            "updated": 1611343220386
        },
        {
            "style": "Text",
            "text": "In its current version, the system may be deployed in multiple machines—as many as desired—and each machine may constitute a node in a network of nodes. In fact, different networks of nodes may live within the same computer network."
        },
        {
            "style": "Callout",
            "text": "Each node on a network may specialize in a single type of process or handle multiple processes of different types."
        },
        {
            "style": "Text",
            "text": "For example, you may have a set of nodes running data mining operations extracting data from multiple markets and multiple exchanges. You may have a set of nodes specializing in processing indicators and technical studies. And you may have a set of nodes specializing in running trading sessions."
        },
        {
            "style": "Text",
            "text": "You may also use different criteria to arrange the network. For example, you may have a node running combined data mining, data processing, and trading operations on a single exchange or market, and other nodes running similar combined operations on other exchanges or markets."
        },
        {
            "style": "Text",
            "text": "Or you may have a network of nodes for your testing environment and another network of nodes for your production environment."
        },
        {
            "style": "Callout",
            "text": "In other words, the system allows building any arrangement of networks of nodes responding to the organizational logic of your preference."
        },
        {
            "style": "Text",
            "text": "What is unique about Superalgos is that the system keeps track of the network arrangements you create and makes sure that all components and data structures in the system can seamlessly track dependencies across the network. This means, for example, that trading sessions running on Node X may access data in Node Y and Node Z without requiring any sort of configuration."
        },
        {
            "style": "Callout",
            "text": "On top of that, the operation may be managed entirely from any node on the network. In fact, it may be managed from a computer in the network not running Superalgos, by pointing the browser to any of the nodes in the network to run the frontend."
        },
        {
            "style": "Text",
            "text": "The following explanations assume that you are familiar with the basic workings of Superalgos, and in particular, of the Network hierarchy. If that is not the case, then please read the Network pages before diving into building a trading farm."
        },
        {
            "style": "Warning",
            "text": "At this stage, Superalgos does not implement any form of security measures, therefore, the system is to be used in the context of a restricted Local Area Network only.",
            "updated": 1611343257268
        }
    ]
}