{
    "topic": "Troubleshooting",
    "pageNumber": "13",
    "type": "Investigating Issues - Check the Integrity of Your Data",
    "definition": {
        "text": "When data mining processes are not shut down gracefully, your data may get corrupted.",
        "updated": 1611515660531
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Your PC may have been forcefully shut down or you may have closed the console running the Superalgos backend while running a data-mining operation. Such situations may cause some data to become corrupt.",
            "updated": 1611515685392
        },
        {
            "style": "Title",
            "text": "1. Check the Integrity of the Sensor Bot Data",
            "updated": 1611515705862
        },
        {
            "style": "Text",
            "text": "Go to the Exchange-Raw-Data folder under Data-Storage > Exchange > Market > Masters and keep opening the subfolders to get to the last day available, and open the Data.json file. If the file opens fine, this may mean that the data you downloaded from the exchange is safe."
        },
        {
            "style": "Text",
            "text": "If the last file in Exchange-Raw-Data does not open properly then delete the whole Data-Storage > Exchange > Market and run the data mining operation. This will have the OHLCV sensor bot download all the data from the exchange again, and all indicators calculated from scratch."
        },
        {
            "style": "Text",
            "text": "If the sensor data seems fine, then proceed with the next step."
        },
        {
            "style": "Title",
            "text": "2. Check the Integrity of Indicator’s Data",
            "updated": 1611515724143
        },
        {
            "style": "Text",
            "text": "If you are having issues with candles you need to check the data of the Candles Volumes indicator of the Masters Data Mine located deep in Multi-Period-Daily and Multi-Period-Market folders under Data-Storage > Exchange > Market > Masters > Candles-Volumes > Output > Candles."
        },
        {
            "style": "Text",
            "text": "If you find any .tmp files or you can’t open some of the latest Data.json files in a regular text editor, or some files are empty, chances are the files have been corrupted."
        },
        {
            "style": "Text",
            "text": " Note: Something similar may have happened with other indicators as well, so make sure you check the data storage folders of indicators that may not be working or that you may be experiencing issues with."
        },
        {
            "style": "Text",
            "text": "If that is the case, then you will delete the folder for each data mine within Data-Storage > Exchange > Market, but will leave Exchange-Raw-Data intact, and get the data mining operation running afterward. This will regenerate all indicators data products, including Candles Volumes."
        },
        {
            "style": "Title",
            "text": "3. Remember There is a Proper Way to Close the System!",
            "updated": 1611515754787
        }
    ]
}