{
    "topic": "Troubleshooting",
    "pageNumber": "3",
    "type": "How to Upgrade Your Existing Installation",
    "definition": {
        "text": "Staying up to date with the latest version of the software is highly recommended. Learn how to do it and what precautions to take.",
        "updated": 1611511361415
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You should expect new releases of Superalgos to become available every few months. Release announcements are made through the Official Superalgos Telegram Announcements Channel.",
            "updated": 1611511377439
        },
        {
            "style": "Note",
            "text": "During this beta stage, patches may be released as frequently as several times per week. Due to their high-frequency, minor updates go unannounced. If you ever experience a malfunction, make sure you upgrade your installation to the latest version available in the Superalgos repository before reporting a bug.",
            "updated": 1611511390486
        },
        {
            "style": "Title",
            "text": "New Releases"
        },
        {
            "style": "Text",
            "text": "If you are upgrading to a new official release, make sure you follow these instructions as well as those under the All Upgrades section."
        },
        {
            "style": "Subtitle",
            "text": "Read the Announcement Carefully"
        },
        {
            "style": "Text",
            "text": "Read and understand the announcement explaining the changes and how they may impact your workflow. Most importantly, find out if the new version requires upgrading your workspace."
        },
        {
            "style": "Subtitle",
            "text": "Check the Getting Started Guide"
        },
        {
            "style": "Text",
            "text": "It would be wise to go through the potentially new Getting Started Guide in the documentation, as it may reveal important information."
        },
        {
            "style": "Subtitle",
            "text": "Back Up Your Personal Work"
        },
        {
            "style": "Text",
            "text": "If the new version requires upgrading to a new workspace, you must decide which parts of your work you wish to backup so that you may restore them on the upgraded workspace (e.g.: you may want to backup your trading systems, data mines, super scripts, specific settings or configurations such as testing sessions, time machines, and so on)."
        },
        {
            "style": "Text",
            "text": "If there is no need to upgrade the workspace, that means that the new version of the system should work well with your existing workspace, provided that you are only one version behind."
        },
        {
            "style": "Title",
            "text": "All Upgrades"
        },
        {
            "style": "Subtitle",
            "text": "Back Up the Workspace"
        },
        {
            "style": "Text",
            "text": "Always back up your existing workspace before switching versions. You may go back to a working version of the software in case something goes wrong with the new one, by installing the previous version of the system and restoring your old workspace from a backup file if needed."
        },
        {
            "style": "Subtitle",
            "text": "Put the House in Order"
        },
        {
            "style": "Text",
            "text": "1. Stop all tasks that may be running in the network hierarchy, and close your browser. Allow a minute or two until all activity stops before closing the Console/Command Line/Terminal running the servers."
        },
        {
            "style": "Text",
            "text": "2. Check if you have any personal files, such as your workspace backups and so on in your Superalgos-master folders. Move them to a different location if you do, or take precautions not to delete them in the next step."
        },
        {
            "style": "Text",
            "text": "3. You will keep the Data-Storage and My-Workspaces folders intact and delete all the remaining folders within the Superalgos folder."
        },
        {
            "style": "Important",
            "text": "You do not need to get rid of the historic market data or the workspaces you have been working with every time you upgrade your system. Do not delete your Data-Storage or your My-Workspaces folder.",
            "updated": 1611511439947
        },
        {
            "style": "Title",
            "text": "Install the New Version",
            "updated": 1611511465990
        },
        {
            "style": "Text",
            "text": "Always follow the instructions in the Official Announcements Channel and the official blog post about the new release.",
            "updated": 1611511529701
        },
        {
            "style": "Important",
            "text": "Always beware of what random people may post in open Telegram groups or forums. Patches and releases will always be made available at the master branch of the Superalgos repository.",
            "updated": 1611511536779
        },
        {
            "style": "Title",
            "text": "Empty Cache and Hard Reload"
        },
        {
            "style": "Text",
            "text": "Once the system loads in your browser window and before you start working, you need to empty Chrome’s cache and do a hard reload to make sure the browser does use the newly installed files."
        },
        {
            "style": "Text",
            "text": "1. Hit F12 to open Chrome’s Developer Tools. You do not need to use the Developers Tools, but opening it allows performing the next task."
        },
        {
            "style": "Text",
            "text": "2. Right-click on the refresh icon and select Empty Cache and Hard Reload from the drop-down menu. Once refreshed, you may close Developer Tools with F12."
        },
        {
            "style": "Text",
            "text": "F12 to open Developer Tools, then right-click on the refresh icon."
        },
        {
            "style": "Title",
            "text": "Final Tunning and Testing"
        },
        {
            "style": "Text",
            "text": "Occasionally, the new version of the system may introduce changes that may require you to update your existing trading systems or some other parts of your workspace. If that is the case, an official announcement should explain how to proceed."
        },
        {
            "style": "Text",
            "text": "This is the time to restore any of the work you may have backed up earlier."
        },
        {
            "style": "Text",
            "text": "Before going deep back to work, it is always recommeended to test the new version a bit and make sure that your existing work performs as you would expect."
        },
        {
            "style": "Text",
            "text": "If you run into any issues, feel free to drop us a line in our Community."
        }
    ]
}