{
    "type": "Asset",
    "definition": {
        "text": "An Asset is an artifact, mostly in a digital format, that belongs to a Project. It may be a code file, a documentation or tutorial page, an image, a video, a social media account or even a post, marketing collateral, and more. To incentivize the production and maintenance of Assets, the node may receive Weight Votes. It may also receive Contribution Claims from Contributors involved in their production and maintenance.",
        "updated": 1630435180948,
        "translations": [
            {
                "language": "RU",
                "text": "Asset - это изделие, в основном в цифровом формате, который принадлежит проекту Project. Это может быть файл кода, страница документации или учебника, изображение, видео, учетная запись в социальных сетях или даже сообщение, маркетинговое обеспечение и многое другое. Чтобы стимулировать производство и обслуживание изделий, узел может получать весовые голоса Weight Votes. Он также может получать требования о взносах Contribution Claims от участников Contributors, участвующих в их производстве и обслуживании.",
                "updated": 1638606457884
            },
            {
                "language": "TR",
                "text": "Varlık, çoğunlukla dijital formatta olan ve bir Projeye ait olan bir eserdir. Bir kod dosyası, bir dokümantasyon veya eğitim sayfası, bir resim, bir video, bir sosyal medya hesabı veya hatta bir gönderi, pazarlama teminatı ve daha fazlası olabilir. Varlıkların üretimini ve bakımını teşvik etmek için düğüm Ağırlık Oyları alabilir. Ayrıca, üretim ve bakımlarında yer alan Katılımcılardan Katkı Talepleri de alabilir.",
                "updated": 1654394480398
            },
            {
                "language": "DE",
                "text": "Ein Asset ist ein Artefakt, meist in einem digitalen Format, das zu einem Projekt (Project) gehört. Dabei kann es sich um eine Codedatei, eine Dokumentations- oder Anleitungsseite, ein Bild, ein Video, ein Social-Media-Konto oder sogar einen Beitrag, Marketingmaterial und mehr handeln. Um Anreize für die Erstellung und Pflege von Assets zu schaffen, kann der Knoten Gewichtungsstimmen (Weight Votes) erhalten. Er kann auch Beitragsforderungen (Contribution Claims) von Mitwirkenden erhalten, die an der Erstellung und Pflege der Assets beteiligt sind.  ",
                "updated": 1708628758683
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624709759877
        },
        {
            "style": "Text",
            "text": "You may cast Weight Votes on individual Asset nodes to incentivize the improvement, development, and maintenance of the said asset.",
            "updated": 1630435190635,
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете отдавать голоса Weight Votes по отдельным узлам изделия, чтобы стимулировать улучшение, развитие и обслуживание указанного изделия.",
                    "updated": 1638606543678
                },
                {
                    "language": "TR",
                    "text": "Söz konusu varlığın iyileştirilmesini, geliştirilmesini ve bakımını teşvik etmek için tek tek Varlık düğümlerine Ağırlık Oyları verebilirsiniz.",
                    "updated": 1654394486201,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie können Gewichtungsstimmen (Weight Votes) für einzelne Asset-Knoten abgeben, um Anreize für die Verbesserung, Entwicklung und Instandhaltung des betreffenden Assets zu schaffen.",
                    "updated": 1708290711804
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you are involved in the development or maintenance of the said asset, you may place an Asset Contribution Claim and rally the Community to support your claim so that you may be rewarded for your work.",
            "updated": 1630435212758,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы участвуете в разработке или обслуживании указанного изделия, вы можете подать заявление об Asset Contribution Claim и сплотить сообщество для поддержки вашего требования, чтобы вы могли быть вознаграждены за свою работу.",
                    "updated": 1638606669194
                },
                {
                    "language": "TR",
                    "text": "Söz konusu varlığın geliştirilmesinde veya bakımında yer alıyorsanız, bir Varlık Katkı Talebinde bulunabilir ve çalışmalarınızın karşılığını alabilmeniz için Topluluğu talebinizi desteklemeye çağırabilirsiniz.",
                    "updated": 1654394492405,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie an der Entwicklung oder Instandhaltung des besagten Vermögenswerts beteiligt sind, können Sie einen Antrag auf einen Vermögensbeitrag (Asset Contribution Claim) stellen und die Gemeinschaft (Community) auffordern, Ihren Antrag zu unterstützen, damit Sie für Ihre Arbeit belohnt werden können.",
                    "updated": 1708290769709
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1638606682435
                },
                {
                    "language": "TR",
                    "text": "Konfigürasyon",
                    "updated": 1654394498249,
                    "style": "Title"
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}