{
    "topic": "Repository Branches",
    "pageNumber": "3",
    "type": "Develop",
    "definition": {
        "text": "The Develop branch is the branch developers use to contribute to the codebase. Changes at this branch are merged into the Master branch upon each release or service pack. The purpose of the Develop branch is to accumulate changes at the codebase until the release date when changes are ready for merging.",
        "updated": 1630657066558,
        "translations": [
            {
                "language": "RU",
                "text": "Ветка Develop - это ветка, которую разработчики используют для внесения вклада в кодовую базу. Изменения в этой ветке сливаются в ветку Master после каждого выпуска или пакета обновления. Цель ветки Develop - накапливать изменения в кодовой базе до даты релиза, когда изменения будут готовы к слиянию.",
                "updated": 1640353124124
            },
            {
                "language": "TR",
                "text": "Geliştirme (Develop) dalı, geliştiricilerin kod tabanına katkıda bulunmak için kullandığı daldır. Bu daldaki değişiklikler, her yayın veya hizmet paketinden sonra Ana dal (Master) ile birleştirilir. Geliştirme şubesinin amacı, değişikliklerin birleştirilmeye hazır olduğu yayın tarihine kadar değişiklikleri kod tabanında toplamaktır.",
                "updated": 1642710483059
            },
            {
                "language": "DE",
                "text": "Der Develop-Zweig ist der Zweig, den die Entwickler verwenden, um zur Codebasis beizutragen. Änderungen in diesem Zweig werden bei jedem Release oder Service Pack in den Master-Zweig (Master branch) zusammengeführt. Der Zweck des Develop-Zweiges ist es, Änderungen an der Codebasis bis zum Veröffentlichungsdatum zu sammeln, wenn die Änderungen zum Zusammenführen bereit sind.",
                "updated": 1689530425899
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Contributors working at this branch Hang out in the Telegram Develop Group.",
            "updated": 1630657099841,
            "translations": [
                {
                    "language": "RU",
                    "text": "Сотрудники, работающие в этой ветке, зависают в группе Telegram Develop Group.",
                    "updated": 1640353193626
                },
                {
                    "language": "TR",
                    "text": "Bu şubede çalışarak katkıda bulunanlar, Telegram Geliştirme Grubunda takılır.",
                    "updated": 1642710508818
                },
                {
                    "language": "DE",
                    "text": "Mitwirkende, die an diesem Zweig arbeiten, hängen in der Telegram Develop Group ab.",
                    "updated": 1689530442363
                }
            ]
        },
        {
            "style": "Link",
            "text": "Telegram Developers Group->t.me/superalgosdevelop",
            "updated": 1622468567484
        }
    ]
}