{
    "topic": "Docs Paragraph Styles",
    "pageNumber": 22,
    "type": "Docs Block Style",
    "definition": {
        "text": "Use block paragraphs to define blocks of content with any number of paragraphs. A block starts with the paragraph that is assigned the Docs Block Style and ends on the last paragraph before the next paragraph with a Docs Block Style, or where the page ends.",
        "updated": 1642938399056,
        "translations": [
            {
                "language": "DE",
                "text": "Blockabsätze definieren eine Reihe von Absätzen, die von anderen Seiten aus eingefügt werden können. Wenn Sie einen Block einbinden, indem Sie einen Docs Include Style Absatz erstellen, müssen Sie auf einen Blockabsatz verweisen, der auf der Seite erstellt wurde, die die einzubindende Absatzgruppe enthält. Ein Block enthält alle Absätze nach sich selbst bis zum nächsten Block oder dem Ende der Seite.",
                "updated": 1633958201415
            },
            {
                "language": "RU",
                "text": "Блок абзацев Block Paragraph определяет набор абзацев, которые могут быть включены с других страниц. Когда вы включаете блок, создавая абзац стиля Docs Include Style, вам необходимо ссылаться на абзац блока, созданный на странице, на которой есть набор абзацев для включения. Блок содержит весь абзац после себя до следующего блока или конца страницы.",
                "updated": 1638544396175
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1642938781588,
            "translations": [
                {
                    "language": "DE",
                    "text": "Um einen Blockabsatz korrekt zu definieren, müssen Sie die folgende Syntax befolgen:",
                    "updated": 1633958297788
                },
                {
                    "language": "RU",
                    "text": "Чтобы правильно определить блок абзацев, вам необходимо следовать следующему синтаксису:",
                    "updated": 1638544350250
                }
            ]
        },
        {
            "style": "Text",
            "text": "To start a new block, write the name of the block in a new paragraph and apply the Docs Block Style."
        },
        {
            "style": "Callout",
            "text": "Once you apply the Docs Block Style, the paragraph seems to disappear. It doesn't though. What happens is that the paragraph gets assigned a CSS style that makes invisible the name you wrote, and displays a faint triangle pointing downwards that is highlighted upon mouseover. The triangle now marks the start of the block.",
            "updated": 1642950503111
        },
        {
            "style": "Text",
            "text": "To end a block, create a new block after it. If you don't, then the block ends wherever the page ends."
        },
        {
            "style": "Block",
            "text": "Example",
            "updated": 1642938594418
        },
        {
            "style": "Subtitle",
            "text": "Example"
        },
        {
            "style": "Success",
            "text": "This example is set up as a block. Notice the dim triangle on the right-hand side of the page right above the Example title. Double click to the left of the triangle to select the hidden text. This is how you find the name of the block.",
            "updated": 1642938905830
        },
        {
            "style": "Javascript",
            "text": "Block Name",
            "updated": 1609259337116
        },
        {
            "style": "List",
            "text": "Block Name: This refers to any name that you would like to give to the newly created Block. The name must be unique within the page.",
            "updated": 1609259387171,
            "translations": [
                {
                    "language": "DE",
                    "text": "Block Name: Dies bezieht sich auf einen beliebigen Namen, den Sie dem neu erstellten Block geben möchten. Der Name muss innerhalb der Seite einzigartig sein.",
                    "updated": 1633958323628
                },
                {
                    "language": "RU",
                    "text": "Name: Это относится к любому имени, которое вы хотели бы дать вновь созданному блоку. Имя должно быть уникальным на странице.",
                    "updated": 1638544436027
                }
            ]
        }
    ]
}