{
    "topic": "Docs Paragraph Styles",
    "pageNumber": 17,
    "type": "Docs YouTube Video Style",
    "definition": {
        "text": "It is possible to embed YouTube videos at a Docs page. All you need to know is to copy and pate the YouTube video id into a paragraph with Youtube style.",
        "translations": [
            {
                "language": "DE",
                "text": "Es ist möglich, YouTube-Videos in eine Docs-Seite einzubetten. Alles, was Sie dazu wissen müssen, ist, die YouTube-Video-ID zu kopieren und in einen Absatz mit dem Youtube-Stil einzufügen.",
                "updated": 1633957183556
            },
            {
                "language": "RU",
                "text": "На страницу документов можно встраивать видео с YouTube. Все, что вам нужно знать, это скопировать и вставить идентификатор видео YouTube в абзац в стиле Youtube.",
                "updated": 1638542483088
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The syntax to embed a YouTube video at a Docs page is the following:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Syntax zum Einbetten eines YouTube-Videos in eine Docs-Seite lautet wie folgt:",
                    "updated": 1633957198374
                },
                {
                    "language": "RU",
                    "text": "Синтаксис для встраивания видео YouTube на страницу следующий:",
                    "updated": 1638542518164
                }
            ]
        },
        {
            "style": "Json",
            "text": "videoId (taken from YouTube)"
        },
        {
            "style": "Text",
            "text": "If you wish the video to autoplay, that is, to start playing without user intervention like an animated GIF would, add the following string immediately after the videoId:",
            "updated": 1616182813822,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn Sie möchten, dass das Video automatisch abgespielt wird, d. h. dass die Wiedergabe ohne Benutzereingriff beginnt, wie bei einem animierten GIF, fügen Sie die folgende Zeichenfolge unmittelbar nach der videoId ein:",
                    "updated": 1633957228484
                },
                {
                    "language": "RU",
                    "text": "Если вы хотите, чтобы видео воспроизводилось автоматически, то есть чтобы видео начиналось без вмешательства пользователя, как это сделал бы анимированный GIF, добавьте следующую строку сразу после videoId:",
                    "updated": 1638542559313
                }
            ]
        },
        {
            "style": "Json",
            "text": "?rel=0&autoplay=1&mute=1"
        },
        {
            "style": "Title",
            "text": "Example:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Beispiel:",
                    "updated": 1633957244489
                },
                {
                    "language": "RU",
                    "text": "Пример:",
                    "updated": 1638542570388
                }
            ]
        },
        {
            "style": "Json",
            "text": "fO-CHEEVneI\n",
            "updated": 1616182571265
        },
        {
            "style": "Text",
            "text": "This would render the following video:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Dies würde das folgende Video wiedergeben:",
                    "updated": 1633957260647
                },
                {
                    "language": "RU",
                    "text": "Это приведет к воспроизведению следующего видео:",
                    "updated": 1638542640415
                }
            ]
        },
        {
            "style": "Youtube",
            "text": "fO-CHEEVneI"
        },
        {
            "style": "Success",
            "text": "To edit a YouTube video paragraph, right-click slightly above the upper border of the video, not on the video itself.",
            "updated": 1616182753529,
            "translations": [
                {
                    "language": "DE",
                    "text": "Um den Absatz eines YouTube-Videos zu bearbeiten, klicken Sie mit der rechten Maustaste etwas oberhalb des oberen Randes des Videos, nicht auf das Video selbst.",
                    "updated": 1633957388424
                },
                {
                    "language": "RU",
                    "text": "Чтобы отредактировать абзац видео YouTube, щелкните правой кнопкой мыши немного выше верхней границы видео, а не на самом видео.",
                    "updated": 1638542661727
                }
            ]
        }
    ]
}