{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 42,
    "type": "Tutorial Step - The Elegant Way...",
    "definition": {
        "icon": {
            "name": "Mouse\\mouse-pointer",
            "project": "Foundations"
        },
        "text": "I know! Zooming into a random spot is unlikely to position the chart squared with your screen, right? No worries... try this trick!",
        "translations": [
            {
                "language": "IT",
                "text": "Lo so, zoommare su un punto a caso difficilmente farà sì che il grafico si adatti al tuo schermo, vero? No problem...",
                "updated": 1614893061080,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Aku tahu!, Memperbesar ke tempat acak tidak seperti langsung menuju ke kotak chart discreenmu, benar? Jangan khawatir... Coba trik ini!",
                "updated": 1616948885540,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Lo sé! Es poco probable que hacer zoom en un lugar aleatorio coloque el gráfico al cuadrado con su pantalla, ¿verdad? No te preocupes ... ¡prueba este truco!",
                "updated": 1624384343958,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Ich weiß! Wenn Sie auf eine beliebige Stelle zoomen, ist es unwahrscheinlich, dass Sie die Karte im rechten Winkel zu Ihrem Bildschirm positionieren, oder? Keine Sorge... versuchen Sie diesen Trick!",
                "updated": 1634207830054,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Biliyorum! Rastgele bir noktaya zum yapmak, grafiği ekranınızla kare şeklinde konumlandırmak pek mümkün değil, değil mi? Endişelenme... bu numarayı dene!",
                "updated": 1636036151336
            }
        ],
        "updated": 1616417516192
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "Adjust the aspect ratio: Point your mouse to the Backtesting Session chart (the one on top) and hit Ctrl + Shift + Alt + Key-A",
            "updated": 1630942566854,
            "translations": [
                {
                    "language": "ID",
                    "text": "Menyesuaikan aspect ratio: Point mouse-mu ke chart dan tekan Ctrl + Shift + Key-A",
                    "updated": 1616948923519,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Adjust the aspect ratio: apunta al gráfico Backtesting Session (está en la parte superior) y presiona Ctrl + Shift + Key-A",
                    "updated": 1627304634273,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Stellen Sie das Seitenverhältnis ein: Zeigen Sie mit der Maus auf den Chart der Backtesting Session (den oberen) und drücken Sie Ctrl + Shift + Alt + Key-A",
                    "updated": 1634207859976,
                    "style": "List"
                },
                {
                    "language": "TR",
                    "text": "En-boy oranını ayarlayın: Farenizi Backtesting Session grafiğine (üstteki) getirin ve Ctrl + Shift + Alt + Key-A tuşlarına basın",
                    "updated": 1636036205725
                }
            ]
        },
        {
            "style": "List",
            "text": "Zoom out: use the mouse wheel to go to the furthest zoom out position; only from this position will the next command work!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Zoom out: gunakan mouse wheel untuk memposisikan zoom out terkecil; hanya dari posisi ini perintah berikutnya akan bekerja!",
                    "updated": 1616949119939,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Zoom out: usa la rueda del mouse para ir a la posición de alejamiento más lejana; ¡Solo asi funcionará el siguiente comando!",
                    "updated": 1624403987866,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Verkleinern: Benutzen Sie das Mausrad, um zur äußersten Verkleinerungsposition zu gelangen; nur von dieser Position aus funktioniert der nächste Befehl!",
                    "updated": 1634207868032,
                    "style": "List"
                },
                {
                    "language": "TR",
                    "text": "Uzaklaştır: en uzak uzaklaştırma konumuna gitmek için fare tekerleğini kullanın; sadece bu konumdan sonraki komut çalışacaktır!",
                    "updated": 1636036274866
                }
            ]
        },
        {
            "style": "List",
            "text": "Double-click once: this centers the chart and takes you to a certain level of zoom; a margin is left to fit the name and tab of the chart on the top-left corner.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Fai doppio click sulla Time Machine in cima: questo centrerà il grafico e lo zoomerà, lasciando del margine per visualizzarne il nome e la tab in alto a sinistra.",
                    "updated": 1618647317393,
                    "style": "List"
                },
                {
                    "language": "ID",
                    "text": "Double-click sekali: Ini memusatkan chart dan membawamu ke tingkat zoom tertentu; margin terlihat kekiri agar pas dengan nama dan tab chart di sudut kiri atas.",
                    "updated": 1616949208729,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Double-click once: esto centra el gráfico y te lleva a un cierto nivel de zoom; se deja un margen para ajustar el nombre y la pestaña del gráfico en la esquina superior izquierda.",
                    "updated": 1624384580827,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Doppelklicken Sie einmal: Dies zentriert das Diagramm und bringt Sie zu einer bestimmten Zoomstufe; es wird ein Rand gelassen, damit der Name und die Registerkarte des Diagramms in die obere linke Ecke passen.",
                    "updated": 1634207894965,
                    "style": "List"
                },
                {
                    "language": "TR",
                    "text": "Bir kez çift tıklayın: bu, grafiği ortalar ve sizi belirli bir yakınlaştırma düzeyine götürür; sol üst köşede grafiğin adına ve sekmesine uyacak şekilde bir kenar boşluğu bırakılır.",
                    "updated": 1636037063264
                }
            ],
            "updated": 1616418234728
        },
        {
            "style": "List",
            "text": "Double-click again: this takes you further in the chart, to the zoom level in which the chart perfectly fits the screen and Layer Managers emerge.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Fai un altro doppio click: questo ti trasporterà dentro il grafico, zoomandolo quanto basta per adattarlo perfettamente allo schermo e farne emergere i layer.",
                    "updated": 1618647548231,
                    "style": "List"
                },
                {
                    "language": "ID",
                    "text": "Double-click lagi: Ini membawamu lebih jauh kedalam bagan, tingkat zoom ini secara sempurna cocok dengan layar beserta layer managers yang muncul.",
                    "updated": 1616949317416,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Double-click again: esto lo lleva más lejos, al nivel de zoom en el que el gráfico se ajusta perfectamente a la pantalla y emergen los Layer Managers.",
                    "updated": 1624404060794,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Ein weiterer Doppelklick: bringt Sie weiter in das Diagramm, bis zu einer Zoomstufe, in der das Diagramm perfekt auf den Bildschirm passt und die Layer Manager erscheinen.",
                    "updated": 1634207914480,
                    "style": "List"
                },
                {
                    "language": "TR",
                    "text": "Tekrar çift tıklayın: bu sizi grafikte daha ileri götürür, grafiğin ekrana tam olarak oturduğu ve Katman Yöneticilerinin ortaya çıktığı yakınlaştırma düzeyine gidersiniz.",
                    "updated": 1636037090275
                }
            ],
            "updated": 1622198926988
        }
    ]
}