{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 41,
    "type": "Tutorial Step - Get In the Wormhole!",
    "definition": {
        "icon": {
            "name": "Mouse\\mouse-wheel-up",
            "project": "Foundations"
        },
        "text": "It's time to dive into a Time Machine and see what happens! Are you ready for a full-on immersive experience?",
        "translations": [
            {
                "language": "IT",
                "text": "È il momento di tuffarci in una Time Machine e vedere che succede! Sei pronto per questa esperienza?",
                "updated": 1614892693632,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Saatnya menuju Time Machine dan lihat yang terjadi! Apakah kamu siap untuk merasakan full-on immersive experience?",
                "updated": 1616948557580,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Es hora de sumergirse en un Time Machine y ver qué pasa! ¿Estás listo para una experiencia inmersiva total?",
                "updated": 1624384047290,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": " Es ist an der Zeit, in eine Time Machine einzutauchen und zu sehen, was passiert! Sind Sie bereit für ein umfassendes, immersives Erlebnis?",
                "updated": 1634207146163,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Bir Zaman Makinesine ( Time Machine ) dalıp ne olduğunu görmenin zamanı geldi! Tamamen sürükleyici bir deneyime hazır mısınız?",
                "updated": 1636036023943
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The charting space is like the Google Maps of market charts. As you already know, you left-click and drag to move around the landscape... but, how do you zoom in to see the details?",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il Charting Space è un po'come il Google Maps dei grafici di mercato. Come sai già, si clicca e si trascina per spostarsi al suo interno...ma come si zoomma per vedere i dettagli?",
                    "updated": 1614892771662,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Charting space seperti Google Maps untuk chart market. Seperti yang diketahui, kamu bisa click kiri dan drag untuk bergerak diarea landscape... Tapi, Bagaimana kamu memperbesar untuk melihat detailnya?",
                    "updated": 1616948680615,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El Charting Space es como Google Maps de los gráficos de mercado. Como ya sabes, haces clic izquierdo y arrastras para moverte por el paisaje ... pero, ¿cómo haces zoom para ver los detalles?",
                    "updated": 1624384176097,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Der Charting Space ist so etwas wie das Google Maps der Marktcharts. Wie Sie bereits wissen, können Sie mit der linken Maustaste klicken und ziehen, um sich in der im Charting Space zu bewegen... aber wie zoomen Sie hinein, um die Details zu sehen?",
                    "updated": 1634207179395,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Grafik alanı, piyasa verilerinin Google Haritaları gibidir. Bildiğiniz gibi, haritalarda gezinmek için sol tıklayıp sürüklersiniz... ama detayları görmek için nasıl yakınlaştırıyorsunuz?",
                    "updated": 1636036084427
                }
            ]
        },
        {
            "style": "Callout",
            "text": "With the wheel of the mouse! Try it!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Con la rotella del mouse! Provaci!",
                    "updated": 1614892781701,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Dengan mouse wheelmu! Cobalah!",
                    "updated": 1616948707864,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Con la rueda del mouse! ¡Intentalo!",
                    "updated": 1624384207479,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Mit dem Rad der Maus! Probieren Sie es aus!",
                    "updated": 1634207215883,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Farenin tekerleği ile! Dene!",
                    "updated": 1636036095610
                }
            ]
        },
        {
            "style": "Text",
            "text": "Exactly! Just like in Google Maps! Pointing the mouse to the area of interest, then roll the wheel of the mouse forwards to zoom in, and backwards to zoom out!",
            "updated": 1634207261588,
            "translations": [
                {
                    "language": "IT",
                    "text": "Esatto! Proprio come su Google Maps! Posiziona il mouse su un'area di interesse e gira la rotella in avanti per aumentare lo zoom, e all'indietro per diminuirlo!  ",
                    "updated": 1634207493280,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Persis banget! Seperti Google Maps! Point mouse ke area yang diinginkan, lalu putar mouse wheelmu ke depan untuk memperbesar, dan ke belakang untuk memperkecil!  ",
                    "updated": 1634207515158,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¡Exactamente! ¡Como en Google Maps! Apunte el mouse al área de interés, luego gire la rueda del mouse hacia adelante para acercar y hacia atrás para alejar.  ",
                    "updated": 1634207437297,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Ganz genau! Genau wie in Google Maps! Zeigen Sie mit der Maus auf den Bereich, der Sie interessiert, und drehen Sie dann das Mausrad nach vorne, um hineinzuzoomen, und nach hinten, um herauszuzoomen!  ",
                    "updated": 1634207338450,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Aynen öyle! Tıpkı Google Haritalar'daki gibi! Fareyi ilgilenilen alana doğrultun, ardından yakınlaştırmak için farenin tekerleğini ileri, uzaklaştırmak için geri çevirin!",
                    "updated": 1636036116439
                }
            ]
        }
    ]
}