{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 108,
    "type": "Tutorial Step - Is It Working?",
    "definition": {
        "icon": {
            "name": "crypto-exchange",
            "project": "Foundations"
        },
        "text": "The unequivocal way to verify if things are working fine is logging on to the exchange and checking your order history for BTC/USDT.",
        "updated": 1640291050452,
        "translations": [
            {
                "language": "IT",
                "text": "Il modo inequivocabile per verificare se le cose stanno funzionando bene è accedere all'Exchange e controllare la cronologia degli ordini per BTC/USDT.",
                "updated": 1666394302684,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "La forma inequívoca de verificar si las cosas están funcionando bien es iniciar sesión en el exchange y comprobar tu historial de órdenes de BTC/USDT.",
                "updated": 1675362535652,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Der eindeutigste Weg, um zu überprüfen, ob die Dinge gut funktionieren, ist, sich bei der Börse anzumelden und Ihre Auftragshistorie für BTC/USDT zu überprüfen. ",
                "updated": 1642152645770
            },
            {
                "language": "TR",
                "text": "İşlerin yolunda gidip gitmediğini doğrulamanın kesin yolu borsaya giriş yapmak ve BTC/USDT için sipariş geçmişinizi kontrol etmektir.",
                "updated": 1666065963618
            },
            {
                "language": "ID",
                "text": "Salah satu cara untuk memverifikasi apakah semuanya berfungsi dengan baik adalah masuk ke exchange dan memeriksa riwayat pesanan kamu untuk BTC / USDT .",
                "updated": 1640595940733
            },
            {
                "language": "RU",
                "text": "Однозначным способом проверить, все ли работает нормально, является вход на биржу и проверка истории ордеров на BTC/USDT.",
                "updated": 1642771874432
            },
            {
                "language": "NL",
                "text": "De ondubbelzinnige manier om te controleren of alles goed werkt, is door in te loggen op het handelsplatform en uw order geschiedenis te controleren op BTC/USDT.",
                "updated": 1667135751148
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Go to the exchange's web interface and take a look at what's going on!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Vai all'interfaccia web dell'Exchange e dai un'occhiata a cosa sta succedendo!",
                    "updated": 1666394349412,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Accede a la plataforma web del exchange y echa un vistazo.",
                    "updated": 1675362587264,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Gehen Sie auf die Weboberfläche der Börse und sehen Sie sich an, was dort los ist! ",
                    "updated": 1642152672719
                },
                {
                    "language": "TR",
                    "text": "Borsa hesabınıza gidin ve neler olup bittiğine bir göz atın! ",
                    "updated": 1666066096405
                },
                {
                    "language": "ID",
                    "text": "Pergi ke exchange's website interface dan lihat apa yang terjadi!",
                    "updated": 1640595981515
                },
                {
                    "language": "RU",
                    "text": "Зайдите в веб-интерфейс биржи и посмотрите, что происходит!",
                    "updated": 1642771885326
                },
                {
                    "language": "NL",
                    "text": "Ga naar de webinterface van het handelsplatform en kijk wat er aan de hand is!",
                    "updated": 1667135772413
                }
            ],
            "updated": 1640291072820
        },
        {
            "style": "Note",
            "text": "At any point in time, you should see one open order and a number of canceled orders pilling up in your order history, pretty much like in the video on the next step!",
            "translations": [
                {
                    "language": "IT",
                    "text": "In qualunque momento, dovresti vedere un ordine aperto e un certo numero di ordini cancellati nella tua cronologia, come nel video al prossimo step!",
                    "updated": 1618071750939,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "En cualquier momento, deberías ver una orden abierta y un número de ordenes canceladas acumulándose en tu historial de órdenes, ¡casi como en el video del siguiente paso!",
                    "updated": 1675362634552,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Zu einem beliebigen Zeitpunkt sollten Sie eine offene Order und eine Reihe von stornierten Orders in Ihrer Orderhistorie sehen, ähnlich wie im Video im nächsten Schritt!",
                    "updated": 1634245350624
                },
                {
                    "language": "TR",
                    "text": "Herhangi bir zamanda, bir sonraki adımdaki videoda olduğu gibi, sipariş geçmişinizde bir açık sipariş ve bir dizi iptal edilen siparişin biriktiğini görmelisiniz!",
                    "updated": 1636577910650
                },
                {
                    "language": "ID",
                    "text": "Kapan saja, kamu akan melihat satu open order dan sejumlah canceled orders muncul dalam riwayat pesananmu, seperti dalam video pada langkah berikutnya!",
                    "updated": 1640596048300
                },
                {
                    "language": "RU",
                    "text": "В любой момент времени вы должны видеть один открытый ордер и несколько отмененных ордеров, которые накапливаются в вашей истории ордеров, почти как в видео на следующем шаге!",
                    "updated": 1642771902012
                },
                {
                    "language": "NL",
                    "text": "Op elk moment zou je een openstaande bestelling en een aantal geannuleerde bestellingen moeten zien opstapelen in je order geschiedenis, ongeveer zoals in de video bij de volgende stap!",
                    "updated": 1667135797932
                }
            ]
        }
    ]
}