{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 2,
    "type": "Tutorial Step - Pick Your Language",
    "definition": {
        "text": "Users are contributing translations so that you may choose your preferred language! This Community is awesome!",
        "updated": 1619801502482,
        "icon": {
            "name": "Languages\\EN",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "FR",
                "text": "Les utilisateurs contribuent aux traductions afin que vous puissiez choisir votre langue préférée ! Cette communauté est géniale !",
                "updated": 1623947311364,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Los usuarios están contribuyendo con traducciones para que puedas elegir tu idioma preferido! ¡Esta comunidad es increíble!",
                "updated": 1625927584664,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Kullanıcılar, tercih ettiğiniz dili seçebilmeniz için çevirilere katkıda bulunuyor! Bu Topluluk harika!",
                "updated": 1633120577362,
                "style": "Definition"
            },
            {
                "language": "NL",
                "text": "Gebruikers voegen vertalingen toe, zodat je jouw voorkeurstaal kan kiezen! Deze Community is geweldig!",
                "updated": 1633850957963,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Die Übersetzungen werden von Unterstützern aus der Community beigetragen, so dass Sie Ihre bevorzugte Sprache wählen können! Diese Community ist großartig!",
                "updated": 1634159799660,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Пользователи предоставляют переводы для выбора предпочитаемого языка. Это потрясающее Community! ",
                "updated": 1635453127908
            },
            {
                "language": "ID",
                "text": "Pengguna saling berkontribusi dalam menerjemahkan sehingga kamu dapat memilih bahasa pilihanmu! Community ini luarbiasa!",
                "updated": 1639582383650
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This is how it works: the default language is English. If you choose any other language and there is a translation for the current page, then you get it in the selected language. Otherwise, you get it in English!",
            "updated": 1619801342624,
            "translations": [
                {
                    "language": "FR",
                    "text": "Voici comment cela fonctionne : la langue par défaut est l'anglais. Si vous choisissez une autre langue et qu'il existe sa traduction, vous l'obtenez, sinon, elle apparaitra en anglais !",
                    "updated": 1623947447536,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Así es como funciona: el idioma predeterminado es el inglés. Si eliges cualquier otro idioma y hay una traducción para la página actual, la obtendrás en el idioma seleccionado. De lo contrario en inglés.",
                    "updated": 1627240786626,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Bu nasıl çalışır? Varsayılan dil İngilizce'dir. Başka bir dil seçerseniz ve mevcut sayfa için bir herhangi bir dilde çeviri varsa, onu sayfanın aşağısındaki bayraklara tıklaarak seçtiğiniz dilde görüntülersiniz. Eğer çeviri yoksa,İngilizce olarak görürsünüz1",
                    "updated": 1633120762865,
                    "style": "Text"
                },
                {
                    "language": "NL",
                    "text": "Dit is hoe het werkt: de standaardtaal is Engels. Als je een andere taal kiest en er is een vertaling voor de huidige pagina, dan krijgt je deze te zien in de gekozen taal, anders zie je de pagina in het Engels!",
                    "updated": 1633851093585,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "So funktioniert es: Standard ist Englisch. Wenn Sie eine andere Sprache wählen und es eine Übersetzung für die aktuelle Seite gibt, erhalten Sie diese in der gewählten Sprache. Andernfalls erhalten Sie die Seite auf Englisch!",
                    "updated": 1634159943189,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Как это работает: английский - язык по умолчанию. В случае, если Вы выберете какой-нибудь другой язык, где существует перевод текущей страницы, у Вас появится возможность перевода на данном предпочитаемом языке. В обратном случае, язык остается  - английский.",
                    "updated": 1635448551187
                },
                {
                    "language": "ID",
                    "text": "Begini cara kerjanya: bahasa utama adalah bahasa Inggris. Jika kamu pilih bahasa lain dan ada terjemahannya, maka kamu sudah berada di bahasa yang diinginkan. Jika tidak, Kamu akan membacanya dalam bahasa Inggris!",
                    "updated": 1639582032428
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Use the mouse wheel to scroll the page on the right downwards. Click on a flag to change the preferred language, if so you wish!",
            "updated": 1619803411650,
            "translations": [
                {
                    "language": "FR",
                    "text": "Utilisez la molette de la souris pour faire défiler la page de droite vers le bas. Cliquez sur un drapeau pour changer la langue préférée, si vous le souhaitez !",
                    "updated": 1623947515076,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Utiliza la rueda del mouse para desplazarte por la página de la derecha hacia abajo. Haz clic en una bandera para cambiar el idioma preferido, si así lo deseas.",
                    "updated": 1627241034008,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Sayfayı aşağı kaydırmak için fare tekerleğini kullanın. Dilerseniz tercih ettiğiniz dili değiştirmek için bir bayrağa tıklayın!",
                    "updated": 1633120795496,
                    "style": "Callout"
                },
                {
                    "language": "NL",
                    "text": "Gebruik je muiswiel om de pagina aan de rechterkant naar beneden te scrollen. Als je het wilt, klik op een vlaggetje om de voorkeurstaal te wijzigen!",
                    "updated": 1633851203889,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Um die bevorzugte Sprache zu ändern scrollen Sie die Docs auf der rechten Seite ganz nach unten und klicken Sie auf die entsprechende Flagge.",
                    "updated": 1634159894831,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Используйте колесико мыши, чтобы прокрутить страницу в правильном направлении вниз. Нажмите на флажок, чтобы изменить предпочитаемый язык, если Вы желаете.",
                    "updated": 1635448656834
                },
                {
                    "language": "ID",
                    "text": "Gunakan mouse wheel untuk menggulir halaman di kanan bawah. Click bendera sesuai bahasa yang kamu inginkan!",
                    "updated": 1639582298058
                }
            ]
        },
        {
            "style": "Note",
            "text": "Only the Docs and tutorials may be translated, not the interface, nor titles!",
            "updated": 1619804204225,
            "translations": [
                {
                    "language": "FR",
                    "text": "Note : Seuls les docs et les tutoriels peuvent être traduits, pas l'interface, ni les titres !",
                    "updated": 1623947561329,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "¡Solo se pueden traducir los documentos y los tutoriales, no la interfaz ni los títulos!",
                    "updated": 1625928204688,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Arayüz veya başlıklar değil, yalnızca Dokümanlar ve öğreticiler çevrilebilir!",
                    "updated": 1633121237275,
                    "style": "Note"
                },
                {
                    "language": "NL",
                    "text": "Alleen de Docs en de tutorials mogen worden vertaald niet de interface en de titels!",
                    "updated": 1633851259089,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Nur die Docs und Tutorials dürfen übersetzt werden, nicht aber das Interface oder die Titel!",
                    "updated": 1634070001415,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Только документы и учебное пособие могут быть переведены, но не интерфейс, ни заголовки.",
                    "updated": 1635448708836
                },
                {
                    "language": "ID",
                    "text": "Hanya Docs dan tutorials yang akan diterjemahkan, bukan interface, ataupun titles!",
                    "updated": 1639582361956
                }
            ]
        }
    ]
}