{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 92,
    "type": "Tutorial Step - Check Your Spot Balance!",
    "definition": {
        "icon": {
            "name": "crypto-exchanges\\binance",
            "project": "Foundations"
        },
        "text": "Before you run the Live Trading Session, make sure you have enough spot USDT balance at the exchange!",
        "translations": [
            {
                "language": "IT",
                "text": "Prima di lanciare la Live Trading Session, assicurati di avere abbastanza USDT nel tuo wallet spot sull'exchange.",
                "updated": 1618070262891,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Antes de ejecutar el Live Trading Session, asegúrate de tener suficiente saldo en USDT al contado en el exchange.",
                "updated": 1624471256717,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Take a look at your balance at the exchange and arrange for enough USDT for the session!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Controlla il tuo saldo sull'exchange e prepara abbastanza USDT per la sessione!",
                    "updated": 1618070327486,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Eche un vistazo a su saldo en el exchange y organiza suficientes USDT para la sesión!",
                    "updated": 1624471291732,
                    "style": "Callout"
                }
            ]
        },
        {
            "style": "Important",
            "text": "The Trading Bot will place one limit order for the initialBalance, and cancel it the next minute in case it is not filled, as explained earlier.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il Trading Bot inserirà un limit order del valore di initialBalance, e lo cancellerà il minuto successivo se non viene evaso, come spiegato prima.",
                    "updated": 1618070448288,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "El Trading Bot colocará una orden limitada para el inicialBalance y la cancelará al minuto siguiente en caso de que no se complete, como se explicó anteriormente.",
                    "updated": 1624471439730,
                    "style": "Important"
                }
            ]
        },
        {
            "style": "Note",
            "text": "Keep going even if you are not ready to trade! It's important because there are more things to learn in the tutorial!",
            "updated": 1622232501088,
            "translations": [
                {
                    "language": "IT",
                    "text": "Continua il tutorial anche se non sei pronto al live trading. Imparerai altri trucchi utili prima della fine.",
                    "updated": 1618070434600,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "¡Continúa incluso si no estás listo para la sesión! ¡Es importante porque hay más cosas que aprender en el tutorial!",
                    "updated": 1624471521635,
                    "style": "Note"
                }
            ]
        }
    ]
}