{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 42,
    "type": "Tutorial Step - Talkin' Time Travel",
    "definition": {
        "icon": {
            "name": "Time\\time-machine",
            "project": "Foundations"
        },
        "text": "I mentioned earlier there are two charts in this workspace. In Superalgos, we call each of these a Time Machine.",
        "translations": [
            {
                "language": "IT",
                "text": "Poco fa ho detto che ci sono due grafici in questo workspace. In Superalgos, chiamiamo ognuno di questi grafici una Time Machine.",
                "updated": 1614847393489,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Aku telah memberitahumu duluan ada dua charts di workspace ini. Dalam Superalgos, kam memanggilnya dengan Time Machine.",
                "updated": 1616935192130,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Mencioné anteriormente que hay dos gráficos en este espacio de trabajo. En Superalgos, llamamos a cada uno de estos un Time Machine.",
                "updated": 1624381357850,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Ich habe bereits erwähnt, dass es in diesem Workspace zwei Diagramme gibt. In Superalgos nennen wir jedes dieser Diagramme eine Time Machine.",
                "updated": 1634205940397,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Daha önce bahsetmiştim, bu çalışma alanında iki grafik var. Superalgos'ta bu grafiklerin her birine bir Zaman Makinesi ( Time Machine ) diyoruz.",
                "updated": 1644911532637
            },
            {
                "language": "RU",
                "text": "Я упоминал ранее, что в этом рабочем пространстве имеется две диаграммы. В Superalgos мы называем каждую из них - Time Machine.",
                "updated": 1636199639429
            },
            {
                "language": "NL",
                "text": "Ik heb eerder gezegd dat er twee grafieken in deze werkruimte zijn. In Superalgos noemen we elk van deze een Time Machine.",
                "updated": 1666698742920
            },
            {
                "language": "FR",
                "text": "J'ai mentionné plus tôt qu'il y a deux graphiques dans cet espace de travail. Dans Superalgos, nous appelons chacun d'eux une Time Machine.",
                "updated": 1668067979518
            },
            {
                "language": "PL",
                "text": "Wspomniałem wcześniej, że w tym obszarze roboczym znajdują się dwa wykresy. W Superalgos każdy z nich nazywamy Time Machine.",
                "updated": 1675081116687
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "A time machine may hold one Timeline Chart or more. We call them time machines because all timeline charts within a time machine are synchronized in time. This feature of time machines allows to superimpose different layers of data sharing the same Time Scale.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Una Time Machine può contenere una o più Timeline Chart. Le chiamiamo così perchè tutti i Timeline Chart in una Time Machine sono sincronizzati nel tempo. Ciò permette di sovrapporre differenti livelli di dati che usano la stessa Time Scale.",
                    "updated": 1614847651838,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Time machine akan menahan satu atau lebih Timeline Chart. Dalam time machines karena semua timeline charts dalam time machine tersingkronasi dengan waktu. Fitur time machines ini memungkinkan untuk menempatkan berbeda lapisan data dalam pembagian data di Time Scale yang sama.",
                    "updated": 1616935672320,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Un Time Machine puede tener un Timeline Chart o más. Los llamamos máquinas del tiempo porque todos los gráficos de la línea de tiempo dentro de ella están sincronizados en el tiempo. Esta característica permite superponer diferentes capas de datos compartiendo el mismo Time Scale.",
                    "updated": 1624381666829,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Eine Time Machine kann einen oder mehere Timeline Charts enthalten. Wir nennen sie Time Machines, weil alle Timeline Charts innerhalb einer Time Machine zeitlich synchronisiert sind. Diese Eigenschaft der Time Machines ermöglicht es, verschiedene Datenebenen auf derselben Time Scale zu überlagern.",
                    "updated": 1634206096721,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Bir zaman makinesi, bir veya daha fazla Zaman Çizelgesi Grafiği tutabilir. Onlara zaman makineleri diyoruz çünkü bir zaman makinesindeki tüm zaman çizelgeleri zamanla senkronize edilir. Zaman makinelerinin bu özelliği, aynı Zaman Ölçeğini paylaşan farklı veri katmanlarının üst üste binmesine izin verir.",
                    "updated": 1636035067580
                },
                {
                    "language": "RU",
                    "text": "Машина времени может содержать одну или несколько Timeline Chart. Мы называем их машиной времени, потому что все графики временной шкалы в машине времени синхронизированы во времени. Эта особенность машин времени позволяет накладывать различные слои данных, используя один и тот же Time Scale.",
                    "updated": 1636199955416
                },
                {
                    "language": "NL",
                    "text": "Een time machine kan één of meer Timeline Chart bevatten. We noemen ze time machines omdat alle tijdlijndiagrammen binnen een time machine in de tijd worden gesynchroniseerd. Deze functie van time machines maakt het mogelijk om verschillende gegevenslagen over elkaar heen te leggen die dezelfde Time Scale delen.",
                    "updated": 1666698848582
                },
                {
                    "language": "FR",
                    "text": "Une machine temporelle peut contenir une Timeline Chart ou plus. Nous les appelons machines temporelles parce que tous les diagrammes chronologiques dans une machine temporelle sont synchronisés dans le temps. Cette caractéristique des machines temporelles permet de superposer différentes couches de données partageant la même échelle de temps.",
                    "updated": 1668068068271
                },
                {
                    "language": "PL",
                    "text": "Time Machine może pomieścić jeden lub więcej Timeline Chart. Nazywamy je Time Machine, ponieważ wszystkie  Timeline Chart w ramach Time Machine są zsynchronizowane w czasie. Ta cecha Time Machine pozwala na nakładanie różnych warstw danych dzielących ten sam Time Scale.",
                    "updated": 1675081341942
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Hover your mouse pointer over the time machines!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Sposta il puntatore del mouse sopra le Time Machine!",
                    "updated": 1614847549742,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Arahkan mouse pointer kearah time machines!",
                    "updated": 1616935491446,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Pasa el mouse sobre un Time Machine!",
                    "updated": 1624406480076,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Fahren Sie mit dem Mauszeiger über die Time Machines!",
                    "updated": 1634206006623,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Fare imlecinizi zaman makinelerinin üzerine getirin!",
                    "updated": 1636035197351
                },
                {
                    "language": "RU",
                    "text": "Наведите указатель мыши на машины времени!",
                    "updated": 1636201484840
                },
                {
                    "language": "NL",
                    "text": "Beweeg uw muisaanwijzer over de tijdmachines!",
                    "updated": 1666698869358
                },
                {
                    "language": "FR",
                    "text": "Passez le pointeur de votre souris sur les time machines !",
                    "updated": 1668068093438
                },
                {
                    "language": "PL",
                    "text": "Najedź kursorem myszy na Time Machine!",
                    "updated": 1675081419313
                }
            ]
        },
        {
            "style": "Text",
            "text": "Notice the label emerging on the left-hand side showing which exchanges and markets the data is associated with. A single time machine may hold data from multiple markets and multiple exchanges!",
            "updated": 1610622145377,
            "translations": [
                {
                    "language": "IT",
                    "text": "Le label che spuntano da sinistra mostrano a quale exchange e market si riferiscono i dati. Una singola Time Machine può contenere dati da diversi markets e exchanges!",
                    "updated": 1614847670664,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Perhatikan label yang ada dikiri yang menyatakan exchange dan market dari data yang diasosiasikan. Satu time machine akan dapat menyimpan dari berbagai market dan lebih dari satu exchange.",
                    "updated": 1616935697836,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Observa la etiqueta emergente en el lado izquierdo que muestra a qué exchange y mercados están asociados los datos. ¡Un Time Machine puede contener datos de múltiples mercados y múltiples exchanges!",
                    "updated": 1627304357216,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Beachten Sie die Beschriftung auf der linken Seite, aus der hervorgeht, mit welchen Börsen und Märkten die Daten verbunden sind. Eine einzige Time Machine kann Daten von mehreren Märkten und mehreren Börsen enthalten!",
                    "updated": 1634206050433,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Sol tarafta beliren ve verilerin hangi borsa ve piyasalarla ilişkili olduğunu gösteren etikete dikkat edin. Tek bir zaman makinesi birden fazla işlem çiftinden ve birden fazla borsadan veri tutabilir!",
                    "updated": 1669839740079
                },
                {
                    "language": "RU",
                    "text": "Обратите внимание на появившуюся слева метку, которая указывает на то, с какими биржами и рынками связаны данные. Одна машина времени может содержать данные с множества рынков и бирж.",
                    "updated": 1636201607160
                },
                {
                    "language": "NL",
                    "text": "Let op het label dat aan de linkerkant verschijnt en laat zien aan welke handelsplatformen en markten de gegevens zijn gekoppeld. Een enkele tijdmachine kan gegevens bevatten van meerdere markten en meerdere handelsplatformen!",
                    "updated": 1666698952119
                },
                {
                    "language": "FR",
                    "text": "Remarquez l'étiquette qui apparaît sur le côté gauche et qui indique à quelles exchanges et à quels marchés les données sont associées. Une seule time machine peut contenir des données provenant de plusieurs marchés et de plusieurs exchanges !",
                    "updated": 1668068145044
                },
                {
                    "language": "PL",
                    "text": "Zwróć uwagę na etykietę pojawiającą się po lewej stronie, pokazującą, z którymi giełdami i rynkami dane są powiązane. W jednej Time Machine mogą znajdować się dane z wielu rynków i wielu giełd!",
                    "updated": 1675081615077
                }
            ]
        }
    ]
}