{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 3,
    "type": "Tutorial - Welcome to Superalgos!",
    "definition": {
        "icon": {
            "name": "tutorial",
            "project": "Foundations"
        },
        "text": "I'm an interactive tutorial, the first in a series designed to facilitate your onboarding and teach you all the basics!",
        "translations": [
            {
                "language": "ID",
                "text": "Aku adalah tutorial yang interaktif, yang berkerja untuk memfasilitasi orientasi pemikiran kamu dan mengajari kamu semua dasar tentang Superalgos!",
                "updated": 1614416780981,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Soy un tutorial interactivo, el primero de una serie diseñada para facilitar tu llegada y enseñarte lo básico.",
                "updated": 1613594456875,
                "style": "Definition"
            },
            {
                "language": "IT",
                "text": "Sono un tutorial interattivo, il primo di una serie progettata per rendere più facile la tua introduzione a Superalgos e per insegnarti tutti i concetti base!",
                "updated": 1614711302828,
                "style": "Definition"
            },
            {
                "language": "FR",
                "text": "Je suis un tutoriel interactif, le premier de une serie cree pour vous facilter la connaissance de Superalgo et de vous guider dans ses choix basiques!",
                "updated": 1623946542352,
                "style": "Definition"
            },
            {
                "language": "NL",
                "text": "Ik ben een interactieve tutorial, de eerste in een reeks die ontworpen is om je kennismaking te vergemakkelijken en je alle basisprincipes te leren!",
                "updated": 1633850222210,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Ich bin ein interaktives Tutorial, das erste einer Reihe, die Ihnen den Einstieg erleichtern und Ihnen alle Grundlagen vermitteln soll!",
                "updated": 1634070025309,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Я - интерактивное учебное пособие, первое в серии, предназначенное для облегчения Вашей адаптации и обучения всем основам.",
                "updated": 1635448912724
            },
            {
                "language": "TR",
                "text": "Ben interaktif bir öğreticiyim, Superalgos'u öğrenmenize yardımcı olmak,işinizi  kolaylaştırmak ve size tüm temel bilgileri öğretmek için tasarlanmış bir serinin ilk öğreticisiyim.",
                "updated": 1635575887053
            }
        ],
        "updated": 1633159917192
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I will get you started, show you the tools that will help you move around comfortably, and help you discover all the cool things that Superalgos may do for you.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Aku akan membantumu dalam memulai, dan menunjukkan alat yang akan membantumu bergerak dengan nyaman, dan menemukan semua hal keren yang akan dilakukan Superalgos untuk tradingmu.",
                    "updated": 1614416877222,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Te pondré en marcha, te mostraré las herramientas que te ayudarán a moverte cómodamente y te ayudaré a descubrir todas las cosas geniales que Superalgos puede hacer por ti.",
                    "updated": 1613594557989,
                    "style": "Text"
                },
                {
                    "language": "IT",
                    "text": "Ti farò un'introduzione, mostrandoti gli strumenti che ti aiuteranno a prendere confidenza, e ti aiuterò a scoprire tutte le cose grandiose che Superalgos può fare per te.",
                    "updated": 1614711533001,
                    "style": "Text"
                },
                {
                    "language": "FR",
                    "text": "Je vais vous aider à démarrer, en vous montrant les outils qui vous aideront à vous déplacer facilement, et vous aider à découvrir toutes les choses que Superalgos vous faciliter.",
                    "updated": 1623945805888,
                    "style": "Text"
                },
                {
                    "language": "NL",
                    "text": "Ik help je op weg, laat je de hulpmiddelen zien om je op weg te helpen en help je alle coole dingen te ontdekken die Superalgos voor je kan doen.",
                    "updated": 1633850415380,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Ich werde Ihnen die Werkzeuge zeigen, mit denen Sie sich bequem zurechtfinden, und Ihnen helfen, all die coolen Dinge zu entdecken, die Superalgos für Sie tun kann.",
                    "updated": 1634159537847,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Я помогу Вам начать, покажу панель инструментов, с помощью которых Вы сможете комфортно передвигаться и раскрыть все интересные вещи, которые Superalgos может сделать для Вас.",
                    "updated": 1635449021102
                },
                {
                    "language": "TR",
                    "text": "Başlamanıza yardımcı olacağım, rahatça hareket etmenize yardımcı olacak araçları göstereceğim ve Superalgos'un sizin için yapabileceği tüm harika şeyleri keşfetmenize yardımcı olacağım.",
                    "updated": 1635575910092
                }
            ],
            "updated": 1633159949363
        },
        {
            "style": "Callout",
            "text": "Tutorials are the ultimate Superalgos onboarding tool! Starting with Superalgos in any other way is a mistake, as no other resource will get you up to speed faster. You should do all tutorials before trying to implement your own ideas!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Memulai Superalgos dengan cara sendiri sangat tidak direkomendasikan, karena tidak ada sumber lain yang lebih paham selain aku. Aku akan membantumu dalam memahami Superalgos!",
                    "updated": 1616696383875,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Los tutoriales son la mejor manera de comenzar en Superalgos. Empezar de otra manera es un error, ya que ningún otro recurso te pondrá al día más rápido. ¡Deberías recorrer todos los tutoriales antes de intentar poner en marcha tus estrategias!",
                    "updated": 1618431788534,
                    "style": "Callout"
                },
                {
                    "language": "IT",
                    "text": "Sono lo strumento definitivo per scoprire Superalgos! Avventurarti alla sua scoperta in qualsiasi altro modo é un errore: nessun altro strumento ti aiuterà a farlo più in fretta. Ti assicuro che risponderò alla maggior parte delle tue domande!",
                    "updated": 1614711851139,
                    "style": "Callout"
                },
                {
                    "language": "FR",
                    "text": "Les tutoriels sont l'ultime outil d'initiation à Superalgos ! Commencer à utiliser Superalgos d'une autre manière serait une erreur, car aucune autre ressource ne vous permettra d'être opérationnel plus rapidement. Nous vous recommandons de suivre tous les tutoriels avant d'essayer de mettre en œuvre vos propres idées !",
                    "updated": 1623946050005,
                    "style": "Callout"
                },
                {
                    "language": "NL",
                    "text": "Tutorials zijn de ultieme Superalgos kennismakingstool! Op een andere manier Superalgos ontdekken is een vergissing, omdat geen enkel ander hulpmiddel je sneller op weg helpt. Je hoort alle tutorials te doen voordat je jouw eigen ideeën probeert te implementeren!",
                    "updated": 1633850814638,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Tutorials sind der beste Start in Superalgos!  Keine andere Ressource wird Sie schneller einarbeiten. Sie sollten alle Tutorials durcharbeiten, bevor Sie versuchen, Ihre eigenen Ideen zu implementieren!",
                    "updated": 1634159523866,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Это учебное пособие является окончательным инструментом для адаптации в системе Superalgos. Начинать ознакомление с этой системой каким-либо другим образом, является ошибкой, так как никакой другой ресурс не поможет Вам ускорить процесс. Вам следовало бы ознакомиться с полным учебным пособием, прежде чем пытаться реализовать свои собственные идеи!",
                    "updated": 1635449358224
                },
                {
                    "language": "TR",
                    "text": "Öğreticiler, Superalgos'a alıştırma aracıdır! Superalgos'a başka bir şekilde başlamak bir hatadır, çünkü başka hiçbir kaynak sizi daha fazla hızlandıramaz. Kendi fikirlerinizi uygulamaya çalışmadan önce tüm dersleri yapmalısınız!",
                    "updated": 1635576039599
                }
            ],
            "updated": 1633159975051
        },
        {
            "style": "Success",
            "text": "Please, always click Next to continue!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Mohon, klik Next untuk melanjutkan",
                    "updated": 1614417191759,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Porfavor, presiona siguiente para continuar",
                    "updated": 1613594696979,
                    "style": "Success"
                },
                {
                    "language": "IT",
                    "text": "Premi sempre Next per continuare!",
                    "updated": 1614711933264,
                    "style": "Success"
                },
                {
                    "language": "FR",
                    "text": "S'il vous plaît, cliquez toujours sur Suivant pour continuer !",
                    "updated": 1623950092303,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "Lütfen devam etmek için her zaman NEXT'e tıklayın!",
                    "updated": 1633121186582,
                    "style": "Success"
                },
                {
                    "language": "NL",
                    "text": "klik op Next om verder te gaan!",
                    "updated": 1633850689870,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": " Bitte klicken Sie immer auf Weiter, um fortzufahren!",
                    "updated": 1634070092386,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Пожалуйста, всегда нажимайте Next, чтобы продолжить.",
                    "updated": 1635449400949
                }
            ]
        }
    ]
}