{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 24,
    "type": "Tutorial Step - Need a Quick Reminder?",
    "definition": {
        "icon": {
            "name": "Key\\key-left",
            "project": "Foundations"
        },
        "text": "At this point, I'm probably overflowing your hippocampus! But don't worry... you may go back to any previous step!",
        "translations": [
            {
                "language": "IT",
                "text": "Tutte queste informazioni ti avranno sovraccaricato l'ippocampo! Ma non preccuparti, puoi tornare indietro a qualunque step precedente.",
                "updated": 1614790380193,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Pada point ini, Aku sudah membuatmu banyak mengingat! Tapi jangan khawatir ... kamu dapat kembali ke step sebelumnya!",
                "updated": 1616768312747,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "En este punto, ¡probablemente esté saturando tu hipocampo! Pero no te preocupes... ¡puedes volver a cualquier paso anterior!",
                "updated": 1627303260247,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "An dieser Stelle werde ich wahrscheinlich Ihren Hippocampus überlaufen lassen! Aber keine Sorge... Sie können zu jedem früheren Schritt zurückgehen!",
                "updated": 1634165475316,
                "style": "Definition"
            },
            {
                "language": "NL",
                "text": "Op dit punt, overspoel ik waarschijnlijk je hippocampus! Maak je geen zorgen... je kan teruggaan naar elke vorige stap!",
                "updated": 1635181798322,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "В этот момент я, вероятно, перезагружаю Ваш мозг. Но не волнуйтесь... Вы можете вернуться к любому предыдущему шагу.",
                "updated": 1635611688610,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Bu noktada, muhtemelen hipokampüsünüzden taşıyorum! Ama merak etmeyin... önceki herhangi bir adıma geri dönebilirsiniz!",
                "updated": 1635952703561
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If you ever need a reminder about any of these topics, you may replay any Tutorial Topic or Tutorial Step. ",
            "translations": [
                {
                    "language": "IT",
                    "text": "Se mai ti servirà un ripasso su uno di quesi topic...",
                    "updated": 1614790424338,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Jika kamu membutuhkan pengingat tentang salah satu topik...",
                    "updated": 1616768354407,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Si necesitas un recordatorio sobre estos temas...",
                    "updated": 1625871978228,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie jemals eine Erinnerung an eines dieser Themen brauchen...",
                    "updated": 1634165486557,
                    "style": "Text"
                },
                {
                    "language": "NL",
                    "text": "Heb je een reminder nodig over deze onderwerpen?",
                    "updated": 1635181965170,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Если Вам когда-нибудь понадобится напоминание по любой из этих тем...",
                    "updated": 1635611733808,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Bu konulardan herhangi biri hakkında bir hatırlatmaya ihtiyacınız olursa...",
                    "updated": 1635952719290
                }
            ],
            "updated": 1636910771339
        },
        {
            "style": "Text",
            "text": "You may find me on the bottom-left corner of the design space, browse through the hierarchy of topics and steps, and click Play on any of them. Topics are arranged in a clockwise direction, starting from the right-hand side of the main Tutorial node."
        },
        {
            "style": "Callout",
            "text": "\"Need a Quick Reminder?\" Find this step under the \"Tutorials & Help\" topic below. Then click Stop, and restart by clicking Play on the said Tutorial Step!",
            "updated": 1622192045886,
            "translations": [
                {
                    "language": "IT",
                    "text": "Hai bisogno di un ripasso veloce? Trova lo step sotto il topic Tutorial & Help. Poi clicca Stop, e ricomincia cliccando Play su quel Tutorial Step!",
                    "updated": 1614790783510,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Butuh Reminder Cepat? Temukan step pada Tutorials & Help topik dibawah. Lalu click Stop, dan mulai ulang dengan Mengclick Play disamping Tutorial Step!",
                    "updated": 1616769536924,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¿Necesita un recordatorio rápido? Busca este paso en el tema \"Tutorials & Help\". A continuación, haz clic en Stop y reinicia haciendo clic en Play en dicho Paso del tutorial.",
                    "updated": 1624491749893,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "\"Need a Quick Reminder?\" Diesen Schritt finden Sie unter dem Thema \"Tutorials & Help\". Klicken Sie auf \"Stop\" und starten Sie erneut, indem Sie auf \"Play\" für den besagten Tutorial Step klicken!",
                    "updated": 1634165797400,
                    "style": "Callout"
                },
                {
                    "language": "NL",
                    "text": "\"Need a Quick Reminder?\" Vind deze stap onder het \"Tutorials & Help\" onderwerp. Klik dan op Stop en herstart door op Play te klikken van de Tutorial Step!",
                    "updated": 1635182294956,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "\"Нужно быстрое напоминание?\" Найдите этот шаг в разделе \"Tutorials & Help\" - ниже. Затем нажмите Stop и перезапустите, нажав Play на указанном Tutorial Step!",
                    "updated": 1635612228869,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "\"Hızlı Bir Hatırlatıcıya mı ihtiyacınız var?\" Bu adımı aşağıdaki \"Öğreticiler ve Yardım\" başlığı altında bulun. Ardından Durdur'a tıklayın ve söz konusu Eğitim Adımında ( Tutorial Step ) Oynat'a tıklayarak yeniden başlatın!",
                    "updated": 1635953298548
                }
            ]
        }
    ]
}