{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 52,
    "type": "Tutorial Step - Scales' Best-Kept Secrets",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "balance"
        },
        "text": "You just learned the basics about the three scales governing the charts, but there's more!",
        "translations": [
            {
                "language": "IT",
                "text": "Hai imparato le basi delle tre scale che governano i grafici, ma c'è di più!",
                "updated": 1614894499111,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Acabas de aprender los conceptos básicos sobre las tres escalas que gobiernan los gráficos, ¡pero hay más!",
                "updated": 1624408792686,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Sie haben gerade die Grundlagen über die drei Skalen gelernt, die die Charts bestimmen, aber es gibt noch mehr!",
                "updated": 1634217561414
            },
            {
                "language": "TR",
                "text": "Tabloları yöneten üç ölçekle ilgili temel bilgileri az önce öğrendiniz, ancak dahası da var!",
                "updated": 1636112760510
            },
            {
                "language": "RU",
                "text": "Вы только что изучили основы трех шкал, управляющих диаграммами, но это еще не все!",
                "updated": 1636562410811
            },
            {
                "language": "ID",
                "text": "Kamu baru saja mempelajari dasar-dasar tentang tiga skala yang mengatur chart, tetapi masih ada lagi!",
                "updated": 1639586512568
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Remember I mentioned that a Time Machine may feature multiple charts from multiple exchanges and markets? There is no limit as to how you may visualize data in Superalgos, and scales play a major role in more complex configurations than the ones we are exploring at this point.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ricordi quando ti ho detto che una Time Machine può contenere più grafici provenienti da molteplici exchange e markets? Non c'è limite al numero di modi in cui puoi visualizzare i dati in Superalgos, e le scale giocano un ruolo chiave in configurazioni più complesse di quelle che abbiamo esplorato finora.",
                    "updated": 1614894601856,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¿Recuerdas que mencioné que un Time Machine puede presentar múltiples gráficos de múltiples intercambios y mercados? No hay límite en cuanto a cómo puedes visualizar los datos en Superalgos, y las escalas juegan un papel importante en configuraciones más complejas que las que estamos explorando en este momento.",
                    "updated": 1624409321331,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Erinnern Sie sich, dass ich erwähnt habe, dass eine Time Machine mehrere Charts von verschiedenen Börsen und Märkten enthalten kann? Es gibt keine Grenzen für die Visualisierung von Daten in Superalgos, und die Skalen spielen eine wichtige Rolle in komplexeren Konfigurationen als denen, die wir an dieser Stelle erkunden.",
                    "updated": 1634217567611
                },
                {
                    "language": "TR",
                    "text": "Bir  Zaman Makinesinin ( Time Machine ) birden fazla borsadan ve piyasadan birden fazla grafik içerebileceğini söylediğimi hatırlıyor musunuz? Superalgos'ta verileri nasıl görselleştireceğinizin bir sınırı yoktur ve ölçekler, bu noktada araştırdığımızdan daha karmaşık konfigürasyonlarda önemli bir rol oynar.",
                    "updated": 1636112585521
                },
                {
                    "language": "RU",
                    "text": "Помните, я упоминал, что Time Machine может содержать множество графиков с нескольких бирж и рынков? Нет никаких ограничений в том, как Вы можете визуализировать данные в Superalgos; масштабы играют важную роль в более сложных конфигурациях чем те, которые мы исследуем на данном этапе.",
                    "updated": 1636562891888
                },
                {
                    "language": "ID",
                    "text": "Ingat aku menyebutkan bahwa Time Machine dapat menampilkan beberapa chart dari beberapa exchange dan market? Tidak ada batasan bagaimana kamu dapat memvisualisasikan data di Superalgos, dan skala memainkan peran utama dalam konfigurasi yang lebih kompleks daripada yang kita jelajahi saat ini.",
                    "updated": 1639586723940
                }
            ]
        },
        {
            "style": "Callout",
            "text": "If you wish to learn all the details, feel free to go through the Scales section of the documentation.",
            "updated": 1610539789707,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se vuoi imparare tutti i dettagli, consulta la sezione Scales nella documentazione completa.",
                    "updated": 1614894588673,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Si desea conocer todos los detalles, no dude en consultar sección Scales de la documentación.",
                    "updated": 1624408963114,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie alle Details erfahren möchten, lesen Sie bitte den Abschnitt Scales in der Dokumentation.",
                    "updated": 1634217573618
                },
                {
                    "language": "TR",
                    "text": "Tüm detayları öğrenmek istiyorsanız, dokümantasyonun Ölçekler ( Scales ) bölümünü incelemekten çekinmeyin.",
                    "updated": 1636112742089
                },
                {
                    "language": "RU",
                    "text": "Если Вы желаете изучить подробности, то можете ознакомиться с разделом документации - Scales.",
                    "updated": 1636564050323
                },
                {
                    "language": "ID",
                    "text": "Jika kamu ingin mempelajari semua detail yang ada, silahkan buka bagian Scales di documentation.",
                    "updated": 1639586601660
                }
            ]
        }
    ]
}