{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 113,
    "type": "Tutorial Step - Beware of Impersonators!",
    "definition": {
        "text": "Superalgos Admins, the Core Team, and Community Mods will never contact you directly unless you contact them first!",
        "icon": {
            "name": "Bullet\\bullet-warning",
            "project": "Foundations"
        },
        "updated": 1617608574624,
        "translations": [
            {
                "language": "IT",
                "text": "Gli admin di Superalgos non ti contatteranno mai direttamente, a meno che non li contatti tu per primo.",
                "updated": 1618074109290,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Los administradores de Superalgos, el Core Team y los Community Mods nunca se comunicarán contigo directamente a menos que los contactes primero.",
                "updated": 1624488617429,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Die Superalgos-Admins, das Core Team und die Community Mods werden Sie niemals direkt kontaktieren, es sei denn, Sie kontaktieren sie zuerst!",
                "updated": 1634247837275
            },
            {
                "language": "TR",
                "text": "Superalgos Yöneticileri, Çekirdek Ekip ve Topluluk Modları, önce siz onlarla iletişime geçmedikçe sizinle asla doğrudan iletişime geçmeyecektir!",
                "updated": 1636663081508
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Warning",
            "text": "Scammers are lurking! Beware! It's no news that trading-related groups attract all sorts of scammers, and we are aware that they contact people in our groups attempting all sorts of tricks. We will never ask you for API keys, coins, or cash. In fact, we will never ask you to trust us in any way! We want to make it clear that if someone contacts you directly claiming to work with or for the project, it is a scam. Please report scammers in the Community group so that they may be banned, and to increase awareness of the problem, but also block them and report them to Telegram if the option is available.",
            "updated": 1617608980211,
            "translations": [
                {
                    "language": "IT",
                    "text": "Attenzione, gli scammers sono in agguato! Non è una novità che i gruppi riguardanti il trading attraggano ogni tipo di scammer, e siamo al corrente del fatto che contattino persone del gruppo tentando di truffarle. Non chiederemo mai API keys, crypto o soldi. Di fatto, non ti chiederemo di fidarti di noi in alcun modo! Vogliamo che sia chiaro che se qualcuno ti contatta direttamente e dichiarando di lavorare per o con il progetto, è uno scam. Per favore segnalate gli scammers nel canale Community così che possano essere bannati, bloccateli e se possibile segnalateli a Telegram stesso.",
                    "updated": 1618074329147,
                    "style": "Warning"
                },
                {
                    "language": "ES",
                    "text": "¡Los estafadores están al acecho! sabemos que se ponen en contacto con personas de nuestros grupos para intentar todo tipo de trucos. Nunca te pediremos claves de API, monedas o efectivo. De hecho, ¡nunca  pediremos que confíes en nosotros de ninguna manera! Queremos dejar en claro que si alguien se pone en contacto directo para afirmar que trabaja con o para el proyecto, es una estafa. Reportalos en el grupo de la Comunidad para que puedan ser baneados,también bloquéelos e infórmelos a Telegram si la opción está disponible.",
                    "updated": 1625933454872,
                    "style": "Warning"
                },
                {
                    "language": "DE",
                    "text": "Es lauern Betrüger! Hüten Sie sich! Es ist keine Neuigkeit, dass Gruppen, die mit dem Handel zu tun haben, alle Arten von Betrügern anziehen, und wir sind uns bewusst, dass sie Leute in unseren Gruppen kontaktieren und alle möglichen Tricks versuchen. Wir werden Sie niemals nach API-Schlüsseln, Münzen oder Bargeld fragen. Tatsächlich werden wir Sie niemals bitten, uns in irgendeiner Weise zu vertrauen! Wir möchten klarstellen, dass es sich um einen Betrug handelt, wenn jemand Sie direkt kontaktiert und behauptet, mit oder für das Projekt zu arbeiten. Bitte melden Sie Betrüger in der Community-Gruppe, damit sie gesperrt werden können und um das Bewusstsein für das Problem zu schärfen, aber blockieren Sie sie auch und melden Sie sie an Telegram, wenn diese Option verfügbar ist.",
                    "updated": 1634247848663
                },
                {
                    "language": "TR",
                    "text": "Dolandırıcılar pusuda! Dikkat! Ticaretle ilgili grupların her türlü dolandırıcıyı cezbetmesi yeni bir haber değil ve her türlü numarayı deneyerek gruplarımızdaki insanlarla iletişim kurduklarının farkındayız. Sizden asla API anahtarları, coin veya nakit para istemeyeceğiz. Projeyle veya proje için çalıştığını iddia eden biri sizinle doğrudan iletişime geçerse, bunun bir dolandırıcılık olduğunu açıkça belirtmek isteriz. Lütfen Topluluk grubundaki dolandırıcıları yasaklanabilmeleri ve sorunun farkındalığını artırmak için rapor edin, ancak aynı zamanda onları engelleyin ve onları Telegram'a bildirin.",
                    "updated": 1636663176342
                }
            ]
        }
    ]
}