{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 57,
    "type": "Tutorial Step - The Hard Data",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "plotter-panel"
        },
        "text": "A Plotter Panel features non-graphical representations of data, mostly in the form of numerical values or text.",
        "translations": [
            {
                "language": "IT",
                "text": "Un Plotter Panel contiene rappresentazioni dei dati in formato numerico o testuale.",
                "updated": 1615963973184,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Un Plotter Panel presenta representaciones no gráficas de datos, principalmente en forma de valores numéricos o texto.",
                "updated": 1624410194484,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Ein Plotter Panel enthält nicht-grafische Darstellungen von Daten, meist in Form von numerischen Werten oder Text.",
                "updated": 1634218122317
            },
            {
                "language": "TR",
                "text": "Bir Plotter Paneli, çoğunlukla sayısal değerler veya metin biçiminde verileri içerir.",
                "updated": 1636096630769
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Each layer may or may not feature one or more associated panels. It's up to the developer of the corresponding Indicator Bot to define them or not.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ogni layer può avere uno o più pannelli associati. Sta allo sviluppatore dell'Indicator Bot corrispondente decidere se definirli o meno.",
                    "updated": 1615964050088,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Cada capa puede presentar o no uno o más paneles asociados. Depende del desarrollador del Bot indicador correspondiente definirlos o no.",
                    "updated": 1624410271230,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Jede Ebene kann ein oder mehrere zugehörige Panels enthalten oder auch nicht. Es liegt im Ermessen des Entwicklers des entsprechenden Indicator Bot, ob er diese definiert oder nicht.",
                    "updated": 1634218128665
                },
                {
                    "language": "TR",
                    "text": "Her katman, bir veya daha fazla ilişkili panel içerebilir veya içermeyebilir. Bunları tanımlamak veya tanımlamamak ilgili Gösterge Botunun ( Indicator Bot ) geliştiricisine bağlıdır.",
                    "updated": 1636096681002
                }
            ]
        },
        {
            "style": "Callout",
            "text": "To access panels, left-click on the plotter panel icon of the layer of choice.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Per accedere ai pannelli, clicca su un'icona del Plotter Panel di tua scelta.",
                    "updated": 1615964087465,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Para acceder a los paneles, haz clic con el botón izquierdo en el icono del panel del trazador de la capa de tu elección.",
                    "updated": 1624410322152,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Um auf die Panels zuzugreifen, klicken Sie mit der linken Maustaste auf das Symbol des Plotter-Panels der gewünschten Ebene.",
                    "updated": 1634218135107
                },
                {
                    "language": "TR",
                    "text": "Panellere erişmek için, seçilen katmanın çizici paneli simgesine sol tıklayın.",
                    "updated": 1636096699582
                }
            ]
        },
        {
            "style": "Success",
            "text": "You may move layers managers and plotter panels by left-clicking on their headers and dragging them to any corner of the screen.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Puoi spostare i layer manager e i plotter panel cliccando su di essi e trascinandoli in un angolo qualsiasi dello schermo.",
                    "updated": 1615964142762,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Puedes mover el Layer Manager y Plotter Panel haciendo clic con el botón izquierdo en sus encabezados y arrastrándolos a cualquier esquina de la pantalla.",
                    "updated": 1624410466327,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Sie können Ebenen-Manager und Plotter-Panels verschieben, indem Sie mit der linken Maustaste auf ihre Überschriften klicken und sie in eine beliebige Ecke des Bildschirms ziehen.",
                    "updated": 1634218142345
                },
                {
                    "language": "TR",
                    "text": "Katman yöneticilerini ve çizici panellerini, başlıklarına sol tıklayarak ve ekranın herhangi bir köşesine sürükleyerek taşıyabilirsiniz.",
                    "updated": 1636096719299
                }
            ]
        }
    ]
}