{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 55,
    "type": "Tutorial Step - Layers on Top of Layers",
    "definition": {
        "icon": {
            "name": "Layer\\layer",
            "project": "Foundations"
        },
        "text": "Your data mining operation features bots making data products. Each product is made available on the charts through a Layer in a Layer Manager.",
        "translations": [
            {
                "language": "IT",
                "text": "Le operazioni di data mining coinvolgono bots che creano data products. Ogni product è accessibile dal grafico attraverso un Layer nel Layer Manager.",
                "updated": 1618648641710,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Tu operación de minería de incluye bots que fabrican productos de datos. Cada producto está disponible en los gráficos a través de un Layer en un Layer Manager.",
                "updated": 1625881909843,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Ihre Data-Mining-Operation umfasst Bots, die Datenprodukte erstellen. Jedes Produkt wird in den Diagrammen durch einen Layer in einem Layer Manager verfügbar gemacht.",
                "updated": 1634217919050,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Veri madenciliği operasyonunuz, veri ürünleri yapan botlara sahiptir. Her ürün, bir Katman Yöneticisindeki ( Layer Manager ) bir Katman ( Layer ) aracılığıyla çizelgelerde kullanılabilir hale getirilir.",
                "updated": 1636096341967
            }
        ],
        "updated": 1616427338175
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The first layer manager to the left of this time machine features three layers. Those layers represent the data products that the Trading System we are going to test later on uses to make trading decisions.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il primo Layer Manager alla sinistra di questa Time Machine contiene tre layers. Questi layer rappresentano i data products che il Trading System, che testeremo più tardi, usa per fare le sue scelte.",
                    "updated": 1615963760779,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El primer Layer Manager de este Time machine presenta tres capas que representan los productos de datos del Trading System que veremos mas adelante.",
                    "updated": 1625883118231,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Der erste Layer-Manager auf der linken Seite dieser Time Machine besteht aus drei Layern. Diese Layer stellen die Datenprodukte dar, die das Handelssystem, das wir später testen werden, verwendet, um Handelsentscheidungen zu treffen.",
                    "updated": 1634217907919,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Bu zaman makinesinin solundaki ilk katman yöneticisi üç katmana sahiptir. Bu katmanlar, daha sonra test edeceğimiz Ticaret Sisteminin ( Trading System ) ticaret kararları vermek için kullandığı veri ürünlerini temsil eder.",
                    "updated": 1636096453476
                }
            ]
        },
        {
            "style": "Callout",
            "text": "To turn layers on and off, left-click on them!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Per attivare e disattivare i layers, cliccaci sopra!",
                    "updated": 1615963587655,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Para activar y desactivar las capas, haz clic izquierdo en ellas!",
                    "updated": 1624495289554,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Um Ebenen ein- und auszuschalten, klicken Sie mit der linken Maustaste auf sie!",
                    "updated": 1634221550537
                },
                {
                    "language": "TR",
                    "text": "Katmanları açmak ve kapatmak için üzerlerine mouse'un sol tuşuyla tıklayın!",
                    "updated": 1636096510159
                }
            ]
        },
        {
            "style": "Note",
            "text": "Superalgos ships with many more indicators, but they are not configured in this Workspace. You will learn about them later!",
            "updated": 1610622819519,
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos è provvisto di molti più indicatori, ma non sono configurati in questo Workspace. Ne parleremo più tardi!",
                    "updated": 1615963772691,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Superalgos conecta con muchos más indicadores, pero no están configurados en este Work Space. ¡Aprenderás sobre ellos más tarde!",
                    "updated": 1624409780086,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Superalgos wird mit vielen weiteren Indikatoren ausgeliefert, die jedoch in diesem Workspace nicht konfiguriert sind. Sie werden sie später kennenlernen!",
                    "updated": 1634217927340,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Superalgos daha birçok göstergeyle birlikte gelir, ancak bunlar bu Çalışma Alanında yapılandırılmamıştır. Onları daha sonra öğreneceksiniz!",
                    "updated": 1636096525958
                }
            ]
        }
    ]
}