{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 61,
    "type": "Tutorial Step - Plotters Magic!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "plotter"
        },
        "text": "And this is how plotters are built! Plotters create graphical representations of data... from candles, to everything else!",
        "translations": [
            {
                "language": "IT",
                "text": "Ed ecco come vengono costruiti i Plotters! Essi creano rappresentazioni grafiche di tutti i dati...dalle candele, a qualsiasi altra cosa!",
                "updated": 1618056813296,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Y así es como se construyen los trazadores! Los trazadores crean representaciones gráficas de datos ... ¡desde velas hasta todo lo demás!",
                "updated": 1624413955983,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Und so werden Plotter gebaut! Plotter erstellen grafische Darstellungen von Daten... von Kerzen bis hin zu allem anderen!",
                "updated": 1634218493534
            },
            {
                "language": "TR",
                "text": "Ve Plotter'lar bu şekilde inşa edilir! Plotter'lar, mumlardan diğer şeylere kadar verilerin grafiksel temsillerini oluşturur!",
                "updated": 1636106406315
            },
            {
                "language": "RU",
                "text": "И вот как строятся плоттеры! Плоттеры создают графические представления данных... от свечей до всего остального!",
                "updated": 1636746375089
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Again, visual scripting at its best! Plotters use stylized polygons made out of coordinate points to paint lines and shapes that represent data. Every layer made available on the charts is created with a set of definitions of the sort you are looking at right now. The particular case of the Resistances and Supports bot is a rather complex one, but does showcase the power of the tool!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Di nuovo, il meglio del visual scripting! I Plotters usano poligoni stilizzati definiti da punti e coordinate per disegnare linee e forme che rappresentano dati. Ogni layer disponibile sul grafico è creato da un insieme di definizioni come quello che stai guardando ora. Il caso del bot dei Supporti e Resistenze è abbastanza complesso, ma mostra la potenza di questo strumento!",
                    "updated": 1618057031198,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Una vez más, guiones visuales en su máxima expresión. Los trazadores utilizan polígonos estilizados hechos de puntos de coordenadas para pintar líneas y formas que representan datos. Cada capa disponible en los gráficos se crea con un conjunto de definiciones del tipo que estas viendo en este momento. El caso particular del bot Resistances y Supports es bastante complejo, ¡pero muestra el poder de la herramienta!",
                    "updated": 1624414165332,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wiederum visuelles Skripting in seiner besten Form! Plotter verwenden stilisierte Polygone aus Koordinatenpunkten, um Linien und Formen zu zeichnen, die Daten darstellen. Jede Ebene, die in den Diagrammen zur Verfügung steht, wird mit einer Reihe von Definitionen erstellt, so wie Sie sie gerade sehen. Der besondere Fall des Bot Resistenzen und Unterstützungen ist ziemlich komplex, zeigt aber die Leistungsfähigkeit des Tools!",
                    "updated": 1634218497006
                },
                {
                    "language": "TR",
                    "text": "Bunu yapmanın en iyi yolu görsel komut dosyasıdır! Plotter'lar, verileri temsil eden çizgileri ve şekilleri işaretlemek için koordinat noktalarından yapılmış stilize çokgenler kullanır. Grafiklerde kullanıma sunulan her katman, şu anda baktığınız türden bir dizi tanımla oluşturulur. Dirençler ve Destekler botunun özel durumu oldukça karmaşıktır, ancak aracın gücünü sergilemektedir.!",
                    "updated": 1636106574620
                },
                {
                    "language": "RU",
                    "text": "Опять же, визуальное описание в лучшем виде! Плоттеры используют стилизованные полигоны, произведенные из координатных точек для окрашивания линий и фигур, представляющих данные. Каждый слой произвел доступ на диаграммах, создавая наборы определений того типа, на который Вы смотрите прямо сейчас. Каждый случай бота сопротивления и поддержки является довольно сложным, но показывает мощность инструмента!",
                    "updated": 1636746631697
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Find the Support Zone 5 Polygon (to the left), expand it, and crawl your way up the branches for a sneak peek of how this beauty was built!",
            "updated": 1636911282878,
            "translations": [
                {
                    "language": "IT",
                    "text": "Cerca il Resistance 5 Polygon (qui a sinistra), espandilo e esplora i percorsi che collegano i vari componenti per osservare come è stata costruita questa bellezza!",
                    "updated": 1618057208787,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Encuentra el Resistance Zone 5 Polygon (a la izquierda), amplíalo y trepa por las ramas para echar un vistazo a cómo se construyó esta belleza.",
                    "updated": 1624414251258,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Suchen Sie das Polygon der Widerstandszone 5 (links), erweitern Sie es und krabbeln Sie die Äste hinauf, um zu sehen, wie diese Schönheit entstanden ist!",
                    "updated": 1634218503528
                },
                {
                    "language": "TR",
                    "text": "Direnç Bölgesi 5 Poligonunu (Resistances Zone) (solda) bulun, genişletin ve bu güzelliğin nasıl inşa edildiğine bir göz atın.",
                    "updated": 1636106823729
                },
                {
                    "language": "RU",
                    "text": "Найдите Polygon Зоны сопротивления 5 (Zone 5) - слева, разверните его и поднимайтесь вверх по ветвям, чтобы взглянуть украдкой на то, как была построена эта красота!",
                    "updated": 1636746844784
                }
            ]
        }
    ]
}