{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 44,
    "type": "Tutorial Step - Size Matters?",
    "definition": {
        "text": "How about shaping the time machine to the exact aspect ratio of your screen?",
        "icon": {
            "name": "Time\\time-machine",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "IT",
                "text": "Che ne dici di adattare perfettamente la Time Machine al formato del tuo schermo?",
                "updated": 1614848136114,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Bagaimana membuat time machine menjadi sesuai dengan aspect ratio dari layar?",
                "updated": 1616936505798,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¿Qué tal darle forma a la máquina del tiempo con la relación de aspecto exacta de tu pantalla?",
                "updated": 1624383053610,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Zusammenfassung: Wie wäre es, die Time Machine genau an das Seitenverhältnis Ihres Bildschirms anzupassen?",
                "updated": 1634206350448,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Zaman makinesini ekranınızın tam en boy oranına göre şekillendirmeye ne dersiniz?",
                "updated": 1636035470271
            },
            {
                "language": "RU",
                "text": "Как насчет того, чтобы настроить по форме машину времени в соответствии с правильным соотношение сторон Вашего экрана?",
                "updated": 1636202464425
            },
            {
                "language": "NL",
                "text": "Hoe zit het met het vormgeven van de time machine naar de exacte beeldverhouding van uw scherm?",
                "updated": 1666699195764
            },
            {
                "language": "FR",
                "text": "Pourquoi ne pas adapter la time machine au format exact de votre écran ?",
                "updated": 1668068374855
            },
            {
                "language": "PL",
                "text": "A może by tak uformować Time Machine, by dokładnie dopasować go do proporcji ekranu?",
                "updated": 1675084838657
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Matching the aspect ratio of your time machines to the aspect ratio of your screen is crucial for charts to fit your screen tightly while zooming in!",
            "updated": 1622198491208,
            "translations": [
                {
                    "language": "IT",
                    "text": "Dare alle tue time machines lo stesso aspect ratio del tuo schermo è importante perchè si adattino perfettamente ad esso.",
                    "updated": 1614848156397,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Mencocokkan aspect ratiotime machines kamu dengan aspect ratio layar sangat penting agar charts pas dengan layarmu saat memperbesar!",
                    "updated": 1639745608931,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¡Hacer coincidir la relación de aspecto de tus máquinas del tiempo con la relación de aspecto de su pantalla es crucial para que los gráficos se ajusten perfectamente a tu pantalla al hacer zoom!",
                    "updated": 1624494074907,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die Anpassung des Seitenverhältnisses Ihrer Zeitmaschinen an das Seitenverhältnis Ihres Bildschirms ist entscheidend dafür, dass die Diagramme beim Heranzoomen genau auf Ihren Bildschirm passen!",
                    "updated": 1634206368643,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Zaman makinelerinizin en boy oranını ekranınızın en boy oranıyla eşleştirmek, yakınlaştırırken grafiklerin ekranınıza sığabilmesi için çok önemlidir!",
                    "updated": 1636035504803
                },
                {
                    "language": "RU",
                    "text": "Соответствие соотношения сторон Ваших машин времени с соотношению сторон Вашего экрана, имеет решающее значение, т.к. необходимо, чтобы диаграммы плотно прилегали к Вашему экрану при увеличении масштаба!",
                    "updated": 1636202715136
                },
                {
                    "language": "NL",
                    "text": "Het afstemmen van de beeldverhouding van uw time machines op de beeldverhouding van uw scherm is cruciaal om ervoor te zorgen dat grafieken goed op uw scherm passen terwijl u inzoomt!",
                    "updated": 1666699226580
                },
                {
                    "language": "FR",
                    "text": "Faire correspondre le rapport hauteur/largeur de vos time machine à celui de votre écran est crucial pour que les graphiques s'adaptent parfaitement à votre écran tout en zoomant !",
                    "updated": 1668068407955
                },
                {
                    "language": "PL",
                    "text": "Dopasowanie współczynnika proporcji Twoich Time Machine do współczynnika proporcji twojego ekranu jest kluczowe podczas powiększania wykresów!",
                    "updated": 1675084931955
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Direct your mouse at one of the time machines and hit Ctrl + Shift + Alt + Key-A. ",
            "updated": 1649166936846,
            "translations": [
                {
                    "language": "IT",
                    "text": "Sposta il mouse su una delle time machines e premi Ctrl + Shift + Key-A. Fai lo stesso con l'altra.",
                    "updated": 1614848104941,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Arahkan mouse ke salah satu time machines dan tekan Ctrl + Shift + Alt + Key-A. Lakukan hal yang sama dengan yang lain!",
                    "updated": 1639745642461,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Dirige el ratón a una de las máquinas del tiempo y pulsa Ctrl + Shift + Alt + Key-A",
                    "updated": 1675276810651,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Richten Sie Ihre Maus auf eine der Time Machines und drücken Sie Ctrl + Shift + Alt + Key-A. Machen Sie dasselbe mit der anderen Maschine!",
                    "updated": 1634206401027,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Farenizi zaman makinelerinden birine yönlendirin ve Ctrl + Shift + Alt + Key-A tuşlarına basın.",
                    "updated": 1666064286573
                },
                {
                    "language": "RU",
                    "text": "Наведите мышь на одну из машин времени и нажмите Ctrl + Shift + Alt + Key-A. ",
                    "updated": 1662032665322
                },
                {
                    "language": "NL",
                    "text": "Richt je muis op een van de time machines en druk op Ctrl + Shift + Alt + Key-A.",
                    "updated": 1666699261421
                },
                {
                    "language": "FR",
                    "text": "Dirigez votre souris sur l'une des machines à remonter le temps et appuyez sur Ctrl + Shift + Alt + Key-A.",
                    "updated": 1668068422311
                },
                {
                    "language": "PL",
                    "text": "Najedź myszą na jedną z Time Machine i kliknij Ctrl + Shift + Alt + Key-A.",
                    "updated": 1675084962008
                }
            ]
        },
        {
            "style": "Text",
            "text": "On Mac: Ctrl + Shift + Cmd + Key-A.",
            "updated": 1649166910199,
            "translations": [
                {
                    "language": "IT",
                    "text": "D'ora in poi, lascia le due time machines con lo stesso aspect ratio del tuo schermo!",
                    "updated": 1614848186502,
                    "style": "Success"
                },
                {
                    "language": "ID",
                    "text": "Biarkan dua time machine cocok dengan rasio aspek layarmu. dari sekarang!",
                    "updated": 1616936619368,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "En Mac: Ctrl + Shift + Cmd + Key-A",
                    "updated": 1675276818845,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Lassen Sie die beiden Time Machines von nun an auf das Seitenverhältnis Ihres Bildschirms abgestimmt!",
                    "updated": 1634206411265,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "Şu andan itibaren ekranınızın en boy oranıyla eşleşen iki zaman makinesini görmen lazım.",
                    "updated": 1636035706936
                },
                {
                    "language": "RU",
                    "text": "На Mac: Ctrl + Shift + Cmd + Key-A.",
                    "updated": 1662032695514
                },
                {
                    "language": "NL",
                    "text": "Op een Mac: Ctrl + Shift + Cmd + Key-A.",
                    "updated": 1666699272980
                },
                {
                    "language": "FR",
                    "text": "Sur Mac: Ctrl + Shift + Cmd + Key-A.",
                    "updated": 1668068428808
                },
                {
                    "language": "PL",
                    "text": "Na Mac: Ctrl + Shift + Cmd + Key-A.",
                    "updated": 1675084966719
                }
            ]
        },
        {
            "style": "Success",
            "text": "Do the same with the other chart, and leave the two time machines matching the aspect ratio of your screen from now on!",
            "updated": 1649167002906,
            "translations": [
                {
                    "language": "TR",
                    "text": "Aynısını diğer grafik için de yapın ve bundan sonra iki zaman makinesini ekranınızın en boy oranıyla eşleştirin!",
                    "updated": 1654394237984,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Сделайте то же самое с другой диаграммой, и отныне две машины времени будут соответствовать соотношению сторон вашего экрана!",
                    "updated": 1662032719880
                },
                {
                    "language": "NL",
                    "text": "Doe hetzelfde met de andere grafiek en laat de twee time machines voortaan overeenkomen met de beeldverhouding van je scherm!",
                    "updated": 1666699299533
                },
                {
                    "language": "FR",
                    "text": "Faites de même avec l'autre graphique, et laissez les deux time machines s'adapter au ratio d'aspect de votre écran à partir de maintenant !",
                    "updated": 1668068453301
                },
                {
                    "language": "PL",
                    "text": "Zrób to samo z drugim wykresem i pozostaw oba Time Machine dopasowane do proporcji ekranu!",
                    "updated": 1675085017951
                },
                {
                    "language": "ES",
                    "text": "Haz lo mismo con el otro gráfico y, a partir de ahora, ¡deja que las dos máquinas del tiempo coincidan con la relación de aspecto de tu pantalla!",
                    "updated": 1675276852804
                }
            ]
        }
    ]
}