{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 17,
    "type": "Tutorial Step - How Are Things Going?",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "sensor-bot-instance"
        },
        "text": "I just dragged you deep into the confines of the Data Mining operation. See the progress of the Sensor Bot Instance to your right!",
        "translations": [
            {
                "language": "IT",
                "text": "Sei stato appena trascinato dentro i confini dell'operazione di Data Mining. Controlla i progressi della Sensor Bot Instance alla tua destra!",
                "updated": 1614720420362,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Aku membawamu kepada kebingungan akan operasi Data Mining. Lihat progress dari Sensor Bot Instance disebelah kanan!",
                "updated": 1616697727995,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Acabo de arrastrarte a los confines de la operación de  Data Mining. ¡Observa el progreso de la Instancia del  Sensor Bot a tu derecha!",
                "updated": 1618434622270,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Ich habe Sie soeben in die Tiefen der Data-Mining-Operation gezogen. Sehen Sie sich den Fortschritt der Sensor Bot Instance zu Ihrer Rechten an!",
                "updated": 1634162835620,
                "style": "Definition"
            },
            {
                "language": "NL",
                "text": "Ik heb je net diep in de \"Data Mining\" operatie gesleept. Bekijk de voortgang van de Sensor Bot Instance aan je rechterkant!",
                "updated": 1634456610972,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Я только что вовлек Вас глубоко в рамки операции по Сбору данных. Посмотрите, как продвигается экземпляр Sensor Bot справа от вас!",
                "updated": 1635592906231,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Seni Veri Madenciliği operasyonunun derinliklerine sürükledim. Sağınızdaki Sensör Botu Aşaması'nın (Sensor Bot Instance ) ilerleyişini görüyorsunuz.",
                "updated": 1635943205649
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The sensor bot is currently extracting data from the exchange. As soon as she completes the extraction for the defined datetime range something really cool will happen... automatically!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il sensor bot sta estraendo dati dal mercato. Appena avrà finito l'estrazione per l'intervallo di tempo selezionato, qualcosa di veramente forte accadrà...automaticamente!",
                    "updated": 1614720508108,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "sensor bot sedang mengekstrak data dari exchange. Setelah selesai mengekstrak maka range datetime yang telah ditentukan akan berubah secara otomatis!",
                    "updated": 1616697880677,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El sensor bot está extrayendo datos del exchage. En cuanto complete la extracción para el rango de fechas definido, sucederá algo realmente genial... ¡automáticamente!",
                    "updated": 1618434692416,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Der Sensor-Bot extrahiert gerade Daten aus der Börse. Sobald er die Extraktion für den definierten Zeitraum abgeschlossen hat, wird etwas wirklich Cooles passieren... automatisch!",
                    "updated": 1634162847422,
                    "style": "Text"
                },
                {
                    "language": "NL",
                    "text": "De sensor bot haalt momenteel gegevens op van de exchange. Zodra ze klaar is met de extractie van de ingegeven datums, zal er iets heel cools gebeuren... automatisch!",
                    "updated": 1634456716853,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Сенсорный бот в настоящий момент извлекает данные из обмена. Как только бот завершит извлечение необходимых данных для определенного диапазона дат и времени, пороизойдет что-то действительно классное... автоматически!",
                    "updated": 1635593777398,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Sensör botu şu anda borsadan veri alıyor. Tanımlanan tarih/saat aralığı için çekme işlemini tamamlar tamamlamaz gerçekten harika bir şey olacak... Otomatik olarak!",
                    "updated": 1635944904679
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Can you guess what that may be?",
            "translations": [
                {
                    "language": "IT",
                    "text": "Riesci a immaginare cosa possa essere?",
                    "updated": 1614720522523,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Apakah kamu bisa mengira apa yang akan terjadi?",
                    "updated": 1616697509340,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¿Puedes imaginar que es lo que sucederá?",
                    "updated": 1624291138773,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Können Sie erraten, was das sein könnte?",
                    "updated": 1634162853374,
                    "style": "Callout"
                },
                {
                    "language": "NL",
                    "text": "Heb je een idee wat het zou kunnen zijn?",
                    "updated": 1634456739799,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Вы можете догадаться, что это может быть?",
                    "updated": 1635593428455,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Bunun ne olabileceğini tahmin edebilir misin?",
                    "updated": 1635943403659
                }
            ]
        },
        {
            "style": "Success",
            "text": "It should take no longer than 3 to 5 minutes to extract the data from Binance, or a bit longer, depending on your hardware. Can't wait? Fine! Click Next for a quick hint!",
            "updated": 1616414820007,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ci dovrebbero volere soltanto dai 3 ai 5 minuti per estrarre i dati da Binance, o un pò di più, in base al tuo hardware. Non vedi proprio l'ora? Va bene! Clicca su Next per un anticipo!",
                    "updated": 1618645818271,
                    "style": "Success"
                },
                {
                    "language": "ID",
                    "text": "Aku tidak akan memberitahumu! Kamu harus mencarinya... Bersabarlah! Tidak akan lama cukup 3 - 5 menit untuk mengekstrak data Binance, bisa lebih lama, tergantung perangkatmu. Click Next untuk orang yang tidak sabaran!",
                    "updated": 1616697911652,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "No debería tomar más de 3 a 5 minutos extraer los datos de Binance dependiendo de tu hardware. ¿No quieres esperar? No hay problema. Haz clic en Next para obtener una pequeña pista.",
                    "updated": 1625933743042,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Es sollte nicht länger als 3 bis 5 Minuten dauern, um die Daten von Binance zu extrahieren, oder ein bisschen länger, je nach Ihrer Hardware. Sie können nicht warten? Kein Problem! Klicken Sie auf Weiter für einen kurzen Hinweis!",
                    "updated": 1634162864177,
                    "style": "Success"
                },
                {
                    "language": "NL",
                    "text": "Het zou niet langer dan 3 tot 5 minuten moeten duren om de gegevens van Binance op te halen, het kan langer duren, afhankelijk van je hardware. Kan je niet wachten? Prima! Klik op Volgende voor een hint!",
                    "updated": 1634456830102,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Извлечение данных из Binance должно занять не более 3-5 минут, или немного больше, в зависимости от Вашего устройства. Не можете дождаться? Отлично! Нажмите Next для быстрой подсазки!",
                    "updated": 1635593584865,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "Binance'den verileri çıkarmak 3 ila 5 dakikadan uzun sürmemeli veya donanımınıza bağlı olarak birazcık daha uzun sürebilir. Bekleyemez misin? İyi! Hızlı bir ipucu için İleri'ye tıklayın!",
                    "updated": 1635943388237
                }
            ]
        }
    ]
}