{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 76,
    "type": "Tutorial Step - Find the Logic Challenge!",
    "definition": {
        "icon": {
           "project": "Foundations",
            "name": "layer-resistance"
        },
        "text": "Now that you know how the indicator works, can you find the relationship between buy orders and support levels?",
        "translations": [
            {
                "language": "IT",
                "text": "Ora che sai come funzionano gli indicatori, puoi trovare la relazione tra buy orders e livelli di supporto?",
                "updated": 1618064528654,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Ahora que sabe cómo funciona el indicador, ¿puede encontrar la relación entre las órdenes de compra y los niveles de soporte?",
                "updated": 1624458274773
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Take some time to explore the period of time tested looking for clues on how support levels determine the rate of the Limit Buy Order!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Prenditi un'attimo per esplorare il periodo di tempo testato e cercare indizi su come i livelli di supporto determinino l'inserimento del Limit Buy Order!",
                    "updated": 1618064580106,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Tómate tu tiempo para explorar el período de tiempo probado en busca de pistas sobre cómo los niveles de apoyo determinan la tasa del Limit Buy Order!",
                    "updated": 1624458322994
                }
            ]
        },
        {
            "style": "Text",
            "text": "It's fun noticing how new levels form when price changes direction, and how an established level changes color when price bounces-off it.",
            "translations": [
                {
                    "language": "IT",
                    "text": "È divertente osservare come i nuovi livelli si formano quando il prezzo cambia direzione, e come un livello cambia colore quando respinge il prezzo.",
                    "updated": 1618064645034,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Es divertido notar cómo se forman nuevos niveles cuando el precio cambia de dirección, y cómo un nivel establecido cambia de color cuando el precio rebota.",
                    "updated": 1624458385692
                }
            ]
        },
        {
            "style": "Success",
            "text": "But the trick lies in counting levels above the order!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Il trucco sta nel contare i livelli sopra l'ordine!",
                    "updated": 1618064660104,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "¡Pero el truco está en contar niveles por encima de la orden!",
                    "updated": 1624458422706
                }
            ]
        }
    ]
}