{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 48,
    "type": "Tutorial Step - Playing with the Rate Scale!",
    "definition": {
        "icon": {
            "name": "Charting-Space\\rate-scale",
            "project": "Foundations"
        },
        "text": "Do I need to tell you how the Rate Scale works or can you figure it out on your own? Ok... I'll give you a hint...",
        "translations": [
            {
                "language": "IT",
                "text": "Vuoi che ti spieghi come funziona il Rate Scale, o lo immagini già? Ok, ti darò un suggerimento...",
                "updated": 1614893948589,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¿Necesito decirte cómo el Rate Scale funciona o puedes resolverlo por tu cuenta? Vale... te daré una pista ...",
                "updated": 1624407403842,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Muss ich Ihnen erklären, wie die Rate Scale funktioniert, oder können Sie es selbst herausfinden? Ok... Ich gebe Ihnen einen Tipp...",
                "updated": 1634217173850
            },
            {
                "language": "TR",
                "text": "Size Fiyat Ölçeğinin nasıl çalıştığını söylememe gerek var mı yoksa kendi başınıza çözebilir misiniz? Tamam... Sana bir ipucu vereceğim...",
                "updated": 1636094814213
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "The rate scale works like the time scale, but —when using the keyboard— you must reverse the arrow keys! Use the left and right arrows ← → to toggle through the automatic modes and up and down arrows ↑ ↓ to affect the scale! Check the video coming next for clarity!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Funziona esattamente come il Time Scale, con la differenza che se usi le frecce devi invertire le direzioni dei tasti! Usa le frecce laterali per scegliere tra le modalità automatiche e quelle su e giù ↑ ↓ per cambiare la scala! Guarda il video al prossimo step per i dettagli.",
                    "updated": 1618648350572,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "El Rate Scale trabaja como el Time Scale, pero —al usar el teclado—¡debes invertir las teclas de flecha! Usa las flechas izquierda y derecha ← → para alternar entre los modos automáticos y las flechas hacia arriba y hacia abajo ↑ ↓ para afectar la escala. ¡Mira el video que viene a continuación para mayor claridad!",
                    "updated": 1624407641584,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Die Rate Scale funktioniert wie die Time Scale, aber -wenn du die Tastatur benutzt- musst du die Pfeiltasten umkehren! Mit den Pfeiltasten links und rechts ← → schaltest du zwischen den Automatikmodi um und mit den Pfeiltasten auf und ab ↑ ↓ kannst du die Skala beeinflussen! Schauen Sie sich das nächste Video an, um sich Klarheit zu verschaffen!",
                    "updated": 1634217218782
                },
                {
                    "language": "TR",
                    "text": "Fiyat ölçeği, zaman ölçeği gibi çalışır, ancak klavyeyi kullanırken ok tuşlarını tersini kullanmanız gerekir! Otomatik modlar arasında geçiş yapmak için sol ve sağ okları ← → ve ölçeği etkilemek için yukarı ve aşağı okları ↑ ↓ kullanın! Anlamak için bir sonraki videoyu kontrol edin!",
                    "updated": 1636094888142
                }
            ],
            "updated": 1616505192799
        },
        {
            "style": "Success",
            "text": "Play with the semi-automatic scale modes too! You know, when a single tiny triangle remains visible after a few flicks of the mouse wheel.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Prova anche la modalità semi-automatica per le differenti scale! Ruota la rotella del mouse finchè non vedi un singolo triangolino verde.",
                    "updated": 1614894098439,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "¡Juega también con los modos de escala semiautomáticos! Ya sabes, cuando un pequeño triángulo permanece visible después de unos pocos movimientos de la rueda del mouse.",
                    "updated": 1624407734966,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Spielen Sie auch mit den halbautomatischen Skalenmodi! Sie wissen schon, wenn ein einziges winziges Dreieck nach ein paar Bewegungen des Mausrads sichtbar bleibt.",
                    "updated": 1634217227774
                },
                {
                    "language": "TR",
                    "text": "Yarı otomatik ölçek modlarıyla da oynayın! Fare tekerleğinin birkaç hareketinin ardından tek bir küçük üçgen görünür kaldığında yarı otomatik moddasınızdır.",
                    "updated": 1636094932757
                }
            ]
        }
    ]
}