{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": "115",
    "type": "Tutorial Step - About our Governance",
    "definition": {
        "text": "Before I leave you with the next tutorial, you must know that Superalgos is a crypto project with distributed governance!",
        "icon": {
            "name": "\\governance-project",
            "project": "Governance"
        },
        "updated": 1629835261024,
        "translations": [
            {
                "language": "ES",
                "text": "Antes de dejarlo con el siguiente tutorial, debe saber que Superalgos es un proyecto crypto project con gobernanza distribuida!",
                "updated": 1633545502625
            }
        ]
    },
    "paragraphs": [
        {
            "style": "List",
            "text": "You may earn Superalgos SA Tokens and Reputation by contributing to the project.",
            "updated": 1630065210887,
            "translations": [
                {
                    "language": "ES",
                    "text": "Puede ganar Superalgos SA Tokens y Reputation por contribuir al proyecto.",
                    "updated": 1633545548293
                }
            ]
        },
        {
            "style": "List",
            "text": "Then you may leverage your tokens and reputation to participate in Governance Programs.",
            "updated": 1629834501563,
            "translations": [
                {
                    "language": "ES",
                    "text": "Entonces puede aprovechar sus tokens y reputación para particiapar en los Governance Programs.",
                    "updated": 1633545620173
                }
            ]
        },
        {
            "style": "List",
            "text": "Participating in governance earns you more tokens, as helping direct the project is an important contribution in and of itself!",
            "updated": 1629834600057,
            "translations": [
                {
                    "language": "ES",
                    "text": "Participando en la gobernanza gana más tokens, ya que ayudar a dirigir el proyecto es una contribución importante en sí misma!",
                    "updated": 1633545710019
                }
            ]
        },
        {
            "style": "Note",
            "text": "You may earn your first few tokens with the Airdrops Program just by setting up your User Profile. But before you do that, you need to do a couple more tutorials to complete your education!",
            "updated": 1629835202298,
            "translations": [
                {
                    "language": "ES",
                    "text": "Puede ganar sus primeros pocos tokens con el Airdrops Program con solo programar su User Profile. Pero antes de que lo haga, necesita hacer un parmás de tutoriales para completar su educación!",
                    "updated": 1633545813091
                }
            ]
        }
    ]
}