{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 5,
    "type": "Tutorial Step - That's Me On the Right!",
    "definition": {
        "icon": {
            "name": "tutorial",
            "project": "Education"
        },
        "text": "Tutorials are defined within the system, so you may create more of us if you wish! But we'll discuss that God-like power later on. Let's focus on the basics first!",
        "translations": [
            {
                "language": "ID",
                "text": "Tutorial ini dibuat oleh system, jadi kamu juga bisa membuat tutorial berbeda jika ingin! Tapi kita bahas hal besar itu nanti saja. Untuk sekarang fokus saja ke hal yang basic!",
                "updated": 1614417905988,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Los tutoriales se definen dentro del sistema, así que puedes crear más como yo si lo deseas. Pero ya hablaremos de ese poder divino más adelante. ¡Centrémonos primero en lo básico!",
                "updated": 1618431969376,
                "style": "Definition"
            },
            {
                "language": "IT",
                "text": "I tutorial sono definiti all'interno del sistema, quindi puoi creare altri di noi se lo vuoi! Ma parleremo di questo potere divino più avanti. Prima concentriamoci sulle basi!",
                "updated": 1614712747107,
                "style": "Definition"
            },
            {
                "language": "FR",
                "text": "Les tutoriels sont définis a l'interieur du système, et vous pouvez en créer d'autres si vous le souhaitez ! Mais nous parlerons de ces facilitées plus tard. Concentrez-vous d'abord sur les bases !",
                "updated": 1623950810074,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Öğreticiler sistem içinde tanımlanmıştır, böylece dilerseniz daha fazlasını oluşturabilirsiniz! Ama bu Tanrısal gücü daha sonra tartışacağız. Önce temellere odaklanalım!",
                "updated": 1633121322983,
                "style": "Definition"
            },
            {
                "language": "NL",
                "text": "Tutorials zijn gedefinieerd binnen in het systeem, je mag er meer maken als je wilt! Maar die \"goddelijke macht\" bespreken we later. Laten we ons eerst richten op de basis!",
                "updated": 1633760912101,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Tutorien werden innerhalb des Systems definiert, Sie können also mehrere von uns erstellen, wenn Sie möchten! Aber wir werden diese Fähigkeit später besprechen. Konzentrieren wir uns erst einmal auf die Grundlagen!",
                "updated": 1634070459015,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Учебное пособие устанавливается через систему, поэтому Вы можете создать больше нас, если Вы этого пожелаете. Но мы обсудим эти детали позднее. Давайте сначала сосредоточимся на базовых шагах!",
                "updated": 1635450888939
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Superalgos is inherently a visual tool. The system represents information in hierarchical structures of interconnected nodes, represented by icons. What you see on your right is one of these hierarchies—in particular, a Tutorial hierarchy. In this case, \"tutorial\" is the type of node and \"Welcome to Superalgos!\" is the name of the node.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Superalgos secara inheren merupakan alat visual. Sistem ini mewakili informasi dalam struktur hierarkis node yang saling berhubungan, diwakili oleh icons. Apa yang kamu lihat di sebelah kanan kamu adalah salah satu hierarki ini — khususnya, hierarki Tutorial. Dalam hal ini, \"tutorial\" adalah jenis node dan \"Welcome to Superalgos!\"Adalah nama node.",
                    "updated": 1640568083362,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Superalgos es intrínsecamente una herramienta visual. El sistema representa la información en estructuras jerárquicas de nodos interconectados, representados por iconos. Lo que ve a su derecha es una de estas jerarquías, en concreto, una jerarquía de Tutorial. En este caso, \"tutorial\" es el tipo de nodo y \"¡Bienvenido a Superalgos!\" es el nombre del nodo.",
                    "updated": 1624490614330,
                    "style": "Text"
                },
                {
                    "language": "IT",
                    "text": "Superalgos é per natura uno strumento visivo. Il sistema rappresenta le informazioni in una struttura gerarchica di nodi interconnessi, rappresentati da icone. Alla tua destra c'é una di queste gerarchie: più precisamente, una gerarchia Tutorial. In questo caso \"tutorial\" è il tipo del nodo e \"Welcome to Superalgos\" è il suo nome.",
                    "updated": 1618645075554,
                    "style": "Text"
                },
                {
                    "language": "FR",
                    "text": "Superalgos est par nature un outil visuel. Le système représente l'information dans des structures hiérarchiques de nœuds interconnectés, représentés par des icônes. Ce que vous voyez à votre droite est l'une de ces hiérarchies - en particulier, une hiérarchie Tutorial. Dans ce cas, \"tutoriel\" est le type de nœud et \"Bienvenue à Superalgos !\" est le nom du nœud.",
                    "updated": 1623951170653,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Superalgos doğası gereği görsel bir araçtır. Sistem, simgelerle temsil edilen, birbirine bağlı düğümlerin hiyerarşik yapılarındaki bilgileri temsil eder. Sağınızda gördüğünüz şey, bu hiyerarşilerden biridir - özellikle bir Öğretici hiyerarşisi. Bu durumda, \"öğretici\" düğüm türüdür ve \"Superalgos'a Hoş Geldiniz!\" düğümün adıdır.",
                    "updated": 1633121451310,
                    "style": "Text"
                },
                {
                    "language": "NL",
                    "text": "Superalgos is een visueel hulpmiddel. Het systeem geeft informatie weer in hiërarchische structuren van onderling verbonden knooppunten, afgebeeld met pictogrammen. Wat je rechts ziet, is een van deze hiërarchieën - in het bijzonder een Tutorial hiërarchie. In dit geval is \"tutorial\" het type knooppunt en \"Welcome to Superalgos!\" is de naam van het knooppunt.",
                    "updated": 1633761030337,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Superalgos ist von Natur aus ein visuelles Werkzeug. Das System stellt Informationen in hierarchischen Strukturen aus miteinander verbundenen Knoten dar, die durch Icons repräsentiert werden. Was Sie auf der rechten Seite sehen, ist eine dieser Hierarchien - insbesondere eine Tutorial-Hierarchie. In diesem Fall ist \"Tutorial\" der Typ des Knotens und \"Willkommen bei Superalgos\" ist der Name des Knotens.",
                    "updated": 1634070485959,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "По сути Superalgos является визуальным инструментом. Система представляет информацию в иерархических структурах взаимосвязанных узлов, представленных иконками. То, что Вы видите справа, является одной из этих иерархий, в частности, иерархией учебного пособия - \"Tutorial\". В этом случае Tutorial - это тип узла, а глава \"Welcome to Superalgos!\" - это наименование узла.",
                    "updated": 1635507910736
                }
            ],
            "updated": 1616410534255
        },
        {
            "style": "Callout",
            "text": "Hover your mouse pointer over the Tutorial node and see what happens! Wow! Cool right? That's a lot of buttons!",
            "updated": 1611075799669,
            "translations": [
                {
                    "language": "ID",
                    "text": "Dekatkan pointer mousemu ke node Tutorial dan lihat apa yang terjadi!, Keren bukan? Banyak sekali tombol disana!",
                    "updated": 1614424765045,
                    "style": "Callout"
                },
                {
                    "language": "IT",
                    "text": "Sposta il cursore del mouse sul nodo Tutorial e guarda cosa succede! Wow! Forte, vero? Ci sono un sacco di pulsanti!",
                    "updated": 1614717176134,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Pasa el puntero del mouse sobre el node Tutorial y ve lo que ocurre. ¡Wow! Genial, ¿verdad? ¡Son un montón de botones!",
                    "updated": 1627239702475,
                    "style": "Callout"
                },
                {
                    "language": "FR",
                    "text": "Passez le pointeur de votre souris sur le nœud \"Tutorial\", et voyez ce qui se passe ! Ouh... C'est cool, non ? Ça fait beaucoup de boutons !",
                    "updated": 1623951096410,
                    "style": "Callout"
                },
                {
                    "language": "FR",
                    "text": "Passez le pointeur de votre souris sur le nœud \"Tutorial\", et voyez ce qui se passe ! Ouh... C'est cool, non ? Ça fait beaucoup de boutons !",
                    "updated": 1623951096410,
                    "style": "Callout"
                },
                {
                    "language": "NL",
                    "text": "Beweeg je muis over het Tutorial knooppunt en kijk wat er gebeurt! Wow! Cool toch? Dat zijn een heleboel knoppen!",
                    "updated": 1633761113014,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Bewegen Sie Ihren Mauszeiger über den Knoten Tutorial und sehen Sie, was passiert! Wahnsinn! Cool, oder? Das sind eine Menge Knöpfe!",
                    "updated": 1634070500067,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Наведите курсор мыши на узел Tutorial и посмотрите, что произойдет! Ух ты! Круто, правда? Так много кнопок!",
                    "updated": 1635451952870
                },
                {
                    "language": "TR",
                    "text": "Fare imlecinizi Eğitim \" Tutorial \" düğümünün üzerine getirin ve ne olduğunu görün! Vay! Güzel değil mi?Daha fazla düğme!",
                    "updated": 1635577498974
                }
            ]
        }
    ]
}