{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 68,
    "type": "Tutorial Step - Ready. Set. Go!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "task"
        },
        "text": "Let's get going! This is going to be quick anyway, as we are testing a single day worth of historic data.",
        "translations": [
            {
                "language": "IT",
                "text": "Forza, iniziamo! Sarà comunque una cosa veloce, perchè stiamo testando dati di una sola giornata.",
                "updated": 1618060660046,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Vámonos! De todos modos, esto será rápido, ya que estamos probando datos históricos de un solo día.",
                "updated": 1624453945775,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Los geht's! Dies wird ohnehin schnell gehen, da wir nur einen einzigen Tag mit historischen Daten testen.",
                "updated": 1634222237362
            },
            {
                "language": "TR",
                "text": "Haydi gidelim!  Bir günlük zaman dilimi için Backtest yapacağımız için bu hızlı olacak.",
                "updated": 1636122670075
            },
            {
                "language": "RU",
                "text": "Давайте начнем! В любом случае это будет быстро, т.к. мы тестируем исторические данные за 1 день.",
                "updated": 1636930436914
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Running a trading task is quite similar to running a data mining task. The difference lies in that&mdash;after running the task&mdash;you also need to run the trading session.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Eseguire una task di trading è simile a eseguire una task di data mining. La differenza sta nel fatto che, dopo aver lanciato la task, devi anche lanciare la trading session.",
                    "updated": 1618060706178,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Ejecutar un Trading Task es bastante similar a ejecutar una tarea de minería de datos. La diferencia radica en que, después de ejecutar la tarea, también debe ejecutar lel Trading Session.",
                    "updated": 1624454018479,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Bir ticaret görevi yürütmek ( Trading Tasks ), bir veri madenciliği (Data Mining Tasks ) görevi yürütmeye oldukça benzer. Aradaki fark, görevi çalıştırdıktan sonra, ticaret oturumunu da çalıştırmanız gerektiğidir.",
                    "updated": 1636122738568
                },
                {
                    "language": "RU",
                    "text": "Запуск торговой задачи очень похож на запуск задачи интеллектуального анализа данных. Разница заключается в том, что после запуска задачи, Вам также необходимо запустить торговую сессию.",
                    "updated": 1636930532553
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Select Run on the Lightning Strike Task menu!</br></br>Now select Run on the Backtesting Session menu!",
            "updated": 1629823345596,
            "translations": [
                {
                    "language": "IT",
                    "text": "Seleziona Run dal menu Task, e poi seleziona Run dal menu della Backtesting Session!",
                    "updated": 1618060790679,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Seleccione Run en el Task menu! Ahora seleccione Run en el Backtesting Session menu!",
                    "updated": 1624454082709,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Wählen Sie im Menü Lightning Strike Task die Option Run! <br/>Wählen Sie nun Run im Menü Backtesting Session!",
                    "updated": 1634222444040
                },
                {
                    "language": "TR",
                    "text": "Önce Lightning Strike Task menüsünde Run'ı seçin! Sonra Backtesting Session menüsünde Run'ı seçin!",
                    "updated": 1636122946019
                },
                {
                    "language": "RU",
                    "text": "Выберите Run в меню Task: Lightning Strike! Сейчас выберите Run в меню Backtesting Session!",
                    "updated": 1636930675030
                }
            ]
        },
        {
            "style": "Note",
            "text": "When the Backtesting Session indicates it finished processing, stop the Task and click Next.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Quando la progress bar della Trading Process Instance raggiunge il 100%, ferma la task e clicca Next.",
                    "updated": 1618060849542,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Cuando el Backtesting Session indica que terminó el procesamiento, detenga el Task y haz clic en Next.",
                    "updated": 1624454207659,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Wenn die Backtesting Session anzeigt, dass die Verarbeitung abgeschlossen ist, beenden Sie die Aufgabe und klicken Sie auf Weiter.",
                    "updated": 1634222377772
                },
                {
                    "language": "TR",
                    "text": "Geriye Dönük Test Oturumu ( Backtesting Session ), işlemin tamamlandığını gösterdiğinde, Görevi ( Task) durdurun ve İleri'ye tıklayın.",
                    "updated": 1636122871481
                },
                {
                    "language": "RU",
                    "text": "Когда Backtesting Session покажет, что обработка завершена, остановите Task и нажмите Next.",
                    "updated": 1636930736439
                }
            ],
            "updated": 1622201246283
        }
    ]
}