{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 15,
    "type": "Tutorial Step - Let's Mine Some Data!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "run"
        },
        "text": "Access the Data Tasks node menu and find the \"Run all project data tasks\" button on the top-right corner...",
        "updated": 1622189956451,
        "translations": [
            {
                "language": "IT",
                "text": "Apri il menu del nodo Data Tasks e cerca il pulsante Run All Project Data Tasks nell'angolo in alto a destra...",
                "updated": 1614720124109,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Open the Data Tasks node menu dan cari tombol Run All Project Data Tasks dibagian atas kanan...",
                "updated": 1616697053489,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Abre el menú del nodo Data Tasks y busca el botón Run All Project Data Tasks en la esquina superior derecha... ",
                "updated": 1627302836248,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Rufen Sie das Menü des Knotens Data Tasks auf und suchen Sie die Schaltfläche \"Run all project data tasks\" in der Ecke oben rechts...",
                "updated": 1634162677145,
                "style": "Definition"
            },
            {
                "language": "NL",
                "text": "Open het \"Data Tasks\" knooppunt menu en zoek de \"Run all project data tasks\" knop in de rechter bovenhoek...",
                "updated": 1634455832255,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Перейдите в меню узла Data Tasks и найдите кнопку \"Run All Project Data Tasks\" в правом верхнем углу...",
                "updated": 1641804826657,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Veri Görevleri ( Data Tasks) düğüm menüsüne erişin ve sağ üst köşedeki \"\"Tüm proje veri görevlerini çalıştır\"  ( Run All Project Data Tasks ) düğmesini bulun...\n",
                "updated": 1635850868808
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Click the \"Run all project data tasks\" button! Confirm the request by clicking the button a second time.",
            "updated": 1622190007548,
            "translations": [
                {
                    "language": "IT",
                    "text": "Clicca sul pulsante Run All Project Data Tasks!",
                    "updated": 1614720129427,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Click tombol Run All Project Data Tasks!",
                    "updated": 1616697004627,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Haz clic en el botón \"Run all project data tasks\". Confirma la solicitud haciendo clic en el botón por segunda vez.",
                    "updated": 1624491186735,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie auf die Schaltfläche \"Run all project data tasks\"! Bestätigen Sie die Anfrage, indem Sie die Schaltfläche ein zweites Mal anklicken (\"Confirm to run\").",
                    "updated": 1634203946171,
                    "style": "Callout"
                },
                {
                    "language": "NL",
                    "text": "Klik op de knop \"Run all project data tasks\"! Bevestig het starten door een tweede keer op de knop te klikken.",
                    "updated": 1634455913719,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Нажмите кнопку \"Run All Project Data Tasks\"! Подтвердите запрос, нажав кнопку во второй раз.",
                    "updated": 1641804835712,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "\"Tüm proje veri görevlerini çalıştır\" (Run All Project Data Tasks) düğmesine tıklayın! Düğmeye ikinci kez tıklamak onayladığınız anlamına gelir ve işlemi başlatmış olursunuz",
                    "updated": 1644849740065
                }
            ]
        },
        {
            "style": "Text",
            "text": "In about 30 seconds, you should see a status notice below the Data Tasks node indicating that 1 out of 1 Exchange Data Tasks node is running.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Conferma la richiesta cliccando il pulsante una seconda volta. In circa 30 secondi, dovresti vedere un messaggio di stato sotto il nodo Data Mining che ti indica che é in corso 1 Exchange Data Tasks su 1. ",
                    "updated": 1614720224584,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Konfirmasi request dengan click tombol di second time. Dalam 30 detik, kamu akan melihat notice status dibawah Data Mining node yang menjelaskan 1/1 Exchange Data Tasks node sedang berjalan.",
                    "updated": 1616696981851,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "En unos 30 segundos, deberias ver un aviso de estado debajo del nodo Data Tasks que indica que 1 de cada 1 nodo Exchange Data Tasks se está ejecutando.",
                    "updated": 1624452903459,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "In etwa 30 Sekunden sollten Sie eine Statusmeldung unterhalb des Knotens \"Data Tasks\" sehen, die anzeigt, dass 1 von 1 Knoten \"Exchange Data Tasks\" ausgeführt wird.",
                    "updated": 1634162722564,
                    "style": "Text"
                },
                {
                    "language": "NL",
                    "text": "Na ongeveer 30 seconden hoor je een statusbericht te zien onder de Data Tasks knooppunt, dat aangeeft dat 1 van de 1 \"Exchange Data Tasks\" knooppunten draait.",
                    "updated": 1634456056619,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Примерно через 30 секунд Вы должны увидеть уведомление о состоянии под узлом Data Tasks nоказывающее, что 1 из 1 задач Exchange Data Tasks - запущено.",
                    "updated": 1641805161843,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Yaklaşık 30 saniye içinde, Veri Görevleri (Data Tasks) düğümünün altında, Borsa Veri Görevi     (Exchange Data Tasks) düğümünün çalıştığını belirten bir durum bildirimi görmelisiniz.",
                    "updated": 1644849789734
                }
            ],
            "updated": 1622190035816
        },
        {
            "style": "Note",
            "text": "Your console app should show something similar to the video on the next step.",
            "translations": [
                {
                    "language": "IT",
                    "text": "La tua console app dovrebbe mostrarti qualcosa di simile al video nello step successivo.",
                    "updated": 1614720247842,
                    "style": "Note"
                },
                {
                    "language": "ID",
                    "text": "Console app akan memperlihatkan sesuatu yang mirip dengan video di step selanjutnya.",
                    "updated": 1616696802459,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Tu aplicación de consola deberia mostrar algo similar a lo que aparece en el video a continuación..",
                    "updated": 1624283587596,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": " Ihre Konsolenanwendung sollte etwas Ähnliches wie das Video im nächsten Schritt zeigen.",
                    "updated": 1634162733856,
                    "style": "Note"
                },
                {
                    "language": "NL",
                    "text": "De console van de app zou er ongeveer zo uit moeten zien als de video in de volgende stap.",
                    "updated": 1634456127607,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Ваше консольное приложение должно показать что-то похожее на то, как показано на видео в следующем шаге.",
                    "updated": 1635591567030,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Konsol uygulamanız, bir sonraki adımdaki videoya benzer bir şey göstermelidir.",
                    "updated": 1635851222308
                }
            ]
        }
    ]
}