{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 39,
    "type": "Tutorial Step - Size Matters?",
    "definition": {
        "icon": {
            "name": "Time\\time-machine",
            "project": "Foundations"
        },
        "text": "How about shaping the time machine to the exact aspect ratio of your screen?",
        "translations": [
            {
                "language": "IT",
                "text": "Che ne dici di adattare perfettamente la Time Machine al formato del tuo schermo?",
                "updated": 1614848136114,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Bagaimana membuat time machine menjadi sesuai dengan aspect ratio dari layar?",
                "updated": 1616936505798,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¿Qué tal darle forma a la máquina del tiempo con la relación de aspecto exacta de tu pantalla?",
                "updated": 1624383053610,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Zusammenfassung: Wie wäre es, die Time Machine genau an das Seitenverhältnis Ihres Bildschirms anzupassen?",
                "updated": 1634206350448,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Zaman makinesini ekranınızın tam en boy oranına göre şekillendirmeye ne dersiniz?",
                "updated": 1636035470271
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Matching the aspect ratio of your time machines to the aspect ratio of your screen is crucial for charts to fit your screen tightly while zooming in!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Dare alle tue time machines lo stesso aspect ratio del tuo schermo è importante perchè si adattino perfettamente ad esso.",
                    "updated": 1614848156397,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Mencocokkan rasio aspek time machine kamu dengan rasio aspek laya sangat penting agar bagan pas dengan layarmu!",
                    "updated": 1616936545221,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¡Hacer coincidir la relación de aspecto de tus máquinas del tiempo con la relación de aspecto de su pantalla es crucial para que los gráficos se ajusten perfectamente a tu pantalla al hacer zoom!",
                    "updated": 1624494074907,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die Anpassung des Seitenverhältnisses Ihrer Zeitmaschinen an das Seitenverhältnis Ihres Bildschirms ist entscheidend dafür, dass die Diagramme beim Heranzoomen genau auf Ihren Bildschirm passen!",
                    "updated": 1634206368643,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Zaman makinelerinizin en boy oranını ekranınızın en boy oranıyla eşleştirmek, yakınlaştırırken grafiklerin ekranınıza sığabilmesi için çok önemlidir!",
                    "updated": 1636035504803
                }
            ],
            "updated": 1622198491208
        },
        {
            "style": "Callout",
            "text": "Direct your mouse at one of the time machines and hit Ctrl + Shift + Alt + Key-A. Do the same with the other one!",
            "updated": 1630943771557,
            "translations": [
                {
                    "language": "IT",
                    "text": "Sposta il mouse su una delle time machines e premi Ctrl + Shift + Key-A. Fai lo stesso con l'altra.",
                    "updated": 1614848104941,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Point mousemu ke satu dari time machines dan tekan Ctrl + Shift + Key-A. Lakukan dengan yang satunya juga!",
                    "updated": 1616936593204,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Dirije tu mouse a una de las máquinas del tiempo y presiona Ctrl + Shift + Key-A. ¡Haz lo mismo con la otra!",
                    "updated": 1624383472672,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Richten Sie Ihre Maus auf eine der Time Machines und drücken Sie Ctrl + Shift + Alt + Key-A. Machen Sie dasselbe mit der anderen Maschine!",
                    "updated": 1634206401027,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Farenizi zaman makinelerinden birine yönlendirin ve Ctrl + Shift + Alt + Key-A tuşlarına basın. Aynısını diğeriyle yapın!",
                    "updated": 1636035527567
                }
            ]
        },
        {
            "style": "Success",
            "text": "Leave the two time machines matching the aspect ratio of your screen. from now on!",
            "updated": 1610622263656,
            "translations": [
                {
                    "language": "IT",
                    "text": "D'ora in poi, lascia le due time machines con lo stesso aspect ratio del tuo schermo!",
                    "updated": 1614848186502,
                    "style": "Success"
                },
                {
                    "language": "ID",
                    "text": "Biarkan dua time machine cocok dengan rasio aspek layarmu. dari sekarang!",
                    "updated": 1616936619368,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "¡Deja que las dos máquinas del tiempo coincidan con la relación de aspecto de tu pantalla de ahora en adelante!",
                    "updated": 1624383547817,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Lassen Sie die beiden Time Machines von nun an auf das Seitenverhältnis Ihres Bildschirms abgestimmt!",
                    "updated": 1634206411265,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "Şu andan itibaren ekranınızın en boy oranıyla eşleşen iki zaman makinesini görmen lazım.",
                    "updated": 1636035706936
                }
            ]
        }
    ]
}