{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 45,
    "type": "Tutorial Step - Unlocking Time!",
    "definition": {
        "icon": {
            "name": "Time\\time-scale",
            "project": "Foundations"
        },
        "text": "The reason why you can't move is that scales are locked in the automatic mode so that you may easily find the data after your first data mining operation.",
        "translations": [
            {
                "language": "IT",
                "text": "Il motivo per cui non ti puoi muovere è che le scale sono bloccate in modalità automatica, così puoi trovare facilmente i dati dopo la tua prima operazione di mining.",
                "updated": 1614893522639,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "No puedes moverte porque las escalas están bloqueadas en el modo automático para que puedas encontrar fácilmente los datos después de tu primera operación de minería de datos.",
                "updated": 1624404740730,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Der Grund, warum Sie sich nicht bewegen können, ist, dass die Skalen im automatischen Modus gesperrt sind, damit Sie die Daten nach Ihrer ersten Data-Mining-Operation leicht finden können.",
                "updated": 1634216885238
            },
            {
                "language": "TR",
                "text": "Hareket edememenizin nedeni, ilk veri madenciliği işleminizden sonra verileri kolayca bulabilmeniz için skalanın otomatik modda kilitli olmasıdır.",
                "updated": 1636093218029
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Setting the Time Scale in automatic mode forces the whole datetime range of available data into the chart.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Settare la Time Scale in modalità automatica fa sì che i dati sull'intera scala temporale vengano mostrati insieme sul grafico.",
                    "updated": 1614893577134,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Fijar el Time Scale en automático fuerza todo el rango de fecha y hora de los datos disponibles al gráfico.",
                    "updated": 1624404973090,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie die Time Scale im automatischen Modus einstellen, wird der gesamte Zeitbereich der verfügbaren Daten in das Diagramm gezwungen.",
                    "updated": 1634216894224
                },
                {
                    "language": "TR",
                    "text": "Zaman Ölçeğini ( Time Scale ) otomatik modda ayarlamak, mevcut verilerin tümünün tarih-saat aralığında gösterilmesine zorlar.",
                    "updated": 1636093070726
                }
            ]
        },
        {
            "style": "Callout",
            "text": "To toggle between the various automatic modes and manual mode, hit Shift and make a gentle one-step roll with the wheel of your mouse on top of the time scale box. Alternatively, you can also place the mouse pointer over the scale box and hit the up and down arrow keys ↑ ↓.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Per cambiare tra automatico e manuale, premi Shift e ruota una volta la rotella del mouse sopra a una time scale box. Oppure, posiziona il cursore sulla scale box e usa i tasti freccia ↑ ↓.",
                    "updated": 1618647811116,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Para alternar entre los modos automáticos y el manual, presiona Shift y haz un suave giro de un paso con la rueda del mouse en la parte superior del cuadro de escala de tiempo. O bien, también puedes colocar el mouse sobre el cuadro de escala y presionar ↑ ↓.",
                    "updated": 1624405351031,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Um zwischen den verschiedenen automatischen Modi und dem manuellen Modus hin- und herzuschalten, drücken Sie die Umschalttaste und bewegen Sie das Mausrad über dem Time Scale-Feld in einem Schritt. Alternativ können Sie auch den Mauszeiger auf das Skalenfeld setzen und die Pfeiltasten ↑ ↓ drücken.",
                    "updated": 1634216938054
                },
                {
                    "language": "TR",
                    "text": "Otomatik mod ve manuel mod arasında geçiş yapmak için Shift 'e basın ve farenizin tekerleği ile zaman ölçeği kutusunun üzerinde birkez döndürün. Alternatif olarak, fare işaretçisini ölçek kutusunun üzerine getirebilir ve yukarı ve aşağı ok tuşlarına ↑ ↓ basabilirsiniz.",
                    "updated": 1636093154603
                }
            ],
            "updated": 1622199287763
        },
        {
            "style": "Text",
            "text": "You should now be able to move freely on the X-axis, that is, the time axis of the chart.",
            "updated": 1616495689238,
            "translations": [
                {
                    "language": "IT",
                    "text": "Dovresti poterti muovere liberamente sull'asse X del grafico, ossia quella del tempo.",
                    "updated": 1618647843971,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Ahora deberías poder moverte libremente en el eje X, es decir, el eje de tiempo del gráfico.",
                    "updated": 1624405847740,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie sollten sich nun frei auf der X-Achse, das heißt der Zeitachse des Diagramms, bewegen können.",
                    "updated": 1634216981937
                },
                {
                    "language": "TR",
                    "text": "Artık X ekseninde , yani grafiğin zaman ekseninde serbestçe hareket edebilmeniz gerekir.",
                    "updated": 1636093193714
                }
            ]
        }
    ]
}