{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 113,
    "type": "Tutorial Step - Beware of Impersonators!",
    "definition": {
        "text": "Superalgos Admins, the Core Team, and Community Mods will never contact you directly unless you contact them first!",
        "icon": {
            "name": "Bullet\\bullet-warning",
            "project": "Foundations"
        },
        "updated": 1617608574624,
        "translations": [
            {
                "language": "IT",
                "text": "Gli admin di Superalgos non ti contatteranno mai direttamente, a meno che non li contatti tu per primo.",
                "updated": 1618074109290,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Los administradores de Superalgos, el Core Team y los Community Mods nunca se comunicarán contigo directamente a menos que los contactes primero.",
                "updated": 1624488617429,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Warning",
            "text": "Scammers are lurking! Beware! It's no news that trading-related groups attract all sorts of scammers, and we are aware that they contact people in our groups attempting all sorts of tricks. We will never ask you for API keys, coins, or cash. In fact, we will never ask you to trust us in any way! We want to make it clear that if someone contacts you directly claiming to work with or for the project, it is a scam. Please report scammers in the Community group so that they may be banned, and to increase awareness of the problem, but also block them and report them to Telegram if the option is available.",
            "updated": 1617608980211,
            "translations": [
                {
                    "language": "IT",
                    "text": "Attenzione, gli scammers sono in agguato! Non è una novità che i gruppi riguardanti il trading attraggano ogni tipo di scammer, e siamo al corrente del fatto che contattino persone del gruppo tentando di truffarle. Non chiederemo mai API keys, crypto o soldi. Di fatto, non ti chiederemo di fidarti di noi in alcun modo! Vogliamo che sia chiaro che se qualcuno ti contatta direttamente e dichiarando di lavorare per o con il progetto, è uno scam. Per favore segnalate gli scammers nel canale Community così che possano essere bannati, bloccateli e se possibile segnalateli a Telegram stesso.",
                    "updated": 1618074329147,
                    "style": "Warning"
                },
                {
                    "language": "ES",
                    "text": "¡Los estafadores están al acecho! sabemos que se ponen en contacto con personas de nuestros grupos para intentar todo tipo de trucos. Nunca te pediremos claves de API, monedas o efectivo. De hecho, ¡nunca le pediremos que confíe en nosotros de ninguna manera! Queremos dejar en claro que si alguien se pone en contacto con usted directamente para afirmar que trabaja con o para el proyecto, es una estafa. Reporta a los estafadores en el grupo de la Comunidad para que puedan ser baneados,también bloquéelos e infórmelos a Telegram si la opción está disponible.",
                    "updated": 1624488963730,
                    "style": "Warning"
                }
            ]
        }
    ]
}