{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 90,
    "type": "Tutorial Step - Disclaimer",
    "definition": {
        "text": "This warning will be rendered in full screen mode.",
        "translations": [
            {
                "language": "IT",
                "text": "Questo warning verrà visualizzato a schermo intero.",
                "updated": 1618069224090,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Diese Warnung wird im Vollbildmodus wiedergegeben.",
                "updated": 1634226875668
            },
            {
                "language": "TR",
                "text": "Bu uyarı tam ekran modunda gösterilecektir.",
                "updated": 1636404372696
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Warning",
            "text": "Superalgos is a piece of computer software. Like with any software, errors may occur at any point, including errors that may cause you to lose money. You are responsible for taking all precautions you may deem appropriate before trading live. Even if you take all possible precautionary measures, things may still go wrong and errors may occur. By using this software to trade live despite the warnings, you acknowledge that you are aware of the inherent risks in trading and in using software for that purpose. The Superalgos Project offers the software AS IS, with no explicit or implied warranties of any kind. The project, the software, the superalgos.org website, and this tutorial do not offer financial advice. Although the strategies shipping with the system may be fully functional, Superalgos does not make any express or implied recommendation as to how you should use them. We share strategies for educational purposes only. Trade under your responsibility and at your own risk. The use of the software is subject to the terms of the LICENSE.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos è un software. Come ogni altro software, può presentare errori di qualsiasi tipo, inclusi errori che possono causare all'utente perdita di denaro. Sei responsabile di prendere ogni precauzione che tu ritenga appropriata prima di fare trading live. Anche prendendo ogni precauzione possibile, è comunque possibile che si verifichino errori. Utilizzando questo software per fare trading live, nonostante i presenti avvertimenti, riconosci di essere a conoscenza dei rischi inerenti all'attività di trading e all'uso di un software per quello scopo. Superalgos Project offre il software \"AS IS\", senza alcun tipo di garanzia esplicita o implicita. Il progetto, il software, il sito superalgos.org e questo tutorial non offrono consulenza finanziaria. Nonostante le strategie incluse nel sistema possano essere funzionanti, Superalgos non fa alcuna raccomandazione esplicita o implicita su come usarle. Condividiamo strategia a puro scopo educativo. Fai trading sotto la tua responsabilità e a tuo rischio e pericolo. L'uso del software è soggetto ai termini di licenza.",
                    "updated": 1618069837996,
                    "style": "Warning"
                },
                {
                    "language": "ES",
                    "text": "Superalgos es un software de computadora. Al igual que con cualquier software, pueden ocurrir errores en cualquier momento, incluidos errores que pueden provocar una pérdida de dinero. Usted es responsable de tomar las precauciones que considere apropiadas antes de operar en vivo. Incluso si toma todas las medidas de precaución posibles, las cosas pueden salir mal y pueden ocurrir errores. Al usar este software para operar en vivo a pesar de las advertencias, usted reconoce que es consciente de los riesgos inherentes al comercio y al uso de software para ese propósito. El Proyecto Superalgos ofrece el software TAL CUAL, sin garantías explícitas o implícitas de ningún tipo. El proyecto, el software, el sitio web superalgos.org y este tutorial no ofrecen asesoramiento financiero. Las estrategias que se envían con el sistema pueden ser completamente funcionales,pero Superalgos no hace ninguna recomendación implícita sobre cómo debe usarlas. Compartimos estrategias solo con fines educativos. Opere bajosu propio riesgo. El uso del software está sujeto a los términos de la LICENCIA.",
                    "updated": 1624465065714,
                    "style": "Warning"
                },
                {
                    "language": "DE",
                    "text": "Superalgos ist ein Stück Computer-Software. Wie bei jeder Software können jederzeit Fehler auftreten, auch solche, bei denen Sie Geld verlieren können. Sie sind dafür verantwortlich, alle Vorsichtsmaßnahmen zu treffen, die Sie für angemessen halten, bevor Sie live handeln. Selbst wenn Sie alle möglichen Vorsichtsmaßnahmen ergreifen, kann immer noch etwas schief gehen und es können Fehler auftreten. Indem Sie diese Software trotz der Warnungen für den Live-Handel verwenden, erkennen Sie an, dass Sie sich der inhärenten Risiken des Handels und der Verwendung von Software für diesen Zweck bewusst sind. Das Superalgos Projekt bietet die Software so an, wie sie ist, ohne ausdrückliche oder stillschweigende Garantien jeglicher Art. Das Projekt, die Software, die Website superalgos.org und dieses Tutorial bieten keine finanzielle Beratung. Auch wenn die mit dem System gelieferten Strategien voll funktionsfähig sind, gibt Superalgos keine ausdrückliche oder stillschweigende Empfehlung ab, wie Sie sie verwenden sollten. Wir geben die Strategien nur zu Ausbildungszwecken weiter. Handeln Sie auf eigene Verantwortung und auf eigenes Risiko. Die Nutzung der Software unterliegt den Bedingungen der LIZENZ.",
                    "updated": 1634226901092
                },
                {
                    "language": "TR",
                    "text": "Superalgos bir bilgisayar yazılımı parçasıdır. Herhangi bir yazılımda olduğu gibi, para kaybetmenize neden olabilecek hatalar da dahil olmak üzere herhangi bir noktada hatalar meydana gelebilir. Canlı işlem yapmadan önce uygun görebileceğiniz tüm önlemleri almak sizin sorumluluğunuzdadır. Olası tüm ihtiyati tedbirleri alsanız bile, işler yine de ters gidebilir ve hatalar meydana gelebilir. Uyarılara rağmen canlı ticaret yapmak için bu yazılımı kullanarak, ticarette ve yazılımı bu amaçla kullanmanın doğasında var olan risklerin farkında olduğunuzu kabul etmektesiniz. Superalgos Projesi, yazılımı OLDUĞU GİBİ sunar ve hiçbir açık veya zımni garanti içermez. Proje, yazılım, superalgos.org web sitesi ve bu eğitim, finansal tavsiye sunmamaktadır. Sistemle birlikte gönderilen stratejiler tamamen işlevsel olsa da, Superalgos bunları nasıl kullanmanız gerektiği konusunda açık veya zımni herhangi bir öneride bulunmaz. Stratejileri yalnızca eğitim amaçlı paylaşıyoruz. Kendi sorumluluğunuzda ve riski size ait olmak üzere ticaret yapın. Yazılımın kullanımı LİSANS şartlarına tabidir.",
                    "updated": 1636404351933
                }
            ]
        }
    ]
}