{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 9,
    "type": "Tutorial Step - Repository Branches",
    "definition": {
        "text": "The Superalgos repository features two main branches: master and develop.",
        "icon": {
            "name": "github",
            "project": "Foundations"
        },
        "updated": 1636912658939,
        "translations": [
            {
                "language": "IT",
                "text": "La repository di Superalgos ha tree branches principali: master, develop e quella che cerchiamo noi, plugins-docs.",
                "updated": 1619633110033,
                "style": "Definition"
            },
            {
                "language": "FR",
                "text": "L'entrepôt Superalgos comporte trois sections principales : master, develop, et celle que nous recherchons, plugins-docs.",
                "updated": 1623952696128,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "El repositorio de Superalgos presenta tres ramas principales: master, develop, y el que estamos buscando, plugins-docs.",
                "updated": 1628121680964,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Das Superalgos-Repository hat zwei Hauptzweige: master und develop.",
                "updated": 1638832363730,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Особенностью репозитория Superalgos является подразделение его на три основных разновидности: мастер, разработка и одно поисковое подразделение - плагины-документы.\n",
                "updated": 1635515254111
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Success",
            "text": "There may be more, but these are the main!",
            "updated": 1618143442686,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ce ne sono altre, ma queste sono le principali!",
                    "updated": 1619633138117,
                    "style": "Success"
                },
                {
                    "language": "FR",
                    "text": "Il peut y en avoir d'autres, mais ce sont les principales !",
                    "updated": 1623952831504,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Puede que haya más, ¡pero estos son los principales!",
                    "updated": 1628121700843,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Es gibt vielleicht noch mehr, aber das sind die wichtigsten!",
                    "updated": 1634821022072,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Их может быть и больше, но эти самые основные!",
                    "updated": 1635581904616
                }
            ]
        },
        {
            "style": "List",
            "text": "Master Branch: Features the stable version of the software. Never submit contributions to this branch!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Master Branch: ospita l'ultima versione stabile del software. Non mandare mai contributi a questo branch!",
                    "updated": 1619633296240,
                    "style": "List"
                },
                {
                    "language": "FR",
                    "text": "Branche Master: Features la version stable du logiciel. Ne soumettez jamais de contributions à cette branche !",
                    "updated": 1623952911737,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Master Branch: Es la versión estable del software. ¡Nunca envíes contribuciones a esta rama!",
                    "updated": 1628121827428,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Master Branch: Enthält die stabile Version der Software. Reichen Sie niemals Beiträge für diesen Zweig ein!",
                    "updated": 1634821032083,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Master Branch: Features имеет устойчивую версию программного обеспечения. Никогда не размещайте материалы в этом подразделении.",
                    "updated": 1635516502634
                }
            ]
        },
        {
            "style": "List",
            "text": "Develop Branch: Features the version currently in development. Submit contributions of code affecting the codebase, translations, improvements in the Docs, tutorials, and plugins such as data mines, trading systems, and so on!",
            "updated": 1636912699736,
            "translations": [
                {
                    "language": "IT",
                    "text": "Develop Branch: contiene la versione attualmente in sviluppo. Manda qui i contributi riguardanti la codebase.",
                    "updated": 1619633304194,
                    "style": "List"
                },
                {
                    "language": "FR",
                    "text": "Branche Develop : Features la version en cours de développement., pour soumettre des contributions de code affectant la base de code.",
                    "updated": 1623953015534,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Develop Branch: Presenta la versión actualmente en desarrollo. Envía contribuciones de código que afecten al código base.",
                    "updated": 1628121811043,
                    "style": "List"
                },
                {
                    "language": "DE",
                    "text": "Develop Branch: Enthält die Version, die sich derzeit in der Entwicklung befindet. Reichen Sie Beiträge ein, die die Codebasis, Übersetzungen,Verbesserungen der Docs, Tutorials, plugins sowie Data-Mines, trading systems und so weiter betreffen.",
                    "updated": 1638831914823,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Develop Branch: Features имеет версию, которая на данный момент находится в разработке. Размещайте материалы кода, влияющие на кодовую базу.",
                    "updated": 1635515640752
                }
            ]
        }
    ]
}