{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 65,
    "type": "Tutorial Step - Civil Works Ahead!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "under-construction"
        },
        "text": "Don't be surprised if you find an under construction sign here and there...",
        "translations": [
            {
                "language": "IT",
                "text": "Non sorprenderti se trovi segnali di \"lavori in corso\" qua e là...",
                "updated": 1618059716381,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "No te sorprendas si encuentras un letrero en construcción aquí y allá ...",
                "updated": 1624450913450,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wundern Sie sich nicht, wenn Sie hier und da ein \"under construction\"-Schild finden...",
                "updated": 1634220290367
            },
            {
                "language": "TR",
                "text": "Arada bir \"Under Construction\" tabelası görürseniz şaşırmayın...",
                "updated": 1636110077834
            },
            {
                "language": "RU",
                "text": "Не удивляйтесь, если Вы найдете над этой конструкцией знак \"Здесь и там\"...",
                "updated": 1636749753795
            }
        ],
        "updated": 1622200773527
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "As I mentioned earlier, Superalgos is constantly growing, and infrastructure architected for the upcoming version may occasionally be merged to the current version in a service pack, along with necessary fixes and minor improvements.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Come detto prima, Superalgos è in continua evoluzione e gli sviluppi per la versione successiva potrebbero essere occasionalmente implementati nella versione corrente, per risolvere problemi o apportare piccole migliorie.",
                    "updated": 1618059772511,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Como mencioné anteriormente, Superalgos está en constante crecimiento y la infraestructura diseñada para la próxima versión puede fusionarse ocasionalmente con la versión actual en un paquete de servicio, junto con las correcciones necesarias y las mejoras menores.",
                    "updated": 1624450981653,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wie ich bereits erwähnt habe, wächst Superalgos ständig, und die Infrastruktur, die für die kommende Version entworfen wurde, kann gelegentlich in die aktuelle Version in einem Service Pack integriert werden, zusammen mit notwendigen Korrekturen und kleineren Verbesserungen.",
                    "updated": 1634220302814
                },
                {
                    "language": "TR",
                    "text": "Daha önce bahsettiğim gibi, Superalgos sürekli büyüyor ve gelecek sürüm için tasarlanan altyapı, gerekli düzeltmeler ve küçük iyileştirmelerle birlikte zaman zaman bir hizmet paketindeki mevcut sürümle birleştiriliyor.",
                    "updated": 1636110110844
                },
                {
                    "language": "RU",
                    "text": "Как я упоминал ранее, Superalgos постоянно растет и инфраструктура выстраивается для предстоящей версии, иногда может быть объединена с текущей версией в пакете обновления вместе  с необходимыми исправлениями и незначительными улучшениями.",
                    "updated": 1636749912452
                }
            ]
        },
        {
            "style": "Note",
            "text": "If you are curious about what is cooking for the upcoming Superalgos release, join the <a href='https://t.me/superalgosdevelop' target='_blank' style='color:blue;'>Superalgos Develop</a> Telegram group.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Se vuoi scoprire cosa bolle in pentola per la prossima release di Superalgos, unisciti al canale Telegram <a href='https://t.me/superalgosdevelop' target='_blank' style='color:blue;'>Superalgos Develop</a>.",
                    "updated": 1618059823365,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Si tienes curiosidad sobre lo que se está cocinando para el próximo lanzamiento de Superalgos, únete al grupo <a href='https://t.me/superalgosdevelop' target='_blank' style='color:blue;'>Superalgos Develop</a> en Telegram.",
                    "updated": 1624451110541,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie neugierig sind, was für die kommende Superalgos Version geplant ist, treten Sie der <a href='https://t.me/superalgosdevelop' target='_blank' style='color:blue;'>Superalgos Develop</a> Telegram Gruppe bei. ",
                    "updated": 1634220334096
                },
                {
                    "language": "TR",
                    "text": "Bir sonraki sürüm içeriğini öğrenebilmek için Telegram Grubumuza Katılın. https://t.me/superalgosdevelop",
                    "updated": 1636119227691
                },
                {
                    "language": "RU",
                    "text": "Если Вам интересно, что готовится к предстоящему выпуску Superalgos, присоединяйтесь к группе в телеграмме SuperalgosDevelop.",
                    "updated": 1636750362265
                }
            ],
            "updated": 1636750158168
        }
    ]
}
