{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 53,
    "type": "Tutorial Step - Switching Gears...",
    "definition": {
        "icon": {
            "name": "Layer\\layer-manager",
            "project": "Foundations"
        },
        "text": "Leaving scales behind, let's take a look at how the system makes data available on the charts.",
        "translations": [
            {
                "language": "IT",
                "text": "Ora diamo un'occhiata al modo in cui il sistema rappresenta i dati sui grafici.",
                "updated": 1615963273716,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Dejando atrás las escalas, echemos un vistazo a cómo el sistema hace que los datos estén disponibles en los gráficos.",
                "updated": 1624409028040,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Zusammenfassung: Lassen wir die Skalen hinter uns und schauen wir uns an, wie das System Daten in den Diagrammen verfügbar macht.",
                "updated": 1634217725509
            },
            {
                "language": "TR",
                "text": "Ölçekleri geride bırakarak, sistemin verileri grafiklerde nasıl kullanılabilir hale getirdiğine bir göz atalım.",
                "updated": 1636096145748
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Every Timeline Chart has an associated Layer Manager, which is represented as a drop-down menu listing multiple layers.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ogni Timeline Chart ha un corrispondente Layer Manager, rappresentato come un menù a tendina che mostra i vari layers.",
                    "updated": 1615963369522,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Cada Timeline Chart tiene un Layer Manager asociado, que se representa como un menú desplegable que enumera varias capas.",
                    "updated": 1624409085765,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Jedem Timeline Chart ist ein Layer Manager zugeordnet, der in Form eines Drop-Down-Menüs mit mehreren Layern dargestellt wird.",
                    "updated": 1634217734286
                },
                {
                    "language": "TR",
                    "text": "Her Zaman Çizelgesi ( Timeline Chart ) Grafiği, birden çok katmanı listeleyen bir açılır menü olarak temsil edilen ilişkili bir Katman Yöneticisine ( Layer Manager ) sahiptir.",
                    "updated": 1636096050983
                }
            ]
        },
        {
            "style": "Callout",
            "text": "To open a layers manager, scroll the wheel of the mouse on its header. Use the wheel of the mouse to scroll through its content too!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Per aprire un layer manager, scorri la rotella del mouse sulla sua testata. Usa la rotella del mouse anche per scorrere i suoi contenuti!",
                    "updated": 1615963411220,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Para abrir un Layers Manager, desplaza la rueda del mouse en su encabezado. ¡También usa la rueda del mouse para desplazarte por su contenido!",
                    "updated": 1627309278146,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Um einen Ebenenmanager zu öffnen, fahren Sie mit dem Mausrad über seine Kopfzeile. Verwenden Sie das Mausrad auch, um durch den Inhalt zu blättern!",
                    "updated": 1634217743759
                },
                {
                    "language": "TR",
                    "text": "Bir katman yöneticisi (sol üstteki siyah kutular) açmak için farenin tekerleğini başlığında kaydırın. İçeriğinde gezinmek için de farenin tekerleğini kullanın!",
                    "updated": 1636096113075
                }
            ]
        },
        {
            "style": "Text",
            "text": "See the video on the next step for clarity...",
            "translations": [
                {
                    "language": "IT",
                    "text": "Guarda il prossimo video per dettagli più chiari...",
                    "updated": 1615963431549,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Ve el video en el siguiente paso para mayor claridad ...",
                    "updated": 1624409230888,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Zur Verdeutlichung sehen Sie sich das Video im nächsten Schritt an...",
                    "updated": 1634217753499
                },
                {
                    "language": "TR",
                    "text": "Netlik için bir sonraki adımdaki videoyu izleyin...",
                    "updated": 1636096131626
                }
            ]
        }
    ]
}