{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 50,
    "type": "Tutorial Step - Time Frames Salad?",
    "definition": {
        "icon": {
            "name": "Time\\time-frame-scale",
            "project": "Foundations"
        },
        "text": "News-flash about the Time Frame Scale: there is no automatic mode!",
        "translations": [
            {
                "language": "IT",
                "text": "Notizia lampo sulla Time Frame Scale: non esiste una modalità automatica!",
                "updated": 1614894147285,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Noticias de última hora sobre el Time Frame Scale: ¡no hay modo automático!",
                "updated": 1624407844642,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Kurzmeldung zur Time Frame Scale: Es gibt keinen automatischen Modus!",
                "updated": 1634217396808
            },
            {
                "language": "TR",
                "text": "Zaman Çerçevesi Ölçeği ( Time Frame Scale ) hakkında flaş haber: otomatik mod yok!",
                "updated": 1636095177127
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "You may toggle through all available time frames using the mouse wheel or up and down arrows ↑ ↓ — In descending order: 24, 12, 8, 6, 4, 3, 2, and 1 hours, and 45, 40, 30, 20, 15, 10, 5, 4, 3, 2, and 1 minutes.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Puoi scegliere liberamente tra tutti i time frame disponibili usando la rotella del mouse o i tasti freccia ↑ ↓. In ordine decrescente: 24, 8, 6, 4, 3, 2, e 1 ore, e 45, 40, 30, 20, 15, 10, 5, 4, 3, 2, e 1 minuti. ",
                    "updated": 1618648424995,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Puedes alternar entre todos los marcos de tiempo disponibles usando la rueda del mouse o las flechas hacia arriba y hacia abajo ↑ ↓ — En orden descendente: 24, 12, 8, 6, 4, 3, 2, y 1 horas, y 45, 40, 30, 20, 15, 10, 5, 4, 3, 2, y 1 minutos.",
                    "updated": 1624494748397,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Sie können mit dem Mausrad oder den Pfeiltasten ↑ ↓ — in absteigender Reihenfolge - durch alle verfügbaren Zeitrahmen schalten: 24, 12, 8, 6, 4, 3, 2 und 1 Stunde sowie 45, 40, 30, 20, 15, 10, 5, 4, 3, 2 und 1 Minute. ",
                    "updated": 1634217420841
                },
                {
                    "language": "TR",
                    "text": "Fare tekerleğini veya yukarı ve aşağı okları kullanarak mevcut tüm zaman dilimleri arasında geçiş yapabilirsiniz ↑ ↓ — Sırasıyla: 24, 12, 8, 6, 4, 3, 2 ve 1 saat ve 45, 40, 30, 20, 15, 10, 5, 4, 3, 2 ve 1 dakika.",
                    "updated": 1636095217975
                }
            ],
            "updated": 1616505407890
        },
        {
            "style": "Important",
            "text": "Beware when you switch the time frame scale to lower time frames! Dropping time frames too fast and without adjusting the time scale may cause too much information to be rendered on-screen at a time, slowing down your computer. How much information density your hardware may handle depends on its CPU and GPU performance.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Fai attenzione quando selezioni time frame con intervalli di tempo più brevi! Scalare i time frame verso il basso troppo rapidamente può sovraccaricare il rendering a schermo e rallentare il computer. I limiti dipendono dal tuo hardware.",
                    "updated": 1618648474971,
                    "style": "Important"
                },
                {
                    "language": "ES",
                    "text": "En los tiempos más bajos dejar los marcos de tiempo demasiado rápido y sin ajustar la escala de tiempo puede hacer que se muestre demasiada información en la pantalla a la vez, lo que ralentiza tu computadora. La cantidad de información que puede manejar tu hardware depende del rendimiento de tu CPU y GPU.",
                    "updated": 1625881772119,
                    "style": "Important"
                },
                {
                    "language": "DE",
                    "text": "Wichtig: Seien Sie vorsichtig, wenn Sie die Time Frame Scale auf niedrigere Zeiträume umstellen! Wenn Sie die Zeitrahmen zu schnell und ohne Anpassung der Time Scale verringern, kann dies dazu führen, dass zu viele Informationen auf einmal auf dem Bildschirm dargestellt werden, was Ihren Computer verlangsamt. Wie viel Informationsdichte Ihre Hardware verarbeiten kann, hängt von ihrer CPU- und GPU-Leistung ab.",
                    "updated": 1634217436779
                },
                {
                    "language": "TR",
                    "text": "Zaman çerçevesi ölçeğini daha düşük zaman dilimlerine değiştirirken dikkatli olun! Zaman dilimlerini çok hızlı ve zaman ölçeğini ayarlamadan bırakmak, ekranda aynı anda çok fazla bilgi görüntülenmesine neden olarak bilgisayarınızı yavaşlatabilir. Donanımınızın ne kadar bilgi yoğunluğu kaldırabileceği CPU ve GPU performansına bağlıdır.",
                    "updated": 1636095244874
                }
            ]
        }
    ]
}