{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 87,
    "type": "Tutorial Step - Feedback Loops",
    "definition": {
        "icon": {
            "name": "Limit-Order\\limit-buy-order",
            "project": "Foundations"
        },
        "text": "Lets take a look at another example to let the notion of the constant feedback loop sink in before we move on!",
        "translations": [
            {
                "language": "IT",
                "text": "Diamo un'occhiata a un altro esempio per assorbire bene la nozione di \"constant feedback loop\" prima di proseguire!",
                "updated": 1618068120939,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Echemos un vistazo a otro ejemplo para dejar que la noción del ciclo de retroalimentación constante se entienda antes de continuar!",
                "updated": 1624463986592,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Zusammenfassung: Schauen wir uns ein weiteres Beispiel an, um den Begriff der konstanten Rückkopplungsschleife zu verinnerlichen, bevor wir weitermachen!",
                "updated": 1634226654216
            },
            {
                "language": "TR",
                "text": "Devam etmeden önce sabit geri besleme döngüsü kavramının anlaşılması için başka bir örneğe bakalım!",
                "updated": 1636403007502
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This is the data structure where information about limit buy orders is kept.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Questa è la struttura di dati dove si trovano le informazioni sui limit buy orders.",
                    "updated": 1618068157301,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Esta es la estructura de datos donde se guarda la información sobre las órdenes de compra límite.",
                    "updated": 1624464006602,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Dies ist die Datenstruktur, in der die Informationen über limitierte Kaufaufträge gespeichert werden.",
                    "updated": 1634226647187
                },
                {
                    "language": "TR",
                    "text": "Limitli alış emirleri ile ilgili bilgilerin tutulduğu veri yapısıdır.",
                    "updated": 1636403126356
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Go to the Trading Engine layers manager on the charts (the second counting from the left). Scroll down and turn on the Limit Buy Orders layer. Now swipe the mouse pointer over a few of the buy orders and check the effect on the nodes on the design space.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Vai al layer manager del Trading Engine sul grafico (il secondo da sinistra). Scorri verso il basso e attiva il layer dei Limit Buy Orders. Ora passa con il mouse su alcuni dei buy orders e osserva l'effetto sui nodi nel Design Space.",
                    "updated": 1618068248928,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Ve a la Trading Engine Layers Manager en los gráficos (segundo contando desde la izquierda). Vaya hacia abajo y encienda el Limit Buy Orders layer. Ahora deslice el mouse sobre algunas de las órdenes de compra y verifique el efecto en los nodos en el espacio de diseño.",
                    "updated": 1624464208051,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Gehen Sie zum Ebenen-Manager der Trading Engine auf den Charts (die zweite Zählung von links). Scrollen Sie nach unten und schalten Sie die Ebene Limit Buy Orders ein. Bewegen Sie nun den Mauszeiger über einige der Kaufaufträge und prüfen Sie die Auswirkungen auf die Knoten im Design Space.",
                    "updated": 1634226668445
                },
                {
                    "language": "TR",
                    "text": "Grafiklerdeki Trading Engine katmanları yöneticisine gidin (soldan ikinci). Aşağı kaydırın ve Satın Alma Siparişlerini Sınırla ( Limit Buy Order )katmanını açın. Şimdi fare imlecini birkaç satın alma siparişinin üzerine kaydırın ve tasarım alanındaki düğümler üzerindeki etkisini kontrol edin.",
                    "updated": 1636403375825
                }
            ]
        },
        {
            "style": "Text",
            "text": "Can you envision the implications of having this level of control over the data managed by the trading bot?",
            "translations": [
                {
                    "language": "IT",
                    "text": "Capisci le implicazioni di avere un tale livello di controllo sui dati su cui lavora il Trading Bot?",
                    "updated": 1618068321644,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¿Puedes imaginarte las implicaciones de tener este nivel de control sobre los datos administrados por el trading bot?",
                    "updated": 1624464130332,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Können Sie sich vorstellen, welche Auswirkungen es hat, wenn Sie diese Ebene der Kontrolle über die vom Trading Bot verwalteten Daten haben?",
                    "updated": 1634226677234
                },
                {
                    "language": "TR",
                    "text": "Ticaret botu tarafından yönetilen veriler üzerinde bu düzeyde bir kontrole sahip olmanın etkilerini hayal edebiliyor musun?",
                    "updated": 1636403403085
                }
            ]
        }
    ]
}