{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 6,
    "type": "Tutorial Step - Expand That Node!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "expand-structure-of-nodes"
        },
        "text": "Each node features a menu. The button on the bottom-left expands and collapses the structure of nodes below the current node.",
        "translations": [
            {
                "language": "ID",
                "text": "Setiap node memiliki menunya sendiri. Tombol dikiri bawah bisa membesar dan mengecilkan struktur dari sekumpulan nodes lainnya yang masih berada di node yang sekarang.",
                "updated": 1614424892833,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Cada nodo cuenta con un menú. El botón de la parte inferior izquierda expande y colapsa la estructura de los nodos por debajo del nodo actual.",
                "updated": 1613595237180,
                "style": "Definition"
            },
            {
                "language": "IT",
                "text": "Ogni nodo ha un menu. Il bottone in basso a sinistra espande o comprime la struttura dei nodi sotto il nodo corrente.",
                "updated": 1614713202090,
                "style": "Definition"
            },
            {
                "language": "FR",
                "text": "Chaque nœud dispose d'un menu. Le bouton situé en bas à gauche permet de développer et de réduire la structure des nœuds situés sous le nœud actuel.",
                "updated": 1623951244249,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Her düğümde bir menü bulunur. Sol altta üzerinde \"+\" simgesinin bulunduğu buton, mevcut düğümü genişletir ya da daraltır. Böylece düğümün altındaki öğelere (alt düğümlere) ulaşabilirsiniz.",
                "updated": 1644846589471,
                "style": "Definition"
            },
            {
                "language": "NL",
                "text": "Elk knooppunt heeft een menu. De knop linksonder klapt de structuur van de knooppunten onder het huidige knooppunt uit en in.",
                "updated": 1633852831708,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Jeder Knoten verfügt über ein Menü. Mit der Schaltfläche unten links können Sie die Struktur der Knoten unterhalb des aktuellen Knotens auf- und zuklappen.",
                "updated": 1634160270495,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "В каждом узле есть меню. Кнопка в левом нижнем углу раскрывает и сворачивает структуру узлов внизу текущего узла.",
                "updated": 1635509730475
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Go ahead and click the expand button!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Ayo coba dengan men-click tombol expand tersebut!",
                    "updated": 1614424924865,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Adelante, haz clic en el botón de expansión.",
                    "updated": 1613595248682,
                    "style": "Callout"
                },
                {
                    "language": "IT",
                    "text": "Prova a cliccare il bottone per espandere!",
                    "updated": 1614713217883,
                    "style": "Callout"
                },
                {
                    "language": "FR",
                    "text": "Allez-y et cliquez sur le bouton d'expansion !",
                    "updated": 1623951533708,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Devam edin ve genişlet düğmesine tıklayın!",
                    "updated": 1633267545525,
                    "style": "Callout"
                },
                {
                    "language": "NL",
                    "text": "Klik maar op de \"expand\" knop en vouw het knooppunt uit!",
                    "updated": 1633852949878,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie einfach auf die Schaltfläche \"Erweitern\"!",
                    "updated": 1634160281971,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Идите вперед и нажмите кнопку развернуть.",
                    "updated": 1635509803681
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Tutorial node has several offspring, and these have several more offspring. That's why it's a hierarchy!",
            "translations": [
                {
                    "language": "ID",
                    "text": "Node Tutorial memiliki beberapa turunan, dan setiap turunan mempunyai turunannya lagi. Itulah hirarki!",
                    "updated": 1614425111632,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "El nodo Tutorial tiene varios subnodos, y éstos tienen varios subnodos más. ¡Por eso es una jerarquía!",
                    "updated": 1613595290969,
                    "style": "Text"
                },
                {
                    "language": "IT",
                    "text": "Il nodo Tutorial ha diversi discendenti, e questi ne hanno altri a loro volta. Ecco perché é una gerarchia!",
                    "updated": 1614713286305,
                    "style": "Text"
                },
                {
                    "language": "FR",
                    "text": "Le noeud Tutorial contient plusieurs ramifications, et celles-ci possedent a leur tour plusieurs autres ramifications. C'est pourquoi il s'agit d'une hiérarchie !",
                    "updated": 1623951690741,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Öğretici (Tutorial) düğümün birkaç alt düğümü vardır ve bunların birkaç alt düğümü daha vardır.",
                    "updated": 1644846612105,
                    "style": "Text"
                },
                {
                    "language": "NL",
                    "text": "Het Tutorial knooppunt heeft meerdere sub knooppunten, en deze hebben weer meerdere knooppunten. Daarom is het een hiërarchie!",
                    "updated": 1633853126300,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Der Knoten Tutorial hat mehrere Unterknoten, und diese haben wiederum mehrere Unterknoten. Das ist der Grund, warum es eine Hierarchie ist!",
                    "updated": 1634160340549,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "У узла Tutorial есть несколько потомков и у этих потомков есть намного больше потомков. Вот почему это называется иерархией.",
                    "updated": 1635510024525
                }
            ]
        },
        {
            "style": "Note",
            "text": "Structured visual representations of information are at the core of how Superalgos administers the complexity behind flexible and scalable trading operations.",
            "translations": [
                {
                    "language": "ID",
                    "text": "Representasi visual terstruktur dari informasi merupakan inti dari cara Superalgos mengelola kompleksitas di balik aplikasi trading yang fleksibel dan dapat dikembangkan.",
                    "updated": 1614425276894,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Las representaciones visuales estructuradas de la información son el núcleo de la forma en que Superalgos administra la complejidad de las operaciones de trading flexibles y escalables.",
                    "updated": 1613595317733,
                    "style": "Note"
                },
                {
                    "language": "IT",
                    "text": "Le rappresentazioni visive strutturate di informazioni sono la chiave di come Superalgos gestisce operazioni di trading complesse, flessibili e scalabili.",
                    "updated": 1614717222097,
                    "style": "Note"
                },
                {
                    "language": "FR",
                    "text": "Les représentations visuelles structurées de l'information sont au cœur de la manière dont Superalgos gère la complexité qui sous-tend les opérations de trading flexibles et évolutives.",
                    "updated": 1623951745486,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Bilginin yapılandırılmış görsel temsilleri, Superalgos'un esnek ve ölçeklenebilir ticaret operasyonlarının arkasındaki karmaşıklığı nasıl yönettiğinin merkezinde yer alır.",
                    "updated": 1633267689476,
                    "style": "Note"
                },
                {
                    "language": "NL",
                    "text": "Gestructureerde visuele weergave van informatie vormt de kern van hoe Superalgos de complexiteit achter flexibele en schaalbare handelingen beheert.",
                    "updated": 1633890454389,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Strukturierte visuelle Darstellungen von Informationen sind das Herzstück von Superalgos, um die Komplexität hinter flexiblen und skalierbaren Handelsoperationen zu verwalten.",
                    "updated": 1634160347110,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Структурированные визуальные представления информации лежат в основе того, как Superalgos в целом выполняет торговые операции гибко и в полном масштабе.",
                    "updated": 1635510247771
                }
            ]
        }
    ]
}