{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 37,
    "type": "Tutorial Step - Talkin' Time Travel",
    "definition": {
        "icon": {
            "name": "Time\\time-machine",
            "project": "Foundations"
        },
        "text": "I mentioned earlier there are two charts in this workspace. In Superalgos, we call each of these a Time Machine.",
        "translations": [
            {
                "language": "IT",
                "text": "Poco fa ho detto che ci sono due grafici in questo workspace. In Superalgos, chiamiamo ognuno di questi grafici una Time Machine.",
                "updated": 1614847393489,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Aku telah memberitahumu duluan ada dua charts di workspace ini. Dalam Superalgos, kam memanggilnya dengan Time Machine.",
                "updated": 1616935192130,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Mencioné anteriormente que hay dos gráficos en este espacio de trabajo. En Superalgos, llamamos a cada uno de estos un Time Machine.",
                "updated": 1624381357850,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Ich habe bereits erwähnt, dass es in diesem Workspace zwei Diagramme gibt. In Superalgos nennen wir jedes dieser Diagramme eine Time Machine.",
                "updated": 1634205940397,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Daha önce bahsetmiştim, bu çalışma alanında iki çizelge var. Superalgos'ta bu çizelgelerin her birine bir Zaman Makinesi ( Time Machine ) diyoruz.",
                "updated": 1636035055393
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "A time machine may hold one Timeline Chart or more. We call them time machines because all timeline charts within a time machine are synchronized in time. This feature of time machines allows to superimpose different layers of data sharing the same Time Scale.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Una Time Machine può contenere una o più Timeline Chart. Le chiamiamo così perchè tutti i Timeline Chart in una Time Machine sono sincronizzati nel tempo. Ciò permette di sovrapporre differenti livelli di dati che usano la stessa Time Scale.",
                    "updated": 1614847651838,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Time machine akan menahan satu atau lebih Timeline Chart. Dalam time machines karena semua timeline charts dalam time machine tersingkronasi dengan waktu. Fitur time machines ini memungkinkan untuk menempatkan berbeda lapisan data dalam pembagian data di Time Scale yang sama.",
                    "updated": 1616935672320,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Un Time Machine puede tener un Timeline Chart o más. Los llamamos máquinas del tiempo porque todos los gráficos de la línea de tiempo dentro de ella están sincronizados en el tiempo. Esta característica permite superponer diferentes capas de datos compartiendo el mismo Time Scale.",
                    "updated": 1624381666829,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Eine Time Machine kann einen oder mehere Timeline Charts enthalten. Wir nennen sie Time Machines, weil alle Timeline Charts innerhalb einer Time Machine zeitlich synchronisiert sind. Diese Eigenschaft der Time Machines ermöglicht es, verschiedene Datenebenen auf derselben Time Scale zu überlagern.",
                    "updated": 1634206096721,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Bir zaman makinesi, bir veya daha fazla Zaman Çizelgesi Grafiği tutabilir. Onlara zaman makineleri diyoruz çünkü bir zaman makinesindeki tüm zaman çizelgeleri zamanla senkronize edilir. Zaman makinelerinin bu özelliği, aynı Zaman Ölçeğini paylaşan farklı veri katmanlarının üst üste binmesine izin verir.",
                    "updated": 1636035067580
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Hover your mouse pointer over the time machines!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Sposta il puntatore del mouse sopra le Time Machine!",
                    "updated": 1614847549742,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Arahkan mouse pointer kearah time machines!",
                    "updated": 1616935491446,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Pasa el mouse sobre un Time Machine!",
                    "updated": 1624406480076,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Fahren Sie mit dem Mauszeiger über die Time Machines!",
                    "updated": 1634206006623,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Fare imlecinizi zaman makinelerinin üzerine getirin!",
                    "updated": 1636035197351
                }
            ]
        },
        {
            "style": "Text",
            "text": "Notice the label emerging on the left-hand side showing which exchanges and markets the data is associated with. A single time machine may hold data from multiple markets and multiple exchanges!",
            "updated": 1610622145377,
            "translations": [
                {
                    "language": "IT",
                    "text": "Le label che spuntano da sinistra mostrano a quale exchange e market si riferiscono i dati. Una singola Time Machine può contenere dati da diversi markets e exchanges!",
                    "updated": 1614847670664,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Perhatikan label yang ada dikiri yang menyatakan exchange dan market dari data yang diasosiasikan. Satu time machine akan dapat menyimpan dari berbagai market dan lebih dari satu exchange.",
                    "updated": 1616935697836,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Observa la etiqueta emergente en el lado izquierdo que muestra a qué exchange y mercados están asociados los datos. ¡Un Time Machine puede contener datos de múltiples mercados y múltiples exchanges!",
                    "updated": 1627304357216,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Beachten Sie die Beschriftung auf der linken Seite, aus der hervorgeht, mit welchen Börsen und Märkten die Daten verbunden sind. Eine einzige Time Machine kann Daten von mehreren Märkten und mehreren Börsen enthalten!",
                    "updated": 1634206050433,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Sol tarafta beliren ve verilerin hangi borsalar ve pazarlarla ilişkili olduğunu gösteren etikete dikkat edin. Tek bir zaman makinesi birden fazla pazardan ve birden fazla borsadan veri tutabilir!",
                    "updated": 1636035233840
                }
            ]
        }
    ]
}