{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 81,
    "type": "Tutorial Step - Simplifying Complexity",
    "definition": {
        "icon": {
            "name": "trading-system",
            "project": "Algorithmic-Trading"
        },
        "text": "We haven't discussed trading systems as a framework, but a feature relevant to this explanation is that they may handle multiple strategies.",
        "translations": [
            {
                "language": "IT",
                "text": "Non abbiamo discusso dei Trading System come dei framework, ma un feature di rilievo in questo senso è che possono gestire diverse strategie.",
                "updated": 1618065765945,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "No hemos hablado de los Trading Systems como un marco, pero una característica relevante para esta explicación es que pueden manejar múltiples estrategias.",
                "updated": 1624460329052,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wir haben noch nicht über Handelssysteme als Rahmenwerk gesprochen, aber ein für diese Erklärung relevantes Merkmal ist, dass sie mehrere Strategien handhaben können.",
                "updated": 1634225842126
            },
            {
                "language": "TR",
                "text": "Ticaret sistemlerini bir çerçeve olarak anlattık, ancak bu açıklamayla ilgili bir hatılatma : bir tiacaret sistemi birden fazla stratejiyi ele alabilir.",
                "updated": 1636210282829
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Each strategy features an Open Stage and a Close Stage, each with its own execution definitions. Each stage may feature multiple execution algorithms, and each algorithm may handle multiple orders.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ogni strategia ha un Open Stage e un Close Stage, ognuno dei quali ha i propri metodi di esecuzione. Ogni stage può avere diversi execution algorithms e ognuno di questi può gestire vari ordini.",
                    "updated": 1618065861963,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Cada estrategia presenta un Open Stage y un Close Stage, cada uno con sus propias definiciones de ejecución. Cada etapa puede presentar múltiples algoritmos de ejecución y cada algoritmo puede manejar múltiples órdenes.",
                    "updated": 1624460372216,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Jede Strategie verfügt über eine Open Stage und eine Close Stage, die jeweils eigene Ausführungsdefinitionen haben. Jede Phase kann mehrere Ausführungsalgorithmen enthalten, und jeder Algorithmus kann mehrere Aufträge verarbeiten.",
                    "updated": 1634225846386
                },
                {
                    "language": "TR",
                    "text": "Her strateji, her biri kendi yürütme tanımlarına sahip bir Açık Aşama ( Open Stage ) ve bir Kapatma Aşaması ( Close Stage ) içerir. Her aşama birden fazla yürütme algoritması içerebilir ve her algoritma birden fazla siparişi işleyebilir.",
                    "updated": 1636210854492
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Do you see the pattern? We call it granularity.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Riesci a vedere lo schema? Noi lo chiamiamo granularità.",
                    "updated": 1618065885044,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¿Ves el patrón? Lo llamamos granularidad.",
                    "updated": 1624460392079,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Erkennen Sie das Muster? Wir nennen es Granularität.",
                    "updated": 1634225855936
                },
                {
                    "language": "TR",
                    "text": "Kalıbı görüyor musun? Biz buna ayrıntı düzeyi diyoruz.",
                    "updated": 1636210976648
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos breaks down each issue to the minimum expression, and integrates the solutions. This is how it allows you to design, deploy, and manage both simple and the most complex trading setups you may envision.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Superalgos decompone ogni problema al minimo, e integra le soluzioni. In questo modo ti permette di progettare, rilasciare e gestire ogni tipo di trading setup, semplice o complesso, che vuoi implementare!",
                    "updated": 1618065967425,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Superalgos desglosa cada tema a la mínima expresión e integra las soluciones. Así es como le permite diseñar, implementar y administrar configuraciones de trading tan simples y tan complejas como puedas imaginar.",
                    "updated": 1624460510159,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Superalgos bricht jedes Problem auf den kleinsten Ausdruck herunter und integriert die Lösungen. Auf diese Weise können Sie sowohl einfache als auch die komplexesten Handels-Setups entwerfen, einsetzen und verwalten, die Sie sich vorstellen können.",
                    "updated": 1634225869664
                },
                {
                    "language": "TR",
                    "text": "Superalgos, her konuyu minimum ifadeye ayırır ve çözümleri bütünleştirir. Bu şekilde hem basit hem de hayal edebileceğiniz en karmaşık ticaret kurulumlarını tasarlamanıza, dağıtmanıza ve yönetmenize olanak tanır.",
                    "updated": 1636210999536
                }
            ]
        }
    ]
}