{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 2,
    "type": "Tutorial Step - Pick Your Language",
    "definition": {
        "text": "Users are contributing translations so that you may choose your preferred language! This Community is awesome!",
        "updated": 1619801502482,
        "icon": {
            "name": "Languages\\EN",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "FR",
                "text": "Les utilisateurs contribuent aux traductions afin que vous puissiez choisir votre langue préférée ! Cette communauté est géniale !",
                "updated": 1623947311364,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "¡Los usuarios están contribuyendo con traducciones para que puedas elegir tu idioma preferido! ¡Esta comunidad es increíble!",
                "updated": 1625927584664,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Kullanıcılar, tercih ettiğiniz dili seçebilmeniz için çevirilere katkıda bulunuyor! Bu Topluluk harika!",
                "updated": 1633120577362
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This is how it works: the default language is English. If you choose any other language and there is a translation for the current page, then you get it in the selected language. Otherwise, you get it in English!",
            "updated": 1619801342624,
            "translations": [
                {
                    "language": "FR",
                    "text": "Voici comment cela fonctionne : la langue par défaut est l'anglais. Si vous choisissez une autre langue et qu'il existe sa traduction, vous l'obtenez, sinon, elle apparaitra en anglais !",
                    "updated": 1623947447536,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Así es como funciona: el idioma predeterminado es el inglés. Si eliges cualquier otro idioma y hay una traducción para la página actual, la obtendrás en el idioma seleccionado. De lo contrario en inglés.",
                    "updated": 1627240786626,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Bu nasıl çalışır? Varsayılan dil İngilizce'dir. Başka bir dil seçerseniz ve mevcut sayfa için bir herhangi bir dilde çeviri varsa, onu sayfanın aşağısındaki bayraklara tıklaarak seçtiğiniz dilde görüntülersiniz. Eğer çeviri yoksa,İngilizce olarak görürsünüz1",
                    "updated": 1633120762865
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Use the mouse wheel to scroll the page on the right downwards. Click on a flag to change the preferred language, if so you wish!",
            "updated": 1619803411650,
            "translations": [
                {
                    "language": "FR",
                    "text": "Utilisez la molette de la souris pour faire défiler la page de droite vers le bas. Cliquez sur un drapeau pour changer la langue préférée, si vous le souhaitez !",
                    "updated": 1623947515076,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Utiliza la rueda del mouse para desplazarte por la página de la derecha hacia abajo. Haz clic en una bandera para cambiar el idioma preferido, si así lo deseas.",
                    "updated": 1627241034008,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Sayfayı aşağı kaydırmak için fare tekerleğini kullanın. Dilerseniz tercih ettiğiniz dili değiştirmek için bir bayrağa tıklayın!",
                    "updated": 1633120795496
                }
            ]
        },
        {
            "style": "Note",
            "text": "Only the Docs and tutorials may be translated, not the interface, nor titles!",
            "updated": 1619804204225,
            "translations": [
                {
                    "language": "FR",
                    "text": "Note : Seuls les docs et les tutoriels peuvent être traduits, pas l'interface, ni les titres !",
                    "updated": 1623947561329,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "¡Solo se pueden traducir los documentos y los tutoriales, no la interfaz ni los títulos!",
                    "updated": 1625928204688,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Arayüz veya başlıklar değil, yalnızca Dokümanlar ve öğreticiler çevrilebilir!",
                    "updated": 1633121237275
                }
            ]
        }
    ]
}