{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 40,
    "type": "Tutorial Step - Putting Things in Order",
    "definition": {
        "icon": {
            "name": "Mouse\\hand-drag",
            "project": "Foundations"
        },
        "text": "One more thing before we dive into the charts. You need to know how to put the house in order!",
        "translations": [
            {
                "language": "IT",
                "text": "Un'ultima cosa prima di tuffarci nei grafici. Devi sapere come tenere il tuo regno in ordine!",
                "updated": 1614848223577,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Satu hal lagi sebelum kita lebih dalam ke charts. Kamu harus tahu bagaimana menata suatu tempat!",
                "updated": 1616948198296,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Una cosa más antes de sumergirnos en los gráficos. ¡Necesitas saber cómo poner la casa en orden!",
                "updated": 1624383691146,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Bevor wir in die Tabellen eintauchen, noch eine Sache. Sie müssen wissen, wie Sie das Haus in Ordnung bringen können!",
                "updated": 1634206589741,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Tablolara girmeden önce bir şey daha var. Bu alanı nasıl düzene sokacağını bilmelisin!",
                "updated": 1636035747714
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The time will come in which you may be working with tens of charts. You already know how to change their format. Now you need to learn how to move them around so that you may create whatever arrangements you require. It's quite easy:",
            "translations": [
                {
                    "language": "IT",
                    "text": "Arriverà il momento in cui potresti dover lavorare con decine di grafici contemporaneamente. Sai già come modificare il loro formato. Ora devi imparare come spostarli in modo da configurarli esattamente come vuoi tu. Tranquillo, è facile: ",
                    "updated": 1618647123812,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Waktunya akan tiba dimana kamu mungkin bekerja dengan puluhan chart. Kamu sudah tahu cara mengubah formatnya. Sekarang kamu perlu mempelajari cara memindahkannya sehingga bisa membuat pengaturan apa pun dibutuhkan. Cukup mudah dengan:",
                    "updated": 1616948323131,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Llegará el momento en que quizás estes trabajando con decenas de gráficos. Ya sabes cómo cambiar su formato. Ahora necesita aprender a moverlos para poder crear los arreglos que necesite. Es bastante sencillo:",
                    "updated": 1624383763312,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Es wird die Zeit kommen, in der Sie vielleicht mit Dutzenden von Diagrammen arbeiten werden. Sie wissen bereits, wie Sie deren Format ändern können. Jetzt müssen Sie lernen, wie Sie die Diagramme verschieben können, damit Sie die gewünschten Arrangements erstellen können. Das ist ganz einfach:",
                    "updated": 1634206671224,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Onlarca çizelge ile çalışmanız gereken zamanar gelecek. Biçimlerini nasıl değiştireceğinizi öğrenmiştik. Şimdi, ihtiyaç duyduğunuz düzenlemeleri oluşturabilmeniz için onları nasıl hareket ettireceğinizi öğrenmeniz gerekiyor. Oldukça kolay:",
                    "updated": 1636035803888
                }
            ],
            "updated": 1616416902513
        },
        {
            "style": "Callout",
            "text": "Hit Shift, left-click, and drag!",
            "updated": 1610622311803,
            "translations": [
                {
                    "language": "IT",
                    "text": "Premi Shift, clicca con il tasto sinistro e trascina!",
                    "updated": 1614848320456,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Tekan Shift, Click-kiri, dan drag!",
                    "updated": 1616948350330,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Pulsa Shift, clic con el botón izquierdo y arrastra!",
                    "updated": 1624494466055,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Drücken Sie die Shift, klicken Sie mit der linken Maustaste, und ziehen Sie!",
                    "updated": 1634206723517,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Shift 'e basın, sol tıklayın ve sürükleyin!",
                    "updated": 1636035874767
                }
            ]
        },
        {
            "style": "Success",
            "text": "I believe we've covered everything about how to manage the charting space. It's time to dive into the charts!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Bene, direi che abbiamo coperto tutto ciò che serve per configurare il Charting Space. È ora di tuffarci tra i grafici!",
                    "updated": 1614848393942,
                    "style": "Success"
                },
                {
                    "language": "ID",
                    "text": "Aku yakin kita telah membahas segalanya tentang cara mengelola charting space. Saatnya menuju ke chart!",
                    "updated": 1616948406170,
                    "style": "Success"
                },
                {
                    "language": "ES",
                    "text": "Creo que hemos cubierto todo sobre cómo administrar Charting Space. ¡Es hora de sumergirse en los gráficos!",
                    "updated": 1624383921501,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Ich glaube, wir haben jetzt alles über die Verwaltung des Charting Space gesagt. Jetzt ist es Zeit, in die Diagramme einzutauchen!",
                    "updated": 1634206736658,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "Grafik alanını nasıl yöneteceğimizle ilgili her şeyi ele aldığımıza inanıyorum. Grafiklere dalmanın zamanı geldi!",
                    "updated": 1636035867318
                }
            ]
        }
    ]
}