{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 35,
    "type": "Tutorial Step - At the Core of Data Mining",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "task"
        },
        "text": "The core of a data mining operation are tasks running bots. One Task controls one bot, and a Task Manager may control multiple tasks.",
        "translations": [
            {
                "language": "IT",
                "text": "Il cuore di un'operazione di data mining è composto da tasks che eseguono vari bots. Una Task controlla un bot, e un Task Manager controlla varie tasks.",
                "updated": 1614845644365,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Inti dari data mining operation adalah tasks yang berjalan di bot. Satu task mengontrol satu bot, dan Task Manager akan menkontrol banyak tasks.",
                "updated": 1616771548832,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "El núcleo de una operación de minería de datos son los bots ejecutando tareas. Un bot  controla una tarea y un Task Manager  puede controlar varias tareas.",
                "updated": 1624326081038,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Das Herzstück einer Data-Mining-Operation sind Tasks, die Bots ausführen. Ein Task steuert einen Bot, und ein Task Manager kann mehrere Tasks steuern.",
                "updated": 1634168469674,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Bir veri madenciliği operasyonunun çekirdeğini botları çalıştıran görevler oluşturur. Bir Görev bir botu kontrol eder ve bir Görev Yöneticisi (Task Manager) birden fazla görevi kontrol edebilir.",
                "updated": 1669838101714
            },
            {
                "language": "RU",
                "text": "Основу процесса добычи данных составляют задачи Task, управляющие ботами. Одна задача управляет одним ботом, а менеджер задач (Task Manager) может управлять несколькими задачами",
                "updated": 1641810257263
            },
            {
                "language": "NL",
                "text": "De kern van een datamijn operatie bestaat uit taken van bots. Eén Task beheerd één bot, een Task Manager kan meerdere taken beheren.",
                "updated": 1637498357325
            },
            {
                "language": "FR",
                "text": "Le cœur d'une opération de minage de données est constitué de bots exécutant des tâches . Une tâche gère un bot, et un Task Manager peut gérer plusieurs tâches.",
                "updated": 1667987329064
            },
            {
                "language": "PL",
                "text": "Rdzeniem operacji gromadzenia danych są zadania uruchamiające boty. Jeden Task kontroluje jednego bota, a Task Manager może kontrolować wiele Task.",
                "updated": 1675077682248
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "By now you've learned about six different devices that you may use to control each bot in your data mining operation. At the highest level, the Data Tasks node controls all data mining bots in the LAN Network Node.",
            "updated": 1640358469790,
            "translations": [
                {
                    "language": "IT",
                    "text": "Finora hai imparato di sei differenti strumenti che puoi usare per controllare i bot nella tua operazione di data mining. A un livello superiore, il nodo Data Tasks controlla tutti i data mining bots nel Network Node.",
                    "updated": 1614845713171,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Sekarang kamu memperlajari tentang enam perangkat berbeda yang dapat mengontrol setiap bot pada data mining operation. Level tertinggi, Data Tasks node mengontrol semua data mining bot di Network Node.",
                    "updated": 1616771757301,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Por ahora has aprendido acerca de seis diferentes dispositivos que puedes usar para controlar cada bot en tu operación de minería de datos. En el nivel más alto, el nodo de Tareas de Datos controla todos los bots de minería de datos en el LAN Network Node.",
                    "updated": 1675207969705,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Inzwischen haben Sie sechs verschiedene Geräte kennengelernt, die Sie zur Steuerung der einzelnen Bots in Ihrem Data Mining-Betrieb verwenden können. Auf der höchsten Ebene steuert der Knoten Data Tasks alle Data-Mining-Bots im LAN-Netzwerkknoten.",
                    "updated": 1642150974844,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Şimdiye kadar, veri madenciliği operasyonunuzdaki her bir botu kontrol etmek için kullanabileceğiniz altı farklı cihaz hakkında bilgi edindiniz. En üst düzeyde, Veri Görevleri (Data Tasks) düğümü, LAN Network Node düğümü'ndeki tüm veri madenciliği botlarını kontrol eder. ",
                    "updated": 1644909959448
                },
                {
                    "language": "RU",
                    "text": "К этому моменту вы уже узнали о шести различных устройствах, которые можно использовать для управления каждым ботом в вашей работе по добыче данных. На самом высшем уровне узел Data Tasks управляет всеми ботами по добыче данных в узле LAN Network.",
                    "updated": 1641810345063
                },
                {
                    "language": "NL",
                    "text": "Inmiddels heb je geleerd over zes verschillende apparaten die je kunt gebruiken om elke bot in je datamining-operatie te besturen. Op het hoogste niveau bestuurt het Data Tasks knooppunt alle datamining-bots in de LAN Network Node.",
                    "updated": 1666615875912
                },
                {
                    "language": "FR",
                    "text": "Vous avez maintenant appris à connaître six dispositifs différents que vous pouvez utiliser pour contrôler chaque robot de votre opération d'exploration de données. Au niveau le plus élevé, le nœud Data Tasks contrôle tous les bots de minages de données dans le nœud LAN Network.",
                    "updated": 1667987404623
                },
                {
                    "language": "PL",
                    "text": "Do tej pory poznałeś już sześć różnych sposobów, które możesz wykorzystać do sterowania każdym botem w operacji gromadzenia danych. Na najwyższym poziomie węzeł Task Manager kontroluje wszystkie boty gromadzące dane w węźle LAN Network.",
                    "updated": 1675077844989
                }
            ]
        },
        {
            "style": "Callout",
            "text": "We'll talk about network nodes in a minute...",
            "translations": [
                {
                    "language": "IT",
                    "text": "Parleremo dei network nodes tra un attimo...",
                    "updated": 1614845732408,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Mari berbicara tentang network node beberapa menit...",
                    "updated": 1616771716245,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Hablaremos de los nodos del Network en un minuto...",
                    "updated": 1624326257421,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Wir werden in einer Minute über Netzwerkknoten sprechen...",
                    "updated": 1634168496945,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Ağ düğümleri hakkında birazdan konuşacağız...",
                    "updated": 1636015240381
                },
                {
                    "language": "RU",
                    "text": "Мы поговорим о сетевых узлах через минуту...",
                    "updated": 1636193625683
                },
                {
                    "language": "NL",
                    "text": "We gaan de netwerk nodes zodadelijk bespreken...",
                    "updated": 1637499364707
                },
                {
                    "language": "FR",
                    "text": "Nous parlerons des nœuds du réseau dans une minute...",
                    "updated": 1667987435507
                },
                {
                    "language": "PL",
                    "text": "O węzłach sieci porozmawiamy za chwilę...",
                    "updated": 1675077872636
                }
            ]
        },
        {
            "style": "Text",
            "text": "At the lowest level, an individual Task controls a single bot. The nodes in between are organizational nodes that help keep the operation in order, and allow granular control over the different sections.",
            "updated": 1610614976513,
            "translations": [
                {
                    "language": "IT",
                    "text": "Al livello più basso, una singola Task controlla un singolo bot. I nodi nel mezzo hanno scopo organizzativo e aiutano a mantenere un ordine tra le operazioni, permettendo un controllo granulare sulle differenti fasi.",
                    "updated": 1614845793674,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Dilevel terendal, setiap individu task mengontrol satu bot. Pada node diantara organizational nodes untuk  menjaga operasi tetap teratur, dan memungkinkan kontrol granular di bagian yang berbeda.",
                    "updated": 1616773259033,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "En el nivel más bajo, un Task individual controla un solo bot. Los nodos intermedios son nodos organizativos que ayudan a mantener la operación en orden y permiten un control granular sobre las diferentes secciones.",
                    "updated": 1624377345331,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Auf der untersten Ebene steuert ein einzelner Task einen einzelnen Bot. Die Knoten dazwischen sind Organisationsknoten, die für Ordnung sorgen und eine detaillierte Kontrolle über die verschiedenen Bereiche ermöglichen.",
                    "updated": 1634168505425,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "En alt düzeyde, tek bir Görev (Task), tek bir botu kontrol eder. Aradaki düğümler, operasyonu düzenli tutmaya yardımcı olan ve farklı bölümler üzerinde ayrıntılı kontrol sağlayan organizasyonel düğümlerdir.",
                    "updated": 1669838159479
                },
                {
                    "language": "RU",
                    "text": "На самом низком уровне отдельная задача Task управляет одним ботом. Промежуточные узлы - это организационные узлы, которые помогают поддерживать порядок в работе и позволяют осуществлять детальный контроль над различными разделами.",
                    "updated": 1641810401098
                },
                {
                    "language": "NL",
                    "text": "Op het laagste niveau, beheerd een individuele Task een enkele bot. De tussenliggende nodes zijn organisatorische nodes om orde in de operatie te houden en granulaire controle over de verschillende secties bieden.",
                    "updated": 1637499812865
                },
                {
                    "language": "FR",
                    "text": "Au niveau le plus bas, une tâche individuelle contrôle un seul bot. Les nœuds intermédiaires sont des nœuds d'organisation qui aident à maintenir l'ordre dans l'opération et permettent un contrôle granulaire des différentes sections.",
                    "updated": 1667987475254
                },
                {
                    "language": "PL",
                    "text": "Na najniższym poziomie, pojedynczy Task kontroluje pojedynczego bota. Węzły pomiędzy nimi to węzły pomocnicze, które porządkują operacje i umożliwiają kontrolę nad poszczególnymi sekcjami.",
                    "updated": 1675077999743
                }
            ]
        }
    ]
}