{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 26,
    "type": "Tutorial Step - Broke Something?",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "workspace"
        },
        "text": "If you ever break something&mdash;like deleting a node or changing a configuration&mdash;and don't know how to deal with the outcome...",
        "translations": [
            {
                "language": "IT",
                "text": "Se ti capiterà mai di rompere qualcosa (per esempio cancellare un nodo o cambiare una configurazione) e non sai come sistemare...",
                "updated": 1614791180230,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Jika kamu merusak sesuatu seperti menghapus node atau merubah konfigurasi dan tidak tahu cara untuk menghadapinya...",
                "updated": 1616770121960,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Si alguna vez rompes algo -como borrar un nodo por error o cambiar la configuración- y no sabes cómo afrontar el resultado...",
                "updated": 1618438157553,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Wenn Sie einmal etwas kaputt machen - wie das Löschen eines Knotens oder das Ändern einer Konfiguration - und nicht wissen, wie Sie mit dem Ergebnis umgehen sollen...",
                "updated": 1634166459683,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Если Вы когда-нибудь что-то нарушили, например, удалили узел или изменили конфигурацию и не знаете, как дальше действовать...",
                "updated": 1635627557596,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Bir düğümü silmek veya bir konfigürasyonu değiştirmek gibi bir şeyi bozarsanız ve sonuçla nasıl başa çıkacağınızı bilmiyorsanız...",
                "updated": 1636013094366
            },
            {
                "language": "NL",
                "text": "Als er iets mis gaat—zoals het verwijderen of de configuratie van een node veranderen—en je komt er niet meer uit...",
                "updated": 1636977985207
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "... you may easily start over with the original Getting Started Tutorials Plugin Workspace!",
            "translations": [
                {
                    "language": "IT",
                    "text": "...c'è un modo semplice di ricominciare con un nuovo workspace!",
                    "updated": 1614791206441,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "... ada cara mudah untuk memulai kembali dengan workspace baru!",
                    "updated": 1616770151572,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "¡Puedes volver a empezar fácilmente con los tutoriales de introducción originales en el Workspace!",
                    "updated": 1624292407924,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "... können Sie ganz einfach mit dem ursprünglichen Getting Started Tutorials Plugin Workspace neu beginnen!",
                    "updated": 1634166463236,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "... Вы можете легко начать все сначала с исходного рабочего пространства Getting Started Tutorials Plugin Workspace!",
                    "updated": 1635628049167,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "... orijinal Getting Started Tutorials Plugin Workspace! ile kolayca baştan başlayabilirsiniz!...",
                    "updated": 1636013152834
                },
                {
                    "language": "NL",
                    "text": "... start je simpelweg opnieuw met de originele Getting Started Tutorials Plugin Workspace!",
                    "updated": 1636978022861
                }
            ],
            "updated": 1622196973760
        },
        {
            "style": "Text",
            "text": "In such a case, just pull the tab on the left-hand side, scroll, find the Getting Started Tutorials plugin, and click it! The original Plugin Workspace will load and the tutorial will show up again, fresh from the start!",
            "translations": [
                {
                    "language": "IT",
                    "text": "Tutto ciò che devi fare è tirare la tab sul lato sinistro dello schermo e cliccare sul plugin workspace Getting-Started.",
                    "updated": 1614791245119,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "yang kamu butuhkan yaitu menarik tab yang ada di sisi kiri dari layarmu dan click pada Getting-Started plugin workspace.",
                    "updated": 1616770232356,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Todo lo que tienes que hacer es tirar de la pestaña de la izquierda de la pantalla y hacer clic en Getting-Started plugin workspace.",
                    "updated": 1618438234984,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie am linken Rand auf \"Workspaces\", suchen und klicken Sie auf das \"Getting Started Tutorials Plugin\"! Der ursprüngliche Plugin Workspace wird geladen und das Tutorial beginnt von neuem.",
                    "updated": 1634166835790,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "В таком случае просто потяните вкладку с левой стороны, прокрутите, найдите плагин Getting Started Tutorials  и нажмите на него! Загрузится исходный Plugin Workspace и учебное пособие появится снова, с самого начала!",
                    "updated": 1635629001422,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Böyle bir durumda, sol taraftaki sekmeyi çekin, kaydırın, Getting Started Tutorials Plugin'i bulun ve tıklayın! Orijinal Eklenti Çalışma Alanı ( Plugin Workspace ) yüklenecek ve öğretici, baştan yeni bir şekilde yeniden görünecek!",
                    "updated": 1636013239148
                },
                {
                    "language": "NL",
                    "text": "in zo'n geval open je de tab aan de linkerkant, scroll en zoek de Getting Started Tutorials plugin, en klik er op! De originele Plugin Workspace zal laden en de tutorial zal herstarten vanaf het begin.",
                    "updated": 1636978208217
                }
            ],
            "updated": 1622634394712
        },
        {
            "style": "Success",
            "text": "Plugin Workspaces ship with the system. Let's see how you can make them your own, or create new workspaces!",
            "updated": 1629802595052,
            "translations": [
                {
                    "language": "ES",
                    "text": "Plugin Workspaces son los primeros en la lista con un fondo negro. Luego viene la lista de espacios de trabajo de usuarios, sobre un fondo violeta.",
                    "updated": 1624292101033,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Plugin-Workspaces gehören zum Lieferumfang. Sie können diese zu Ihrem eigenen machen oder neue Arbeitsbereiche erstellen.",
                    "updated": 1634166969189,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Plugin Workspaces поставляются вместе с системой. Давайте посмотрим, как вы можете сделать их своими собственными или создать новые рабочие пространства!",
                    "updated": 1635629610043,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "Eklenti Çalışma Alanları ( Plugin Workspaces ) sistemle birlikte gönderilir. Şimdi bunları nasıl kendinize ait hale getirebileceğinizi veya yeni çalışma alanları oluşturabileceğinizi görelim!",
                    "updated": 1636013279897
                },
                {
                    "language": "NL",
                    "text": "Plugin Workspaces horen bij het systeem, laten we eens kijken of je ze eigen kan maken of zelfs nieuwe kan creëeren!",
                    "updated": 1636978365070
                }
            ]
        }
    ]
}