{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 83,
    "type": "Tutorial Step - Find the Node Challenge",
    "definition": {
        "icon": {
            "name": "trading-engine",
            "project": "Algorithmic-Trading"
        },
        "text": "The Trading Engine administers the complexity entailed in automated trading by making information accessible to users and trading systems.",
        "translations": [
            {
                "language": "IT",
                "text": "Il Trading Engine gestisce la complessità del trading automatico rendendo le informazioni accessibili agli utenti e ai sistemi di trading.",
                "updated": 1618067277865,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "El Trading Engine administra la complejidad que conlleva el trading automatizado al hacer que la información sea accesible para usuarios y Trading Systems.",
                "updated": 1627315125748,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Die Trading Engine verwaltet die Komplexität, die der automatisierte Handel mit sich bringt, indem sie Informationen für Benutzer und Handelssysteme zugänglich macht.",
                "updated": 1634226103084
            },
            {
                "language": "TR",
                "text": "Alım Satım Motoru ( Trading Engine ), bilgileri kullanıcılar ve alım satım sistemleri için erişilebilir hale getirerek otomatik alım satımın gerektirdiği karmaşıklığı yönetir.",
                "updated": 1636211481328
            },
            {
                "language": "ID",
                "text": "The Trading Engine mengelola kompleksitas yang disyaratkan dalam automated trading dengan membuat informasi dapat diakses oleh pengguna dan trading systems.",
                "updated": 1640566966022
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Remember my comments about granularity? Remember how the formula on the trading system fetched the value of the exit target rate? Here's a quick reminder:",
            "updated": 1622228180200,
            "translations": [
                {
                    "language": "IT",
                    "text": "Ricordi i miei commenti sulla granularità? Ricordi come la formula del trading system prendeva il valore dell'Exit Target Rate? Ecco un promemoria:",
                    "updated": 1618067378217,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¿Recuerdas mis comentarios sobre la granularidad? ¿Cómo la fórmula del Trading System obtuvo el valor de la tasa objetivo de salida? Recordatorio rápido:",
                    "updated": 1624461423083,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Erinnern Sie sich an meine Bemerkungen zur Granularität? Erinnern Sie sich daran, wie die Formel des Handelssystems den Wert des Exit-Zielkurses ermittelt hat? Hier ist eine kurze Erinnerung:",
                    "updated": 1634226111996
                },
                {
                    "language": "TR",
                    "text": "Ayrıntı düzeyi hakkındaki yorumlarımı hatırlıyor musunuz? Ticaret sistemindeki formülün çıkış hedef oranının değerini nasıl aldığını hatırlıyor musunuz? İşte kısa bir hatırlatma:",
                    "updated": 1636211506020
                },
                {
                    "language": "ID",
                    "text": "Ingat komentar saya tentang granularity? Ingat bagaimana formula pada trading system mengambil nilai dari exit target rate? Ini pengingat singkat :",
                    "updated": 1640567056696
                }
            ]
        },
        {
            "style": "Json",
            "text": "tradingEngine.tradingCurrent.position.exitTargetRate.value"
        },
        {
            "style": "Callout",
            "text": "This string holds the path to that piece of information in the data structure of the Trading Engine hierarchy! Can you find the Exit Target Rate node? Expand the hierarchy and follow the breadcrumb trail!",
            "updated": 1616429836465,
            "translations": [
                {
                    "language": "IT",
                    "text": "Questa stringa contiene il percorso a quel dato nel contesto della struttura della gerarchia del Trading Engine! Riesci a trovare il nodo dell'Exit Target Rate? Espandi la gerarchia e seguila!",
                    "updated": 1618067490282,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Esta cadena contiene la ruta a esa pieza de información en la estructura de datos de la jerarquia Trading Engine! ¿Puedes encontrar el nodo Exit Target Rate? ¡Expande la jerarquía y sigue el rastro de migas de pan!",
                    "updated": 1624461765098,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Dieser String enthält den Pfad zu dieser Information in der Datenstruktur der Trading Engine Hierarchie! Können Sie den Knoten Exit Target Rate finden? Erweitern Sie die Hierarchie und folgen Sie dem Brotkrumen-Pfad!",
                    "updated": 1634226148267
                },
                {
                    "language": "TR",
                    "text": "Bu dizi, Trading Engine hiyerarşisinin veri yapısındaki o bilgi parçasının yolunu tutar! Çıkış Hedef Hızı ( Exit Target Rate ) düğümünü bulabilir misiniz? Hiyerarşiyi genişletin ve izini takip edin!",
                    "updated": 1636211761179
                },
                {
                    "language": "ID",
                    "text": "String ini memegang jalur ke informasi itu dalam data structure dari Trading Engine hierarchy! Bisakah kamu menemukan  Exit Target Rate node? Expand hierarki dan ikuti breadcrumb trail!",
                    "updated": 1640567181383
                }
            ]
        }
    ]
}