{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 43,
    "type": "Tutorial Step - Moving in Wonderland",
    "definition": {
        "icon": {
            "name": "Mouse\\mouse-left-click",
            "project": "Foundations"
        },
        "text": "So, you are finally inside a chart. The first thing you'll want to do is move around and learn what these charts may do for you.",
        "translations": [
            {
                "language": "IT",
                "text": "Ecco, sei finalmente dentro un grafico. La prima cosa che vorrai fare sarà farci un giro e imparare cosa può fare per te.",
                "updated": 1614893263479,
                "style": "Definition"
            },
            {
                "language": "ID",
                "text": "Akhirnya kamu berada didalam chart. Hal pertama yang harus dilakukan yaitu adalah berpindah-pindah dan mempelajari apa yang dapat dilakukan bagan ini untukmu.",
                "updated": 1616949419191,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Entonces, finalmente estás dentro de un gráfico. Lo primero que querrás hacer es moverte y aprender qué pueden hacer estos gráficos por ti.",
                "updated": 1624404419428,
                "style": "Definition"
            },
            {
                "language": "DE",
                "text": "Sie befinden sich also endlich in einem Diagramm. Das erste, was Sie tun möchten, ist, sich zu bewegen und zu lernen, was diese Diagramme für Sie tun können.",
                "updated": 1634216714226
            },
            {
                "language": "TR",
                "text": "Sonunda bir grafiğin içindesiniz. Yapmak isteyeceğiniz ilk şey, etrafta dolaşmak ve bu çizelgelerin sizin için neler yapabileceğini öğrenmek.",
                "updated": 1636092060224
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Let's get on with that! Like in the design space&mdash;when inside a time machine&mdash;you move by using your mouse and your keyboard. This is how:",
            "translations": [
                {
                    "language": "IT",
                    "text": "Facciamolo subito! Proprio come nel Design Space, puoi muoverti usando mouse e tastiera. Ecco come:",
                    "updated": 1614893324158,
                    "style": "Text"
                },
                {
                    "language": "ID",
                    "text": "Mari menuju kesana! Seperti di design space—saat berada didalam time machine—kamu bergerak dengan menggunakan mouse dan keyboard. Begini caranya:",
                    "updated": 1616949477545,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "¡Sigamos con esto! Como en el espacio de diseño, cuando estas dentro de una máquina del tiempo, se mueve usando el mouse y el teclado. Así es como:",
                    "updated": 1624404511697,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Fangen wir damit an! Wie im Designbereich - wenn Sie sich in einer Time Machine befinden - bewegen Sie sich mit Hilfe Ihrer Maus und Ihrer Tastatur. So geht's:",
                    "updated": 1634216711619
                },
                {
                    "language": "TR",
                    "text": "Bununla devam edelim! Tasarım alanında olduğu gibi, bir zaman makinesinin içindeykende farenizi ve klavyenizi kullanarak hareket edersiniz. Nasıl?",
                    "updated": 1636092104788
                }
            ]
        },
        {
            "style": "Callout",
            "text": "With the mouse, left-click and drag. With the keyboard, use the arrow keys: ← → ↑ ↓",
            "translations": [
                {
                    "language": "IT",
                    "text": "Con il mouse, fai click con il tasto sinistro e trascina. Con la tastiera, usa le frecce: ← → ↑ ↓",
                    "updated": 1614893357947,
                    "style": "Callout"
                },
                {
                    "language": "ID",
                    "text": "Dengan mouse, click-kiri dan drag. Dengan keyboard, gunakan panah: ← → ↑ ↓",
                    "updated": 1616949524257,
                    "style": "Callout"
                },
                {
                    "language": "ES",
                    "text": "Con el mouse, haz clic con el botón izquierdo y arrastra. Con el teclado, use las teclas de flecha: ← → ↑ ↓",
                    "updated": 1627304690713,
                    "style": "Callout"
                },
                {
                    "language": "DE",
                    "text": "Mit der Maus klicken Sie mit der linken Maustaste und ziehen. Mit der Tastatur benutzt du die Pfeiltasten: ← → ↑ ↓",
                    "updated": 1634216728013
                },
                {
                    "language": "TR",
                    "text": "Fare ile sol tıklayın ve sürükleyin. Klavye ile ok tuşlarını kullanın: ← → ↑ ↓",
                    "updated": 1636092129919
                }
            ]
        },
        {
            "style": "Note",
            "text": "What? It's not working? Are you stuck with a frozen chart? Like in the video on the next step? Don't worry! I know what's going on...",
            "translations": [
                {
                    "language": "IT",
                    "text": "Come? Non funziona? Il grafico resta fermo? Proprio come nel video nel prossimo step? Ah, non preoccuparti! Lo so io cosa sta succedendo...",
                    "updated": 1614893399468,
                    "style": "Note"
                },
                {
                    "language": "ID",
                    "text": "Apa? Tidak bekerja? Apa kamu tersangkut dengan chart yang ngefreeze? Step video distep berikutnya? Jangan khawatir! Aku tahu apa yang terjadi...",
                    "updated": 1616949623092,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "¿Qué? ¿No funciona? ¿Estás atrapado con un gráfico congelado? ¿Como en el video sobre el siguiente paso? Sé lo que está pasando...",
                    "updated": 1627258765795,
                    "style": "Note"
                },
                {
                    "language": "DE",
                    "text": "Was? Es funktioniert nicht? Bleiben Sie mit einem eingefrorenen Diagramm hängen? Wie im Video im nächsten Schritt? Keine Sorge! Ich weiß, was hier los ist...",
                    "updated": 1634216736257
                },
                {
                    "language": "TR",
                    "text": "Ne? Çalışmıyor mu? Donmuş bir çizelgeye mi takıldınız? Bir sonraki adımdaki videodaki gibi mi? Merak etme! Neler olduğunu biliyorum...",
                    "updated": 1636092166517
                }
            ]
        }
    ]
}