{
    "tutorial": "Welcome to Superalgos!",
    "pageNumber": 89,
    "type": "Tutorial Step - Enough Chit Chat!",
    "definition": {
        "icon": {
            "project": "Foundations",
            "name": "production-trading-tasks"
        },
        "text": "Ok, my friend... It's time for the real deal! Are you ready for a little Live Trading Session?",
        "translations": [
            {
                "language": "IT",
                "text": "Ok, amico mio...è ora di entrare in azione! Sei pronto a una piccola Live Trading Session?",
                "updated": 1618068381473,
                "style": "Definition"
            },
            {
                "language": "ES",
                "text": "Vale ... ¡Es hora de la verdad! ¿Estás listo para un poco de Live Trading Session?",
                "updated": 1624464311994,
                "style": "Definition"
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "I'll help you with the three main requirements:",
            "translations": [
                {
                    "language": "IT",
                    "text": "Ti aiuterò con i tre requisiti principali:",
                    "updated": 1618068402523,
                    "style": "Text"
                },
                {
                    "language": "ES",
                    "text": "Te ayudaré con los tres requisitos principales:",
                    "updated": 1624464383867,
                    "style": "Text"
                }
            ]
        },
        {
            "style": "List",
            "text": "Check your parameters, in particular, decide how much capital you wish to assign to the session.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Controlla i parametri: in particolar modo decidi bene quanto capitale assegnare alla sessione",
                    "updated": 1618068548173,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Verifique sus parámetros, en particular, decida cuánto capital desea asignar a la sesión.",
                    "updated": 1624464429837,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Set up an Exchange Account Key so that the app may access your account at the exchange.",
            "translations": [
                {
                    "language": "IT",
                    "text": "Prepara un Exchange Account Key: necessaria perchè l'app possa accedere al tuo account sull'exchange.",
                    "updated": 1618068559526,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Configura un Exchange Account Key para que la aplicación pueda acceder a tu cuenta en el exchange.",
                    "updated": 1625934285852,
                    "style": "List"
                }
            ]
        },
        {
            "style": "List",
            "text": "Ensure a live data feed, that is, the data mining operation with the indicators required by the Trading System must be running and up to date.",
            "updated": 1610642474628,
            "translations": [
                {
                    "language": "IT",
                    "text": "Garantisci un live data feed: l'operazione di data mining con gli indicatori richiesti dal Trading System deve essere attiva e aggiornata.",
                    "updated": 1618068565912,
                    "style": "List"
                },
                {
                    "language": "ES",
                    "text": "Asegurate que la operación de minería de datos con los indicadores requeridos por el Trading System esté funcionando y actualizado con los datos en vivo.",
                    "updated": 1624464716757,
                    "style": "List"
                }
            ]
        },
        {
            "style": "Note",
            "text": "If you are not ready to do some live trading for whatever reason, no worries, just keep going. You will at least learn how things work!",
            "updated": 1622232287190,
            "translations": [
                {
                    "language": "IT",
                    "text": "Se per un qualunque motivo non sei pronto a fare live trading, non preccuparti! Prosegui pure.",
                    "updated": 1618068597799,
                    "style": "Note"
                },
                {
                    "language": "ES",
                    "text": "Si no estás listo para operar en vivo por cualquier motivo, simplemente continúa. ¡Al menos aprenderás cómo funcionan las cosas!",
                    "updated": 1624496689859,
                    "style": "Note"
                }
            ]
        }
    ]
}