{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 23,
    "type": "Tutorial Step - How Github Works",
    "definition": {
        "text": "Github.com bumps up the search ranking of projects when they have many stars, forks, and people watching the repository!",
        "updated": 1630659929485,
        "icon": {
            "name": "Programs\\github-program",
            "project": "Governance"
        },
        "translations": [
            {
                "language": "ES",
                "text": "¡Github.com aumenta la clasificación de búsqueda de proyectos cuando tienen muchas estrellas, bifurcaciones y personas observando el repositorio!",
                "updated": 1630892401029,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Github.com, izleyen çok kişi olduğunda, çok sayıda yıldız verildiğinde ve çok çatallandığında projelerin arama sıralamasını yükseltir!",
                "updated": 1637441112883
            },
            {
                "language": "RU",
                "text": "Github.com поднимает поисковый рейтинг проектов, когда у них много звезд, форков и людей, наблюдающих за репозиторием!",
                "updated": 1639048698999
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Note",
            "text": "That is why we ask you to help in this manner! By completing those three tasks, you are effectively helping more developers find Superalgos.",
            "updated": 1631548798983,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Por eso les pedimos que ayuden de esta manera! Al completar esas tres tareas, está ayudando de manera efectiva a más desarrolladores a encontrar Superalgos.",
                    "updated": 1632016358401,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Bu yüzden sizden bu şekilde yardım etmenizi rica ediyoruz! Bu üç görevi tamamlayarak, daha fazla geliştiricinin Superalgos'u bulmasına etkili bir şekilde yardımcı olursunuz.",
                    "updated": 1637441142172
                },
                {
                    "language": "RU",
                    "text": "Поэтому мы просим вас помочь в этом! Выполняя эти три задачи, вы эффективно помогаете большему количеству разработчиков найти Superalgos.",
                    "updated": 1639048715523
                }
            ]
        },
        {
            "style": "Text",
            "text": "Now, this is how it works on the side of Superalgos:",
            "updated": 1630659982457,
            "translations": [
                {
                    "language": "ES",
                    "text": "Ahora, así es como funciona del lado de Superalgos:",
                    "updated": 1630892460301,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Bunu yaptığınızda Superalgos tarafında ise işler şöyle yürüyor:",
                    "updated": 1637441187044
                },
                {
                    "language": "RU",
                    "text": "Вот как это работает со стороны Superalgos:",
                    "updated": 1639048771573
                }
            ]
        },
        {
            "style": "List",
            "text": "The system checks the repository and verifies if your Github account has a star, a fork, and/or a watch.",
            "updated": 1630660104845,
            "translations": [
                {
                    "language": "ES",
                    "text": "Se verifica el repositorio y si tu cuenta de Github tiene una estrella, una bifurcación y/o un reloj.",
                    "updated": 1630892612043,
                    "style": "List"
                },
                {
                    "language": "TR",
                    "text": "Sistem depoyu kontrol eder ve Github hesabınızda projeye yıldız verip vermediğinizi, çatallayıp çatallamadığınızı ve izleme listenize alıp almadığınızıkontrol ederek doğrular.",
                    "updated": 1637441329067
                },
                {
                    "language": "RU",
                    "text": "Система проверяет, есть ли у вашей учетной записи Github звездочка, форк и / или наблюдаете ли вы за репозиторием.",
                    "updated": 1639048896415
                }
            ]
        },
        {
            "style": "List",
            "text": "There is a cap of SA 1,000 for each of these incentives. This means that you may get up to SA 3,000 if you maximize your participation.",
            "updated": 1630660329237,
            "translations": [
                {
                    "language": "ES",
                    "text": "Hay un límite de 1.000 SA para cada uno de estos incentivos. Puedes obtener hasta SA 3.000.",
                    "updated": 1630892707618,
                    "style": "List"
                },
                {
                    "language": "TR",
                    "text": "Bu işlemlerin her biri için 1.000 SA'lık bir üst sınır vardır. Bu, katılımınızı en üst düzeye çıkarırsanız, ( her 3 görevide tamamlarsanız ) 3.000' SA'lık bir ödül alacağınız anlamına gelir.",
                    "updated": 1637441420349
                },
                {
                    "language": "RU",
                    "text": "Для каждого из этих стимулов существует ограничение в размере 1000 SA. Это означает, что вы можете получить до 3000 SA, если максимизируете свое участие.",
                    "updated": 1639049367596
                }
            ]
        },
        {
            "style": "List",
            "text": "This may not be immediately reflected in the system, as Github limits the number of queries the system makes. Don't worry, you will get your tokens anyway.",
            "updated": 1631548891216,
            "translations": [
                {
                    "language": "ES",
                    "text": "Es posible que no se refleje de inmediato. Github limita la cantidad de consultas que realiza el sistema. Obtendrás tus tokens de todos modos.",
                    "updated": 1632024032825
                },
                {
                    "language": "TR",
                    "text": "Github, sistemin yaptığı sorgu sayısını sınırladığı için bu, sisteme hemen yansımayabilir. Endişelenme, yine de Token'larını alacaksın.",
                    "updated": 1637441467662
                },
                {
                    "language": "RU",
                    "text": "Это может не сразу отразиться в системе, поскольку Github ограничивает количество запросов, которые делает система. Не волнуйтесь, вы все равно получите свои токены.",
                    "updated": 1639049397684
                }
            ]
        }
    ]
}