{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 21,
    "type": "Tutorial Step - Drop it like it’s Hot",
    "definition": {
        "text": "Taking part in governance is a valuable contribution! As such the Airdrop Program rewards you with tokens on every release!",
        "updated": 1630606894763,
        "icon": {
            "name": "Programs\\airdrop-program",
            "project": "Governance"
        },
        "translations": [
            {
                "language": "ES",
                "text": "¡Participar en la gobernanza es una contribución valiosa! ¡El Airdrop Program te recompensa con tokens en cada lanzamiento!",
                "updated": 1630892035941,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Yönetişimde yer almak değerli bir katkıdır! Bu nedenle, Airdrop Programı ( Airdrop Program ) her sürümde sizi tokenlar ile ödüllendirir!",
                "updated": 1637439852932
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "We are not a fan of mindless airdrops. However, since you took the time to learn Superalgos and create your User Profile, you deserve a reward!",
            "updated": 1630606981664,
            "translations": [
                {
                    "language": "ES",
                    "text": "No somos fanáticos de los lanzamientos aéreos sin sentido. Sin embargo, dado que te tomaste el tiempo para aprender Superalgos y crear tu User Profile, te mereces una recompensa!",
                    "updated": 1630891887084,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Biz airdropların hayranı değiliz. Ancak, Superalgos'u öğrenmek ve Kullanıcı Profilinizi ( User Profile ) oluşturmak için zaman ayırdığınızdan, bir ödülü hak ediyorsunuz!",
                    "updated": 1637439908256
                }
            ]
        },
        {
            "style": "Callout",
            "text": "On the Onboarding Programs node click <i>Add Airdrop Program</i>.",
            "updated": 1630607006405,
            "translations": [
                {
                    "language": "ES",
                    "text": "En el nodo Onboarding Programs has clic en Add Airdrop Program.",
                    "updated": 1630891925798,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Onboarding Programs düğümünde Airdrop Programı Ekle'ye (Add Airdrop Program) tıklayın.",
                    "updated": 1637439969490
                }
            ]
        },
        {
            "style": "Success",
            "text": "Just by deploying the program, you are all set to get up to 1,000 SA Tokens at the next Distribution Event and on every other future release provided that you submit your User Profile!",
            "updated": 1630659363719,
            "translations": [
                {
                    "language": "ES",
                    "text": "Con solo implementar el programa, estás listo para obtener hasta 1,000 SA Tokens en el próximo Distribution Event y en cualquier otra versión futura, siempre que envíes tu User Profile!",
                    "updated": 1630891979252,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "İpucu: Yalnızca programı dağıtarak, Kullanıcı Profilinizi göndermeniz koşuluyla, bir sonraki Dağıtım Etkinliğinde ( Distribution Event ) ve gelecekteki her sürümde 1.000 adede kadar SA Jetonu almaya hazırsınız!",
                    "updated": 1637440216341
                }
            ]
        }
    ]
}