{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 35,
    "type": "Tutorial Step - What Token Power?",
    "definition": {
        "text": "If you have no tokens in your Governance Address, then you have zero Token Power! But don't worry! We'll work something out!",
        "updated": 1630687902755,
        "icon": {
            "name": "Exchange\\exchange-account-asset",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Si no tienes tokens en tu Governance Address, entonces tienes cero Token Power!¡Pero no te preocupes! ¡Trabajaremos en algo!",
                "updated": 1682521638988,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Если в вашем управленческом адресе Governance Address нет токенов, значит, у вас нулевая сила токенов! Но не волнуйтесь! Мы что-нибудь придумаем!",
                "updated": 1639052059931
            },
            {
                "language": "DE",
                "text": "Wenn Sie keine Token in Ihrer Governance Address haben, dann haben Sie auch keine Token Power! Aber mach dir keine Sorgen! Wir werden uns etwas einfallen lassen!",
                "updated": 1640080875292
            },
            {
                "language": "TR",
                "text": "Yönetim Adresinizde jeton yoksa, jeton gücünüz sıfırdır! Ama endişelenme! Bir şeyler ayarlayacağız!",
                "updated": 1645101334793
            },
            {
                "language": "ID",
                "text": "Jika kamu tidak memiliki token di Governance Address kamu, maka kamu punya nol Token Power! Tapi tidak perlu khawatir! Kita punya suatu kerjaan untukmu!",
                "updated": 1671543579938
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Whether you have any Token Power or not, notice that there is now 0% of Token Power going into the Onboarding Programs and 100% going into the Community Building Programs! Floodgates closed, the flow goes elsewhere! You can play with percentages!",
            "updated": 1660644007628,
            "translations": [
                {
                    "language": "ES",
                    "text": "Tanto si tienes Poder de tokens como si no, observa que ahora hay un 0% de Token Power que va a los Programas de Incorporación y un 100% que va a los Programas de Creación de Comunidad. Cerradas las compuertas, ¡el flujo va a otra parte! Puedes jugar con los porcentajes.",
                    "updated": 1682521684679,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Независимо от того, есть ли у вас Token Power или нет, обратите внимание, что теперь 0% Token Power идет на программы Onboarding Programs и 100% идет на программы Community Building Programs! Шлюзы закрыты, поток уходит в другое место! Вы тоже можете играть с процентами!",
                    "updated": 1639052318418
                },
                {
                    "language": "DE",
                    "text": "Ob Sie nun Token Power haben oder nicht, beachten Sie, dass jetzt 0% der Token Power in die Onboarding Programs und 100% in die Community Building Programs fließen! Die Schleusen sind geschlossen, der Strom fließt woanders hin! Sie können auch mit Prozentsätzen spielen!",
                    "updated": 1640080911231
                },
                {
                    "language": "TR",
                    "text": "Herhangi bir Jeton Gücünüz olsun ya da olmasın, artık Başlangıç Programlarına (Onboarding Programs) giden Token Gücünün % 0 ve Topluluk Oluşturma Programlarına (Community Building Programs) giden %100 olduğuna dikkat edin! Sel kapıları kapandı, akış başka yere gidiyor! Bu noktada yüzdelerle oynayarak değiştirbilirsiniz!",
                    "updated": 1645101455619
                },
                {
                    "language": "ID",
                    "text": "Apakah kamu memiliki Token Power atau tidak, perhatikan bahwa sekarang ada 0% dari Token Power masuk ke Onboarding Programs dan 100% masuk ke Community Building Programs! Pintu airnya telah ditutup, alirannya mengalir ke tempat lain! Kamu bisa bermain dengan persentase-nya!",
                    "updated": 1671543601302
                }
            ]
        },
        {
            "style": "Important",
            "text": "If you have no Token Power yet, join the Superalgos Token Group in Telegram, introduce yourself, let us know you just created your User Profile, and openly ask for some delegated power to use for the Community Building Programs! We'll be happy to send some power your way!",
            "updated": 1660644061527,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si aún no tienes Token Power, únete al Grupo de Token de Superalgos en Telegram, preséntate, haznos saber que acabas de crear tu Perfil de Usuario, ¡y pide abiertamente algo de poder delegado para utilizarlo en los Programas de Creación de Comunidad! ¡Estaremos encantados de enviarte algo de poder!",
                    "updated": 1682521743118,
                    "style": "Important"
                },
                {
                    "language": "RU",
                    "text": "А теперь вот хорошая новость... Поскольку есть вероятность, что у вас нет Token Power для выполнения третьего требования для участия в программах Community Building Programs, мы собираемся делегировать некоторые полномочия всем профилям пользователей User Profiles в этом выпуске! Я позабочусь об этом, так что забудь об этом!",
                    "updated": 1639052440897
                },
                {
                    "language": "DE",
                    "text": "Jetzt kommt die gute Nachricht... Da die Wahrscheinlichkeit groß ist, dass Sie keine Token Power haben, um die dritte Voraussetzung für die Teilnahme an den Community Building Programs zu erfüllen, werden wir in dieser Version etwas Macht an alle Benutzerprofile delegieren! Wir kümmern uns darum, also vergesst es!",
                    "updated": 1640080927268
                },
                {
                    "language": "TR",
                    "text": "Şimdi, işte iyi haber... Topluluk Oluşturma Programlarına katılmak için üçüncü şartı yerine getirmelisiniz. Ancak bunun için Jeton Gücünüz olmadığından, bu sürümde tüm Kullanıcı Profillerine bir miktar yetki vereceğiz!",
                    "updated": 1645101537497
                },
                {
                    "language": "ID",
                    "text": "Jika sekarang kamu tidak memiliki Token Power, bergabung ke Superalgos Token Group di Telegram, Perkenalkan dirimu, Biarkan kami tahu bahwa kamu baru saja membuat User Profile, dan secara terbuka meminta beberapa delegasi power untuk digunakan pada Community Building Programs! Kami akan dengan senang hati mengirimkan power untukmu!",
                    "updated": 1671543593910
                }
            ]
        }
    ]
}