{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 42,
    "type": "Tutorial Step - Welcome aboard!",
    "definition": {
        "text": "You did it! You are now officially taking part in the governance of Superalgos! So, what's next?",
        "updated": 1630751721473,
        "icon": {
            "name": "announcement",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "¡Lo hiciste! ¡Ahora estás participando oficialmente en el gobierno de Superalgos! ¿Qué es lo siguiente?",
                "updated": 1630899371726,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Ты сделал это! Теперь вы официально принимаете участие в управлении Superalgos! Ну и что дальше?",
                "updated": 1639053732625
            },
            {
                "language": "DE",
                "text": "Sie haben es geschafft! Du bist jetzt offiziell an der Regierung von Superalgos beteiligt! Wie geht es nun weiter?",
                "updated": 1640082521860
            },
            {
                "language": "TR",
                "text": "Başardın! Artık resmi olarak Superalgos'un yönetiminde yer alıyorsunuz! Peki Sırada ne var?",
                "updated": 1645105952157
            },
            {
                "language": "ID",
                "text": "Kamu berhasil! Kamu sekarang resmi menjadi bagian dari governance dari Superalgos! Jadi, apa selanjutnya?",
                "updated": 1671546019440
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If you generated a new Governance Address using the Profile Constructor, you may want to connect it to a software wallet so that you have control of your tokens.",
            "updated": 1630751845529,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si generaste un nuevo Governance Address utilizando el Profile Constructor, es posible que desees conectarlo a una billetera de software para que tengas el control de tus tokens.",
                    "updated": 1630899427730,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Если вы сгенерировали новый адрес управления Governance Address с помощью конструктора профилей Profile Constructor, вы можете подключить его к программному кошельку, чтобы иметь контроль над своими токенами.",
                    "updated": 1639053795526
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie eine neue Governance Address mit dem Profile Constructor erstellt haben, möchten Sie diese vielleicht mit einer Software-Wallet verbinden, damit Sie die Kontrolle über Ihre Token haben.",
                    "updated": 1640082550454
                },
                {
                    "language": "TR",
                    "text": "Profil Oluşturucu'yu (Profile Constructor) kullanarak yeni bir Yönetim Adresi (Governance Address) oluşturduysanız, tokenlerinizi kontrol edebilmek için bunu bir cüzdana bağlamak isteyebilirsiniz.",
                    "updated": 1645106053735
                },
                {
                    "language": "ID",
                    "text": "Jika kamu menghasilkan Governance Address baru menggunakan Profile Constructor, kamu mungkin ingin menghubungkannya ke wallet perangkat lunak sehingga kamu memiliki kendali atas tokenmu.",
                    "updated": 1671546033214
                }
            ]
        },
        {
            "style": "Callout",
            "text": "See the \"Import Private Key in a Wallet\" section of this Docs page on the right. It explains how to do that using Trust Wallet. Check it out!",
            "updated": 1630756159921,
            "translations": [
                {
                    "language": "ES",
                    "text": "Ve el \"Import Private Key in a Wallet\" sección de esta página de Documentos a la derecha. Explica cómo hacerlo con Trust Wallet. ¡Echale un vistazo!",
                    "updated": 1630899460693,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Смотрите раздел Import Private Key in a Wallet на этой странице документов Docs page справа. В нем объясняется, как это сделать с помощью кошелька Trust Wallet. Проверьте это!",
                    "updated": 1639053976753
                },
                {
                    "language": "DE",
                    "text": "Sehen Sie sich den Abschnitt \"Import Private Key in a Wallet\" auf dieser Docs-Seite auf der rechten Seite an. Dort wird erklärt, wie man das mit Trust Wallet macht. Probieren Sie es aus!",
                    "updated": 1640082581822
                },
                {
                    "language": "TR",
                    "text": "Sağdaki bu Dokümanlar sayfasının \"Özel Anahtarı Cüzdana Aktar\" (Import Private Key in a Wallet) bölümüne bakın. Bu bölüm Trust Wallet kullanarak bunun nasıl yapılacağını açıklar. Göz atın!",
                    "updated": 1645106112001
                },
                {
                    "language": "ID",
                    "text": "Lihat bagian \"Import Private Key in a Wallet\" pada halaman Docs di sebelah kanan. Itu akan menjelaskan bagaimana caranya dengan Trust Wallet. Coba lihatlah!",
                    "updated": 1671546040968
                }
            ]
        },
        {
            "style": "Note",
            "text": "Feel free to use any other wallet that supports BEP20 tokens.",
            "updated": 1660648349188,
            "translations": [
                {
                    "language": "ES",
                    "text": " Puedes utilizar cualquier otro monedero compatible con los tokens BEP20. ",
                    "updated": 1682522269599,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Не стесняйтесь использовать любой другой кошелек, который поддерживает токены BEP20 в Binance Smart Chain.",
                    "updated": 1639053992756
                },
                {
                    "language": "DE",
                    "text": "Sie können jede andere Wallet verwenden, die BEP20-Token in der Binance Smart Chain unterstützt.",
                    "updated": 1640082590465
                },
                {
                    "language": "TR",
                    "text": "Trust Wallet yerine Binance Akıllı Zincirinde BEP20 tokenlerini destekleyen diğer cüzdanlarıda kullanabilirsiniz.",
                    "updated": 1645106163562
                },
                {
                    "language": "ID",
                    "text": "Jangan ragu untuk menggunakan wallet lain yang mendukung token BEP20.",
                    "updated": 1671546048130
                }
            ]
        }
    ]
}