{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 32,
    "type": "Tutorial Step - Referral Token Awards",
    "definition": {
        "text": "Superalgos is a community-run project, not a VC-funded startup! We count on you helping with word-of-mouth marketing!",
        "icon": {
            "name": "tokens-awarded",
            "project": "Governance"
        },
        "updated": 1630681292714,
        "translations": [
            {
                "language": "ES",
                "text": "¡Superalgos es un proyecto administrado por la comunidad, no una startup financiada por VC! ¡Contamos con tu ayuda con el marketing de boca en boca!",
                "updated": 1630896521389,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Superpages - это проект, управляемый сообществом, а не стартап, финансируемый венчурным капиталом! Мы рассчитываем на вашу помощь в маркетинге из уст в уста!",
                "updated": 1639050898782
            },
            {
                "language": "DE",
                "text": "Superalgos ist ein von der Gemeinschaft betriebenes Projekt, kein VC-finanziertes Startup! Wir zählen auf Ihre Hilfe bei der Mund-zu-Mund-Propaganda!",
                "updated": 1640080438599
            },
            {
                "language": "TR",
                "text": "Superalgos, herhangi biri ya da bir şirket tarafından finanse edilen bir proje değil, topluluk tarafından yürütülen bir projedir! Ağızdan ağza pazarlama konusunda bize yardımcı olacağınıza güveniyoruz!",
                "updated": 1645100205504
            },
            {
                "language": "ID",
                "text": "Superalgos merupakan proyek yang dijalankan komunitas, bukan startup yang didanai VC! Kami mengandalkan kamu untuk membantu pemasaran dari mulut ke mulut!",
                "updated": 1671529004011
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Important",
            "text": "The incentives to bring your friends, colleagues, or your following are significant! Find the short explanation below, and dive into the details on the right if so you wish!",
            "updated": 1630681312671,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Los incentivos para traer a tus amigos, colegas o tus seguidores son significativos! Encuentre la breve explicación a continuación y sumérjete en los detalles a la derecha si lo desea.",
                    "updated": 1682521378816,
                    "style": "Important"
                },
                {
                    "language": "DE",
                    "text": "Die Anreize, Ihre Freunde, Kollegen oder Ihre Anhängerschaft mitzubringen, sind beträchtlich! Unten finden Sie eine kurze Erklärung, und wenn Sie möchten, können Sie rechts in die Details eintauchen!",
                    "updated": 1640080454958
                },
                {
                    "language": "TR",
                    "text": "Arkadaşlarınızı, meslektaşlarınızı veya takipçilerinizi getirdiğinizde alacağınız teşvikler önemlidir! Aşağıdaki kısa açıklamaya bakın ya da dilerseniz sağdaki ayrıntılara dalın!",
                    "updated": 1645100254487
                },
                {
                    "language": "ID",
                    "text": "Insentif ini untuk mengajak temanmu, kolega, atau yang kamu ikuti! Temukan penjelasan singkat di bawah ini, dan pergi ke detailnya di sebelah kanan jika kamu mau!",
                    "updated": 1671529009861
                }
            ]
        },
        {
            "style": "Text",
            "text": "This is the short version of how these programs work:",
            "updated": 1630680801100,
            "translations": [
                {
                    "language": "ES",
                    "text": "Esta es la versión corta de cómo funcionan:",
                    "updated": 1630896948284,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Это краткая версия того, как работают эти программы:",
                    "updated": 1639050914721
                },
                {
                    "language": "DE",
                    "text": "Dies ist die Kurzversion, wie diese Programme funktionieren:",
                    "updated": 1640080463311
                },
                {
                    "language": "TR",
                    "text": "Bu programların nasıl çalıştığının kısa versiyonu:",
                    "updated": 1645100269894
                },
                {
                    "language": "ID",
                    "text": "Inilah versi pendek dari bagaimana program ini bekerja:",
                    "updated": 1671529020429
                }
            ]
        },
        {
            "style": "List",
            "text": "The more people declare you as their referrers, the more tokens you earn on each distribution event, indefinitely!",
            "updated": 1660643506516,
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuantas más personas te declaren como sus recomendadores, más tokens ganarás en cada evento de distribución, ¡de forma indefinida!",
                    "updated": 1682521442436,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Чем больше людей объявляют вас своими рефералами, тем больше токенов вы зарабатываете на каждом выпуске программного обеспечения на неопределенный срок!",
                    "updated": 1639050932219
                },
                {
                    "language": "DE",
                    "text": "Je mehr Leute Sie als Empfehlungsgeber angeben, desto mehr Token verdienen Sie für jede einzelne Version der Software, und zwar auf unbestimmte Zeit!",
                    "updated": 1640080473267
                },
                {
                    "language": "TR",
                    "text": "Ne kadar çok kişi sizi yönlendirenleri olarak ilan ederse, yazılımın her bir sürümünde süresiz olarak o kadar çok jeton kazanırsınız!",
                    "updated": 1645100285570
                },
                {
                    "language": "ID",
                    "text": "Semakin banyak orang menyatakan kamu sebagai perujuk mereka, semakin banyak token yang kamu peroleh di setiap acara distribusi, tanpa batas waktu!",
                    "updated": 1671529026836
                }
            ]
        },
        {
            "style": "List",
            "text": "If the people you bring to Superalgos bring people too, you earn for those as well, and for those the latter bring, you earn too!",
            "updated": 1630681200103,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si la gente que traes a Superalgos también trae gente, tú también ganas por ellos, y por los que traen estos últimos, ¡tú también ganas!",
                    "updated": 1630896914087,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Если люди, которых вы приводите в Superalgos, тоже приводят людей, вы за них тоже зарабатываете, а за тех, кого они приводят, вы тоже зарабатываете!",
                    "updated": 1639050994343
                },
                {
                    "language": "DE",
                    "text": "Wenn die Leute, die Sie zu Superalgos bringen, auch Leute mitbringen, verdienen Sie auch für diese, und für die, die diese mitbringen, verdienen Sie auch!",
                    "updated": 1640080485683
                },
                {
                    "language": "TR",
                    "text": "Superalgos'a getirdiğiniz insanlar da başkalarını getiriyorsa, onlar için de kazanırsınız, bu böyle sürer gider.",
                    "updated": 1645100341305
                },
                {
                    "language": "ID",
                    "text": "Jika orang yang kamu ajak ke Superalgos juga mengajak orang, kamu juga mendapat penghasilan dari mereka, dan dari orang yang dibawa terakhir, kamu juga mendapatkannya!",
                    "updated": 1671529034275
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}