{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 39,
    "type": "Tutorial Step - Thank Your Mentors",
    "definition": {
        "text": "Mentors are crucial to developing Contributors. They are the people that go the extra mile to help you progress and master Superalgos!",
        "updated": 1630690393118,
        "icon": {
            "name": "Programs\\mentorship-program",
            "project": "Governance"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Los mentores son cruciales para desarrollar colaboradores. ¡Son las personas que hacen un esfuerzo adicional para ayudarte a progresar y dominar Superalgos!",
                "updated": 1630898636401,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Наставники имеют решающее значение для развития участников Contributors. Это люди, которые делают все возможное, чтобы помочь вам прогрессировать и осваивать Superalgos!",
                "updated": 1639053225583
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Mentorship Program is very similar to the Support Program, only that your mentors don't need to be moderators. It may be your friend learning Superalgos with you, or any other Community member!",
            "updated": 1630929989870,
            "translations": [
                {
                    "language": "ES",
                    "text": "El Mentorship Programes muy similar al Support Program, solo que sus mentores no necesitan ser moderadores. ¡Puede ser tu amigo aprendiendo Superalgos contigo, o otro miembro de la comunidad!",
                    "updated": 1630898711625,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Программа наставничества Mentorship Program очень похожа на программу поддержки Support Program, только ваши наставники не обязательно должны быть модераторами. Это может быть ваш друг, изучающий Superalgos вместе с вами, или любой другой член сообщества!",
                    "updated": 1639053294573
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Deploy the program, and declare your mentors!",
            "updated": 1630690640463,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Declara a tus mentores!",
                    "updated": 1630898761046,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Разверните программу и объявите своих наставников!",
                    "updated": 1639053305575
                }
            ]
        },
        {
            "style": "Success",
            "text": "With this you've completed the setup of the main Governance Programs oriented to newcomers! Now it's time to contribute your User Profile to the Superalgos repository!",
            "updated": 1630754628606,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Con esto, has completado la configuración de la Governance Programs orientado a los recién llegados! ¡Ahora es el momento de contribuir con tu User Profile al repositorio de Superalgos!",
                    "updated": 1630898857914,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "На этом вы завершили настройку основных программ управления Governance Programs, ориентированных на новичков! Пришло время добавить свой профиль пользователя User Profile в репозиторий Superalgos!",
                    "updated": 1639053374051
                }
            ]
        }
    ]
}