{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 28,
    "type": "Tutorial Step - Declare Your Referrers",
    "definition": {
        "text": "The program is deployed! Now you have to declare your referrer to fulfill the second requirement!",
        "icon": {
            "name": "User\\user-referrer",
            "project": "Governance"
        },
        "updated": 1630926980041,
        "translations": [
            {
                "language": "ES",
                "text": "¡El programa está implementado! ¡Ahora tienes que declarar tu referente para cumplir con el segundo requisito!",
                "updated": 1630895782489,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Program dağıtıldı! Şimdi ikinci şartı yerine getirmek için yönlendireninizi beyan etmeniz gerekiyor!",
                "updated": 1637445630785
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Maybe you learned about Superalgos from an article, a video, a comment on Reddit, a tweet, the official website, or someone who told you about us!",
            "updated": 1630669214566,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Tal vez aprendiste sobre Superalgos a través de un artículo, un video, un comentario en Reddit, un tweet, el sitio web oficial o alguien que te contó sobre nosotros!",
                    "updated": 1630895800095,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Belki Superalgos'u bir makaleden, bir videodan, Reddit'teki bir yorumdan, bir tweet'ten, resmi web sitesinden veya size bizden bahseden birinden öğrendiniz!",
                    "updated": 1637445669747
                }
            ]
        },
        {
            "style": "Success",
            "text": "Declaring your referrers is the best way to thank the people that may have written that article or tweet, produced that video, maintained the website, or told you about Superalgos!",
            "updated": 1630669976768,
            "translations": [
                {
                    "language": "ES",
                    "text": "Declarar tus referencias es la mejor manera de agradecer a las personas que pueden haber escrito ese artículo o tweet, producido ese video, mantenido el sitio web etc....",
                    "updated": 1632024727440,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "Yönlendirenlerinizi bildirmek, o makaleyi veya tweet'i yazan, o videoyu hazırlayan, web sitesinin bakımını yapan veya size Superalgos'tan bahseden kişilere teşekkür etmenin en iyi yoludur!",
                    "updated": 1637445703299
                }
            ]
        },
        {
            "style": "Note",
            "text": "To declare a referrer, you must establish a reference from the User Referrer node to the User Profile of your referrer! This means that a User Profile name is also a referral code!",
            "updated": 1630926253833,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para declarar una referencia, debes establecerla desde el nodo User Referrer al User Profile de tu referencia. ¡El nombre del User Profile también es un código de referencia!",
                    "updated": 1632025274614,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Yönlendiren beyan etmek için, öncelikle Yönlendiren kişinin Kullanıcı Profiline kendi Kullanıcı düğümünüzden bir başvuru oluşturmalısınız! Bunun için Referral Prragram düğümünden \"Add User Referrer\" butonuna tıklayın. Oluşan yeni düğümü sizi yönlendiren kişinin profilinin üerine getriin Düğümü farenizin sağ tuluna tıklayarak referans olan kişinin profiline sürkleyinve bırakın. Profil sarı bir daire içinde görünecektir. İşte referansınızı oluşturdunuz. Bu, bir Kullanıcı Profili adının aynı zamanda bir tavsiye kodu olduğu aanlamına gelir!",
                    "updated": 1637446427949
                }
            ]
        }
    ]
}