{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 31,
    "type": "Tutorial Step - Reference the User Profile",
    "definition": {
        "text": "Now that you located the target User Profile on the workspace, all that is left is to establish the reference from your User Referrer node to the User Profile.",
        "icon": {
            "name": "delink-node",
            "project": "Foundations"
        },
        "updated": 1660643410612,
        "translations": [
            {
                "language": "ES",
                "text": "Ahora que has localizado el Perfil de Usuario target en el área de trabajo, todo lo que queda es establecer la referencia desde tu nodo User Referrer al Perfil de Usuario",
                "updated": 1682521325762,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Теперь, когда у вас есть целевой профиль пользователя User Profile в рабочем пространстве, все, что осталось, - это установить ссылку из вашего узла реферера пользователя User Referrer на профиль пользователя User Profile.",
                "updated": 1639050815957
            },
            {
                "language": "DE",
                "text": "Da Sie nun das Zielbenutzerprofil im Workspace haben, müssen Sie nur noch den Verweis von Ihrem User Referrer Knoten auf das Benutzerprofil herstellen.",
                "updated": 1640080318104
            },
            {
                "language": "TR",
                "text": "Artık çalışma alanında hedef Kullanıcı Profiline sahip olduğunuza göre, geriye kalan tek şey Kullanıcı Yönlendiren (User Referrer) düğümünüzden Kullanıcı Profiline (User Profile) referansı oluşturmaktır.",
                "updated": 1645099812307
            },
            {
                "language": "ID",
                "text": "Sekarang setelah kamu menemukan User Profile target di workspace, yang tersisa hanyalah membuat referensi dari node User Referrer kamu ke User Profile.",
                "updated": 1671528625029
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Just in case you're not proficient with references, here's a quick reminder of how references work!",
            "updated": 1630680014393,
            "translations": [
                {
                    "language": "ES",
                    "text": "En caso de que no seas competente con las referencias, aquí tienes un recordatorio rápido de cómo funcionan las referencias.",
                    "updated": 1630896216270,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "На всякий случай, если вы не разбираетесь в ссылках, вот краткое напоминание о том, как работают ссылки!",
                    "updated": 1639050842288
                },
                {
                    "language": "DE",
                    "text": "Für den Fall, dass Sie sich mit Referenzen nicht auskennen, hier eine kurze Erinnerung daran, wie Referenzen funktionieren!",
                    "updated": 1640080331154
                },
                {
                    "language": "TR",
                    "text": "Referanslar konusunda uzman değilseniz, işte referansların nasıl çalıştığına dair kısa bir hatırlatma!",
                    "updated": 1645100036569
                },
                {
                    "language": "ID",
                    "text": "Kalau saja kamu tidak mahir dengan referensi, inilah pengingat singkat tentang cara kerja referensi!",
                    "updated": 1671528631324
                }
            ]
        },
        {
            "style": "Note",
            "text": "By the way, if you feel like you have more than one referrer, feel free to add User Referrer nodes and set up the references with their profiles!",
            "updated": 1630680189459,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si crees que tienes más de un referente, ¡no dudes en agregar nodos de User Referrer y configurar las referencias con tus perfiles!",
                    "updated": 1682521345002,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Кстати, если вы чувствуете, что у вас более одного реферера, не стесняйтесь добавлять узлы User Referrer и настраивать ссылки с их профилями!",
                    "updated": 1639050860139
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie das Gefühl haben, dass Sie mehr als einen Referrer haben, können Sie gerne weitere User Referrer Knoten hinzufügen und die Referenzen mit ihren Profilen einrichten!",
                    "updated": 1640080352783
                },
                {
                    "language": "TR",
                    "text": "Bu arada, birden fazla yönlendireniniz olduğunu düşünüyorsanız, Kullanıcı Yönlendiren düğümleri eklemekten ve referansları profilleriyle birlikte ayarlamaktan çekinmeyin!",
                    "updated": 1645100072152
                },
                {
                    "language": "ID",
                    "text": "Ngomong-ngomong, jika kamu merasa memiliki lebih dari satu perujuk, silahkan tambahkan node User Referrer dan atur referensi dengan profil mereka!",
                    "updated": 1671528638107
                }
            ]
        },
        {
            "style": "Success",
            "text": "Once you're done declaring your referrers, keep going with the tutorial!",
            "updated": 1630680219618,
            "translations": [
                {
                    "language": "ES",
                    "text": "Una vez que hayas terminado de declarar tus referencias, ¡continúa con el tutorial!",
                    "updated": 1630896289657,
                    "style": "Success"
                },
                {
                    "language": "DE",
                    "text": "Sobald Sie Ihre Referrer deklariert haben, fahren Sie mit dem Tutorial fort!",
                    "updated": 1640080360518
                },
                {
                    "language": "TR",
                    "text": "Yönlendirenlerinizi bildirmeyi bitirdikten sonra eğiticiye devam edin!",
                    "updated": 1645100087601
                },
                {
                    "language": "ID",
                    "text": "Setelah kamu selesai menyatakan perujukmu, lanjutkan tutorialnya!",
                    "updated": 1671528646411
                }
            ]
        }
    ]
}