{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 27,
    "type": "Tutorial Step - Declare Your Referrers",
    "definition": {
        "text": "The program is deployed! Now you have to declare your referrer to fulfill the second requirement!",
        "icon": {
            "name": "User\\user-referrer",
            "project": "Governance"
        },
        "updated": 1630669057039,
        "translations": [
            {
                "language": "ES",
                "text": "¡El programa está implementado! ¡Ahora tienes que declarar tu referente para cumplir con el segundo requisito!",
                "updated": 1630895782489
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Maybe you learned about Superalgos from an article, a video, a comment on Reddit, a tweet, the official website, or someone who told you about us!",
            "updated": 1630669214566,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Tal vez aprendiste sobre Superalgos a través de un artículo, un video, un comentario en Reddit, un tweet, el sitio web oficial o alguien que te contó sobre nosotros!",
                    "updated": 1630895800095
                }
            ]
        },
        {
            "style": "Success",
            "text": "Declaring your referrers is the best way to thank the people that may have written that article or tweet, produced that video, maintained the website, or told you about Superalgos!",
            "updated": 1630669976768,
            "translations": [
                {
                    "language": "ES",
                    "text": "Declarar tus referencias es la mejor manera de agradecer a las personas que pueden haber escrito ese artículo o tweet, producido ese video, mantenido el sitio web o le han contado sobre Superalgos.",
                    "updated": 1630895822840
                }
            ]
        },
        {
            "style": "Text",
            "text": "To declare a referrer, you must establish a reference from the User Referrer node to the User Profile of your referrer! Does your referrer have a User Profile?",
            "updated": 1630681537614,
            "translations": [
                {
                    "language": "ES",
                    "text": "Para declarar un referente, debe establecer una referencia del nodo User Referrer a el User Profile de tu referente! ¿Su referente tiene un User Profile?",
                    "updated": 1630895923926
                }
            ]
        }
    ]
}