{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 3,
    "type": "Tutorial Step - Are You Ready?",
    "definition": {
        "text": "Before you jump into governance, it’s important you know how Superalgos works!",
        "updated": 1629720525960,
        "icon": {
            "name": "Pool\\pools",
            "project": "Governance"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Antes de pasar a la gobernanza, es importante que sepas cómo funciona Superalgos.",
                "updated": 1630871065288,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Yönetime geçmeden önce Superalgos'un nasıl çalıştığını bilmeniz önemlidir!",
                "updated": 1637146291519
            },
            {
                "language": "RU",
                "text": "Прежде чем приступить к управлению, важно знать, как работает Superalgos!",
                "updated": 1639044437637
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "We've got a lot of exciting things to talk about, but I want to make sure you can follow along easily.",
            "updated": 1630657385662,
            "translations": [
                {
                    "language": "ES",
                    "text": "Tenemos muchas cosas interesantes de las que hablar, pero quiero asegurarme de que pueda seguirlas fácilmente.",
                    "updated": 1630871195572,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Konuşacak çok heyecan verici şeylerimiz var ama önce bunları kolayca takip edebileceğinizden emin olmak istiyorum.",
                    "updated": 1637146318583
                },
                {
                    "language": "RU",
                    "text": "У нас есть много интересных вещей, о которых можно поговорить, но я хочу убедиться, что вы легко сможете понять, о чем идет речь.",
                    "updated": 1639044452483
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Make sure you go through the tutorials in the Getting Started Tutorials Plugin Workspace before continuing if you haven't yet!",
            "updated": 1630598529991,
            "translations": [
                {
                    "language": "ES",
                    "text": "Asegúrate de leer los tutoriales en el Getting Started Tutorials Plugin Workspace antes de continuar si aún no lo has hecho!",
                    "updated": 1630872016952,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Henüz yapmadıysanız, devam etmeden önce Başlarken Öğreticiler Eklentisi Çalışma Alanındaki ( Getting Started Tutorials Plugin Workspace ) öğreticileri gözden geçirdiğinizden emin olun!",
                    "updated": 1637146372454
                },
                {
                    "language": "RU",
                    "text": "Обязательно ознакомьтесь с учебными материалами в Getting Started Tutorials Plugin Workspace, прежде чем продолжить, если вы еще этого не сделали!",
                    "updated": 1639044502453
                }
            ]
        },
        {
            "style": "Success",
            "text": "No need to be an expert, but you do need to know how to operate the system! Otherwise, the process may be confusing and even frustrating!",
            "updated": 1631546896227,
            "translations": [
                {
                    "language": "ES",
                    "text": "No es necesario ser un experto, pero necesitará algunos conocimientos generales del sistema para comprender de qué se trata.",
                    "updated": 1630872031627,
                    "style": "Success"
                },
                {
                    "language": "TR",
                    "text": "İpucu: Uzman olmanıza gerek yok, ancak sistemi nasıl çalıştıracağınızı bilmeniz gerekiyor! Aksi takdirde, süreç kafa karıştırıcı ve hatta sinir bozucu olabilir!",
                    "updated": 1637146395009
                },
                {
                    "language": "RU",
                    "text": "Не нужно быть экспертом, но вам нужно знать, как работать с системой! В противном случае процесс может сбивать с толку и даже разочаровывать!",
                    "updated": 1639044519182
                }
            ]
        }
    ]
}