{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 33,
    "type": "Tutorial Step - Token Power Requirement",
    "definition": {
        "text": "Remember the third requirement to earn your Tokens Bonus? \"You must drive Token Power to the program\". What's that all about?",
        "updated": 1630686739254,
        "icon": {
            "name": "Exchange\\exchange-account-asset",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Recuerda el tercer requisito para ganar tu Tokens Bonus, \"Debes llevar Token Power al programa \". ¿De qué se trata todo eso?",
                "updated": 1630897032249,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Помните третье требование для получения бонуса Tokens Bonus? «Вы должны вбить Token Power в программу». Что все это значит?",
                "updated": 1639051056388
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "We're probably getting in the weeds here, but I'll try to keep it simple!",
            "updated": 1630683871001,
            "translations": [
                {
                    "language": "ES",
                    "text": "Probablemente nos estemos metiendo en la maleza aquí, ¡pero intentaré que sea simple!",
                    "updated": 1630897050223,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Возможно, мы здесь зарастаем сорняками, но я постараюсь, чтобы все было просто!",
                    "updated": 1639051094755
                }
            ]
        },
        {
            "style": "List",
            "text": "When your Governance Address has some tokens in its balance, then you get the same amount of Token Power in your User Profile.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Cuando tu Governance Address tiene algunos tokens en su saldo, entonces obtienes la misma cantidad de Token Power en tu User Profile.",
                    "updated": 1630897088486,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Когда на балансе вашего управленческого адреса Governance Address есть несколько токенов, вы получаете такое же количество Token Power в своем профиле пользователя User Profile.",
                    "updated": 1639051172758
                }
            ]
        },
        {
            "style": "List",
            "text": "Token Power flows down the hierarchy like a river! The amount of Token Power you let into each Governance Program determines how strongly you wish to participate in the program and impacts the Token Rewards you may get from it.",
            "updated": 1630684153086,
            "translations": [
                {
                    "language": "ES",
                    "text": "Token Power fluye por la jerarquía como un río. La cantidad de Token Power que ingresa en cada Programa de Gobernanza determina la intensidad con la que desea participar en el programa y afecta las Token Rewards que puedes obtener de él.",
                    "updated": 1630897159932,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "Token Power течет по иерархии рекой! Количество токенов, которые вы вкладываете в каждую программу управления, определяет, насколько сильно вы хотите участвовать в программе, и влияет на количество токенов Token Rewards, которые вы можете получить от нее.",
                    "updated": 1639051267520
                }
            ]
        },
        {
            "style": "List",
            "text": "By default, Token Power flows in equal amounts to all offspring nodes! You may change this though!",
            "updated": 1630684072593,
            "translations": [
                {
                    "language": "ES",
                    "text": "Por defecto, Token Power fluye en cantidades iguales a todos los nodos descendientes! ¡Puedes cambiar esto difícil!",
                    "updated": 1630897224172,
                    "style": "List"
                },
                {
                    "language": "RU",
                    "text": "По умолчанию Token Power течет в равных количествах ко всем дочерним узлам! Вы можете это изменить!",
                    "updated": 1639051313076
                }
            ]
        }
    ]
}