{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 19,
    "type": "Tutorial Step - Delete the Constructor",
    "definition": {
        "text": "After you have made sure to back up the contents of the Profile Constructor it's time to clean up shop.",
        "updated": 1629582388020,
        "icon": {
            "name": "Docs\\docs-action-delete-paragraph",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Una vez que te hayas asegurado de hacer una copia de seguridad del contenido del Profile Constructor es hora de limpiar el taller.",
                "updated": 1630891469094,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Profil Oluşturucunun içeriğini yedeklediğinizden emin olduktan sonra dükkanı temizlemenin zamanı geldi.",
                "updated": 1637247271679
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Once you are satisfied with your backup of the private key, delete the Profile Constructor node! ",
            "updated": 1629582405899,
            "translations": [
                {
                    "language": "ES",
                    "text": "Una vez que estés satisfecho con tu copia de seguridad de la clave privada, elimina el nodo Profile Constructor.",
                    "updated": 1630891508439,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Özel anahtarı istediğiniz şekilde yedeklediyseniz, Profil Oluşturucu düğümünü silin!",
                    "updated": 1637247304339
                }
            ]
        },
        {
            "style": "Warning",
            "text": "It is not safe to store your private key at the Workspace, as you may accidentally submit it to GitHub.com with one of your contributions. Also, remember that workspaces are saved on disk as unencrypted JSON files, with no security whatsoever.",
            "translations": [
                {
                    "language": "ES",
                    "text": "No es seguro almacenar tu clave privada en el espacio de trabajo, ya que puedes enviarla accidentalmente a GitHub.com con una de tus contribuciones. Además, recuerda que los espacios de trabajo se guardan en el disco como archivos JSON sin cifrar, sin ningún tipo de seguridad.",
                    "updated": 1630891565910,
                    "style": "Warning"
                },
                {
                    "language": "TR",
                    "text": "Uyarı: Daha sonra Superalgos'a göndereceğiniz katkılarınızdan biriyle yanlışlıkla GitHub.com'a gönderebileceğiniz için özel anahtarınızı Çalışma Alanında saklamak güvenli değildir. Ayrıca, çalışma alanlarının hiçbir güvenlik olmaksızın diske şifrelenmemiş JSON dosyaları olarak kaydedildiğini unutmayın.",
                    "updated": 1637247430421
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}