{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 39,
    "type": "Tutorial Step - Thank Your Mentors",
    "definition": {
        "text": "Mentors are crucial to developing Contributors. They are the people that go the extra mile to help you progress and master Superalgos!",
        "updated": 1630690393118,
        "icon": {
            "name": "Programs\\mentorship-program",
            "project": "Governance"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Los mentores son cruciales para desarrollar colaboradores. ¡Son las personas que hacen un esfuerzo adicional para ayudarte a progresar y dominar Superalgos!",
                "updated": 1630898636401,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Наставники имеют решающее значение для развития участников Contributors. Это люди, которые делают все возможное, чтобы помочь вам прогрессировать и осваивать Superalgos!",
                "updated": 1639053225583
            },
            {
                "language": "DE",
                "text": "Mentoren sind entscheidend für die Entwicklung von Contributors. Sie sind die Menschen, die die Extrameile gehen, um Ihnen zu helfen, Fortschritte zu machen und Superalgos zu meistern!",
                "updated": 1640081859049
            },
            {
                "language": "TR",
                "text": "Mentorlar, Katkıda Bulunanları geliştirmek için çok önemlidir. Onlar, ilerlemenize ve Superalgos'ta ustalaşmanıza yardımcı olmak için ekstra yol kat eden insanlardır!",
                "updated": 1645102045242
            },
            {
                "language": "ID",
                "text": "Mentor sangat krusial untuk mengembangkan kontributor. Mereka adalah orang-orang yang bekerja ekstra untuk membantu kamu maju dan menguasai Superalgos!",
                "updated": 1671544925504
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The Mentorship Program is very similar to the Support Program, only that your mentors don't need to be moderators. It may be your friend learning Superalgos with you, or any other Community member!",
            "updated": 1630929989870,
            "translations": [
                {
                    "language": "ES",
                    "text": "El Programa de Mentores es muy similar al Programa de Apoyo, sólo que tus mentores no necesitan ser moderadores. Puede ser tu amigo aprendiendo Superalgos contigo, o cualquier otro miembro de la Comunidad",
                    "updated": 1682522020426,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Программа наставничества Mentorship Program очень похожа на программу поддержки Support Program, только ваши наставники не обязательно должны быть модераторами. Это может быть ваш друг, изучающий Superalgos вместе с вами, или любой другой член сообщества!",
                    "updated": 1639053294573
                },
                {
                    "language": "DE",
                    "text": "Das Mentorship Program ist dem Support Program sehr ähnlich, nur dass Ihre Mentoren keine Moderatoren sein müssen. Es kann Ihr Freund sein, der Superalgos mit Ihnen lernt, oder jedes andere Community Mitglied!",
                    "updated": 1640081902923
                },
                {
                    "language": "TR",
                    "text": "Mentorluk Programı (Mentorship Program), Destek Programına (Support Program) çok benzer, ancak mentorlarınızın moderatör olması gerekmez. Sizinle Superalgos öğrenen bir arkadaşınız veya başka bir Topluluk üyesi olabilir!",
                    "updated": 1645102094486
                },
                {
                    "language": "ID",
                    "text": "Mentorship Program sangat mirip dengan Support Program, hanya saja mentor kamu tidak perlu menjadi moderator. Mungkin sesama temanmu yang mempelajari Superalgos bersama-sama, atau anggota Community lainnya!",
                    "updated": 1671544932257
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Deploy the program, and declare your mentors!",
            "updated": 1630690640463,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Declara a tus mentores!",
                    "updated": 1630898761046,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Разверните программу и объявите своих наставников!",
                    "updated": 1639053305575
                },
                {
                    "language": "DE",
                    "text": "Setze das Programm ein, und erkläre deine Mentoren!",
                    "updated": 1640081910957
                },
                {
                    "language": "TR",
                    "text": "Programı uygulayın ve akıl hocalarınızı ilan edin!",
                    "updated": 1645102125343
                },
                {
                    "language": "ID",
                    "text": "Deploy programnya, dan nyatakan mentormu!",
                    "updated": 1671544938643
                }
            ]
        },
        {
            "style": "Success",
            "text": "With this you've completed the setup of the main Governance Programs oriented to newcomers! Now it's time to contribute your User Profile to the Superalgos repository!",
            "updated": 1630754628606,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Con esto, has completado la configuración de la Governance Programs orientado a los recién llegados! ¡Ahora es el momento de contribuir con tu User Profile al repositorio de Superalgos!",
                    "updated": 1630898857914,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "На этом вы завершили настройку основных программ управления Governance Programs, ориентированных на новичков! Пришло время добавить свой профиль пользователя User Profile в репозиторий Superalgos!",
                    "updated": 1639053374051
                },
                {
                    "language": "DE",
                    "text": "Damit haben Sie die Einrichtung der wichtigsten Governance-Programme für Neueinsteiger abgeschlossen! Jetzt ist es an der Zeit, Ihr Benutzerprofil zum Superalgos-Repository beizutragen!",
                    "updated": 1640081918820
                },
                {
                    "language": "TR",
                    "text": "Bununla yeni gelenlere yönelik ana Yönetim Programlarının (Governance Programs) kurulumunu tamamladınız! Şimdi Kullanıcı Profilinizi Superalgos deposuna gönderme zamanı!",
                    "updated": 1645102891410
                },
                {
                    "language": "ID",
                    "text": "Dengan ini kamu telah menyelesaikan penyiapan utama Governance Programs yang diorientasikan pada pendatang baru! Sekarang saatnya kontribusikan User Profil kamu ke repositori Superalgos!",
                    "updated": 1671544968508
                }
            ]
        }
    ]
}