{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 35,
    "type": "Tutorial Step - What Token Power?",
    "definition": {
        "text": "If you have no tokens in your Governance Address, then you have zero Token Power! But don't worry! We'll work something out!",
        "updated": 1630687902755,
        "icon": {
            "name": "Exchange\\exchange-account-asset",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Si no tiene tokens en tu Governance Address, entonces tienes cero Token Power!¡Pero no te preocupes! ¡Trabajaremos en algo!",
                "updated": 1630897494092,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Если в вашем управленческом адресе Governance Address нет токенов, значит, у вас нулевая сила токенов! Но не волнуйтесь! Мы что-нибудь придумаем!",
                "updated": 1639052059931
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Whether you have any Token Power or not, notice that there is now 0% of Token Power going into the Onboarding Programs and 100% going into the Community Building Programs! Floodgates closed, the flow goes elsewhere! You can play with percentages too!",
            "updated": 1630688907038,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si tienes algun Token Powero no, observe que ahora hay 0% de Token Power entrando en el Onboarding Programs y 100% entrando en el Community Building Programs! ¡Las compuertas cerradas, el flujo va a otra parte! ¡También puedes jugar con porcentajes!",
                    "updated": 1630897759311,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Независимо от того, есть ли у вас Token Power или нет, обратите внимание, что теперь 0% Token Power идет на программы Onboarding Programs и 100% идет на программы Community Building Programs! Шлюзы закрыты, поток уходит в другое место! Вы тоже можете играть с процентами!",
                    "updated": 1639052318418
                }
            ]
        },
        {
            "style": "Important",
            "text": "Now, here's the good news... Because chances are that you have no Token Power to fulfill the third requirement to participate in the Community Building Programs, we are going to delegate some power to all User Profiles in this release! Well take care of that, so forget about it! ",
            "updated": 1630689031351,
            "translations": [
                {
                    "language": "ES",
                    "text": "Es probable que no tengas Token Power para cumplir con el tercer requisito para participar en el Community Building Programs, ¡vamos a delegar algo de poder a todos los perfiles de usuario en esta versión!",
                    "updated": 1630897892512,
                    "style": "Important"
                },
                {
                    "language": "RU",
                    "text": "А теперь вот хорошая новость... Поскольку есть вероятность, что у вас нет Token Power для выполнения третьего требования для участия в программах Community Building Programs, мы собираемся делегировать некоторые полномочия всем профилям пользователей User Profiles в этом выпуске! Я позабочусь об этом, так что забудь об этом!",
                    "updated": 1639052440897
                }
            ]
        }
    ]
}