{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 36,
    "type": "Tutorial Step - Tokens Don't Move",
    "definition": {
        "text": "When we talk Token Power Flows, it's important to clarify that tokens don't go anywhere! It's Token Power that flows!",
        "updated": 1630929455261,
        "icon": {
            "name": "stop",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Cuando decimos Token Power Flows, es importante aclarar que los tokens no van a ninguna parte! Es el Token Power el que fluye!",
                "updated": 1633296750160
            },
            {
                "language": "RU",
                "text": "Когда мы говорим о потоках Token Power Flows, важно уточнить, что токены никуда не денутся! Это  течет Token Power!",
                "updated": 1639052530492
            },
            {
                "language": "DE",
                "text": "Wenn wir über Token Power Flows sprechen, ist es wichtig klarzustellen, dass Token nirgendwo hingehen! Es ist Token Power, die fließt!",
                "updated": 1640081480599
            },
            {
                "language": "TR",
                "text": "Token Power Flows'dan bahsederken, jetonlarınızın hiçbir yere gitmediğini söyleyelim. Giden sadece Token Gücünüzdür!",
                "updated": 1645101621540
            },
            {
                "language": "ID",
                "text": "Saat kita berbicara Token Power Flows, penting untuk mengklarifikasi bahwa token tidak ke mana-mana! Kekuatan Tokenlah yang mengalir!",
                "updated": 1671543851019
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Important",
            "text": "Tokens in your Governance Address never leave your address! There is zero cost for participating in governance! The balance in your address confers Token Power to your User Profile, and it is this abstraction that flows down the hierarchy, not actual tokens.",
            "updated": 1630929379130,
            "translations": [
                {
                    "language": "ES",
                    "text": "Tokens en su Governance Address nunca se van de su dirección! Hay cero costo por participar en la gobernancia! El balance en su dirección le confiere Token Power a su User Profile, y es esta abstracción lo que fluye  hacia abajo en la jerarquia, no tokens reales.",
                    "updated": 1633297162024
                },
                {
                    "language": "RU",
                    "text": "Токены в вашем адресе управления Governance Address никогда не покидают ваш адрес! Нет никаких затрат на участие в управлении! Баланс в вашем адресе наделяет ваш профиль пользователя абстракцией Token Power, и именно эта абстракция течет вниз по иерархии, а не фактические токены.",
                    "updated": 1639052656259
                },
                {
                    "language": "DE",
                    "text": "Token in Ihrer Governance-Adresse verlassen niemals Ihre Adresse! Es gibt keine Kosten für die Teilnahme an der Governance! Das Guthaben in Ihrer Adresse verleiht Ihrem Benutzerprofil Token Power, und es ist diese Abstraktion, die in der Hierarchie nach unten fließt, nicht die tatsächlichen Token.",
                    "updated": 1640081494857
                },
                {
                    "language": "TR",
                    "text": "Yönetim Adresinizdeki jetonlar adresinizden asla kaybolmaz! Yönetime katılmanın sıfır maliyeti vardır! Adresinizdeki bakiye, Kullanıcı Profilinize Token Gücü verir ve hiyerarşide aşağı doğru akan gerçek Tokenler değil, bu tokenlerden gelen gücünüzdür.",
                    "updated": 1645101689739
                },
                {
                    "language": "ID",
                    "text": "Token yang ada pada Governance Address kamu tidak pernah pindah keluar! Tidak ada biaya untuk berpartisipasi dalam governance! Saldo pada alamat kamu memberikan Token Power ke User Profile kamu, dan abstraksi inilah yang mengalir ke bawah hierarki, bukan token yang sebenarnya.",
                    "updated": 1671543857245
                }
            ]
        },
        {
            "style": "Callout",
            "text": "I'll show you how to play with Token Power Flows before we wrap up the tutorial! Let's now get back to the Community Building Programs!",
            "updated": 1660644278837,
            "translations": [
                {
                    "language": "ES",
                    "text": "Te mostraré cómo jugar con los Token Power Flows antes de terminar el tutorial. ¡Volvamos ahora a los Community Building Programs! ",
                    "updated": 1682521846104
                },
                {
                    "language": "RU",
                    "text": "Напомните мне показать вам, как играть с Token Power Flows, прежде чем мы завершим урок! Но давайте вернемся к программам Community Building Programs, пока мы не заблудились!",
                    "updated": 1639052702735
                },
                {
                    "language": "DE",
                    "text": "Erinnern Sie mich daran, Ihnen zu zeigen, wie Sie mit Token Power Flows spielen können, bevor wir das Tutorial abschließen! Aber lassen Sie uns zu den Community Building Programs zurückkehren, bevor wir uns verirren!",
                    "updated": 1640081505208
                },
                {
                    "language": "TR",
                    "text": "Öğreticiyi tamamlamadan önce Token Power Flows ile nasıl oynanacağını göstermemi bana hatırlat! Ama yolumuzu kaybetmeden önce Topluluk Oluşturma Programlarına (Community Building Programs) geri dönelim!",
                    "updated": 1645101763408
                },
                {
                    "language": "ID",
                    "text": "Aku akan memperlihatkanmu bagaimana bermain dengan Token Power Flows sebelum kita mengakhiri tutorialnya! Sekarang mari kita kembali ke Community Building Programs!",
                    "updated": 1671543863416
                }
            ]
        }
    ]
}