{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 17,
    "type": "Tutorial Step - Backup the Key!",
    "definition": {
        "text": "You need the back up the private key so that you may later import your Governance Address in a crypto wallet.",
        "updated": 1630932770708,
        "icon": {
            "name": "Key\\key-reference",
            "project": "Foundations"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Necesitas la copia de seguridad de la clave privada para luego importar tu dirección de gobierno en una billetera criptográfica.",
                "updated": 1632014909086,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Daha sonra Yönetim Adresinizi ( Governance Address ) bir kripto cüzdanına aktarabilmeniz için özel anahtarı yedeklemeniz gerekir.",
                "updated": 1637244864917
            },
            {
                "language": "RU",
                "text": "Вам нужна резервная копия закрытого ключа, чтобы впоследствии вы могли импортировать свой управляющий адрес Governance Address в криптокошелек.",
                "updated": 1639047714952
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Superalgos generates the private key locally. No one else in the world has access or knowledge of your key, as long as your machine is secure.",
            "updated": 1630933019771,
            "translations": [
                {
                    "language": "ES",
                    "text": "Superalgos genera la clave privada localmente. Nadie más en el mundo tiene acceso o conocimiento de tu clave, siempre que su máquina sea segura.",
                    "updated": 1632014575112,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Superalgos, özel anahtarı yerel olarak oluşturur. Makineniz güvende olduğu sürece, dünyada başka hiç kimse anahtarınıza erişemez veya anahtarınıza ilişkin bilgi sahibi olamaz.",
                    "updated": 1637244882805
                },
                {
                    "language": "RU",
                    "text": "Superalgos генерирует закрытый ключ локально. Никто в мире не имеет доступа к вашему ключу и не знает его, пока ваша машина в безопасности.",
                    "updated": 1639047734831
                }
            ]
        },
        {
            "style": "Warning",
            "text": "Some people print several copies of the private key to store each copy in different places. Remember that most cases of lost crypto involve people losing keys, not hacks!",
            "updated": 1630932986220,
            "translations": [
                {
                    "language": "ES",
                    "text": "Algunas personas imprimen varias copias de la clave privada para almacenarla en diferentes lugares. Recuerda la mayoría de los casos de criptomonedas perdidas involucran personas que pierden claves, ¡no hackeos!",
                    "updated": 1632014671513,
                    "style": "Warning"
                },
                {
                    "language": "TR",
                    "text": "Uyarı: Bazı kişiler, her kopyayı farklı yerlerde saklamak için özel anahtarın birkaç kopyasını yazdırır. Çoğu kayıp kripto vakasının, hacklerden değil, anahtarları kaybeden insanlardan kaynaklandığını unutmayın!",
                    "updated": 1637244946888
                },
                {
                    "language": "RU",
                    "text": "Некоторые люди распечатывают несколько копий закрытого ключа, чтобы хранить каждую копию в разных местах. Помните, что в большинстве случаев потери криптовалюты связаны с потерей ключей людьми, а не с взломом!",
                    "updated": 1639047754684
                }
            ]
        },
        {
            "style": "Note",
            "text": "If you linked a previously owned address you will not need to save the private key but should back up the contents of the constructor for safety.",
            "translations": [
                {
                    "language": "ES",
                    "text": "Al vincular una dirección anterior, no necesitarás guardar la clave privada, pero debes hacer un Backup del contenido del constructor.",
                    "updated": 1632016270585,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": " Not: Daha önce sahip olduğunuz bir adresi bağladıysanız, özel anahtarı kaydetmeniz gerekmez, ancak güvenlik için kurucunun ( Constructor ) içeriğini yedeklemeniz gerekir.",
                    "updated": 1637245002227
                },
                {
                    "language": "RU",
                    "text": "Если вы связали ранее принадлежавший адрес, вам не нужно сохранять закрытый ключ, но для безопасности следует создать резервную копию содержимого конструктора.",
                    "updated": 1639047772176
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}