{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 41,
    "type": "Tutorial Step - To Infinity and Beyond",
    "definition": {
        "text": "Under the Governance-Plugins row, you should see your User Profile plugin file listed.",
        "updated": 1660647880034,
        "icon": {
            "name": "User\\user-profile",
            "project": "Governance"
        },
        "translations": [
            {
                "language": "ES",
                "text": " En la fila Governance-Plugins, debería ver el archivo del plugin User Profile en la lista.",
                "updated": 1682522148351,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Погнали! Мы будем использовать команду app.contribute для отправки вашего профиля.",
                "updated": 1639053568479
            },
            {
                "language": "DE",
                "text": "Los geht's! Wir werden den Befehl <i>app.contribute</i> verwenden, um Ihr Profil einzureichen.",
                "updated": 1640082340841
            },
            {
                "language": "TR",
                "text": "Hadi başlayalım! Profilinizi göndermek için app.contribute komutunu kullanacağız.",
                "updated": 1645104660981
            },
            {
                "language": "ID",
                "text": "Pada bawah baris Governance-Plugins, kamu akan melihat file plugin User Profile-mu yang terdaftar.",
                "updated": 1671545675285
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Enter a commit message, like \"First profile submission\", and click the Contribute button!",
            "updated": 1660647967222,
            "translations": [
                {
                    "language": "ES",
                    "text": "Introduzca un mensaje de confirmación, como \"Primer envío de perfil\", y haga clic en el botón Contribuir. ",
                    "updated": 1682522189293,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Скопируйте команду, убедившись, что вы заменили заполнитель своим именем пользователя Github, вставьте его в поле поиска и нажмите Enter.",
                    "updated": 1639053625713
                },
                {
                    "language": "DE",
                    "text": "Kopieren Sie den Befehl und ersetzen Sie den Platzhalter durch Ihren Github-Benutzernamen, fügen Sie ihn in das Suchfeld ein und klicken Sie auf Enter.",
                    "updated": 1640082358682
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki komutu kopyalayın, arama kutusuna yapıştırın ve \"add your name\" kısmını  Github kullanıcı adınızla değiştirerek Enter'a tıklayın.",
                    "updated": 1645104765848
                },
                {
                    "language": "ID",
                    "text": "Masukkan pesan commit seperti \"First profile submission\", dan klik tombol Contribute!",
                    "updated": 1671545681762
                }
            ]
        },
        {
            "style": "Note",
            "text": "If everything is set up correctly, within a few seconds the plugin file should disappear from the list and you should get a message confirming the contribution was sent. This means that your profile has been sent to the Governance-Plugins repository and will be automatically merged within a few hours!",
            "updated": 1660648163819,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si todo está configurado correctamente, en unos segundos el archivo del plugin debería desaparecer de la lista y deberías recibir un mensaje confirmando que la contribución ha sido enviada. Esto significa que tu perfil ha sido enviado al repositorio Governance-Plugins y será automáticamente fusionado en unas horas.",
                    "updated": 1682522220406,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Если все настроено правильно, вы должны увидеть сообщение о том, что ваш запрос на перенос был отправлен. Это означает, что ваш профиль был отправлен в основной репозиторий Superalgos и будет автоматически объединен в течение нескольких часов!",
                    "updated": 1639053703579
                },
                {
                    "language": "DE",
                    "text": "Wenn alles korrekt eingerichtet ist, sollten Sie eine Nachricht sehen, die besagt, dass Ihr Pull Request eingereicht wurde. Dies bedeutet, dass Ihr Profil an das Haupt-Repository von Superalgos gesendet wurde und innerhalb weniger Stunden automatisch zusammengeführt wird!",
                    "updated": 1640082370088
                },
                {
                    "language": "TR",
                    "text": "Her şey doğru ayarlanmışsa, Pull Request'inizin gönderildiğini belirten bir mesaj görmelisiniz. Bu, profilinizin ana Superalgos deposuna gönderildiği ve birkaç saat içinde otomatik olarak birleştirileceği anlamına gelir!",
                    "updated": 1645105046961
                },
                {
                    "language": "ID",
                    "text": "Jika semuanya diatur dengan benar, dalam beberapa detik file plugin akan hilang dari daftar dan kamu akan mendapatkan pesan yang mengonfirmasi bahwa kontribusimu telah terkirim. Ini berarti profil kamu telah masuk ke repositori Governance-Plugins dan akan digabungkan secara otomatis dalam beberapa jam!",
                    "updated": 1671545688038
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}