{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 43,
    "type": "Tutorial Step - Deep Governance",
    "definition": {
        "text": "Are you ready to go deeper into the Governance rabbit hole?<br/> If you're just starting with Superalgos, you don't <i>need</i> to go any further at this point!",
        "icon": {
            "name": "governance",
            "project": "Governance"
        },
        "updated": 1630753677065,
        "translations": [
            {
                "language": "ES",
                "text": "¿Estás listo para adentrarte más en la madriguera de la gobernanza? Si recién está comenzando con Superalgos, ¡no necesita ir más lejos ahora!",
                "updated": 1630899585481,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Готовы ли вы углубиться в кроличью нору управления? Если вы только начинаете с Superalgos, вам не нужно углубляться в этот момент!",
                "updated": 1639054031794
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "However, if you're invested in the project and wish to place some Contribution Claims or cast some votes, then you have some reading to do!",
            "updated": 1630753559879,
            "translations": [
                {
                    "language": "ES",
                    "text": "Sin embargo, si has invertido en el proyecto y deseas realizar algunas reclamaciones de contribución o emitir algunos votos, ¡tienes que leer un poco!",
                    "updated": 1630899572852,
                    "style": "Text"
                },
                {
                    "language": "RU",
                    "text": "Однако, если вы вложили средства в проект и хотите подать несколько требований о взносах Contribution Claims или подать несколько голосов, вам нужно кое-что почитать!",
                    "updated": 1639054094052
                }
            ]
        },
        {
            "style": "Callout",
            "text": "The Governance Project book on the right takes you deep into all Governance Programs, including those we haven't covered yet!",
            "updated": 1630753327041,
            "translations": [
                {
                    "language": "ES",
                    "text": "The Governance Project el libro de la derecha te lleva a lo más profundo de todo Governance Programs, ¡incluidos los que aún no hemos cubierto!",
                    "updated": 1630899611785,
                    "style": "Callout"
                },
                {
                    "language": "RU",
                    "text": "Книга Governance Project справа познакомит вас со всеми программами управления Governance Programs, включая те, которые мы еще не рассмотрели!",
                    "updated": 1639054160691
                }
            ]
        },
        {
            "style": "Success",
            "text": "You're on your own from here on! If you have any questions about governance or the token, please join the Token Group in Telegram!",
            "updated": 1630753481035,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si tiene alguna pregunta sobre la gobernanza o el token, ¡únte al Token Group en Telegram!",
                    "updated": 1630899662771,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "С этого момента ты сам по себе! Если у вас есть какие-либо вопросы по управлению или токену, присоединяйтесь к группе Token Group в Telegram!",
                    "updated": 1639054213957
                }
            ]
        }
    ]
}