{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 13,
    "type": "Tutorial Step - Oh so Shiny",
    "definition": {
        "text": "We are almost there! To finish the process, you need to click the right button on the Profile Constructor node!",
        "icon": {
            "name": "User\\user-profile",
            "project": "Governance"
        },
        "updated": 1660641883460,
        "translations": [
            {
                "language": "ES",
                "text": "¡Ya casi hemos terminado! Para finalizar el proceso, debes hacer clic con el botón derecho en el nodo Constructor de perfiles.",
                "updated": 1682520248613,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Neredeyse geldik. Şimdi Profil Oluştur'a (Build Profile) tıklayın ve sihrin gerçekleşmesini izleyin. Evet, profilinizi yeni oluşturdunuz!",
                "updated": 1644578242594
            },
            {
                "language": "RU",
                "text": "Мы почти на месте. Теперь нажмите Build Profile и посмотрите, как происходит волшебство. Правильно, вы только что создали свой профиль!",
                "updated": 1639047257246
            },
            {
                "language": "DE",
                "text": "Wir sind fast am Ziel. Klicken Sie jetzt auf <i>Build Profile</i> und beobachten Sie, wie die Magie geschieht. Richtig, Sie haben gerade Ihr Profil erstellt!",
                "updated": 1640073239787
            },
            {
                "language": "ID",
                "text": "Kita akan sampai sedikit lagi! Untuk menyelesaikan prosesnya, kamu harus meng-klik tombol kanan  pada node Profile Constructor!",
                "updated": 1670854068135
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "If you are creating a new wallet, click the Build Profile and New Wallet button.</br></br>If you are linking an existing wallet, click the Build Profile with Mnemonic button.",
            "updated": 1660641803806,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si deseas crear un nuevo monedero, haz clic en el botón Crear perfil y nuevo monedero. Si deseas vincular un monedero existente, haz clic en el botón Crear perfil con mnemónico.",
                    "updated": 1682520290097,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Profilinizi ter dökmeden oluştururken, sahne arkasında oldukça şaşırtıcı şeyler oldu.",
                    "updated": 1637243000359
                },
                {
                    "language": "RU",
                    "text": "Хотя нам не пришлось беспокоиться о создании вашего профиля, за кулисами происходили довольно удивительные вещи.",
                    "updated": 1639047272620
                },
                {
                    "language": "DE",
                    "text": "Obwohl wir bei der Erstellung Ihres Profils nicht ins Schwitzen gekommen sind, sind hinter den Kulissen einige erstaunliche Dinge passiert.",
                    "updated": 1640073250598
                },
                {
                    "language": "ID",
                    "text": "Jika kamu membuat wallet baru, klik tombol Build Profile dan New Wallet. Jika kamu mengkoneksikan wallet yang ada, klik tombol Build Profile with Mnemonic.",
                    "updated": 1670854165423
                }
            ]
        },
        {
            "style": "Text",
            "text": "Done! Now, this is what happened behind the scenes...",
            "updated": 1660641960414,
            "translations": [
                {
                    "language": "ID",
                    "text": "Selesai! Sekarang, inilah yang terjadi di balik layar...",
                    "updated": 1670854112190
                },
                {
                    "language": "ES",
                    "text": "¡Hecho! Ahora, esto es lo que pasó entre bastidores...",
                    "updated": 1682520307521
                }
            ]
        },
        {
            "style": "Note",
            "text": "The constructor just generated your user profile, and either linked your address or created a unique SA Token Governance Address.",
            "updated": 1630599816232,
            "translations": [
                {
                    "language": "ES",
                    "text": "El constructor acaba de generar su perfil de usuario y vinculó su dirección o creó un SA Token Governance Address.",
                    "updated": 1682520334425,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Constructor, kullanıcı profilinizi oluşturdu, adresinizi bağladı ve benzersiz bir SA Token Yönetim Adresi ( Governance Address ) oluşturdu.",
                    "updated": 1644578254449
                },
                {
                    "language": "RU",
                    "text": "Конструктор только что сгенерировал ваш профиль пользователя и либо связал ваш адрес, либо создал уникальный адрес Governance Address токенов SA.",
                    "updated": 1639047406304
                },
                {
                    "language": "DE",
                    "text": "Der Konstruktor hat gerade Ihr Benutzerprofil erstellt und entweder Ihre Adresse verknüpft oder eine eindeutige SA Token Governance Address erstellt.",
                    "updated": 1640073263975
                },
                {
                    "language": "ID",
                    "text": "Constructor hanya menghasilkan user profile kamu, dan menautkan alamat kamu atau membuat token SA Governance Address yang unik.",
                    "updated": 1670854118996
                }
            ]
        }
    ]
}