{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 13,
    "type": "Tutorial Step - Oh so Shiny",
    "definition": {
        "text": "We are almost there. Now click <i>Build Profile</i> and watch the magic happen. That’s right, you just created your profile!",
        "icon": {
            "name": "User\\user-profile",
            "project": "Governance"
        },
        "updated": 1630658421560,
        "translations": [
            {
                "language": "ES",
                "text": "Estamos casi alli. Ahora has clic enBuild Profile y ve cómo sucede la magia. Así es, ¡acabas de crear tu perfil!",
                "updated": 1630888309658,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Neredeyse geldik. Şimdi Profil Oluştur'a ( Build Profile ) tıklayın ve sihrin gerçekleşmesini izleyin. Evet, profilinizi yeni oluşturdunuz!",
                "updated": 1637242566507
            },
            {
                "language": "RU",
                "text": "Мы почти на месте. Теперь нажмите Build Profile и посмотрите, как происходит волшебство. Правильно, вы только что создали свой профиль!",
                "updated": 1639047257246
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "While we didn’t have to break a sweat making your profile, some pretty amazing things happened behind the scenes. ",
            "updated": 1629553522636,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si bien no tuvimos que sudar mucho para crear tu perfil, sucedieron algunas cosas asombrosas detrás de escena.",
                    "updated": 1630888348614,
                    "style": "Text"
                },
                {
                    "language": "TR",
                    "text": "Profilinizi ter dökmeden oluştururken, sahne arkasında oldukça şaşırtıcı şeyler oldu.",
                    "updated": 1637243000359
                },
                {
                    "language": "RU",
                    "text": "Хотя нам не пришлось беспокоиться о создании вашего профиля, за кулисами происходили довольно удивительные вещи.",
                    "updated": 1639047272620
                }
            ]
        },
        {
            "style": "Note",
            "text": "The constructor just generated your user profile, and either linked your address or created a unique SA Token Governance Address.",
            "updated": 1630599816232,
            "translations": [
                {
                    "language": "ES",
                    "text": "TEl constructor acaba de generar su perfil de usuario y vinculó su dirección o creó un SA Token Governance Address.",
                    "updated": 1630888438347,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Constructor, kullanıcı profilinizi oluşturdu, adresinizi bağladı ve benzersiz bir SA Token Yönetim Adresi ( Governance Addrss ) oluşturdu.",
                    "updated": 1637243124914
                },
                {
                    "language": "RU",
                    "text": "Конструктор только что сгенерировал ваш профиль пользователя и либо связал ваш адрес, либо создал уникальный адрес Governance Address токенов SA.",
                    "updated": 1639047406304
                }
            ]
        }
    ]
}