{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 15,
    "type": "Tutorial Step - Under the Hood",
    "definition": {
        "text": "Let's take a closer look at the cryptographic signature in your new profile.",
        "updated": 1630658552742,
        "icon": {
            "name": "User\\user-profile",
            "project": "Governance"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Echemos un vistazo más de cerca a la firma criptográfica en tu nuevo perfil.",
                "updated": 1630888742337,
                "style": "Definition"
            },
            {
                "language": "TR",
                "text": "Yeni profilinizdeki kriptografik imzaya daha yakından bakalım.",
                "updated": 1637244588517
            },
            {
                "language": "RU",
                "text": "Давайте подробнее рассмотрим криптографическую подпись в вашем новом профиле.",
                "updated": 1639047574989
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Click the configuration option on your User Profile node and take a look at what's inside.",
            "updated": 1629554250933,
            "translations": [
                {
                    "language": "ES",
                    "text": "Haz clic en la opción de configuración en tu nodo User Profile y echa un vistazo a lo que hay dentro.",
                    "updated": 1630888787848,
                    "style": "Callout"
                },
                {
                    "language": "TR",
                    "text": "Kullanıcı Profili ( User Profile ) düğümünüzdeki yapılandırma seçeneğine tıklayın ve içinde ne olduğuna bir göz atın.",
                    "updated": 1637244643042
                },
                {
                    "language": "RU",
                    "text": "Щелкните параметр конфигурации в узле User Profile и посмотрите, что внутри.  ",
                    "updated": 1639047625180
                }
            ]
        },
        {
            "style": "Note",
            "text": "Wow that’s a lot of numbers! Again, this is how the governance system will know that this User Profile belongs to the private key that signed the message, which in turn belongs to the address that will hold the tokens that confer your profile with Token Power.",
            "updated": 1629554289159,
            "translations": [
                {
                    "language": "ES",
                    "text": "¡Vaya, son muchos números! Nuevamente, así es como el sistema de gobernanza sabrá que este User Profile pertenece a la clave privada que firmó el mensaje, que a su vez pertenece a la dirección que albergará los tokens que confieren tu perfil con Token Power.",
                    "updated": 1630888835905,
                    "style": "Note"
                },
                {
                    "language": "TR",
                    "text": "Not: Vay, ne kadar çok sayı var! Yönetim sistemi bu şekilde, bu Kullanıcı Profilinin ( User Profile ) mesajı imzalayan özel anahtara ait olduğunu bilecektir, bu da profilinize Token Gücü veren tokenleri tutacak adrese aittir.",
                    "updated": 1637244772999
                },
                {
                    "language": "RU",
                    "text": "Ух ты, много цифр! Опять же, именно так система управления узнает, что этот профиль пользователя принадлежит закрытому ключу, подписавшему сообщение, который, в свою очередь, принадлежит адресу, который будет содержать токены, которые присваивают вашему профилю Token Power.",
                    "updated": 1639047671461
                }
            ]
        }
    ]
}