{
    "tutorial": "Creating Your User Profile Tutorial",
    "pageNumber": 30,
    "type": "Tutorial Step - Load the User Profile",
    "definition": {
        "text": "Use the search box to find the profile you are looking for! Go to the Workspace tab and find the User Profile node matching the name you searched for!",
        "updated": 1660646345682,
        "icon": {
            "name": "User\\user-profile",
            "project": "Governance"
        },
        "translations": [
            {
                "language": "ES",
                "text": "Utilice el cuadro de búsqueda para encontrar el perfil que busca. Vaya a la pestaña Espacio de trabajo y busque el nodo Perfil de usuario que coincida con el nombre que ha buscado. ",
                "updated": 1682521134676,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Вы знаете, кто ваш реферер? У вашего реферера есть профиль пользователя User Profile? Как найти и загрузить нужный профиль?",
                "updated": 1639050613920
            },
            {
                "language": "DE",
                "text": "Wissen Sie, wer Ihr Empfehler ist? Hat Ihr Referrer ein Benutzerprofil? Wie können Sie das richtige Profil finden und laden?",
                "updated": 1640079953874
            },
            {
                "language": "TR",
                "text": "Özet: Yönlendirenin kim olduğunu biliyor musun? Yönlendiren kişinin Kullanıcı Profili (User Profile) var mı? Doğru profili nasıl bulur ve yüklersiniz?",
                "updated": 1645092385492
            },
            {
                "language": "ID",
                "text": "Gunakan box pencarian untuk menemukan profil yang kamu cari! Pergi ke tab Workspace dan temukan node User Profile yang sama dengan nama yang kamu cari!",
                "updated": 1671528150953
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Callout",
            "text": "Make sure you find an actual User Profile node, and not any other kind of node, and click on it!",
            "updated": 1660646418044,
            "translations": [
                {
                    "language": "ID",
                    "text": "Pastikan kamu menemukan node User Profile yang sebenarnya, dan bukan jenis node lainnya, dan klik di atasnya!",
                    "updated": 1671528158112
                },
                {
                    "language": "ES",
                    "text": "Asegúrate de encontrar un nodo de perfil de usuario real, y no cualquier otro tipo de nodo, y haz clic en él.",
                    "updated": 1682521149810
                }
            ]
        },
        {
            "style": "Note",
            "text": "If you can't find the profile you're looking for, you may need to add it manually to the workspace. If that is the case, please refer to the Load a User Profile page in the Docs!",
            "updated": 1660643096627,
            "translations": [
                {
                    "language": "ES",
                    "text": "Si no encuentras el perfil que buscas, puede que tengas que añadirlo manualmente al área de trabajo. ¡En ese caso, consulte la página Cargar un perfil de usuario en Docs!",
                    "updated": 1682521173668,
                    "style": "Note"
                },
                {
                    "language": "RU",
                    "text": "Я привел вас к профилю Dummy profile, упомянутому в руководстве, чтобы вам было проще!",
                    "updated": 1639050685885
                },
                {
                    "language": "DE",
                    "text": "Ich habe Sie zu dem in der Anleitung erwähnten Dummy-Profil geführt, um es Ihnen leichter zu machen!",
                    "updated": 1640079967268
                },
                {
                    "language": "TR",
                    "text": "İşinizi kolaylaştırmak için sizi rehberde bahsedilen Dummy profiline getirdim!",
                    "updated": 1645092431093
                },
                {
                    "language": "ID",
                    "text": "Jika kamu tidak memenukan profil yang kamu cari, kamu harus menambahkannya secara manual ke workspace. Jika itu kasusnya, silahkan lihat halaman Load a User Profile di Docs!",
                    "updated": 1671528164608
                }
            ]
        },
        {
            "style": "Text",
            "text": "New profiles are added to the governance Native Workspace before each distribution event.",
            "updated": 1660643324416,
            "translations": [
                {
                    "language": "ES",
                    "text": "Los nuevos perfiles se añaden al Native Workspace de gobierno antes de cada evento de distribución.",
                    "updated": 1682521246636,
                    "style": "Success"
                },
                {
                    "language": "RU",
                    "text": "Кстати, обратите внимание, что профили участников сообщества Community Mods и Founding Team уже загружены!",
                    "updated": 1639050725765
                },
                {
                    "language": "DE",
                    "text": "Beachte übrigens, dass die Profile von Community Mods und Founding Team Mitgliedern bereits geladen sind!",
                    "updated": 1640079976555
                },
                {
                    "language": "TR",
                    "text": "Bu arada, Topluluk Modlarının (Community Mods) ve Çekirdek Ekip (Founding Team) üyelerinin profillerinin zaten yüklenmiş olduğuna dikkat edin!",
                    "updated": 1645092477222
                },
                {
                    "language": "ID",
                    "text": "Profil baru akan ditambahkan ke governance Native Workspaces ebelum tiap event distribusi.",
                    "updated": 1671528173184
                }
            ]
        }
    ]
}