{
    "type": "Token Power Flows",
    "definition": {
        "text": "Token Power flows cascading down from the User Profile node to the Token Power Switch node, to its offspring, and so on, following the structure of the hierarchy.",
        "updated": 1630215880089
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1630216073912
        },
        {
            "style": "Text",
            "text": "How Token Power flows depends on the following:"
        },
        {
            "style": "List",
            "text": "By default, Token Power flows in equal proportion to each direct offspring node."
        },
        {
            "style": "List",
            "text": "You may override the defaults by explicitly defining the percentage of the Token Power you wish to allocate to each offspring. If you define less than a total of 100%, then the remaining Token Power is distributed evenly across the offspring for which there is no definition."
        },
        {
            "style": "Text",
            "text": "This is the format of the configuration you may use on each of the programs:"
        },
        {
            "style": "Json",
            "text": "{\n\"percentage\": 50\n}",
            "updated": 1630215956488
        },
        {
            "style": "Text",
            "text": "For example, let's say you have 1,000 Token Power flowing into your Token Power Switch node. Let's say you spawn the Onboarding Programs, Community Building Programs, Votes And Claims Programs, and Financial Programs nodes.",
            "updated": 1630436060757
        },
        {
            "style": "Callout",
            "text": "As soon as you deploy these four offspring of the Token Power Switch node, you will see that each of the nodes gets 25% of the Token Power by default.",
            "updated": 1630436087763
        },
        {
            "style": "Text",
            "text": "But you wish to limit the Token Power flowing into the Onboarding Programs to zero, as those programs do not require Token Power. To do that, you set up the following in the Onboarding Programs node configuration:"
        },
        {
            "style": "Json",
            "text": "{\n\"percentage\": 0\n}",
            "updated": 1630215994714
        },
        {
            "style": "Callout",
            "text": "Once the configuration is in place, you will notice that the Onboarding Programs node shows 0% and 0 Token Power flowing into the node. You will also notice that the rest of the nodes are getting 33.33% of the Token Power each."
        },
        {
            "style": "Text",
            "text": "Now let's say you wish to use only 10% of your Token Power in the Community Building Programs. So you set up the following config:",
            "updated": 1630436162265
        },
        {
            "style": "Json",
            "text": "{\n\"percentage\": 10\n}",
            "updated": 1630216035853
        },
        {
            "style": "Callout",
            "text": "As a result, 10% of the Token Power flows into the Community Building Programs, while the remaining nodes get 45% of the Token Power each.",
            "updated": 1630436168281
        },
        {
            "style": "Important",
            "text": "One more thing! When Token Power flows into a specific program, it turns into a specific form of power associated with the said program! For example, Token Power that flows into the Support Program turns into Support Power. In the Voting Program, it turns into Voting Power. Notice that this is just a change in the name, as all these forms of powers behave in the same manner throughout the User Profile hierarchy.",
            "updated": 1630436471069
        }
    ]
}