{
    "type": "Polygon Condition",
    "definition": {
        "text": "A polygon condition is a rule that allows establishing when a polygon shall be rendered and when not.",
        "translations": [
            {
                "language": "RU",
                "text": "Polygon Condition - это правило, которое позволяет установить, когда полигон должен быть отрисован, а когда нет.",
                "updated": 1639727534194
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The node is optional. When the node is not present in the definition of the polygon or when the condition validates true, the polygon is rendered on screen. When the condition validates false the polygon is not rendered. As such, the node allows dynamically switching the rendering of the corresponding polygon on and off.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Узел является необязательным. Если узел не присутствует в определении полигона или если условие считается истинным (true), полигон отображается на экране. При ложном (false) значении условия полигон не отображается. Таким образом, узел позволяет динамически включать и выключать отрисовку соответствующего полигона.",
                    "updated": 1639727624419
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring"
        },
        {
            "style": "Title",
            "text": "Polygon Condition Configuration",
            "updated": 1609853769074,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Polygon Condition",
                    "updated": 1639727646589
                }
            ]
        },
        {
            "style": "Text",
            "text": "Polygon Conditions work pretty much like conditions used on trading systems. The main difference is that the variables available are solely those provided by the bot product definition that reference the corresponding plotter module.",
            "updated": 1609853810664,
            "translations": [
                {
                    "language": "RU",
                    "text": "Условия Polygon Condition работают практически так же, как условия, используемые в торговых системах. Основное отличие заключается в том, что доступными переменными являются только те, которые предусмотрены определением продукта Product Definition бота, ссылающегося на соответствующий модуль плоттера Plotter Module.",
                    "updated": 1639727781056
                }
            ]
        }
    ]
}