{
    "topic": "Trading Engine",
    "pageNumber": "6",
    "type": "Base Asset and Quoted Asset",
    "definition": {
        "text": "Keep track of accounts denominated in the base asset and the quoted asset, in multiple contexts. On this page: Episode Base Asset, Episode Quoted Asset, Position Base Asset, Position Quoted Asset, Stage Base Asset, Stage Quoted Asset, Order Base Asset, Order Quoted Asset.",
        "updated": 1611258310236,
        "translations": [
            {
                "language": "RU",
                "text": "Ведите учет счетов, выраженных в базовом активе и котируемом активе, в различных контекстах. На этой странице: Episode Base Asset, Episode Quoted Asset, Position Base Asset, Position Quoted Asset, Stage Base Asset, Stage Quoted Asset, Order Base Asset, Order Quoted Asset.",
                "updated": 1640344134647
            },
            {
                "language": "TR",
                "text": "Temel varlıkta ve kote varlıkta belirtilen hesapları birden çok durumda takip edin. Bu sayfada aşağıdakileri göreceksiniz: Episode Base Asset, Episode Quoted Asset, Position Base Asset, Position Quoted Asset, Stage Base Asset, Stage Quoted Asset, Order Base Asset, Order Quoted Asset.",
                "updated": 1642342380340
            },
            {
                "language": "DE",
                "text": "Behalten Sie den Überblick über Konten, die auf den Basiswert und den notierten Wert lauten, in verschiedenen Kontexten. Auf dieser Seite: Episode Base Asset, Episode Quoted Asset, Position Base Asset, Position Quoted Asset, Stage Base Asset, Stage Quoted Asset, Order Base Asset, Order Quoted Asset.",
                "updated": 1693254270258
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Because the system aims to be as flexible as possible, the trading engine keeps the accounts relative to both the base asset and the quoted asset. This allows the user to set up the trading system with whatever logic is required and decide which set of accounts suits the intent—the goal—of the trading strategy.",
            "updated": 1611258333516,
            "translations": [
                {
                    "language": "RU",
                    "text": "Поскольку система стремится быть максимально гибкой, торговый движок сохраняет счета относительно базового актива и котируемого актива. Это позволяет пользователю настроить торговую систему с любой логикой и решить, какой набор счетов соответствует замыслу - цели торговой стратегии.",
                    "updated": 1640344161431
                },
                {
                    "language": "TR",
                    "text": "Sistem mümkün olduğunca esnek olmayı amaçladığından, ticaret motoru hesapları hem temel varlığa hem de kote varlığa göre tutar. Bu, kullanıcının ticaret sistemini gerekli olan mantıkla kurmasına ve hangi hesap setinin ticaret stratejisinin amacına uygun olduğuna karar vermesine olanak tanır.",
                    "updated": 1642342446776
                },
                {
                    "language": "DE",
                    "text": "Da das System so flexibel wie möglich sein soll, behält die Handelsmaschine die Konten sowohl in Bezug auf den Basiswert als auch auf den notierten Wert. Dadurch kann der Benutzer das Handelssystem mit jeder beliebigen Logik einrichten und entscheiden, welcher Kontensatz dem Zweck - dem Ziel - der Handelsstrategie entspricht.",
                    "updated": 1693254282527
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Notice that—usually—the accounts denominated in one asset will be valid, while the accounts denominated in the other asset will likely make no sense.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Обратите внимание, что обычно счета, выраженные в одном активе, будут действительными, а счета, выраженные в другом активе, скорее всего, не будут иметь смысла.",
                    "updated": 1640344189307
                },
                {
                    "language": "TR",
                    "text": "Dikkat edin - genellikle - bir varlıkta belirtilen hesaplar geçerli olurken, diğer varlıkta belirtilen hesaplar muhtemelen hiçbir anlam ifade etmeyecektir.",
                    "updated": 1642363998521
                },
                {
                    "language": "DE",
                    "text": "Beachten Sie, dass die Konten, die auf einen Vermögenswert lauten, in der Regel gültig sind, während die Konten, die auf den anderen Vermögenswert lauten, wahrscheinlich keinen Sinn ergeben.",
                    "updated": 1693254297278
                }
            ]
        },
        {
            "style": "Text",
            "text": "Which set of accounts you will monitor to track the performance of the episode depends on how you define your trading system.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Какой набор счетов вы будете контролировать для отслеживания результативности эпизода, зависит от того, как вы определите свою торговую систему.",
                    "updated": 1640344206252
                },
                {
                    "language": "TR",
                    "text": "Bölümün performansını izlemek için hangi hesap grubunu izleyeceğiniz, ticaret sisteminizi nasıl tanımladığınıza bağlıdır.",
                    "updated": 1642364029592
                },
                {
                    "language": "DE",
                    "text": "Welche Konten Sie überwachen werden, um die Performance der Episode zu verfolgen, hängt davon ab, wie Sie Ihr Handelssystem definieren.",
                    "updated": 1693254308657
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example, If you are trading the BTC/USDT market and developed a trading system to accumulate USDT, then the set of accounts that will make sense for you is the one denominated in the quoted asset, that is, in USDT. This is why:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Например, если вы торгуете на рынке BTC/USDT и разработали торговую систему для накопления USDT, то набор счетов, который будет иметь смысл для вас, это тот, который выражен в котируемом активе, то есть в USDT. Вот почему:",
                    "updated": 1640344232941
                },
                {
                    "language": "TR",
                    "text": "Örneğin, BTC/USDT piyasasında işlem yapıyorsanız ve USDT biriktirmek için bir ticaret sistemi geliştirdiyseniz, sizin için anlamlı olacak hesap seti, kote varlıkta, yani USDT'de belirtilen hesap setidir. Bu nedenle:",
                    "updated": 1642364057203
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie beispielsweise auf dem BTC/USDT-Markt handeln und ein Handelssystem entwickelt haben, um USDT zu akkumulieren, dann ist die Gruppe von Konten, die für Sie sinnvoll ist, diejenige, die auf den notierten Vermögenswert, also auf USDT, lautet. Das ist der Grund:",
                    "updated": 1693254325327
                }
            ]
        },
        {
            "style": "Text",
            "text": "Your strategy will likely buy BTC (the base asset) expecting the price to go up while the position is open, in order to sell BTC at a higher rate and end up with more USDT (the quoted asset) than you started with.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Ваша стратегия, скорее всего, будет покупать BTC (базовый актив), ожидая, что цена будет расти, пока позиция открыта, чтобы продать BTC по более высокому курсу и в итоге получить больше USDT (котируемый актив), чем в начале.",
                    "updated": 1640344298195
                },
                {
                    "language": "TR",
                    "text": "Stratejiniz, BTC'yi daha yüksek bir oranda satmak ve sonunda başladığınızdan daha fazla USDT (kote edilen varlık) elde etmek için pozisyon açıkken fiyatın yükselmesini bekleyerek BTC'yi (temel varlık) satın alacaktır.",
                    "updated": 1642364201227
                },
                {
                    "language": "DE",
                    "text": "Ihre Strategie kauft wahrscheinlich BTC (den Basiswert) in der Erwartung, dass der Preis steigt, während die Position offen ist, um BTC zu einem höheren Kurs zu verkaufen und am Ende mehr USDT (den börsennotierten Wert) zu haben, als Sie zu Beginn hatten.",
                    "updated": 1693254344799
                }
            ]
        },
        {
            "style": "Title",
            "text": "Example",
            "updated": 1611258412121,
            "translations": [
                {
                    "language": "RU",
                    "text": "Пример",
                    "updated": 1640344308052
                },
                {
                    "language": "DE",
                    "text": "Beispiel",
                    "updated": 1693254366189
                }
            ]
        },
        {
            "style": "Text",
            "text": "Let’s say you buy 10,000 USDT worth of BTC. BTC price increases by 10%, so you sell the whole amount of BTC to close the position and end up with 10,900 USDT (exchange fees are deducted from the balance).",
            "translations": [
                {
                    "language": "RU",
                    "text": "Допустим, вы купили BTC на сумму 10 000 USDT. Цена BTC увеличивается на 10%, поэтому вы продаете всю сумму BTC, чтобы закрыть позицию, и в итоге получаете 10 900 USDT (комиссия за обмен вычитается из баланса).",
                    "updated": 1640344338695
                },
                {
                    "language": "TR",
                    "text": "10.000 USDT değerinde BTC aldığınızı varsayalım. BTC fiyatı %10 artar, bu nedenle pozisyonu kapatmak için tüm BTC miktarını satarsınız ve 10.900 USDT ile sonuçlanırsınız (borsa komisyonlarının bakiyeden düştüğünü farzediyorum).",
                    "updated": 1642364260972
                },
                {
                    "language": "DE",
                    "text": "Angenommen, Sie kaufen BTC im Wert von 10.000 USDT. Der BTC-Preis steigt um 10 %, also verkaufen Sie die gesamte BTC-Menge, um die Position zu schließen, und haben am Ende 10.900 USDT (die Wechselgebühren werden vom Saldo abgezogen).",
                    "updated": 1693254378146
                }
            ]
        },
        {
            "style": "Text",
            "text": "In terms of the base asset, your begin balance is 0 BTC and your end balance is 0.00000012 BTC, as the exchange left some BTC dust in the account due to rate conversion limitations. Also in terms of the base asset, your profit loss for the position is...",
            "updated": 1611258453118,
            "translations": [
                {
                    "language": "RU",
                    "text": "Что касается базового актива, ваш начальный баланс составляет 0 BTC, а конечный баланс - 0.00000012 BTC, так как обмен оставил на счете немного BTC из-за ограничений на конвертацию валют. Также с точки зрения базового актива, ваша прибыль-убыток по позиции составляет...",
                    "updated": 1640344376081
                },
                {
                    "language": "TR",
                    "text": "Temel varlık açısından, döviz kur dönüştürme sınırlamaları nedeniyle hesapta bir miktar BTC bıraktığından, başlangıç bakiyeniz 0 BTC ve bitiş bakiyeniz 0.00000012 BTC'dir. Ayrıca temel varlık açısından, pozisyon için kar kaybınız...",
                    "updated": 1642364341144
                },
                {
                    "language": "DE",
                    "text": "In Bezug auf den Basiswert beträgt Ihr Anfangssaldo 0 BTC und Ihr Endsaldo 0,00000012 BTC, da der Umtausch aufgrund von Kursumrechnungsbeschränkungen einige BTC auf dem Konto zurückgelassen hat. Auch in Bezug auf den Basiswert, ist Ihr Gewinn Verlust für die Position...",
                    "updated": 1693254391799
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Json",
            "text": "0.00000012 BTC - 0 BTC = 0.00000012 BTC",
            "updated": 1611258465358
        },
        {
            "style": "Text",
            "text": "ROI and other metrics may be derived from these initial observations as well. Needless to say, such metrics are irrelevant to the intent of the strategy, which is to accumulate USDT.",
            "translations": [
                {
                    "language": "RU",
                    "text": "ROI и другие показатели также могут быть получены из этих первоначальных наблюдений. Само собой разумеется, такие показатели не имеют отношения к замыслу стратегии, который заключается в накоплении USDT.",
                    "updated": 1640344395959
                },
                {
                    "language": "TR",
                    "text": "ROI ve diğer metrikler de bu ilk gözlemlerden türetilebilir. Söylemeye gerek yok, bu tür ölçümler, USDT biriktirmek olan stratejinin amacı ile ilgisizdir.",
                    "updated": 1642364369042
                },
                {
                    "language": "DE",
                    "text": "Aus diesen anfänglichen Beobachtungen können auch der ROI und andere Kennzahlen abgeleitet werden. Natürlich sind solche Kennzahlen für den Zweck der Strategie, nämlich die Akkumulation von USDT, irrelevant.",
                    "updated": 1693254407810
                }
            ]
        },
        {
            "style": "Text",
            "text": "Now, in terms of the quoted asset, your begin balance is 10,000 USDT and your end balance is 10,900 USDT (exchange fees are deducted from the balance). Also in terms of the quoted asset, your profit loss for the position is...",
            "updated": 1619116331161,
            "translations": [
                {
                    "language": "RU",
                    "text": "Теперь, с точки зрения котируемого актива, ваш начальный баланс составляет 10 000 USDT, а конечный баланс - 10 900 USDT (из баланса вычитается комиссия за обмен). Также с точки зрения котируемого актива, ваша прибыль-убыток по данной позиции составляет...",
                    "updated": 1640344416123
                },
                {
                    "language": "TR",
                    "text": "Şimdi, kote edilen varlık açısından başlangıç bakiyeniz 10.000 USD ve bitiş bakiyeniz 10.900 USD'dir borsa konisyon ücretleri bakiyeden düşülür). Ayrıca, kote edilen varlık açısından, pozisyon için kar kaybınız olur...",
                    "updated": 1642364499822
                },
                {
                    "language": "DE",
                    "text": "Nun, in Bezug auf den notierten Vermögenswert, beträgt Ihr Anfangssaldo 10.000 USDT und Ihr Endsaldo 10.900 USDT (Wechselgebühren werden vom Saldo abgezogen). Auch in Bezug auf den notierten Vermögenswert, ist Ihr Gewinn Verlust für die Position...",
                    "updated": 1693254417750
                }
            ]
        },
        {
            "style": "Json",
            "text": "10,900 USDT - 10,000 USDT = 900 USDT"
        },
        {
            "style": "Text",
            "text": "It should be clear by now that these are the metrics relevant to the intent of the strategy.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Теперь должно быть понятно, что это показатели, соответствующие замыслу стратегии.",
                    "updated": 1640344432146
                },
                {
                    "language": "TR",
                    "text": "Bunun stratejinin amacına uygun ölçüler olduğunu artık herkes biliyor.",
                    "updated": 1642364601529
                },
                {
                    "language": "DE",
                    "text": "Es sollte inzwischen klar sein, dass dies die für die Absicht der Strategie relevanten Kennzahlen sind.",
                    "updated": 1693254427101
                }
            ]
        },
        {
            "style": "Note",
            "text": "With other types of strategies, for example, those in which the intent is to accumulate both assets, both sets of metrics may be relevant. Also, the consolidated metrics provided in the context of statistics may be relevant too.",
            "updated": 1611258499505,
            "translations": [
                {
                    "language": "RU",
                    "text": "Для других типов стратегий, например, тех, в которых целью является накопление обоих активов, оба набора показателей могут быть уместны. Также могут быть уместны сводные показатели, представленные в контексте статистики.",
                    "updated": 1640344462006
                },
                {
                    "language": "TR",
                    "text": "Diğer tür stratejilerle, örneğin amacın her iki varlığı da biriktirmek olduğu stratejilerde, her iki ölçüm grubu da alakalı olabilir. Ayrıca, istatistik bağlamında sağlanan birleştirilmiş metrikler de alakalı olabilir.",
                    "updated": 1642364535603
                },
                {
                    "language": "DE",
                    "text": "Hinweis: Bei anderen Arten von Strategien, z. B. solchen, bei denen die Absicht besteht, beide Vermögenswerte zu akkumulieren, können beide Kennzahlensätze von Bedeutung sein. Auch die konsolidierten Kennzahlen, die im Zusammenhang mit Statistiken bereitgestellt werden, können relevant sein.",
                    "updated": 1693254440346
                }
            ]
        },
        {
            "style": "Text",
            "text": "The concepts relative to base and quoted asset, such as the balance of each asset and the performance metrics computed from the perspective of each asset, are tracked in multiple contexts simultaneously.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Концепции относительно базового и котируемого актива, такие как баланс каждого актива и показатели эффективности, рассчитанные с точки зрения каждого актива, отслеживаются в нескольких контекстах одновременно.",
                    "updated": 1640344480314
                },
                {
                    "language": "TR",
                    "text": "Her bir varlığın dengesi ve her bir varlığın perspektifinden hesaplanan performans ölçütleri gibi temel ve kote varlıkla ilgili kavramlar, aynı anda birden çok bağlamda izlenir.",
                    "updated": 1642364623194
                },
                {
                    "language": "DE",
                    "text": "Die Konzepte in Bezug auf die Basis und die notierten Vermögenswerte, wie z. B. der Saldo jedes Vermögenswerts und die aus der Perspektive jedes Vermögenswerts berechneten Leistungskennzahlen, werden in mehreren Kontexten gleichzeitig verfolgt.",
                    "updated": 1693254451679
                }
            ]
        },
        {
            "style": "Text",
            "text": "What follows are the definitions of the base and quoted asset in each of the contexts that the concepts are tracked.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Далее следуют определения базового и котируемого актива в каждом из контекстов, в которых отслеживаются эти понятия.",
                    "updated": 1640344495376
                },
                {
                    "language": "TR",
                    "text": "Aşağıda, kavramların izlendiği bağlamların her birinde temel ve kote edilmiş varlığın tanımları yer almaktadır.",
                    "updated": 1642364652467
                },
                {
                    "language": "DE",
                    "text": "Im Folgenden werden die Definitionen des Basiswerts und des zitierten Vermögenswerts in den jeweiligen Kontexten, in denen die Konzepte verfolgt werden, erläutert.",
                    "updated": 1693254461375
                }
            ]
        },
        {
            "style": "Title",
            "text": "Episode Base Asset",
            "updated": 1611258577948,
            "translations": [
                {
                    "language": "DE",
                    "text": "Episode Basis-Asset",
                    "updated": 1693254476945
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Episode Base Asset->Definition",
            "updated": 1611258580907
        },
        {
            "style": "Title",
            "text": "Episode Quoted Asset",
            "updated": 1611258588997
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Episode Quoted Asset->Definition",
            "updated": 1611258592849
        },
        {
            "style": "Title",
            "text": "Position Base Asset",
            "updated": 1611258602952
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Position Base Asset->Definition",
            "updated": 1611258605932
        },
        {
            "style": "Title",
            "text": "Position Quoted Asset",
            "updated": 1611258616805
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Position Quoted Asset->Definition",
            "updated": 1611258619810
        },
        {
            "style": "Title",
            "text": "Stage Base Asset",
            "updated": 1611258630368
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Stage Base Asset->Definition",
            "updated": 1611258633312
        },
        {
            "style": "Title",
            "text": "Stage Quoted Asset",
            "updated": 1611258644044
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Stage Quoted Asset->Definition",
            "updated": 1611258647352
        },
        {
            "style": "Title",
            "text": "Order Base Asset",
            "updated": 1611258657391
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Order Base Asset->Definition",
            "updated": 1611258660759
        },
        {
            "style": "Title",
            "text": "Order Quoted Asset",
            "updated": 1611258669352
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Order Quoted Asset->Definition",
            "updated": 1611258672239
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}