{
    "topic": "Trading Engine",
    "pageNumber": "5",
    "type": "Conceptual Context - Episode, Strategy, Position, Strategy Stages",
    "definition": {
        "text": "Track the properties within each of the major concepts handled by the trading bot, such as episodes, strategies, positions, strategy stages, and exchange orders.",
        "updated": 1611256914210,
        "translations": [
            {
                "language": "RU",
                "text": "Отслеживайте свойства в рамках каждой из основных концепций, обрабатываемых торговым ботом, таких как эпизоды, стратегии, позиции, этап стратегии и биржевые ордера.",
                "updated": 1640342186144
            },
            {
                "language": "TR",
                "text": "Özet: Bölümler, stratejiler, pozisyonlar, strateji aşamaları ve takas emirleri gibi ticaret botu tarafından işlenen ana kavramların her birinin içindeki özellikleri izleyin.",
                "updated": 1650574977209
            },
            {
                "language": "DE",
                "text": "Verfolgen Sie die Eigenschaften der wichtigsten Konzepte, die vom Trading-Bot verarbeitet werden, wie z. B. Episoden, Strategien, Positionen, Strategiephasen und Börsenaufträge.",
                "updated": 1702580807556
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Episodes, strategies, positions, strategy stages, exchange orders, and other concepts may be seen as different contexts too, although not of the temporal kind.",
            "updated": 1611256927199,
            "translations": [
                {
                    "language": "RU",
                    "text": "Эпизоды, стратегии, позиции, этапы стратегии, порядок обмена и другие понятия тоже можно рассматривать как различные контексты, хотя и не временного типа.",
                    "updated": 1640342217283
                },
                {
                    "language": "TR",
                    "text": "Bölümler, stratejiler, pozisyonlar, strateji aşamaları, değiş tokuş emirleri ve diğer kavramlar, zamansal türden olmasalar da farklı bağlamlar olarak görülebilir.",
                    "updated": 1650575001246
                },
                {
                    "language": "DE",
                    "text": "Episoden, Strategien, Positionen, Strategiephasen, Austauschreihenfolgen und andere Konzepte können ebenfalls als unterschiedliche Kontexte betrachtet werden, wenn auch nicht als zeitliche.",
                    "updated": 1702580819193
                }
            ]
        },
        {
            "style": "Text",
            "text": "For instance, you may want to know what the ROI is in the context of the episode—that is, the ROI after several positions have passed—or the ROI of the current position only.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Например, вы можете захотеть узнать, что такое ROI в контексте эпизода, то есть ROI после того, как прошло несколько позиций, или ROI только текущей позиции.",
                    "updated": 1640342236077
                },
                {
                    "language": "TR",
                    "text": "Örneğin, bölüm bağlamındaki ROI'nin ne olduğunu (yani, birkaç pozisyon geçtikten sonraki ROI'yi) veya yalnızca mevcut pozisyonun ROI'sini bilmek isteyebilirsiniz.",
                    "updated": 1650575009987
                },
                {
                    "language": "DE",
                    "text": "Sie möchten beispielsweise wissen, was der ROI im Kontext der Episode ist, d. h. der ROI, nachdem mehrere Positionen vergangen sind, oder nur der ROI der aktuellen Position.",
                    "updated": 1702580845922
                }
            ]
        },
        {
            "style": "Callout",
            "text": "In other words, many properties such as performance metrics—like ROI, or profit loss—or market data—like the begin and end datetimes or any of these concepts—exist in more than one conceptual context.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Другими словами, многие свойства, такие как показатели эффективности, например, ROI, или потери прибыли, или рыночные данные, например, время начала и окончания или любое из этих понятий, существуют более чем в одном концептуальном контексте.",
                    "updated": 1640342292590
                },
                {
                    "language": "TR",
                    "text": "Diğer bir deyişle, performans ölçütleri (ROI veya kar kaybı gibi) veya başlangıç ve bitiş tarihleri veya bu kavramlardan herhangi biri gibi piyasa verileri gibi birçok özellik birden fazla kavramsal bağlamda bulunur.",
                    "updated": 1650575029635
                },
                {
                    "language": "DE",
                    "text": "Mit anderen Worten: Viele Eigenschaften, wie Leistungskennzahlen, ROI (z. B. die Kapitalrendite oder der Gewinnverlust) oder Marktdaten (z. B. die Anfangs- und Endzeitpunkte) existieren in mehr als einem konzeptionellen Kontext.",
                    "updated": 1702580952744
                }
            ]
        },
        {
            "style": "Text",
            "text": "The following pages describe each of these major conceptual contexts, which, in turn, may exist in more than one temporal context.",
            "translations": [
                {
                    "language": "RU",
                    "text": "На следующих страницах описывается каждый из этих основных концептуальных контекстов, которые, в свою очередь, могут существовать более чем в одном временном контексте.",
                    "updated": 1640342318497
                },
                {
                    "language": "TR",
                    "text": "Aşağıdaki sayfalar, sırayla birden fazla zamansal bağlamda var olabilecek bu ana kavramsal bağlamların her birini açıklamaktadır.",
                    "updated": 1650575037396
                },
                {
                    "language": "DE",
                    "text": "Auf den folgenden Seiten wird jeder dieser großen konzeptionellen Zusammenhänge beschrieben, die wiederum in mehr als einem zeitlichen Kontext existieren können.",
                    "updated": 1702580960784
                }
            ]
        },
        {
            "style": "Note",
            "text": "From the perspective of systems design, each of these concepts is handled as an object that may be open or closed, thus has a lifespan. The same object may be open more than once, but only after the previous instance has been closed.",
            "updated": 1611256963378,
            "translations": [
                {
                    "language": "RU",
                    "text": "С точки зрения проектирования систем, каждая из этих концепций рассматривается как объект, который может быть открыт или закрыт и, таким образом, имеет срок жизни. Один и тот же объект может быть открыт несколько раз, но только после закрытия предыдущего экземпляра.",
                    "updated": 1640342398215
                },
                {
                    "language": "TR",
                    "text": "Not: Sistem tasarımı açısından, bu kavramların her biri açık veya kapalı olabilen bir nesne olarak ele alınır, dolayısıyla bir ömrü vardır. Aynı nesne birden fazla kez açık olabilir, ancak yalnızca önceki örnek kapatıldıktan sonra.",
                    "updated": 1650575051775
                },
                {
                    "language": "DE",
                    "text": "Aus der Sicht des Systemdesigns wird jedes dieser Konzepte als ein Objekt behandelt, das geöffnet oder geschlossen sein kann und somit eine Lebensdauer hat. Ein und dasselbe Objekt kann mehr als einmal geöffnet werden, aber erst nachdem die vorherige Instanz geschlossen worden ist.",
                    "updated": 1702580974365
                }
            ]
        },
        {
            "style": "Title",
            "text": "Trading Episode",
            "updated": 1611257045974,
            "translations": [
                {
                    "language": "TR",
                    "text": "Ticaret Bölümü ( Trading Episode )",
                    "updated": 1650575073662
                },
                {
                    "language": "DE",
                    "text": "Handelsepisode",
                    "updated": 1702580983426
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Trading Episode->Definition",
            "updated": 1611257060021
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Trading Episode->Content",
            "updated": 1611257063548
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion"
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Trading Episode->2",
            "updated": 1611257076886
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Title",
            "text": "Strategy",
            "updated": 1611257279919,
            "translations": [
                {
                    "language": "TR",
                    "text": "Strateji ( Strategy )",
                    "updated": 1650575100260
                },
                {
                    "language": "DE",
                    "text": "Strategie",
                    "updated": 1702581009210
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy->Definition",
            "updated": 1611257297317
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy->Content",
            "updated": 1611257300492
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion"
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Strategy->2",
            "updated": 1611257312551
        },
        {
            "style": "Title",
            "text": "Position",
            "updated": 1611257347308,
            "translations": [
                {
                    "language": "TR",
                    "text": "Pozisyon ( Position )",
                    "updated": 1650575123121
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Position->Definition",
            "updated": 1611257358664
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Position->Content",
            "updated": 1611257362447
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion"
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Position->2",
            "updated": 1611257376163
        },
        {
            "style": "Title",
            "text": "Strategy Stages",
            "updated": 1611257433526,
            "translations": [
                {
                    "language": "RU",
                    "text": "Этапы стратегии",
                    "updated": 1640343032614
                },
                {
                    "language": "TR",
                    "text": "Strateji Aşamaları ( Strategy Stages )",
                    "updated": 1650575149416
                },
                {
                    "language": "DE",
                    "text": "Etappen der Strategie",
                    "updated": 1702581061816
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Superalgos Protocol implements a trading framework by which strategies within a trading system are described in stages. The trading bot uses these definitions during runtime.",
            "updated": 1611257532139,
            "translations": [
                {
                    "language": "RU",
                    "text": "Протокол Superalgos реализует торговую структуру, с помощью которой стратегии в рамках торговой системы описываются поэтапно. Торговый бот использует эти определения во время выполнения.",
                    "updated": 1640343076326
                },
                {
                    "language": "TR",
                    "text": "Superalgos Protokolü, bir ticaret sistemi içindeki stratejilerin aşamalar halinde tanımlandığı bir ticaret çerçevesi uygular. Ticaret botu, çalışma zamanı sırasında bu tanımları kullanır.",
                    "updated": 1650575183833
                },
                {
                    "language": "DE",
                    "text": "Das Superalgos-Protokoll implementiert einen Handelsrahmen, mit dem Strategien innerhalb eines Handelssystems in Stufen beschrieben werden. Der Trading-Bot verwendet diese Definitionen zur Laufzeit.",
                    "updated": 1702581066298
                }
            ]
        },
        {
            "style": "Text",
            "text": "The concept of strategy stages in the context of the trading engine is an extension of the original concept, useful to keep track of the activity of the trading bot and organize the information processed during runtime.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Концепция этапов стратегии в контексте торгового движка является расширением первоначальной концепции, полезной для отслеживания активности торгового бота и организации информации, обрабатываемой во время выполнения.",
                    "updated": 1640343098501
                },
                {
                    "language": "TR",
                    "text": "Ticaret motoru bağlamında strateji aşamaları kavramı, ticaret botunun etkinliğini takip etmek ve çalışma süresi boyunca işlenen bilgileri düzenlemek için yararlı olan orijinal konseptin bir uzantısıdır.",
                    "updated": 1650575200007
                },
                {
                    "language": "DE",
                    "text": "Das Konzept der Strategiestufen im Zusammenhang mit der Handelsmaschine ist eine Erweiterung des ursprünglichen Konzepts, die nützlich ist, um die Aktivität des Handelsroboters zu verfolgen und die während der Laufzeit verarbeiteten Informationen zu organisieren.",
                    "updated": 1702581076202
                }
            ]
        },
        {
            "style": "Text",
            "text": "Use these sections of the trading engine if you wish to track exactly what is going on, at a granular level, step by step, from the instant a strategy is triggered until it is closed, with the information segregated by strategy stage.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Используйте эти разделы торгового движка, если вы хотите точно отслеживать происходящее на детальном уровне, шаг за шагом, с момента запуска стратегии до ее закрытия, с разделением информации по этапам стратегии.",
                    "updated": 1640343127446
                },
                {
                    "language": "TR",
                    "text": "Strateji aşamasına göre ayrılmış bilgilerle, bir stratejinin tetiklendiği andan kapanana kadar ayrıntılı bir düzeyde adım adım neler olup bittiğini tam olarak izlemek istiyorsanız, ticaret motorunun bu bölümlerini kullanın.",
                    "updated": 1650575208220
                },
                {
                    "language": "DE",
                    "text": "Verwenden Sie diese Abschnitte der Trading Engine, wenn Sie genau verfolgen möchten, was auf einer granularen Ebene Schritt für Schritt passiert, von dem Moment an, in dem eine Strategie ausgelöst wird, bis zu ihrer Schließung, wobei die Informationen nach Strategiestufen getrennt sind.",
                    "updated": 1702581086028
                }
            ]
        },
        {
            "style": "Callout",
            "text": "The exercise may be particularly useful to grasp the intricacies of the workings of the trading bot or to research particular behaviors.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Практика может быть особенно полезна для понимания тонкостей работы торгового бота или для исследования определенных моделей поведения.",
                    "updated": 1640343255181
                },
                {
                    "language": "TR",
                    "text": "Alıştırma, ticaret botunun işleyişinin inceliklerini kavramak veya belirli davranışları araştırmak için özellikle yararlı olabilir.",
                    "updated": 1650575216553
                },
                {
                    "language": "DE",
                    "text": "Die Übung kann besonders nützlich sein, um die Feinheiten der Funktionsweise des Trading-Bots zu verstehen oder um bestimmte Verhaltensweisen zu erforschen.",
                    "updated": 1702581094658
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Strategy Trigger Stage",
            "updated": 1611257553903,
            "translations": [
                {
                    "language": "TR",
                    "text": "Strateji Tetikleme Aşaması ( Strategy Trigger Stage )",
                    "updated": 1650575239806
                },
                {
                    "language": "DE",
                    "text": "Auslösestufe der Strategie",
                    "updated": 1702581112162
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy Trigger Stage->Definition",
            "updated": 1611257563170
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy Trigger Stage->Content",
            "updated": 1611257566539
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion"
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Strategy Trigger Stage->2",
            "updated": 1611257598667
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Subtitle",
            "text": "Strategy Open Stage",
            "updated": 1611257613573,
            "translations": [
                {
                    "language": "TR",
                    "text": "Strateji Açık Aşama ( Strategy Open Stage )",
                    "updated": 1650575261994
                },
                {
                    "language": "DE",
                    "text": "Strategie Open Stage",
                    "updated": 1702581191057
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy Open Stage->Definition",
            "updated": 1611257617299
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy Open Stage->Content",
            "updated": 1611257621534
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion"
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Strategy Open Stage->3",
            "updated": 1611257686884
        },
        {
            "style": "Text",
            "text": ""
        },
        {
            "style": "Subtitle",
            "text": "Strategy Manage Stage",
            "updated": 1611257655850,
            "translations": [
                {
                    "language": "TR",
                    "text": "Strateji Yönetimi Aşaması ( Strategy Manage Stage )",
                    "updated": 1650575283582
                },
                {
                    "language": "DE",
                    "text": "Strategie Manage Stage",
                    "updated": 1702581196626
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy Manage Stage->Definition",
            "updated": 1611257660113
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy Manage Stage->Content",
            "updated": 1611257664015
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion"
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Strategy Manage Stage->2",
            "updated": 1611257866068
        },
        {
            "style": "Subtitle",
            "text": "Strategy Close Stage",
            "updated": 1611257705432,
            "translations": [
                {
                    "language": "TR",
                    "text": "Strateji Aşamayı Kapat ( Strategy Close Stage )",
                    "updated": 1650575335646
                },
                {
                    "language": "DE",
                    "text": "Strategie Close Stage",
                    "updated": 1702581206009
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy Close Stage->Definition",
            "updated": 1611257709416
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Strategy Close Stage->Content",
            "updated": 1611257713254
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion"
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Strategy Close Stage->3",
            "updated": 1611257720858
        }
    ]
}