{
    "topic": "Trading Engine",
    "pageNumber": "4",
    "type": "Temporal Context - Current and Last",
    "definition": {
        "text": "Much of the information provided by the trading engine may be accessed for the current instance of the object as well as for the last instance that was open, at any point in time.",
        "updated": 1611254206670,
        "translations": [
            {
                "language": "RU",
                "text": "Большая часть информации, предоставляемой торговым движком, может быть доступна в любой момент времени как для текущего экземпляра объекта, так и для последнего открытого экземпляра.",
                "updated": 1640341385381
            },
            {
                "language": "TR",
                "text": "Özet: Ticaret motoru tarafından sağlanan bilgilerin çoğuna, herhangi bir zamanda, nesnenin mevcut örneği ve açık olan son örnek için erişilebilir.",
                "updated": 1650574829214
            },
            {
                "language": "DE",
                "text": "Viele der von der Trading Engine bereitgestellten Informationen können sowohl für die aktuelle Instanz des Objekts als auch für die zuletzt geöffnete Instanz zu einem beliebigen Zeitpunkt abgerufen werden.",
                "updated": 1702402619620
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The trading engine hierarchy is organized by context. That is, the main offspring nodes—current, last, and exchange orders—describe the context in which their respective offspring live.",
            "updated": 1611254225764,
            "translations": [
                {
                    "language": "RU",
                    "text": "Иерархия торгового движка организована по контексту. То есть, основные узлы потомков - текущие, последние и биржевые ордера - описывают контекст, в котором живут их соответствующие потомки.",
                    "updated": 1640341416455
                },
                {
                    "language": "TR",
                    "text": "Ticaret motoru hiyerarşisi bağlama göre düzenlenir. Diğer bir deyişle, ana yavru düğümler (mevcut, son ve takas emirleri) kendi yavrularının yaşadığı bağlamı tanımlar.",
                    "updated": 1650574853924
                },
                {
                    "language": "DE",
                    "text": "Die Hierarchie der Handelsmaschine ist nach Kontext gegliedert. Das heißt, die Hauptknoten der Nachkommen - aktuelle, letzte und Tauschaufträge - beschreiben den Kontext, in dem ihre jeweiligen Nachkommen leben.",
                    "updated": 1702403222008
                }
            ]
        },
        {
            "style": "Text",
            "text": "For example, the concept of an episode—a whole run of the trading bot— exists only in the context of the current episode, as the system keeps track of one episode at the time only.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Например, понятие эпизода - целого цикла работы торгового бота - существует только в контексте текущего эпизода, поскольку система отслеживает только один эпизод за раз.",
                    "updated": 1640341441313
                },
                {
                    "language": "TR",
                    "text": "Örneğin, bir bölüm kavramı - ticaret botunun tüm çalışması - sistem aynı anda yalnızca bir bölümü takip ettiğinden, yalnızca mevcut bölüm bağlamında var olur.",
                    "updated": 1650574860164
                },
                {
                    "language": "DE",
                    "text": "Das Konzept einer Episode - ein ganzer Durchlauf des Trading Bots - existiert beispielsweise nur im Zusammenhang mit der aktuellen Episode, da das System jeweils nur eine Episode verfolgt.",
                    "updated": 1702403236033
                }
            ]
        },
        {
            "style": "Text",
            "text": "However, the concept of a position is tracked both as the current position and the last position. This is possible because the system keeps track of all positions occurring within an episode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Однако понятие позиции отслеживается и как текущая позиция, и как последняя позиция. Это возможно потому, что система отслеживает все позиции, возникающие в течение эпизода.",
                    "updated": 1640341476909
                },
                {
                    "language": "TR",
                    "text": "Ancak pozisyon kavramı hem mevcut pozisyon hem de son pozisyon olarak izlenir. Bu mümkündür çünkü sistem bir epizod içinde meydana gelen tüm pozisyonları takip eder.",
                    "updated": 1650574867335
                },
                {
                    "language": "DE",
                    "text": "Das Konzept einer Position wird jedoch sowohl als aktuelle Position als auch als letzte Position verfolgt. Dies ist möglich, weil das System alle Positionen, die innerhalb einer Episode auftreten, aufzeichnet.",
                    "updated": 1702403245160
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Superalgos developers thought it was worth it to provide certain information, positions, for example, in both contexts, as this allows you—visually—and your trading system—using simple syntax—to access information about the current position and the last position at any given point in time.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Разработчики Superalgos решили, что стоит предоставлять определенную информацию, например, позиции, в обоих контекстах, поскольку это позволяет вам - визуально и вашей торговой системе - используя простой синтаксис - получить доступ к информации о текущей позиции и последней позиции в любой момент времени.",
                    "updated": 1640341502228
                },
                {
                    "language": "TR",
                    "text": "Superalgos geliştiricileri, örneğin her iki bağlamda da belirli bilgileri, pozisyonları sağlamanın buna değeceğini düşündüler, çünkü bu size - görsel olarak - ve ticaret sisteminize - basit sözdizimi kullanarak - mevcut pozisyon ve son pozisyon hakkında herhangi bir zamanda bilgilere erişmenizi sağlar. zamanda verilen nokta.",
                    "updated": 1650574889795
                },
                {
                    "language": "DE",
                    "text": "Die Entwickler von Superalgos waren der Meinung, dass es sich lohnt, bestimmte Informationen, z. B. Positionen, in beiden Kontexten bereitzustellen, da dies Ihnen - und Ihrem Handelssystem - mit Hilfe einer einfachen Syntax den Zugriff auf Informationen über die aktuelle Position und die letzte Position zu einem bestimmten Zeitpunkt ermöglicht.",
                    "updated": 1702403261209
                }
            ]
        },
        {
            "style": "Title",
            "text": "Trading Current",
            "updated": 1611254496763,
            "translations": [
                {
                    "language": "TR",
                    "text": "İşlem Akımı ( Trading Current )",
                    "updated": 1650574907295
                },
                {
                    "language": "DE",
                    "text": "Handelsstrom",
                    "updated": 1702403268645
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Trading Current->Definition",
            "updated": 1611254540559
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Trading Current->Content"
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion",
            "updated": 1611255184563
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Trading Current->2",
            "updated": 1611254736085
        },
        {
            "style": "Title",
            "text": "Trading Last",
            "updated": 1611254547170,
            "translations": [
                {
                    "language": "TR",
                    "text": "Ticaret Sonu ( Trading Last )",
                    "updated": 1650574948787
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Trading Last->Definition",
            "updated": 1611254556715
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Trading Last->Content"
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion",
            "updated": 1611255197793
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Trading Last->2",
            "updated": 1611255233693
        }
    ]
}