{
    "topic": "Trading Engine",
    "pageNumber": "2",
    "type": "Monitoring Runtime Data",
    "definition": {
        "text": "Use the trading engine hierarchy to track every piece of information processed by the trading bot, candle by candle.",
        "updated": 1611253725593,
        "translations": [
            {
                "language": "RU",
                "text": "Используйте иерархию торгового движка для отслеживания каждой части информации, обрабатываемой торговым ботом, свеча за свечой.",
                "updated": 1640338990575
            },
            {
                "language": "TR",
                "text": "Özet: Ticaret botu tarafından işlenen her bilgi parçasını mum mum takip etmek için ticaret motoru hiyerarşisini kullanın.",
                "updated": 1650574281254
            },
            {
                "language": "DE",
                "text": "Verwenden Sie die Trading-Engine-Hierarchie, um jede Information, die der Trading-Bot verarbeitet, Kerze für Kerze zu verfolgen.",
                "updated": 1693253813217
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "The trading engine hierarchy is a portal into the trading bot’s machine room—the brain. Think of the trading engine as a terminal connected to each of the brain’s neurons, taking a snapshot for every candle, and registering with precision every piece of data handled by the trading bot during the trading session.",
            "updated": 1611253749127,
            "translations": [
                {
                    "language": "RU",
                    "text": "Иерархия торгового движка - это портал в машинное отделение торгового бота - мозг. Представьте торговый движок как терминал, подключенный к каждому нейрону мозга, делающий снимок каждой свечи и точно регистрирующий каждый фрагмент данных, обработанных торговым ботом в течение торговой сессии.",
                    "updated": 1640339024222
                },
                {
                    "language": "TR",
                    "text": "Ticaret motoru ( Trading Engine ) hiyerarşisi, ticaret botunun makine odasına, yani beyne açılan bir portaldır. Ticaret motorunu, beynin nöronlarının her birine bağlı, her mum için anlık görüntü alan ve ticaret seansı sırasında ticaret botu tarafından işlenen her veri parçasını hassasiyetle kaydeden bir terminal olarak düşünün.",
                    "updated": 1650574340540
                },
                {
                    "language": "DE",
                    "text": "Die Trading-Engine-Hierarchie ist ein Portal in den Maschinenraum des Trading-Bots - das Gehirn. Stellen Sie sich die Trading-Engine als ein Terminal vor, das mit allen Neuronen des Gehirns verbunden ist, bei jeder Kerze einen Schnappschuss macht und alle Daten, die der Trading-Bot während der Handelssitzung verarbeitet, präzise registriert.",
                    "updated": 1693253862089
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos combines the time navigation features of the charts with the visual environment representing data structures of the design space, to create an immersive user experience.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Superalgos объединяет возможности временной навигации графиков с визуальной средой, представляющей структуры данных пространства проектирования, для создания впечатляющего пользовательского опыта.",
                    "updated": 1640339093999
                },
                {
                    "language": "TR",
                    "text": "Superalgos, sürükleyici bir kullanıcı deneyimi yaratmak için çizelgelerin zaman gezinme özelliklerini tasarım alanının veri yapılarını temsil eden görsel ortamla birleştirir.",
                    "updated": 1650574361820
                },
                {
                    "language": "DE",
                    "text": "Superalgos kombiniert die Zeitnavigationsfunktionen der Diagramme mit der visuellen Umgebung, die die Datenstrukturen des Designraums repräsentiert, und schafft so eine immersive Benutzererfahrung.",
                    "updated": 1693253874637
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Each of the nodes in the hierarchy may display its value on the design space, right below the icon representing the node, for each candle.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Каждый из узлов иерархии может отображать свое значение на пространстве проектирования, прямо под иконкой, представляющей узел, для каждой свечи.",
                    "updated": 1640339112725
                },
                {
                    "language": "TR",
                    "text": "Hiyerarşideki düğümlerin her biri, her mum için düğümü temsil eden simgenin hemen altında, tasarım alanında değerini gösterebilir.",
                    "updated": 1650574387037
                },
                {
                    "language": "DE",
                    "text": "Jeder der Knoten in der Hierarchie kann seinen Wert für jede Kerze auf der Gestaltungsfläche direkt unter dem Symbol, das den Knoten darstellt, anzeigen.",
                    "updated": 1693253887052
                }
            ]
        },
        {
            "style": "Note",
            "text": "How users may monitor the information featured in the Trading Engine hierarchy is explained and demonstrated on the Trading Bot Layers tutorial available on the Weak-hands Buster V2.0 Native Workspace.",
            "updated": 1611253775463,
            "translations": [
                {
                    "language": "RU",
                    "text": "Как пользователи могут отслеживать информацию, представленную в иерархии Trading Engine, объясняется и демонстрируется в учебнике Trading Bot Layers, доступном на рабочем пространстве плагина Weak-hands Buster V2.0.",
                    "updated": 1640339162752
                },
                {
                    "language": "TR",
                    "text": "Not: Kullanıcıların Trading Engine ( Trading Engine ) hiyerarşisinde yer alan bilgileri nasıl izleyebileceği, Weak-hands Buster V2.0 eklentisi çalışma alanında bulunan Ticaret Bot ( Trading Bot ) Katmanları eğitiminde açıklanmış ve gösterilmiştir.",
                    "updated": 1650574442518
                },
                {
                    "language": "DE",
                    "text": "Wie Benutzer die Informationen in der Trading-Engine-Hierarchie (Trading Engine hierarchy) überwachen können, wird im Trading-Bot-Layers-Tutorial (Trading Bot Layers tutorial) erklärt und demonstriert, das auf dem nativen Arbeitsbereich (Native Workspace) von Weak-hands Buster V2.0 verfügbar ist.",
                    "updated": 1693253900040
                }
            ]
        },
        {
            "style": "Text",
            "text": "As a quick refresher, the process is more or less as follows:",
            "translations": [
                {
                    "language": "RU",
                    "text": "В качестве краткой справки, процесс выглядит примерно следующим образом:",
                    "updated": 1640339178381
                },
                {
                    "language": "TR",
                    "text": "Hızlı bir tazeleme olarak, süreç aşağı yukarı şöyledir:",
                    "updated": 1650574469605
                },
                {
                    "language": "DE",
                    "text": "Zur Auffrischung: Der Prozess läuft mehr oder weniger wie folgt ab:",
                    "updated": 1693253910136
                }
            ]
        },
        {
            "style": "List",
            "text": "Run a trading session. Start with a backtest, so that you may get a quick feel of how the Trading Engine hierarchy displays data spanning any period.",
            "updated": 1611253817389,
            "translations": [
                {
                    "language": "RU",
                    "text": "Запустите торговую сессию. Начните с бэктеста, чтобы вы могли быстро понять, как иерархия Trading Engine отображает данные за любой период.",
                    "updated": 1640339278549
                },
                {
                    "language": "TR",
                    "text": "Bir ticaret oturumu çalıştırın. Geriye dönük bir testle başlayın, böylece Ticaret Motoru ( Trading Engine ) hiyerarşisinin herhangi bir döneme yayılan verileri nasıl gösterdiğine dair hızlı bir fikir edinebilirsiniz.",
                    "updated": 1650574508828
                },
                {
                    "language": "DE",
                    "text": "Führen Sie eine Handelssitzung durch. Beginnen Sie mit einem Backtest, damit Sie ein schnelles Gefühl dafür bekommen, wie die Trading-Engine-Hierarchie (Trading Engine hierarchy) Daten über einen beliebigen Zeitraum anzeigt.",
                    "updated": 1693253918402
                }
            ]
        },
        {
            "style": "List",
            "text": "Go to the chart displaying the simulation and find one of the positions.",
            "updated": 1611253824254,
            "translations": [
                {
                    "language": "RU",
                    "text": "Перейдите на график, отображающий симуляцию, и найдите одну из позиций.",
                    "updated": 1640339291291
                },
                {
                    "language": "TR",
                    "text": "Simülasyonu gösteren tabloya gidin ve konumlardan birini bulun.",
                    "updated": 1650574528082
                },
                {
                    "language": "DE",
                    "text": "Gehen Sie zum Diagramm, das die Simulation anzeigt, und suchen Sie eine der Positionen.",
                    "updated": 1693253926457
                }
            ]
        },
        {
            "style": "List",
            "text": "Turn on the Current Position layer in the Trading Engine layer manager. This layer monitors the position structure of nodes under the current node, that is, the information regarding current positions.",
            "updated": 1611253835635,
            "translations": [
                {
                    "language": "RU",
                    "text": "Включите слой Current Position в менеджере слоев Trading Engine. Этот слой отслеживает структуру позиций узлов под текущим узлом, то есть информацию о текущих позициях.",
                    "updated": 1640339324088
                },
                {
                    "language": "TR",
                    "text": "Ticaret Motoru ( Trading Engine ) katman yöneticisinde Mevcut Konum katmanını açın. Bu katman, mevcut düğüm altındaki düğümlerin konum yapısını, yani mevcut konumlarla ilgili bilgileri izler.",
                    "updated": 1650574553408
                },
                {
                    "language": "DE",
                    "text": "Schalten Sie die Ebene Aktuelle Position im Ebenenmanager der Trading Engine ein. Diese Ebene überwacht die Positionsstruktur der Knoten unterhalb des aktuellen Knotens, d.h. die Informationen über die aktuellen Positionen.",
                    "updated": 1693253936633
                }
            ]
        },
        {
            "style": "List",
            "text": "Split the screen to make room for both the design space and the charting space.",
            "updated": 1611253840769,
            "translations": [
                {
                    "language": "RU",
                    "text": "Разделите экран, чтобы освободить место как для пространства проектирования, так и для пространства построения графиков.",
                    "updated": 1640339363579
                },
                {
                    "language": "TR",
                    "text": "Hem tasarım alanına hem de grafik alanına yer açmak için ekranı bölün.",
                    "updated": 1650574568342
                },
                {
                    "language": "DE",
                    "text": "Teilen Sie den Bildschirm, um Platz für den Entwurfsbereich und den Diagrammbereich zu schaffen.",
                    "updated": 1693253947758
                }
            ]
        },
        {
            "style": "List",
            "text": "Position the view on the design space so that you may see the corresponding structure of nodes.",
            "updated": 1611253852074,
            "translations": [
                {
                    "language": "RU",
                    "text": "Расположите вид на пространстве проектирования так, чтобы вы могли видеть соответствующую структуру узлов.",
                    "updated": 1640339386892
                },
                {
                    "language": "TR",
                    "text": "Düğümlerin karşılık gelen yapısını görebilmeniz için görünümü tasarım alanına yerleştirin.",
                    "updated": 1650574580503
                },
                {
                    "language": "DE",
                    "text": "Positionieren Sie die Ansicht (Position the view) auf der Entwurfsfläche so, dass Sie die entsprechende Struktur der Knoten sehen können.",
                    "updated": 1693253958167
                }
            ]
        },
        {
            "style": "List",
            "text": "Slide the pointer of the mouse over the charts, across the position, and notice how the values for each node displayed on the design space change. Each node displays the corresponding value for each candle.",
            "updated": 1611253859589,
            "translations": [
                {
                    "language": "RU",
                    "text": "Проведите указателем мыши по графикам, по позиции, и обратите внимание, как меняются значения для каждого узла, отображаемые на пространстве проектирования. Каждый узел отображает соответствующее значение для каждой свечи.",
                    "updated": 1640339453102
                },
                {
                    "language": "TR",
                    "text": "Farenin imlecini konum boyunca grafikler üzerinde kaydırın ve tasarım alanında görüntülenen her bir düğüm için değerlerin nasıl değiştiğine dikkat edin. Her düğüm, her mum için karşılık gelen değeri görüntüler.",
                    "updated": 1650574605379
                },
                {
                    "language": "DE",
                    "text": "Bewegen Sie den Mauszeiger über die Charts und beobachten Sie, wie sich die Werte für die einzelnen Knoten in der Designfläche ändern. Jeder Knoten zeigt den entsprechenden Wert für jede Kerze an.",
                    "updated": 1693253968744
                }
            ]
        },
        {
            "style": "Success",
            "text": "Much of the data handled by the trading engine may also be visualized over the charts through the layers and panels in the Trading Charts layer manager. If any of the above is not clear, please refer to the Trading Bot Layers Tutorial available on the Weak-hands Buster V2.0 Native Workspace.",
            "updated": 1611253891479,
            "translations": [
                {
                    "language": "RU",
                    "text": "Большая часть данных, обрабатываемых торговым ботом, также может быть визуализирована на графиках с помощью слоев и панелей в менеджере слоев торговых графиков. Если что-то из вышесказанного непонятно, пожалуйста, обратитесь к учебнику Trading Bot Layers Tutorial, доступному на рабочем пространстве плагина Weak-hands Buster V2.0.",
                    "updated": 1640339615157
                },
                {
                    "language": "TR",
                    "text": "İpucu: Ticaret motoru tarafından işlenen verilerin çoğu, Ticaret Grafikleri katman yöneticisindeki katmanlar ve paneller aracılığıyla çizelgeler üzerinde de görselleştirilebilir. Yukarıdakilerden herhangi biri net değilse, lütfen Weak-hands Buster V2.0 eklentisi çalışma alanında mevcut olan Trading Bot Layers Tutorial  ( Eğitimine ) bakın.",
                    "updated": 1650574670568
                },
                {
                    "language": "DE",
                    "text": "Viele der Daten, die von der Trading-Engine verarbeitet werden, können auch über die Charts mit Hilfe der Layer und Panels im Layer-Manager der Trading Charts visualisiert werden. Wenn Ihnen etwas davon nicht klar ist, lesen Sie bitte das Trading Bot Layers Tutorial auf dem Weak-hands Buster V2.0 Native Workspace.",
                    "updated": 1693253982609
                }
            ]
        }
    ]
}