{
    "topic": "Trading Engine",
    "pageNumber": "10",
    "type": "Balances",
    "definition": {
        "text": "Keep track of the balances of each asset, at different points in time. On this page: Balance, Begin Balance, and End Balance.",
        "updated": 1611331647405,
        "translations": [
            {
                "language": "RU",
                "text": "Следите за балансом каждого актива в разные моменты времени. На этой странице: Balance (Баланс), Begin Balance (Начальный баланс) и End Balance (Конечный баланс).",
                "updated": 1640347468642
            },
            {
                "language": "TR",
                "text": "Özet: Zamanın farklı noktalarında her bir varlığın bakiyelerini takip edin. Bu sayfada: Bakiye, Bakiyeyi Başlat ve Bakiyeyi Bitir ( Balance, Begin Balance, and End Balance ).",
                "updated": 1650617815777
            },
            {
                "language": "DE",
                "text": "Behalten Sie den Überblick über die Salden der einzelnen Vermögenswerte zu verschiedenen Zeitpunkten. Auf dieser Seite: Saldo, Anfangssaldo und Endsaldo (Balance, Begin Balance, and End Balance).",
                "updated": 1702582130217
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Balances are the basis of the account-keeping features, by which you may know exactly how much of each asset there is on the account at any given point in time.",
            "updated": 1611331659066,
            "translations": [
                {
                    "language": "RU",
                    "text": "Балансы являются основой функций ведения счета, благодаря которым вы можете точно знать, сколько каждого актива находится на счете в любой момент времени.",
                    "updated": 1640347567684
                },
                {
                    "language": "TR",
                    "text": "Bakiyeler, herhangi bir zamanda hesapta her bir varlığın ne kadarının bulunduğunu tam olarak bilebileceğiniz hesap tutma özelliklerinin temelidir.",
                    "updated": 1650617774865
                },
                {
                    "language": "DE",
                    "text": "Die Salden sind die Grundlage der Kontoführungsfunktionen, durch die Sie genau wissen können, wie viel von jedem Vermögenswert zu einem bestimmten Zeitpunkt auf dem Konto vorhanden ist.",
                    "updated": 1702582143882
                }
            ]
        },
        {
            "style": "Text",
            "text": "The system keeps track of balances in multiple contexts, but also saves snapshots of what the balance was at key moments in time, so that such information may be available both to study the results of operations, and so that it may be used form within trading strategies.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Система отслеживает баланс в различных контекстах, а также сохраняет снимки баланса в ключевые моменты времени, чтобы эта информация была доступна как для изучения результатов операций, так и для использования в торговых стратегиях.",
                    "updated": 1640347635177
                },
                {
                    "language": "TR",
                    "text": "Sistem, birçok bağlamda bakiyeleri takip eder, ancak aynı zamanda önemli anlarda bakiyenin ne olduğunun anlık görüntülerini de kaydeder, böylece bu tür bilgiler hem operasyonların sonuçlarını incelemek için kullanılabilir hem de ticarette kullanılabilir.",
                    "updated": 1650617755933
                },
                {
                    "language": "DE",
                    "text": "Das System verfolgt die Salden in verschiedenen Zusammenhängen, speichert aber auch Momentaufnahmen der Salden zu wichtigen Zeitpunkten, so dass diese Informationen sowohl für die Untersuchung der Ergebnisse von Operationen als auch für Handelsstrategien genutzt werden können.",
                    "updated": 1702582152460
                }
            ]
        },
        {
            "style": "Callout",
            "text": "It is important to understand that balances are an internal concept managed by the trading engine, and are calculated based on the information processed by the trading bot. Balances do not necessarily reflect the actual amount of assets at the exchange.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Важно понимать, что балансы - это внутренняя концепция, управляемая торговым движком, и рассчитываются на основе информации, обрабатываемой торговым ботом. Балансы не обязательно отражают фактическое количество активов на бирже.",
                    "updated": 1640347706152
                },
                {
                    "language": "TR",
                    "text": "Bakiyelerin, ticaret motoru tarafından yönetilen dahili bir kavram olduğunu ve ticaret botu tarafından işlenen bilgilere dayanarak hesaplandığını anlamak önemlidir. Bakiyeler, borsadaki varlıkların gerçek miktarını mutlaka yansıtmaz.",
                    "updated": 1650617842459
                },
                {
                    "language": "DE",
                    "text": "Es ist wichtig zu verstehen, dass Salden ein internes Konzept sind, das von der Trading Engine verwaltet wird und auf der Grundlage der vom Trading Bot verarbeiteten Informationen berechnet wird. Die Salden spiegeln nicht notwendigerweise die tatsächliche Höhe der Vermögenswerte an der Börse wider.",
                    "updated": 1702582161530
                }
            ]
        },
        {
            "style": "Title",
            "text": "Balance",
            "updated": 1611331710709,
            "translations": [
                {
                    "language": "DE",
                    "text": "Waage",
                    "updated": 1702582168345
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Balance->Definition",
            "updated": 1611331715062
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Balance->Content",
            "updated": 1611331718713
        },
        {
            "style": "Title",
            "text": "Begin Balance",
            "updated": 1611331731595,
            "translations": [
                {
                    "language": "DE",
                    "text": "Startsaldo",
                    "updated": 1702582202425
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Begin Balance->Definition",
            "updated": 1611331735070
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Begin Balance->Content",
            "updated": 1611331738675
        },
        {
            "style": "Title",
            "text": "End Balance",
            "updated": 1611331749501,
            "translations": [
                {
                    "language": "DE",
                    "text": "Endsaldo",
                    "updated": 1702582214489
                }
            ]
        },
        {
            "style": "Include",
            "text": "Foundations->Node->End Balance->Definition",
            "updated": 1611331752868
        },
        {
            "style": "Include",
            "text": "Foundations->Node->End Balance->Content",
            "updated": 1611331756749
        }
    ]
}