{
    "topic": "Trading Engine",
    "pageNumber": "9",
    "type": "Distance-To-Trading-Events",
    "definition": {
        "text": "Track the number of periods that have passed since the last occurrence of each type of event. On this page: Trigger On, Trigger Off, Take Position, Close Position, Next Phase, Move to Phase, Create Order, Cancel Order, Close Order.",
        "updated": 1611327154424,
        "translations": [
            {
                "language": "RU",
                "text": "Отслеживайте количество периодов, прошедших с момента последнего появления каждого типа события. На этой странице: Trigger On, Trigger Off, Take Position, Close Position, Next Phase, Move to Phase, Create Order, Cancel Order, Close Order.",
                "updated": 1640347416232
            },
            {
                "language": "TR",
                "text": "Özet: Her bir olay türünün son oluşumundan bu yana geçen dönemlerin sayısını izleyin. Bu sayfada: Tetikleme Açık, Tetikleme Kapalı, Pozisyon Al, Pozisyonu Kapat, Sonraki Aşama, Aşamaya Taşı, Emir Oluştur, Emir İptal Et, Siparişi Kapat ( Trigger On, Trigger Off, Take Position, Close Position, Next Phase, Move to Phase, Create Order, Cancel Order, Close Order ).",
                "updated": 1650617406152
            },
            {
                "language": "DE",
                "text": "Verfolgen Sie die Anzahl der Zeiträume, die seit dem letzten Auftreten der einzelnen Ereignistypen vergangen sind. Auf dieser Seite: Trigger On, Trigger Off, Take Position, Close Position, Next Phase, Move to Phase, Create Order, Cancel Order, Close Order.",
                "updated": 1702581870353
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Include",
            "text": "Foundations->Node->Distance To Trading Event->Definition",
            "updated": 1611327304404
        },
        {
            "style": "Include",
            "text": "Foundations->Node->Distance To Trading Event->Content",
            "updated": 1611327325113
        },
        {
            "style": "Include",
            "text": "Foundations->Concept->Reusable Snippets->Note for Hierarchy Tables No Discussion"
        },
        {
            "style": "Hierarchy",
            "text": "Foundations->Distance To Trading Event->2",
            "updated": 1611327347651
        }
    ]
}