{
    "topic": "Data Mining",
    "pageNumber": 7,
    "type": "Data Mining - Managing Execution",
    "definition": {
        "text": "Bots can execute at their own pace or they can wait for other bots to finish executing before starting.",
        "updated": 1622214711890,
        "translations": [
            {
                "language": "DE",
                "text": "Bots können in ihrem eigenen Tempo ausgeführt werden oder sie können warten, bis andere Bots die Ausführung beendet haben, bevor sie beginnen.",
                "updated": 1634828825458
            },
            {
                "language": "RU",
                "text": "Боты могут работать в своем собственном темпе или могут дождаться завершения работы других ботов перед запуском.",
                "updated": 1639410936571
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Bot Execution Tree",
            "updated": 1622215214005,
            "translations": [
                {
                    "language": "DE",
                    "text": "Bot Execution Tree (Bot Ausführungsbaum):",
                    "updated": 1634828847947
                },
                {
                    "language": "RU",
                    "text": "Дерево выполнения ботов",
                    "updated": 1639411324023
                }
            ]
        },
        {
            "style": "Text",
            "text": "A helpful way to think about managing bot execution is to think of the image of a tree. The roots support the trunk which supports the branches. In the same way, Superalgos uses many bots to process data each relying on the output of the last to form a tree. As data is passed through the tree the raw data is processed and reprocessed to build more and more elaborate datasets.",
            "updated": 1622215593975,
            "translations": [
                {
                    "language": "DE",
                    "text": "Eine hilfreiche Art und Weise, über die Verwaltung der Bot-Ausführung nachzudenken, ist das Bild eines Baumes. Die Wurzeln unterstützen den Stamm, der wiederum die Äste stützt. Auf die gleiche Weise verwendet Superalgos viele Bots, um Daten zu verarbeiten, wobei sich jeder auf den Output des letzten stützt, um einen Baum zu bilden. Während die Daten den Baum durchlaufen, werden die Rohdaten verarbeitet und weiterverarbeitet, um immer durchdachtere Datensätze zu erstellen.",
                    "updated": 1634832671242
                },
                {
                    "language": "RU",
                    "text": "Один из полезных способов подумать об управлении запуском бота - это представить себе дерево. Корни поддерживают ствол, который поддерживает ветви. Точно так же Superalgos использует множество ботов для обработки данных, каждый из которых полагается на вывод последнего для формирования дерева. По мере прохождения данных через дерево необработанные данные обрабатываются и перерабатываются для создания все более и более сложных наборов данных.",
                    "updated": 1639411442575
                }
            ]
        },
        {
            "style": "Title",
            "text": "Types of Execution Managment",
            "translations": [
                {
                    "language": "DE",
                    "text": "Arten des Execution (Ausführungs)/ Management:",
                    "updated": 1634832926148
                },
                {
                    "language": "RU",
                    "text": "Типы управления исполнением",
                    "updated": 1639411522267
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "There are two types of execution managment:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Есть два типа управления исполнением:",
                    "updated": 1639411536035
                }
            ]
        },
        {
            "style": "List",
            "text": "Standalone Bots: These bots are the root of the Bot Execution Tree. They don't depend on any other bot to run but use the configuration of it's Process Definition node to run on a pre-defined schedule (in most cases every one minute).",
            "updated": 1622215038717,
            "translations": [
                {
                    "language": "DE",
                    "text": "Diese Bots sind die Wurzel des Execution Tree (Bot-Ausführungsbaums). Sie sind nicht von anderen Bots abhängig, sondern verwenden die Konfiguration ihrer Process Definition node, um nach einem vordefinierten Zeitplan (in den meisten Fällen jede Minute) zu laufen.",
                    "updated": 1634841023922
                },
                {
                    "language": "RU",
                    "text": "Автономные боты: эти боты являются корнем дерева выполнения ботов. Они не зависят от запуска какого-либо другого бота, но используют конфигурацию его узла определения процесса Process Definition для запуска по заранее определенному расписанию (в большинстве случаев каждую минуту).",
                    "updated": 1639411632492
                }
            ]
        },
        {
            "style": "Note",
            "text": "Usually when a bot produces raw data, it operates as a standalone bot. ",
            "updated": 1622215509477,
            "translations": [
                {
                    "language": "DE",
                    "text": "Wenn ein Bot Rohdaten produziert, arbeitet er normalerweise als eigenständiger Bot.",
                    "updated": 1634841057033
                },
                {
                    "language": "RU",
                    "text": "Обычно, когда бот производит необработанные данные, он работает как автономный бот.",
                    "updated": 1639411645983
                }
            ]
        },
        {
            "style": "List",
            "text": "Execution Dependent Bots: These bots are the branches of the Bot Execution Tree. They need to wait for other Bots to finish their execution in order to start.",
            "updated": 1622215195801,
            "translations": [
                {
                    "language": "DE",
                    "text": "Execution Dependent Bots: Diese Bots sind die Zweige des Bot-Ausführungsbaums. Sie müssen warten, bis andere Bots ihre Ausführung beendet haben, um starten zu können.",
                    "updated": 1634841171154
                },
                {
                    "language": "RU",
                    "text": "Боты, зависящие от выполнения: эти боты являются ветвями дерева выполнения ботов. Им нужно дождаться, пока другие боты закончат свое выполнение, чтобы начать.",
                    "updated": 1639411666962
                }
            ]
        },
        {
            "style": "Title",
            "text": "Configuring a Standalone Bot",
            "updated": 1622215700788,
            "translations": [
                {
                    "language": "DE",
                    "text": "Einen eigenständigen Bot konfigurieren:",
                    "updated": 1634841196929
                },
                {
                    "language": "RU",
                    "text": "Настройка автономного бота",
                    "updated": 1639411831237
                }
            ]
        },
        {
            "style": "Text",
            "text": "This is an example of how to configure a bot to execute as a Standalone Bot. Within the Process Definition of a Bot, the normalWaitTime property has a non zero value, in this case 60 seconds.",
            "updated": 1622215895631,
            "translations": [
                {
                    "language": "DE",
                    "text": "Hier ein Beispiel für die Konfiguration eines Bots zur Ausführung als eigenständiger Bot In der Process Definition  eines Bots hat die Eigenschaft normalWaitTime einen Wert ungleich Null, in diesem Fall 60 Sekunden.",
                    "updated": 1634841274219
                },
                {
                    "language": "RU",
                    "text": "Это пример того, как настроить бота для работы в качестве автономного бота. В определении процесса бота свойство normalWaitTime имеет ненулевое значение, в данном случае 60 секунд.",
                    "updated": 1639411745185
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n    \"codeName\": \"Historic-OHLCVs\",\n    \"description\": \"Retrieves and saves historical market data\",\n    \"deadWaitTime\": 0,\n    \"normalWaitTime\": 60000,\n    \"retryWaitTime\": 10000,\n    \"botModule\": \"Exchange Raw Data Historic OHLCVs\"\n}",
            "updated": 1622215784605
        },
        {
            "style": "Title",
            "text": "Configuring an Execution Dependent Bot",
            "updated": 1622215826932,
            "translations": [
                {
                    "language": "DE",
                    "text": "Konfigurieren eines Execution Dependent Bot (ausführungsabhängigen Bots):",
                    "updated": 1634841312416
                },
                {
                    "language": "RU",
                    "text": "Настройка бота, зависящего от выполнения",
                    "updated": 1639411840073
                }
            ]
        },
        {
            "style": "Text",
            "text": "In order to configure a bot to execute as an Execution Dependent Bot two things need to be in place. ",
            "updated": 1622216289412,
            "translations": [
                {
                    "language": "DE",
                    "text": "Um einen Bot so zu konfigurieren, dass er als Execution Dependent Bot (ausführungsabhängiger Bot) ausgeführt wird, müssen zwei Dinge vorhanden sein:",
                    "updated": 1634841400498
                },
                {
                    "language": "RU",
                    "text": "Чтобы настроить бота для работы в качестве бота, зависящего от выполнения, необходимо наличие двух вещей.",
                    "updated": 1639411854708
                }
            ]
        },
        {
            "style": "List",
            "text": "First, the bot's definition will need to have an Execution Started Event defined. After this, the Execution Started Event will need to have a reference to the Execution Finished Event of the Bot on which it is waiting.",
            "updated": 1622216544766,
            "translations": [
                {
                    "language": "DE",
                    "text": "Zunächst muss in der Definition des Bots ein Ereignis Execution Started Event definiert werden. Danach muss das Ereignis \"Execution Started Event\" einen Verweis auf das Ereignis \"Execution Finished Event\" des Bots enthalten, auf das es wartet.",
                    "updated": 1634843860022
                },
                {
                    "language": "RU",
                    "text": "Во-первых, в определении бота должно быть определено событие запуска Execution Started Event. После этого Execution Finished Event должно иметь ссылку на событие завершения Execution Finished Event того бота, которого он ожидает.",
                    "updated": 1639411981280
                }
            ]
        },
        {
            "style": "List",
            "text": "Second, the Bot's Process Definition will need a zero in the normalWaitTime property. This will force the Bot to immediately run the next loop, but since there is an Execution Started Event defined, that will make it wait until the referenced Bot finishes.",
            "updated": 1622216345546,
            "translations": [
                {
                    "language": "DE",
                    "text": "Zweitens benötigt die Prozessdefinition des Bots eine Null in der Eigenschaft normalWaitTime. Dadurch wird der Bot gezwungen, sofort den nächsten loop auszuführen. Da jedoch ein Ereignis  Execution Started Event  definiert ist, wird er warten, bis der referenzierte Bot fertig ist.",
                    "updated": 1634843953677
                },
                {
                    "language": "RU",
                    "text": "Во-вторых, для определения процесса Process Definition бота потребуется ноль в свойстве normalWaitTime. Это заставит бота немедленно запустить следующий цикл, но, поскольку определено событие начала выполнения Execution Started Event, оно заставит его ждать, пока бот, на который ссылается, не закончит работу.",
                    "updated": 1639412078151
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n    \"codeName\": \"Multi-Time-Frame-Market\",\n    \"normalWaitTime\": 0,\n    \"retryWaitTime\": 10000,\n    \"framework\": {\n        \"name\": \"Multi-Time-Frame-Market\"\n    }\n}",
            "updated": 1621710596317
        },
        {
            "style": "Note",
            "text": "From a deployment point of view, the dependant bots can be physically located on the same machine, or on multiple different machines. Superalgos handles syncronization across multiples machines.",
            "updated": 1622216626010,
            "translations": [
                {
                    "language": "DE",
                    "text": "Aus Sicht der Bereitstellung können sich die abhängigen Bots physisch auf demselben Rechner oder auf mehreren verschiedenen Rechnern befinden. Superalgos kümmert sich um die Syncronisierung über mehrere Maschinen hinweg.",
                    "updated": 1634844032286
                },
                {
                    "language": "RU",
                    "text": "С точки зрения развертывания зависимые боты могут физически располагаться на одной машине или на нескольких разных машинах. Superalgos выполняет синхронизацию на нескольких машинах.",
                    "updated": 1639412101011
                }
            ]
        }
    ]
}