{
    "topic": "Data Mining",
    "pageNumber": 4,
    "type": "Data Mining - Datasets Type Conversions",
    "definition": {
        "text": "Processes fetching data from the Internet are optimized for accessing a wide range of APIs available out there. The Dataset Type they use to store raw data is usually not the best one for data consumption within the system. For that reason Dataset Type conversions need to be done.",
        "updated": 1622205220555,
        "translations": [
            {
                "language": "DE",
                "text": "Zusammenfassung: Prozesse, die Daten aus dem Internet abrufen, sind für den Zugriff auf eine breite Palette von APIs optimiert, die dort verfügbar sind. Der Dataset Type (Datentyp), den sie zum Speichern von Rohdaten verwenden, ist in der Regel nicht der beste für die Weiterverwendung innerhalb des Systems. Aus diesem Grund müssen Dataset-Typ-Konvertierungen vorgenommen werden.",
                "updated": 1634677302182
            },
            {
                "language": "RU",
                "text": "Процессы получения данных из Интернета оптимизированы для доступа к широкому спектру доступных API. Тип набора данных, который они используют для хранения необработанных данных, обычно не лучший для потребления данных в системе. По этой причине необходимо выполнить преобразование типов набора данных.",
                "updated": 1639392705857
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Types of Dataset Conversions",
            "updated": 1622227863425,
            "translations": [
                {
                    "language": "DE",
                    "text": "Arten von Dataset-Konvertierungen:",
                    "updated": 1634677318651
                },
                {
                    "language": "RU",
                    "text": "Типы преобразований Dataset",
                    "updated": 1639392731017
                }
            ]
        },
        {
            "style": "Text",
            "text": "The type of conversions currently implemented within the system are:",
            "translations": [
                {
                    "language": "RU",
                    "text": "В настоящее время в системе реализованы следующие типы преобразований:",
                    "updated": 1639392741604
                }
            ]
        },
        {
            "style": "List",
            "text": "From One-Min-Daily Dataset to Multi-Time-Frame-Daily.",
            "updated": 1621701316752,
            "translations": [
                {
                    "language": "RU",
                    "text": "Из One-Min-Daily Dataset в Multi-Time-Frame-Daily.",
                    "updated": 1639392757622
                }
            ]
        },
        {
            "style": "List",
            "text": "From One-Min-Daily Dataset to Multi-Time-Frame-Market.",
            "updated": 1621701322738,
            "translations": [
                {
                    "language": "RU",
                    "text": "Из One-Min-Daily Dataset в Multi-Time-Frame-Market.",
                    "updated": 1639392771510
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "How to Convert from One Dataset Type to Another",
            "updated": 1622205287155,
            "translations": [
                {
                    "language": "RU",
                    "text": "Как преобразовать один тип набора данных в другой",
                    "updated": 1639392787246
                }
            ]
        },
        {
            "style": "Text",
            "text": "There are two ways to convert from one Dataset type to another. ",
            "updated": 1621699409527,
            "translations": [
                {
                    "language": "DE",
                    "text": "Folgende Arten von Dataset Konvertierungen sind derzeit im System implementiert:",
                    "updated": 1634677350007
                },
                {
                    "language": "RU",
                    "text": "Есть два способа преобразовать один тип набора данных в другой.",
                    "updated": 1639392799824
                }
            ]
        },
        {
            "style": "List",
            "text": "Custom Code: Users can write code to handle the conversion in cases where the standard converter is not available for the type of conversion needed.",
            "updated": 1622205316515,
            "translations": [
                {
                    "language": "DE",
                    "text": "Benutzerdefinierter Code: Benutzer können Code schreiben, um die Konvertierung in den Fällen durchzuführen, in denen der Standardkonverter für die benötigte Art der Konvertierung nicht verfügbar ist.",
                    "updated": 1634677385514
                },
                {
                    "language": "RU",
                    "text": "Пользовательский код: пользователи могут написать код для обработки преобразования в тех случаях, когда стандартный преобразователь недоступен для требуемого типа преобразования.",
                    "updated": 1639392825505
                }
            ]
        },
        {
            "style": "List",
            "text": "Standard Converter: Use a standard converter to do the job. Currently there is only one Standard Converter and it works converting from One-Min-Daily Dataset type to Multi-Time-Frame-Daily and Multi-Time-Frame-Market Dataset types. ",
            "updated": 1621711423050,
            "translations": [
                {
                    "language": "DE",
                    "text": "Standardkonverter: Verwenden Sie einen Standardkonverter, um die Aufgabe zu erledigen. Derzeit gibt es nur einen Standardkonverter, der die Konvertierung von One-Min-Daily-Dataset-Typen in Multi-Time-Frame-Daily- und Multi-Time-Frame-Market-Dataset-Typen ermöglicht.",
                    "updated": 1634677568153
                },
                {
                    "language": "RU",
                    "text": "Стандартный конвертер: используйте для работы стандартный конвертер. В настоящее время существует только один стандартный конвертер, и он работает с преобразованием типа One-Min-Daily в типы Multi-Time-Frame-Daily и Multi-Time-Frame-Market.",
                    "updated": 1639393115293
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Custom Code Example",
            "updated": 1622205366974,
            "translations": [
                {
                    "language": "DE",
                    "text": "Beispiel für custom (benutzerdefinierten) Code:",
                    "updated": 1634677731371
                },
                {
                    "language": "RU",
                    "text": "Пример пользовательского кода",
                    "updated": 1639392984374
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Candles-Volumes indicator at the Master Data Mine converts One-Min candles and volumes into candles and volumes of 2 min, 3 min ecc.. up to 24hs. To do this, it runs a custom made algorithm that aggregates that information provided by the Exchange Raw Data Sensor Bot.",
            "updated": 1622191376005,
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Candles-Volumes-Indikator in der Master Data Mine konvertiert One-Min-Candles und Volumes in Candles und Volumes von 2 Minuten, 3 Minuten usw. bis zu 24 Stunden. Zu diesem Zweck wird ein speziell entwickelter Algorithmus ausgeführt, der die vom Exchange Raw Data Sensor Bot bereitgestellten Informationen aggregiert (zusammenfasst).",
                    "updated": 1634678088585
                },
                {
                    "language": "RU",
                    "text": "Индикатор Candles-Volumes в Master Data Mine конвертирует одноминутные свечи и объемы в свечи и объемы от 2 минут, 3 минут и т. д. До 24 часов. Для этого он запускает индивидуальный алгоритм, который агрегирует эту информацию, предоставленную ботом Raw Data Sensor Bot.",
                    "updated": 1639393136355
                }
            ]
        },
        {
            "style": "Note",
            "text": "The reason this was implemented as custom code is because when it was needed there was no standard converter and it has not been migrated to the currently existing one.",
            "updated": 1622205482848,
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Grund dafür, dass dies als benutzerdefinierter Code implementiert wurde, liegt darin, dass es zu dem Zeitpunkt, als es benötigt wurde, keinen Standardkonverter gab und er nicht in den derzeit bestehenden migriert wurde.",
                    "updated": 1634678403439
                },
                {
                    "language": "RU",
                    "text": "Причина, по которой это было реализовано как пользовательский код, заключается в том, что, когда он был нужен, не было стандартного конвертера, и он не был перенесен в существующий в настоящее время.",
                    "updated": 1639393087068
                }
            ]
        },
        {
            "style": "Subtitle",
            "text": "Standard Converter Example",
            "updated": 1621701438440,
            "translations": [
                {
                    "language": "DE",
                    "text": "Beispiel für einen Standardkonverter:",
                    "updated": 1634678436605
                },
                {
                    "language": "RU",
                    "text": "Пример стандартного преобразователя",
                    "updated": 1639393107364
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Asset Metrics Indicator Bot, defined at the Messari Data Mine, uses the Standard Converter from One-Min-Daily Dataset type to Multi-Time-Frame-Daily and Multi-Time-Frame-Market Dataset types. In order to use the converter, the bot's Process Definition nodes needs to have a framework of the converter defined within its config.",
            "updated": 1622205718679,
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Asset Metrics Indicator Bot, der in der Messari Data Mine definiert wurde, verwendet den Standardkonverter von dem One-Min-Daily-Dataset-Typ zu Multi-Time-Frame-Daily und Multi-Time-Frame-Market Dataset-Typen. Um den Konverter verwenden zu können, muss die Process Definition Node des Bots ein Framework des Konverters in seiner Konfiguration definiert haben.",
                    "updated": 1634679002933
                },
                {
                    "language": "RU",
                    "text": "Бот Asset Metrics Indicator Bot, определенный в Messari Data Mine, использует стандартный конвертер из типа набора данных One-Min-Daily в типы данных Multi-Time-Frame-Daily и Multi-Time-Frame-Market. Чтобы использовать конвертер, узлы Process Definition должны иметь структуру конвертера, определенную в его конфигурации.",
                    "updated": 1639400365447
                }
            ]
        },
        {
            "style": "Text",
            "text": "To convert to Multi-Time-Frame-Daily, set the framework name as follows:",
            "updated": 1622205768649,
            "translations": [
                {
                    "language": "DE",
                    "text": "Zur Umstellung auf Multi-Time-Frame-Daily stellen Sie den Framework-Namen wie folgt ein:",
                    "updated": 1634679069645
                },
                {
                    "language": "RU",
                    "text": "Чтобы преобразовать в Multi-Time-Frame-Daily, задайте имя фреймворка следующим образом:",
                    "updated": 1639400383258
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n    \"codeName\": \"From-One-Min-To-Multi-Time-Frame-Daily\",\n    \"normalWaitTime\": 0,\n    \"retryWaitTime\": 10000,\n    \"framework\": {\n        \"name\": \"From-One-Min-To-Multi-Time-Frame-Daily\"\n    }\n}",
            "updated": 1621701781838
        },
        {
            "style": "Text",
            "text": "To convert to Multi-Time-Frame-Market, set the framework name like this:",
            "updated": 1622205804137,
            "translations": [
                {
                    "language": "DE",
                    "text": "Zur Umwandlung in Multi-Time-Frame-Market setzen Sie den Framework-Namen wie folgt:",
                    "updated": 1634679148016
                },
                {
                    "language": "RU",
                    "text": "Чтобы преобразовать в Multi-Time-Frame-Market, задайте имя фреймворка следующим образом:",
                    "updated": 1639400401580
                }
            ]
        },
        {
            "style": "Json",
            "text": " {\n    \"codeName\": \"From-One-Min-To-Multi-Time-Frame-Market\",\n    \"normalWaitTime\": 0,\n    \"retryWaitTime\": 10000,\n    \"framework\": {\n        \"name\": \"From-One-Min-To-Multi-Time-Frame-Market\"\n    }\n}",
            "updated": 1621901499029
        },
        {
            "style": "Success",
            "text": "You will need the standard converter everytime you use the API Data Fetcher Bot to extract data from some Inernet API. The bot will usually save the data in a One-Min-Daily Dataset Type, and you will need to setup an Indicator Bot with two processes in order to convert the One-Min-Daily Dataset Type into a Multi-Time-Frame-Daily and a Multi-Time-Frame-Market Dataset Type.",
            "updated": 1622191511065,
            "translations": [
                {
                    "language": "DE",
                    "text": "Sie benötigen den Standardkonverter jedes Mal, wenn Sie den API Data Fetcher Bot zum Extrahieren von Daten aus einer Inernet-API verwenden. Der Bot speichert die Daten in der Regel in einem One-Min-Daily Dataset Type, und Sie müssen einen Indicator Bot mit zwei Prozessen einrichten, um den One-Min-Daily Dataset Type in einen Multi-Time-Frame-Daily und einen Multi-Time-Frame-Market Dataset Type zu konvertieren.",
                    "updated": 1634679302507
                },
                {
                    "language": "RU",
                    "text": "Стандартный конвертер понадобится вам каждый раз, когда вы будете использовать бот API Data Fetcher Bot для извлечения данных из некоторого Inernet API. Бот обычно сохраняет данные в виде набора данных One-Min-Daily, и вам нужно будет настроить Indicator Bot с двумя процессами, чтобы преобразовать тип набора данных One-Min-Daily в тип набора данных Multi-Time-Frame-Market",
                    "updated": 1639400598952
                }
            ]
        }
    ]
}