{
    "topic": "Data Mining",
    "pageNumber": 12,
    "type": "Data Mining - Products",
    "definition": {
        "text": "All Datasets of any type created by bots within the Superalgos system are considered data products of the Bot that produced them. Why products? Because users will be able to sell these datasets in the form of subscriptions once the Superalgos Network is implemented.",
        "updated": 1622226983424,
        "translations": [
            {
                "language": "DE",
                "text": "Zusammenfassung: Alle Datasets jeglicher Art, die von Bots innerhalb des Superalgos-Systems erstellt werden, gelten als Datenprodukte des Bots, der sie erstellt hat. Warum Produkte? Weil die Nutzer diese Datensätze in Form von Abonnements verkaufen können, sobald das Superalgos Netzwerk implementiert ist.",
                "updated": 1635104802339
            },
            {
                "language": "RU",
                "text": "Все наборы данных Dataset любого типа, созданные ботами в системе Superalgos, считаются продуктами данных бота, который их создал. Почему именно продукты? Потому что пользователи смогут продавать эти наборы данных в форме подписок после внедрения сети Superalgos Network.",
                "updated": 1639580535218
            },
            {
                "language": "TR",
                "text": "Özet: Superalgos sistemi içinde botlar tarafından oluşturulan herhangi bir türdeki tüm Veri Kümeleri, onları üreten Bot'un veri ürünleri olarak kabul edilir. Neden ürünler? Çünkü kullanıcılar Superalgos Network'ün hayata geçmesiyle birlikte bu veri setlerini abonelik şeklinde satabilecekler.",
                "updated": 1645963738338
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "In the future, users will be able to offer products to the rest of the users within the Superalgos Network / Superalgos Marketplace. A single bot might produce as many products as the bot designer wishes. Each product might contain one or more datasets.",
            "updated": 1622227043268,
            "translations": [
                {
                    "language": "DE",
                    "text": "In Zukunft werden die Nutzer in der Lage sein, den anderen Nutzern des Superalgos Network / Superalgos Marketplace Produkte anzubieten. Ein einzelner Bot kann so viele Produkte herstellen, wie der Bot-Designer wünscht. Jedes Produkt kann einen oder mehrere Datasets enthalten.",
                    "updated": 1635105592983
                },
                {
                    "language": "RU",
                    "text": "В будущем пользователи смогут предлагать продукты остальным пользователям в сети Superalgos Network / Superalgos Marketplace. Один бот может производить столько продуктов, сколько пожелает разработчик бота. Каждый продукт может содержать один или несколько наборов данных.",
                    "updated": 1639580575824
                },
                {
                    "language": "TR",
                    "text": "Gelecekte, kullanıcılar Superalgos Network / Superalgos Marketplace içindeki diğer kullanıcılara ürünler sunabilecekler. Tek bir bot, bot tasarımcısının istediği kadar ürün üretebilir. Her ürün bir veya daha fazla veri kümesi içerebilir.",
                    "updated": 1645963801144
                }
            ]
        }
    ]
}