{
    "topic": "Data Mining",
    "pageNumber": 9,
    "type": "Data Mining - Status Reports",
    "definition": {
        "text": "Status Reports are files produced by each Bot's processes with key information the Bot needs to save in order to remember the next time it is run.",
        "updated": 1622218351726,
        "translations": [
            {
                "language": "DE",
                "text": "Statusberichte sind Dateien, die von den einzelnen Bot-Prozessen erstellt werden und wichtige Informationen enthalten, die der Bot speichern muss, um sich bei der nächsten Ausführung an sie zu erinnern.",
                "updated": 1634847240243
            },
            {
                "language": "RU",
                "text": "Отчеты о состоянии Status Reports - это файлы, создаваемые процессами каждого бота, с ключевой информацией, которую бот должен сохранить, чтобы запомнить при следующем запуске.",
                "updated": 1639412860714
            },
            {
                "language": "TR",
                "text": "Özet: Durum Raporları ( Status Reports ), Bot'un bir sonraki çalıştırılışında hatırlamak için kaydetmesi gereken önemli bilgilerle birlikte her bir Bot'un süreçleri tarafından üretilen dosyalardır.",
                "updated": 1645903283726
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "The Task Server Main Loop",
            "updated": 1622218578406,
            "translations": [
                {
                    "language": "DE",
                    "text": "The Task Server Main Loop (Die Hauptschleife des Aufgabenservers):",
                    "updated": 1634847263150
                },
                {
                    "language": "RU",
                    "text": "Главный цикл сервера задач Task Server",
                    "updated": 1639412905521
                },
                {
                    "language": "TR",
                    "text": "Görev Sunucusu Ana Döngüsü",
                    "updated": 1645903350330
                }
            ]
        },
        {
            "style": "Text",
            "text": "Most Bots in Superalgos are run by the Task Server and implement a Main Loop. At each loop execution, bots do their job and at the end they go to sleep. ",
            "updated": 1622218637972,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die meisten Bots in Superalgos werden vom Task Server ausgeführt und implementieren eine Hauptschleife. Bei jeder Schleifenausführung erledigen die Bots ihre Aufgabe und gehen am Ende in eine art \"Schlaf\" (wie ein Ruhezustand Modus) bis die Schleife wieder ausgeführt wird.",
                    "updated": 1634847458538
                },
                {
                    "language": "RU",
                    "text": "Большинство ботов в Superalgos запускаются сервером задач Task Server и реализуют основной цикл Main Loop. При выполнении каждого цикла боты выполняют свою работу и в конце засыпают.",
                    "updated": 1639412976422
                },
                {
                    "language": "TR",
                    "text": "Superalgos'taki çoğu Bot, Görev Sunucusu ( Task Server ) tarafından çalıştırılır ve bir Ana Döngü ( Main Loop ) uygular. Her döngü yürütmede, botlar işlerini yapar ve sonunda uyurlar.",
                    "updated": 1645903454385
                }
            ]
        },
        {
            "style": "Note",
            "text": "How much time they sleep and other details are configured at the Bot's Process Definition.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Wie lange sie \"schlafen\" und andere Details werden in der Prozessdefinition des Bots konfiguriert.",
                    "updated": 1634847359588
                },
                {
                    "language": "RU",
                    "text": "Сколько времени они спят, и другие детали настраиваются в определении процесса Process Definition бота.",
                    "updated": 1639413013057
                },
                {
                    "language": "TR",
                    "text": "Not: Ne kadar uyudukları ve diğer ayrıntılar Bot'un İşlem Tanımında ( Process Definition ) yapılandırılır.",
                    "updated": 1645903496035
                }
            ]
        },
        {
            "style": "Title",
            "text": "Status Report Mechanics",
            "updated": 1622218611081,
            "translations": [
                {
                    "language": "DE",
                    "text": "Status Report Mechanics (Statusbericht Mechaniken):",
                    "updated": 1634847419703
                },
                {
                    "language": "RU",
                    "text": "Механизм отчета о состоянии",
                    "updated": 1639413056970
                }
            ]
        },
        {
            "style": "Text",
            "text": "Before a bot goes to sleep, computer memory is flushed of all information related to the Bot. This is important to free up hardware resources for other bots running on the same machine. However, there is some information Bots need to remember between each execution of the Main Loop, and between executions of the Task itself. That info is stored in a JSON / text file called the Status Report. The name Status was used since the information stored is often the status of the Bot's process. Here is an example of a simple Status Report file:",
            "updated": 1622218847283,
            "translations": [
                {
                    "language": "DE",
                    "text": "Bevor ein Bot in den Ruhezustand geht, werden alle mit dem Bot verbundenen Informationen aus dem Computerspeicher entfernt. Dies ist wichtig, um Hardware-Ressourcen für andere Bots freizugeben, die auf demselben Computer laufen. Es gibt jedoch einige Informationen, die sich Bots zwischen den einzelnen Ausführungen der Hauptschleife selber und zwischen den Ausführungen des Tasks selbst merken müssen.Diese Informationen werden in einer JSON-/Textdatei namens Status Report gespeichert. Der Name \"Status\" wurde gewählt, da die gespeicherten Informationen oft den Status des Bot-Prozesses darstellen. Hier ist ein Beispiel für eine einfache Status Report Datei:",
                    "updated": 1634847824025
                },
                {
                    "language": "RU",
                    "text": "Перед тем, как бот перейдет в спящий режим, из памяти компьютера удаляется вся информация, связанная с ботом. Это важно для освобождения аппаратных ресурсов для других ботов, работающих на той же машине. Однако существует некоторая информация, которую ботам необходимо запоминать между каждым выполнением основного цикла Main Loop и между выполнениями самой задачи. Эта информация хранится в JSON / текстовом файле, который называется Status Report. Название \"Status\" использовалось, поскольку хранимая информация часто является статусом процесса бота. Вот пример простого файла Status Report:",
                    "updated": 1639413309271
                },
                {
                    "language": "TR",
                    "text": "Bir bot uyku moduna geçmeden önce, bilgisayar belleği Bot ile ilgili tüm bilgilerden temizlenir. Bu, aynı makinede çalışan diğer botlar için donanım kaynaklarını boşaltmak için önemlidir. Ancak, Ana Döngünün  ( Main Loop ) her yürütmesi arasında ve Görevin kendisinin yürütülmesi arasında Botların hatırlaması gereken bazı bilgiler vardır. Bu bilgi, Durum Raporu ( Status Report ) adı verilen bir JSON / metin dosyasında saklanır. Durum adı, saklanan bilgiler genellikle Bot'un işleminin durumu olduğu için kullanılmıştır. İşte basit bir Durum Raporu dosyası örneği:",
                    "updated": 1645903631434
                }
            ]
        },
        {
            "style": "Json",
            "text": "{\n\"lastExecution\":\"2021-05-21T22:08:09.278Z\",\n\"lastFile\":\"2021-05-21T00:00:00.000Z\",\n\"beginingOfMarket\":\"Wed, 01 Jan 2020 00:00:00 GMT\"\n}",
            "updated": 1621717169974
        },
        {
            "style": "Note",
            "text": "Status Report files might also include a data structure called Inter Execution Memory. Status information is standard for all types of bots. Inter Execution Memory, on the other hand, depends on each Bot's type and what is actually being processed.",
            "updated": 1622218782345,
            "translations": [
                {
                    "language": "DE",
                    "text": "Status Report Dateien können auch eine Datenstruktur namens Inter Execution Memory enthalten. Statusinformationen sind für alle Arten von Bots Standard. Der Inter Execution Memory (Ausführungsspeicher) hingegen hängt vom Typ des jeweiligen Bots ab und davon, was tatsächlich verarbeitet wird.",
                    "updated": 1634847925406
                },
                {
                    "language": "RU",
                    "text": "Файлы Status Report также могут включать структуру данных, называемую памятью выполнения Inter Execution Memory. Информация о статусе стандартна для всех типов ботов. С другой стороны, Inter Execution Memory зависит от типа каждого бота и от того, что на самом деле обрабатывается.",
                    "updated": 1639413401296
                },
                {
                    "language": "TR",
                    "text": "Not: Durum Raporu ( Status Report ) dosyaları, Yürütme Arası Bellek ( Inter Execution Memory ) adı verilen bir veri yapısı da içerebilir. Durum bilgileri, tüm bot türleri için standarttır. Yürütmeler Arası Bellek ( Inter Execution Memory ) ise her bir Bot'un türüne ve gerçekte ne işlenmekte olduğuna bağlıdır.",
                    "updated": 1645903735673
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}