{
    "topic": "Data Mining",
    "pageNumber": 23,
    "type": "Data Mining - How to Build an Indicator - Video Series",
    "definition": {
        "text": "This video series goes through the entire process of building an indicator, step by step.",
        "updated": 1611434001380,
        "translations": [
            {
                "language": "DE",
                "text": "In dieser Videoserie wird der gesamte Prozess der Erstellung eines Indicators Schritt für Schritt erläutert.",
                "updated": 1635521417011
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This video series focuses on the “how to” aspect of building an indicator. It does not go through definitions nor does it explain the underlying concepts. Therefore, it is highly recommended to read the data mines page as well as the pages about indicator bots before attempting to build an indicator.",
            "updated": 1611434011723,
            "translations": [
                {
                    "language": "DE",
                    "text": "Diese Videoreihe konzentriert sich auf den \"How to\"-Aspekt der Erstellung eines Indikators. Es werden weder Definitionen erläutert noch die zugrunde liegenden Konzepte erklärt. Es wird daher dringend empfohlen, die Seite über Datenminen sowie die Seiten über Indikator-Bots zu lesen, bevor Sie versuchen, einen Indikator zu erstellen.",
                    "updated": 1635522063282
                }
            ]
        },
        {
            "style": "Note",
            "text": "Reading the whole documentation on indicators and plotters is certainly desirable and will save you time in the long run.",
            "updated": 1611434037598,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die ganze docs zu lesen hilft Verständnis über Indikatoren und Plotter zu erlangen und ist sicherlich wünschenswert und wird Ihnen langfristig Zeit sparen.",
                    "updated": 1635522428663
                }
            ]
        },
        {
            "style": "Important",
            "text": "The video series on how to build an indicator was produced for the Beta 5 version (inbetween we are at Beta12) of the system; however, the functionality still works similarly. That said, there may be minor differences that are yet to be documented. Please drop by the Develop group and ask any questions you may have, particularly if something is not working as expected, or as instructed in the videos. The group is linked in the footer.",
            "updated": 1635522913439,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Videoserie über die Erstellung eines Indicators wurde für die Beta 5 Version des Systems produziert (inzwischen sind wir bei 1.0.0); die Funktionalität funktioniert jedoch immer noch ähnlich. Allerdings kann es geringfügige Unterschiede geben, die noch zu dokumentieren sind. Schauen Sie in der Develop group vorbei und stellen Sie Ihre Fragen, insbesondere wenn etwas nicht wie erwartet oder wie in den Videos beschrieben funktioniert. Die Gruppe ist in der Fußzeile verlinkt.",
                    "updated": 1635522983953
                }
            ]
        },
        {
            "style": "Title",
            "text": "Step 1 - Visual Definitions",
            "updated": 1611434706444,
            "translations": [
                {
                    "language": "DE",
                    "text": "Schritt 1  - \"Visual Definitions\":",
                    "updated": 1635523040592
                }
            ]
        },
        {
            "style": "Text",
            "text": "Setting up the Multi-Time-Frame-Market and Multi-Time-Frame-Daily process definitions, status and data dependencies, execution events, and dataset definitions for the main product.",
            "updated": 1611434720860,
            "translations": [
                {
                    "language": "DE",
                    "text": "Einrichtung der Prozessdefinitionen für den Multi-Time-Frame-Market und den Multi-Time-Frame-Daily, der Status- und Datenabhängigkeiten, der Ausführungsereignisse (execution events) und der Dataset-Definitionen für das main product.",
                    "updated": 1635523111913
                }
            ]
        },
        {
            "style": "Youtube",
            "text": "KXKKS_o8Zjw",
            "updated": 1611434740393
        },
        {
            "style": "Title",
            "text": "Step 2 - Code & Record Definition",
            "updated": 1611435476284,
            "translations": [
                {
                    "language": "DE",
                    "text": "Schritt 2 - \"Code & Record Definition\":",
                    "updated": 1635523134273
                }
            ]
        },
        {
            "style": "Text",
            "text": "Reviewing common coding practice and configuring record properties and their formulas.",
            "updated": 1611435495283,
            "translations": [
                {
                    "language": "DE",
                    "text": "Überprüfung gängiger coding (programmier)-praktiken und Konfiguration von record properties und deren Formeln.",
                    "updated": 1635523212258
                }
            ]
        },
        {
            "style": "Youtube",
            "text": "zx5N5D2tkwo",
            "updated": 1611435834819
        },
        {
            "style": "Title",
            "text": "Step 3 - Testing & Troubleshooting",
            "updated": 1611435879103,
            "translations": [
                {
                    "language": "DE",
                    "text": "Schritt 3 - \"Testing & Troubleshooting\":",
                    "updated": 1635523224909
                }
            ]
        },
        {
            "style": "Text",
            "text": "Setting up a data mining task to run the bot instance, checking the dataset files for errors, and troubleshooting common issues with the code and the process definitions.",
            "updated": 1611435892931,
            "translations": [
                {
                    "language": "DE",
                    "text": "Einrichten einer Data-Mining-Task zur Ausführung der Bot-Instanz, Prüfen der Datensatz-Dateien auf Fehler und Beheben allgemeiner Probleme mit dem Code und den Prozessdefinitionen (process definitions).",
                    "updated": 1635523304414
                }
            ]
        },
        {
            "style": "Youtube",
            "text": "gjv5lPmLVSI",
            "updated": 1611435919312
        },
        {
            "style": "Title",
            "text": "Step 4 - Plotters",
            "updated": 1611435948687,
            "translations": [
                {
                    "language": "DE",
                    "text": "Schritt 4 - Plotters",
                    "updated": 1635523314690
                }
            ]
        },
        {
            "style": "Text",
            "text": "How to create the device that will interpret the dataset generated by the indicator and render a graphical representation over the charts.",
            "updated": 1611435955116,
            "translations": [
                {
                    "language": "DE",
                    "text": "So erstellen Sie das Gerät, das den vom Indikator erzeugten Datensatz interpretiert und eine grafische Darstellung in den Diagrammen wiedergibt.",
                    "updated": 1635523333565
                }
            ]
        },
        {
            "style": "Youtube",
            "text": "UBtUtUfZPk4",
            "updated": 1611436312247
        },
        {
            "style": "Title",
            "text": "Step 5 - Trading Bot Dependencies",
            "updated": 1611436344230,
            "translations": [
                {
                    "language": "DE",
                    "text": "Schritt 5 - \"Trading Bot Dependencies\":",
                    "updated": 1635523346918
                }
            ]
        },
        {
            "style": "Text",
            "text": "Before you may use the new indicator on a trading system, you must create the corresponding dependencies on the Low frequency trading bot.",
            "updated": 1611436373962,
            "translations": [
                {
                    "language": "DE",
                    "text": "Bevor Sie den neuen Indikator in einem Handelssystem verwenden können, müssen Sie die entsprechenden Abhängigkeiten auf dem Low Frequency Trading Bot erstellen.",
                    "updated": 1635523409654
                }
            ]
        },
        {
            "style": "Text",
            "text": "To call the properties of a new indicator from within the definitions of a trading system, you first need to let the Low Frequency trading bot that your data mine exists. To do this, you need to add the corresponding data dependencies at the trading bot’s Trading process definitions.",
            "updated": 1611436404033,
            "translations": [
                {
                    "language": "DE",
                    "text": "Um die Eigenschaften eines neuen Indicator aus den Definitionen eines trading system heraus aufrufen zu können, müssen Sie zunächst dem Low Frequency-trading bot mitteilen, dass Ihre data mine existiert. Zu diesem Zweck müssen Sie die entsprechenden data dependencies zu den trading bot’s Trading process definitions des Trading-Bots hinzufügen.",
                    "updated": 1635523501772
                }
            ]
        },
        {
            "style": "Gif",
            "text": "GIFs/Foundations/Docs/design-space/how-to-build-an-indicator-step-5.gif",
            "updated": 1611436528224
        },
        {
            "style": "Important",
            "text": "Because the Low Frequency trading bot is a plugin, the modifications you make to the hierarchy do not persist after closing the frontend app. The workaround is to take a backup of the hierarchy after making the modifications, and replace the plugin file with the backup. Should you decide to contribute your data mine to the project, we will incorporate the dependencies in the official release.",
            "updated": 1611436549743,
            "translations": [
                {
                    "language": "DE",
                    "text": "Da es sich beim Low Frequency Trading Bot um ein Plugin handelt, bleiben die Änderungen, die Sie an der Hierarchie vornehmen, nach dem Schließen der Frontend-App nicht erhalten. Die Abhilfe besteht darin, nach den Änderungen ein Backup der Hierarchie zu erstellen und die Plugin-Datei durch das Backup zu ersetzen. Sollten Sie sich dazu entschließen, Ihre data mine zum Projekt beizusteuern, werden wir die dependencies in die offizielle Version einbauen.",
                    "updated": 1635523596673
                }
            ]
        }
    ]
}