{
    "topic": "Data Mining",
    "pageNumber": 10,
    "type": "Data Mining - Status Dependencies",
    "definition": {
        "text": "Status Dependencies are another type of relationship between Bots. Sometimes bots don't depend on the Datasets produced by other bots, but they depend directly on the status of other bots.",
        "updated": 1622219077845,
        "translations": [
            {
                "language": "DE",
                "text": "Statusabhängigkeiten sind eine weitere Art der Beziehung zwischen Bots. Manchmal sind Bots nicht von den von anderen Bots erzeugten Datensätzen abhängig, sondern direkt vom Status anderer Bots.",
                "updated": 1634848429664
            },
            {
                "language": "RU",
                "text": "Status Dependency - это еще один тип отношений между ботами. Иногда боты не зависят от наборов данных Dataset, созданных другими ботами, но они напрямую зависят от состяния других ботов.",
                "updated": 1639577373124
            },
            {
                "language": "TR",
                "text": "Özet: Durum Bağımlılıkları, Botlar arasındaki başka bir ilişki türüdür. Bazen botlar, diğer botlar tarafından üretilen Veri Kümelerine bağlı değildir, ancak doğrudan diğer botların durumuna bağlıdır.",
                "updated": 1645903790625
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Title",
            "text": "Status Dependency Tree",
            "updated": 1622219244127,
            "translations": [
                {
                    "language": "DE",
                    "text": "Status Dependency Tree (Status-Abhängigkeitsbaum):",
                    "updated": 1634848589978
                },
                {
                    "language": "RU",
                    "text": "Дерево Status Dependency",
                    "updated": 1639573425555
                },
                {
                    "language": "TR",
                    "text": "Durum Bağımlılığı Ağacı",
                    "updated": 1645903804584
                }
            ]
        },
        {
            "style": "Text",
            "text": "Status dependencies operate using the same idea of a tree as execution and data dependencies. Any Bot can have from zero to many status dependencies. For each Status Dependency, the Bot's process at runtime will load the Status Report file of the dependent Bot and will extract from there the information it needs.",
            "updated": 1622222998840,
            "translations": [
                {
                    "language": "DE",
                    "text": "Statusabhängigkeiten funktionieren nach der gleichen Idee eines Baums wie Ausführungs- und Datenabhängigkeiten. Jeder Bot kann zwischen null und vielen Statusabhängigkeiten-(dependencies) haben. Für jede Status Dependency lädt der Prozess des Bots zur Laufzeit die Status Report Datei des abhängigen Bots und extrahiert daraus die Informationen, die er benötigt.",
                    "updated": 1634848766593
                },
                {
                    "language": "RU",
                    "text": "Зависимости от состояния работают с использованием той же идеи дерева, что и зависимости выполнения и данных Data Dependency. Любой бот может иметь от нуля до множества зависимостей от состояний. Для каждой зависимости от состояния процесс бота во время выполнения загружает файл отчета о состоянии зависимого бота и извлекает оттуда необходимую информацию.",
                    "updated": 1639577506769
                },
                {
                    "language": "TR",
                    "text": "Durum bağımlılıkları, yürütme ve veri bağımlılıkları ile aynı ağaç fikrini kullanarak çalışır. Herhangi bir Bot, sıfırdan birçok durum bağımlılığına sahip olabilir. Her Durum Bağımlılığı ( Status Dependency ) için, Bot'un çalışma zamanındaki süreci, bağımlı Bot'un Durum Raporu dosyasını yükleyecek ve buradan ihtiyaç duyduğu bilgileri çıkaracaktır.",
                    "updated": 1645903855500
                }
            ]
        },
        {
            "style": "Note",
            "text": "Bots that produce Raw Data usually do not depend on any other Bot's status and are usually the root of a status dependency tree. ",
            "translations": [
                {
                    "language": "DE",
                    "text": "Bots, die Rohdaten (Raw Data) produzieren, hängen in der Regel nicht vom Status eines anderen Bots ab und sind normalerweise die Wurzel eines Statusabhängigkeitsbaums.",
                    "updated": 1634848799068
                },
                {
                    "language": "RU",
                    "text": "Боты, производящие необработанные данные Raw Data, обычно не зависят от состояния других ботов и обычно являются корнем дерева зависимостей от состояний.",
                    "updated": 1639577577470
                },
                {
                    "language": "TR",
                    "text": "Not: Ham Veri ( Raw Data ) üreten Botlar, genellikle başka bir Bot'un durumuna bağlı değildir ve genellikle bir durum bağımlılığı ağacının köküdür.",
                    "updated": 1645903906741
                }
            ]
        },
        {
            "style": "Text",
            "text": "A good way to undestand why Status Dependencies are needed is with an example:",
            "translations": [
                {
                    "language": "DE",
                    "text": "Anhand eines Beispiels lässt sich gut nachvollziehen, warum Statusabhängigkeiten erforderlich sind:",
                    "updated": 1634848845441
                },
                {
                    "language": "RU",
                    "text": "Хороший способ понять, зачем нужны эти зависимости, - это на примере:",
                    "updated": 1639577662015
                },
                {
                    "language": "TR",
                    "text": "Durum Bağımlılıklarının neden gerekli olduğunu anlamanın iyi bir yolu bir örnektir:",
                    "updated": 1645903975267
                }
            ]
        },
        {
            "style": "Text",
            "text": "The Indicator Bot Bollinger-Bands depends on Candles-Volumes Dataset in order to calculate the Bollinger Bands, but it depend's on Exchange Raw Data Sensor Bot in order to know where the market begins, which is the date of the first piece of data. That information is part of the Status information that Exchange Raw Data Sensor Bot keeps at it's Status Report.",
            "updated": 1622223640276,
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Indikator-Bot Bollinger-Bänder hängt vom Candles-Volumes-Datensatz ab, um die Bollinger-Bänder zu berechnen. Aber er hängt auch vom Exchange Raw Data Sensor Bot ab, um zu wissen, wo der Markt beginnt, nämlich mit dem Datum der ersten Daten. Diese Information ist Teil der Statusinformationen, die der Exchange Raw Data Sensor Bot in seinem Statusbericht speichert.",
                    "updated": 1634848951838
                },
                {
                    "language": "RU",
                    "text": "Индикаторный бот Bollinger-Bands зависит от набора данных Candles-Volumes для расчета полос Боллинджера, но он зависит от бота Exchange Raw Data Sensor Bot, чтобы знать, где начинается рынок, то есть дата первого фрагмента данных. Эта информация является частью информации о состоянии, которую бот Exchange Raw Data Sensor Bot хранит в своем отчете о состоянии Status Report.",
                    "updated": 1639576511235
                },
                {
                    "language": "TR",
                    "text": "Gösterge Botu ( Indicator Bot ) Bollinger Bantları, Bollinger Bantlarını hesaplamak için Mum-Hacimler Veri Kümesine bağlıdır, ancak ilk veri parçasının tarihi olan piyasanın nerede başladığını bilmek için Borsa Ham Veri Sensör Botuna ( Raw Data Sensor Bot ) bağlıdır. Bu bilgi, Exchange Ham Veri Sensörü Botunun Durum Raporunda tuttuğu Durum ( Status ) bilgisinin bir parçasıdır.",
                    "updated": 1645904481833
                }
            ]
        },
        {
            "style": "Title",
            "text": "Classification by Utility",
            "updated": 1621718216510,
            "translations": [
                {
                    "language": "DE",
                    "text": "Classification by Utility (Klassifizierung nach \"Nutzen\"):",
                    "updated": 1634849057981
                },
                {
                    "language": "RU",
                    "text": "Классификация по полезности",
                    "updated": 1639576544621
                },
                {
                    "language": "TR",
                    "text": "Faydaya Göre Sınıflandırma",
                    "updated": 1645904510560
                }
            ]
        },
        {
            "style": "Text",
            "text": "A Status Dependency can be classified by it's utility. This makes it easier for processes to handle them in code. There are currently three different utilities:",
            "updated": 1622223177318,
            "translations": [
                {
                    "language": "DE",
                    "text": "Eine Status Dependency kann nach ihrem Nutzen klassifiziert werden. Das macht es für Prozesse einfacher, sie im Code zu behandeln. Derzeit gibt es drei verschiedene Hilfsprogramme(utilities):",
                    "updated": 1634849116125
                },
                {
                    "language": "RU",
                    "text": "Status Dependency можно классифицировать по ее полезности. Это упрощает процессам обработку их в коде. В настоящее время существует три разных утилиты:",
                    "updated": 1639576606153
                },
                {
                    "language": "TR",
                    "text": "Bir Durum Bağımlılığı ( Status Dependency ) , yardımcı programına göre sınıflandırılabilir. Bu, işlemlerin bunları kodda işlemesini kolaylaştırır. Şu anda üç farklı yardımcı program vardır:",
                    "updated": 1645904567628
                }
            ]
        },
        {
            "style": "List",
            "text": "Self Reference: this is used to load a bot's Status Report to extract data from it or modify it.",
            "updated": 1622223714025,
            "translations": [
                {
                    "language": "DE",
                    "text": "Self Reference: wird verwendet, um den Statusbericht eines Bots zu laden, um Daten daraus zu extrahieren oder ihn zu ändern.",
                    "updated": 1634849138412
                },
                {
                    "language": "RU",
                    "text": "Self Reference: используется для загрузки отчета о состоянии бота, чтобы извлечь из него данные или изменить его.",
                    "updated": 1639577893344
                },
                {
                    "language": "TR",
                    "text": "Kendi Kendine Referans: Bu, bottan veri çıkarmak veya değiştirmek için bir botun Durum Raporunu ( Status Report ) yüklemek için kullanılır.",
                    "updated": 1645904634786
                }
            ]
        },
        {
            "style": "List",
            "text": "Market Starting Point: this means that the referenced Status Report is to be used to extract the information of where the market begins.",
            "updated": 1622223349370,
            "translations": [
                {
                    "language": "DE",
                    "text": "Market Starting Point: Dies bedeutet, dass der referenzierte Status Report verwendet werden soll, um die Information zu extrahieren, wo der Markt beginnt.",
                    "updated": 1634849231211
                },
                {
                    "language": "RU",
                    "text": "Market Starting Point: Начальная точка рынка: это означает, что указанный отчет о состоянии должен использоваться для извлечения информации о том, где начинается рынок.",
                    "updated": 1639577876702
                },
                {
                    "language": "TR",
                    "text": "Piyasa ( Market ) Başlangıç Noktası (Point ): Bu, referans alınan Durum Raporunun ( Status Report ), piyasanın başladığı yerin bilgisini çıkarmak için kullanılacağı anlamına gelir.",
                    "updated": 1645904759655
                }
            ]
        },
        {
            "style": "List",
            "text": "Market Ending Point: this means that the referenced Status Report is to be used to extract the information of where the market ends, meaning which date the market ends.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Market Ending Point: Das bedeutet, dass der referenzierte Status Report dazu verwendet werden soll, die Information zu extrahieren, wo der Markt endet, das heißt an welchem Datum der Markt endet.",
                    "updated": 1634849541450
                },
                {
                    "language": "RU",
                    "text": "Market Ending Point: это означает, что упомянутый отчет о состоянии должен использоваться для извлечения информации о том, где заканчивается рынок, то есть о дате окончания рынка.",
                    "updated": 1639577911127
                },
                {
                    "language": "TR",
                    "text": "Piyasa ( Market )  Bitiş Noktası (Point ): Bu, referans alınan Durum Raporunun piyasanın nerede bittiği, yani piyasanın hangi tarihte bittiği bilgisini çıkarmak için kullanılacağı anlamına gelir.",
                    "updated": 1645904804527
                }
            ]
        },
        {
            "style": "Important",
            "text": "A Bot's process is not allowed to update the Status Report belonging to other Bots!",
            "updated": 1634849600795,
            "translations": [
                {
                    "language": "DE",
                    "text": "Der Prozess eines Bots darf den Statusbericht (Status Report) eines anderen Bots nicht aktualisieren!",
                    "updated": 1634849635487
                },
                {
                    "language": "RU",
                    "text": "Процесс бота не может обновлять Status Report, принадлежащий другим ботам!",
                    "updated": 1639577953867
                },
                {
                    "language": "TR",
                    "text": "Önemli: Bir Bot'un sürecinin, diğer Botlara ait Durum Raporunu ( Status Report ) güncellemesine izin verilmez!",
                    "updated": 1645904833311
                }
            ]
        },
        {
            "style": "Text",
            "text": ""
        }
    ]
}