{
    "topic": "Data Mining",
    "pageNumber": 13,
    "type": "Data Mining - Plotting",
    "definition": {
        "text": "Each product may have one Plotter Module associated with it. This Plotter Module has all the definitions needed to interpret the Product's datasets and render the information on a chart.",
        "updated": 1622227086801,
        "translations": [
            {
                "language": "DE",
                "text": "Jedem Produkt kann ein Plottermodul zugeordnet sein. Dieses Plottermodul enthält alle Definitionen, die zur Interpretation der Datensätze des Produkts und zur Darstellung der Informationen in einer chart (Diagramm) erforderlich sind.",
                "updated": 1635105939995
            },
            {
                "language": "RU",
                "text": "С каждым продуктом может быть связан один модуль плоттера Plotter Module. Этот модуль плоттера имеет все определения, необходимые для интерпретации наборов данных продукта и отображения информации на диаграмме.",
                "updated": 1639580741790
            },
            {
                "language": "TR",
                "text": "Özet: Her ürün, kendisiyle ilişkilendirilmiş bir Çizici Modülüne ( Plotter Module ) sahip olabilir. Bu Çizici Modülü, Ürünün veri kümelerini yorumlamak ve bilgileri bir çizelge üzerinde işlemek için gereken tüm tanımlara sahiptir.",
                "updated": 1645963926578
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Superalgos has the capability to allow it's users to create plotters without writing any code. The plotter is defined at the Designer Space. This is done by means of defining vertices and polygons. Users can create custom charts for any Dataset.",
            "updated": 1622227235452,
            "translations": [
                {
                    "language": "DE",
                    "text": "Superalgos bietet die Möglichkeit, Plotter zu erstellen, ohne dass ein Code geschrieben werden muss. Der Plotter wird im Designer Space definiert. Dies geschieht durch die Definition von Scheitelpunkten und Polygonen. Benutzer können benutzerdefinierte Diagramme für jedes Dataset erstellen.",
                    "updated": 1635106017833
                },
                {
                    "language": "RU",
                    "text": "Superalgos позволяет пользователям создавать плоттеры без написания кода. Плоттер определяется в пространстве Designer Space. Это делается посредством определения вершин и полигонов. Пользователи могут создавать собственные диаграммы для любого набора данных Dataset.",
                    "updated": 1639580856393
                },
                {
                    "language": "TR",
                    "text": "Superalgos, kullanıcıları herhangi bir kod yazmadan çiziciler oluşturmasına izin verme yeteneğine sahiptir. Çizici, Tasarımcı Alanında tanımlanır. Bu, köşeleri ve çokgenleri tanımlayarak yapılır. Kullanıcılar, herhangi bir Veri Kümesi ( Dataset ) için özel grafikler oluşturabilir.",
                    "updated": 1645964011882
                }
            ]
        }
    ]
}