{
    "topic": "Data Mining",
    "pageNumber": 11,
    "type": "Data Mining - Deployments",
    "definition": {
        "text": "Data Mining Bots can be deployed into one or many machines at the same time and they will automatically find the way too coordinate their actions.",
        "updated": 1622225530181,
        "translations": [
            {
                "language": "DE",
                "text": "Data Mining Bots können auf einem oder mehreren Rechnern gleichzeitig eingesetzt werden und finden automatisch einen Weg, ihre Aktionen zu koordinieren.",
                "updated": 1634999274817
            },
            {
                "language": "RU",
                "text": "Боты интеллектуального анализа данных могут быть развернуты на одной или нескольких машинах одновременно, и они автоматически найдут способ для координации своих действий.",
                "updated": 1639578043962
            },
            {
                "language": "TR",
                "text": "Özet: Veri Madenciliği Botları, aynı anda bir veya daha fazla makineye yerleştirilebilir ve eylemlerini koordine etmenin yolunu otomatik olarak bulurlar",
                "updated": 1645963220252
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Once you are done defining your data mining Bots, you can move the Tasks that execute them to other Network Nodes and some other node structures within the Network hierarchy. The bot's will still run even from different machines on the network.",
            "updated": 1622226742772,
            "translations": [
                {
                    "language": "DE",
                    "text": "Sobald Sie Ihre Data Mining Bots definiert haben, können Sie die Tasks, die sie ausführen, auf andere Network Nodes und andere Node Strukturen innerhalb der Network Hierarchie verschieben. Die Bots können auch von verschiedenen Rechnern im Netzwerk ausgeführt.",
                    "updated": 1634999369828
                },
                {
                    "language": "RU",
                    "text": "После того, как вы закончите определение своих ботов для интеллектуального анализа данных, вы можете переместить задачи Task, которые их выполняют, на другие сетевые узлы и некоторые другие структуры узлов в иерархии LAN Network. Бот по-прежнему будет работать даже на разных компьютерах в сети.",
                    "updated": 1639578208788
                },
                {
                    "language": "TR",
                    "text": "Veri madenciliği Botlarınızı tanımlamayı bitirdikten sonra, onları yürüten Görevleri diğer Ağ Düğümlerine ve Ağ hiyerarşisi içindeki diğer bazı düğüm yapılarına taşıyabilirsiniz. Bot, ağdaki farklı makinelerden bile çalışmaya devam edecek.",
                    "updated": 1645963234495
                }
            ]
        },
        {
            "style": "Title",
            "text": "How Does Superalgos Know How  to Coordinate Bots?",
            "updated": 1622226151968,
            "translations": [
                {
                    "language": "DE",
                    "text": "Woher weiß Superalgos, wie die Bots koordiniert werden?",
                    "updated": 1634999399742
                },
                {
                    "language": "RU",
                    "text": "Как Superalgos знает, как координировать работу ботов?",
                    "updated": 1639578283371
                },
                {
                    "language": "TR",
                    "text": "Superalgos, Botları Nasıl Koordine Edeceğini Nasıl Biliyor?",
                    "updated": 1645963250906
                }
            ]
        },
        {
            "style": "Text",
            "text": "Everything that needs to be known is already defined at the Workspace.",
            "updated": 1621904768357,
            "translations": [
                {
                    "language": "DE",
                    "text": "Alles, was man wissen muss, ist bereits im Workspace (Arbeitsbereich) definiert.",
                    "updated": 1634999704931
                },
                {
                    "language": "RU",
                    "text": "Все, что необходимо знать, уже определено в рабочем пространстве Workspace.",
                    "updated": 1639578319982
                },
                {
                    "language": "TR",
                    "text": "Bilinmesi gereken her şey Çalışma Alanında ( Workspace ) zaten tanımlanmıştır.",
                    "updated": 1645963262901
                }
            ]
        },
        {
            "style": "List",
            "text": "In Data Mines: The definitions at the Data Mine contain the 3 types of relationships between Bots: Execution Dependency, Data Dependency and Status Dependency.",
            "updated": 1622226774180,
            "translations": [
                {
                    "language": "DE",
                    "text": "In Data Mines: Die Definitionen in der Data Mine enthalten die 3 Arten von Beziehungen zwischen Bots Execution Dependency (Ausführungsabhängigkeit), Data Dependency (Datenabhängigkeit) und Status Dependency (Statusabhängigkeit).",
                    "updated": 1635001153648
                },
                {
                    "language": "RU",
                    "text": "В узлах Data Mine: определения в Data Mine содержат 3 типа отношений между ботами: Execution Dependency, Data Dependency и Status Dependency.",
                    "updated": 1639578452034
                },
                {
                    "language": "TR",
                    "text": "Veri Madenlerinde: Veri Madeni'ndeki tanımlar Botlar arasındaki 3 tür ilişkiyi içerir: Yürütme Bağımlılığı, Veri Bağımlılığı ( Data Dependency ) ve Durum Bağımlılığı ( Status Dependency ).",
                    "updated": 1645963277107
                }
            ]
        },
        {
            "style": "List",
            "text": "At the Network: The Network hierarchy contains all the information needed to know where the dependent bots are running. Looking at the Tasks on the network node, we can know which bots are running on a particular machine in the network. Looking at the Data Storage hierarchy, we can know where Datasets are being storied in the network.",
            "updated": 1622226083877,
            "translations": [
                {
                    "language": "DE",
                    "text": "At the Network: Die Netzwerkhierarchie enthält alle Informationen, die erforderlich sind, um zu wissen, wo die abhängigen Bots ausgeführt werden. Anhand der Tasks auf der Network Node können wir erkennen, welche Bots auf einem bestimmten Rechner im Netzwerk laufen. Ein Blick auf die Datenspeicherhierarchie verrät, wo im Netzwerk Datensätze gespeichert sind.",
                    "updated": 1635001245096
                },
                {
                    "language": "RU",
                    "text": "В сети LAN Network: иерархия LAN Network содержит всю информацию, необходимую для того, чтобы знать, где работают зависимые боты. Глядя на задачи Task на сетевом узле, мы можем узнать, какие боты работают на определенной машине в сети. Глядя на иерархию Data Storage, мы можем знать, где в сети хранятся наборы данных Dataset.",
                    "updated": 1639578747681
                },
                {
                    "language": "TR",
                    "text": "Ağda: Ağ hiyerarşisi, bağımlı botların nerede çalıştığını bilmek için gereken tüm bilgileri içerir. Ağ düğümündeki Görevlere bakarak, ağdaki belirli bir makinede hangi botların çalıştığını bilebiliriz. Veri Depolama ( Data Storage ) hiyerarşisine bakarak, Veri Kümelerinin ağda nerede depolandığını bilebiliriz.",
                    "updated": 1645963291618
                }
            ]
        },
        {
            "style": "Title",
            "text": "How Does a Bot Know Where Its Dependencies are Running?",
            "updated": 1622226168096,
            "translations": [
                {
                    "language": "DE",
                    "text": "Woher weiß ein Bot, wo seine Abhängigkeiten ausgeführt werden?",
                    "updated": 1635001264425
                },
                {
                    "language": "RU",
                    "text": "Как бот узнает, где запущены его зависимости?",
                    "updated": 1639578719797
                },
                {
                    "language": "TR",
                    "text": "Bir Bot Bağımlılıklarının Nerede Yürüttüğünü Nasıl Bilebilir?",
                    "updated": 1645963304673
                }
            ]
        },
        {
            "style": "Text",
            "text": "Everytime a Task is executed, the whole Network hierarchy, together with the bot definitions at the Data Mines are sent to the Task Server. This includes not only the running Bot's definition, but also all the definitions of the dependent bots.",
            "updated": 1622226410465,
            "translations": [
                {
                    "language": "DE",
                    "text": "Jedes Mal, wenn ein Task ausgeführt wird, wird die gesamte Netzwerkhierarchie zusammen mit den Bot-Definitionen in den Data Mines an den Task-Server gesendet. Dies umfasst nicht nur die Definition des laufenden Bots, sondern auch alle Definitionen der abhängigen Bots.",
                    "updated": 1635103632758
                },
                {
                    "language": "RU",
                    "text": "Каждый раз, когда задача Task выполняется, вся сетевая иерархия вместе с определениями ботов отправляется на сервер задач Task Server. Это включает не только определение запущенного бота, но и все определения зависимых ботов.",
                    "updated": 1639578850309
                },
                {
                    "language": "TR",
                    "text": "Her Görev yürütüldüğünde, tüm Ağ hiyerarşisi, Veri Madenlerindeki bot tanımlarıyla birlikte Görev Sunucusuna ( Task Server ) gönderilir. Bu, yalnızca çalışan Bot'un tanımını değil, aynı zamanda bağımlı botların tüm tanımlarını da içerir.",
                    "updated": 1645963317335
                }
            ]
        },
        {
            "style": "Success",
            "text": "At runtime, Superalgos will provide the Bot with the Datasets defined at Data Dependencies, the Status Reports defined as Status Dependencies, and if necessary, it will help the Bot wait for the Bot defined as an Execution Dependency, no matter where all those resources are within the physical network.",
            "updated": 1635001475212,
            "translations": [
                {
                    "language": "DE",
                    "text": "Zur Laufzeit versorgt Superalgos den Bot mit den unter Data Dependencies definierten Datasets, den unter  Status Dependencies definierten Status Reports und hilft dem Bot bei Bedarf, auf den unter Execution Dependency definierten Bot zu warten, unabhängig davon, wo sich all diese Ressourcen im physischen Netzwerk befinden.",
                    "updated": 1635104587315
                },
                {
                    "language": "RU",
                    "text": "Во время выполнения Superalgos предоставит боту наборы данных Datasets, определенные в зависимостях Data Dependency, отчеты о состоянии Status Report, определенные как зависимости состояния Status Dependency, и при необходимости это поможет боту дождаться бота, определенного как зависимость Execution Dependency, независимо от того, где находятся все эти ресурсы в физической сети.",
                    "updated": 1639579079086
                },
                {
                    "language": "TR",
                    "text": "İpucu: Superalgos, çalışma zamanında Bot'a Veri Bağımlılıkları'nda tanımlanan Veri Kümeleri, Durum Bağımlılıkları olarak tanımlanan Durum Raporları sağlar ve gerekirse, tüm bunlar nerede olursa olsun, Yürütme Bağımlılığı olarak tanımlanan Bot'u beklemesine yardımcı olur. kaynaklar fiziksel ağ içindedir.",
                    "updated": 1645963333546
                }
            ]
        }
    ]
}