{
    "type": "Input Shape",
    "definition": {
        "text": "The first layer in the model needs an inputShape. Make sure you exclude the batch size when providing the inputShape. For example, if you plan to feed the model tensors of shape [B, 784], where B can be any batch size, specify inputShape as [784] when creating the model.",
        "updated": 1613220197721,
        "translations": [
            {
                "language": "RU",
                "text": "Первый слой в модели нуждается в inputShape. Обязательно исключите размер партии при указании inputShape. Например, если вы планируете подавать в модель тензоры формы [B, 784], где B может быть любым размером партии, укажите inputShape как [784] при создании модели.",
                "updated": 1645248215707
            },
            {
                "language": "TR",
                "text": "Modeldeki ilk katmanın bir inputShape'e ihtiyacı vardır. InputShape'i sağlarken batch boyutunu hariç tuttuğunuzdan emin olun. Örneğin, modeli [B, 784] şeklindeki tensörlerle beslemeyi planlıyorsanız, burada B herhangi bir yığın boyutu olabilir, modeli oluştururken inputShape'i [784] olarak belirtin.",
                "updated": 1654397204415
            },
            {
                "language": "DE",
                "text": "Die erste Schicht des Modells benötigt eine inputShape. Vergewissern Sie sich, dass Sie die Losgröße bei der Angabe der inputShape ausschließen. Wenn Sie zum Beispiel planen, das Modell mit Tensoren der Form [B, 784] zu füttern, wobei B eine beliebige Losgröße sein kann, geben Sie bei der Erstellung des Modells als inputShape [784] an.",
                "updated": 1707239895431
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645248220738
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397211611,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1707239903845
                }
            ]
        }
    ]
}