{
    "topic": "How To Debug Exchange Raw Data Sensor Bot",
    "pageNumber": "7",
    "type": "Exchange Raw Data - Fix The Problem",
    "definition": {
        "text": "At this point you will probably know if it is possible or not to extract historical information from your Favorite Exchange or not.",
        "updated": 1614593270288,
        "translations": [
            {
                "language": "RU",
                "text": "На данном этапе вы, вероятно, знаете, можно ли или нет извлечь историческую информацию из вашей любимой биржи.",
                "updated": 1640362646101
            },
            {
                "language": "TR",
                "text": "Bu noktada, muhtemelen Favori Borsanızdan geçmiş bilgileri çıkarmanın mümkün olup olmadığını bileceksiniz.",
                "updated": 1670940790433
            },
            {
                "language": "DE",
                "text": "An dieser Stelle werden Sie wahrscheinlich wissen, ob es möglich ist, historische Informationen aus Ihrem Favorite Exchange zu extrahieren oder nicht.",
                "updated": 1687722186933
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "If you managed to make it work, the rest of the community will be happy to learn how to do it too.",
            "updated": 1614593581507,
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вам удалось заставить его работать, остальные члены сообщества будут рады узнать, как это делается.",
                    "updated": 1640362664743
                },
                {
                    "language": "TR",
                    "text": "Eğer siz bunu başardıysanız, topluluğun geri kalanı da bunu nasıl yapacağını öğrenmekten mutluluk duyacaktır.",
                    "updated": 1670940825829
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie es geschafft haben, wird der Rest der Gemeinschaft gerne lernen, wie man es auch macht.",
                    "updated": 1687722254341
                }
            ]
        },
        {
            "style": "Title",
            "text": "New Config",
            "translations": [
                {
                    "language": "RU",
                    "text": "Новая конфигурация",
                    "updated": 1640362789989
                },
                {
                    "language": "TR",
                    "text": "Yeni Yapılandırma",
                    "updated": 1670940845871
                },
                {
                    "language": "DE",
                    "text": "Neue Konfiguration",
                    "updated": 1687722277212
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you found that your Favorite Exchange works with some special config, please contact the Team so that is can include that config in the next release and move the exchange to the branch of Tested exchanges.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы обнаружили, что ваш любимая биржа работает с какой-то особой конфигурацией, пожалуйста, свяжитесь с командой, чтобы мы могли включить эту конфигурацию в следующий релиз и переместить биржу в ветку Tested exchanges.",
                    "updated": 1640362853803
                },
                {
                    "language": "TR",
                    "text": "Favori Borsanızın bazı özel yapılandırmalarla çalıştığını fark ettiyseniz, bu yapılandırmayı bir sonraki sürüme dahil edebilmek ve borsayı Test Edilen borsalar kategorisine taşıyabilmek için lütfen Ekip ile iletişime geçin.",
                    "updated": 1670940900841
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie festgestellt haben, dass Ihr Favorite Exchange mit einer speziellen Konfiguration funktioniert, kontaktieren Sie bitte das Team, damit wir diese Konfiguration in die nächste Version aufnehmen und den Exchange in den Zweig der getesteten Exchanges verschieben können.",
                    "updated": 1687722297682
                }
            ]
        },
        {
            "style": "Title",
            "text": "Changes In Code",
            "translations": [
                {
                    "language": "RU",
                    "text": "Изменения в коде",
                    "updated": 1640362882494
                },
                {
                    "language": "TR",
                    "text": "Koddaki Değişiklikler",
                    "updated": 1670940928229
                },
                {
                    "language": "DE",
                    "text": "Änderungen im Code",
                    "updated": 1687722306515
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you managed to make it work by modifying the Sensor Bot's code, please submit a PR with your changes.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вам удалось заставить его работать, изменив код Sensor Bot, пожалуйста, отправьте PR (Pull Request) с вашими изменениями.",
                    "updated": 1640362925374
                },
                {
                    "language": "TR",
                    "text": "Sensör Bot'un ( Sensor Bot's ) kodunu değiştirerek çalışmasını sağlamayı başardıysanız, lütfen değişikliklerinizle birlikte bir PR gönderin.",
                    "updated": 1670941002602
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie es geschafft haben, den Code des Sensor Bot´s zu ändern, reichen Sie bitte einen PR mit Ihren Änderungen ein.",
                    "updated": 1687722329920
                }
            ]
        },
        {
            "style": "Title",
            "text": "Changes in Docs",
            "translations": [
                {
                    "language": "RU",
                    "text": "Изменения в документах",
                    "updated": 1640362959284
                },
                {
                    "language": "TR",
                    "text": "Dokümanlardaki Değişiklikler",
                    "updated": 1670941031491
                },
                {
                    "language": "DE",
                    "text": "Änderungen in Docs",
                    "updated": 1687722338931
                }
            ]
        },
        {
            "style": "Text",
            "text": "If you found that this guide is incomplete or needed more info, please update the docs and send it as a contribution with the app.contribute command. That will help others follow this process with less pain. ",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если вы обнаружили, что это руководство неполное или требует дополнительной информации, пожалуйста, обновите документацию и отправьте ее в качестве вклада с помощью команды app.contribute. Это поможет другим пройти этот курс с меньшими страданиями.",
                    "updated": 1640362990927
                },
                {
                    "language": "TR",
                    "text": "Bu kılavuzun eksik olduğunu veya daha fazla bilgiye ihtiyaç duyulduğunu fark ederseniz, lütfen belgeleri güncelleyin ve app.contrib komutuyla bir katkı olarak gönderin. Bu, başkalarının bu süreci daha az zahmetle takip etmesine yardımcı olacaktır.",
                    "updated": 1670941083065
                },
                {
                    "language": "DE",
                    "text": "Wenn Sie feststellen, dass diese Anleitung unvollständig ist oder weitere Informationen benötigt werden, aktualisieren Sie bitte die Dokumente und senden Sie dies als Beitrag mit dem Befehl app.contribute. Das wird anderen helfen, diesen Prozess mit mehr Verständnis zu folgen.",
                    "updated": 1687722426251
                }
            ]
        }
    ]
}