{
    "type": "Task Server",
    "definition": {
        "text": "The Task Server is one of the 3 main software components of Superalgos. The purpose of the Task Server is to run a Task. Tasks are defined at a Workspace at the UI. For running a Task, the Task Server receives at runtime all the needed definitions from the UI.",
        "updated": 1621954996474,
        "translations": [
            {
                "language": "RU",
                "text": "Task Server - один из трех основных программных компонентов Superalgos. Назначение сервера задач - запустить задачу Task. Задачи определяются в рабочем пространстве Workspace пользовательского интерфейса UI. Для выполнения задачи сервер задач Task Server получает во время выполнения все необходимые определения из пользовательского интерфейса UI. ",
                "updated": 1638299320450
            },
            {
                "language": "TR",
                "text": "Görev Sunucusu, Superalgos'un 3 ana yazılım bileşeninden birisidir. Görev Sunucusunun amacı bir Görevi çalıştırmaktır ( Task ). Görevler kullanıcı arayüzündeki ( UI ) bir Çalışma Alanında ( Workspace )  tanımlanır. Bir Görevi çalıştırmak ( Task ) için, Görev Sunucusu çalışma zamanında kullanıcı arayüzündeki ( UI ) gerekli tüm tanımları alır.",
                "updated": 1666873964930
            },
            {
                "language": "DE",
                "text": "Der Task Server ist eine der 3 Haupt-Softwarekomponenten von Superalgos. Der Zweck des Task Servers ist es, einen Task auszuführen. Tasks werden in einem Workspace auf der UI definiert. Um einen Task auszuführen, erhält der Task Server zur Laufzeit alle benötigten Definitionen von der Benutzeroberfläche (UI).",
                "updated": 1698613567456
            },
            {
                "language": "PT",
                "text": "O Servidor de Tarefas (Task Server) é um dos 3 principais componentes do software Superalgos. O objetivo do Servidor de Tarefas (Task Server) é executar uma Tarefa (Task). As tarefas são definidas na Área de Trabalho (Workspace) no interface do utilizador (UI). Para executar uma Tarefa (Task), o Servidor de Tarefas (Task Server) recebe, durante o tempo de processamento (runtime), todas as definições necessárias do UI.",
                "updated": 1711387462089
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Note",
            "text": "For developers: When reading through the code you should notice extensive use of the TS object. The TS object  is the root object of a data structure available at runtime within the Task Server.",
            "updated": 1622896987189,
            "translations": [
                {
                    "language": "RU",
                    "text": "Для разработчиков: при чтении кода вы должны заметить широкое использование объекта TS. Объект TS - это корневой объект структуры данных, доступной во время выполнения на сервере задач Task Server.",
                    "updated": 1638299361366
                },
                {
                    "language": "TR",
                    "text": "Geliştiriciler için: Kodu okurken TS nesnesinin yoğun bir şekilde kullanıldığını fark etmelisiniz. TS nesnesi, Görev Sunucusu içinde çalışma zamanında mevcut olan bir veri yapısının kök nesnesidir.",
                    "updated": 1666874205445
                },
                {
                    "language": "DE",
                    "text": "Für Entwickler: Wenn Sie den Code durchlesen, werden Sie feststellen, dass das TS Objekt häufig verwendet wird. Das TS Objekt ist das Stammobjekt einer Datenstruktur, die zur Laufzeit innerhalb des Task Server ´s verfügbar ist.",
                    "updated": 1698613625025
                },
                {
                    "language": "PT",
                    "text": "Para programadores: Ao ver o código, deverá observar o uso extensivo do objeto TS. O objeto TS é o objeto raiz de uma estrutura de dados disponível durante o tempo de processamento (runtime) dentro do Servidor de Tarefas (Task Server).",
                    "updated": 1711387613211
                }
            ]
        },
        {
            "style": "Text",
            "text": "For a description of how to debug a task being run on the task server please see the Debugging a Task page.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Описание того, как отлаживать задачу, выполняемую на сервере задач Task Server, смотрите на странице Debugging a Task.",
                    "updated": 1638299471652
                },
                {
                    "language": "TR",
                    "text": "Görev sunucusunda çalıştırılan bir görevde nasıl hata ayıklanacağına ilişkin bir açıklama için lütfen Görevde Hata Ayıklama ( Debugging a Task )  sayfasına bakın.",
                    "updated": 1666874429108
                },
                {
                    "language": "DE",
                    "text": "Eine Beschreibung, wie Sie eine auf dem Aufgabenserver ausgeführte Aufgabe debuggen können, finden Sie auf der Seite Debuggen einer Aufgabe (Debugging a Task).",
                    "updated": 1698613652407
                },
                {
                    "language": "PT",
                    "text": "ara perceber como depurar (debug) uma tarefa em execução no servidor de tarefas, consulte a página Depuração de uma Tarefa (Debugging a Task).",
                    "updated": 1711387795725
                }
            ]
        }
    ]
}