{
    "type": "Weight Votes Switch",
    "definition": {
        "text": "Use this switch to spawn different types of Weight Votes, and to reference Class types of nodes within any of the Project Definition Hierarchies to map large structures of definitions.",
        "updated": 1630356971950,
        "translations": [
            {
                "language": "RU",
                "text": "Используйте этот переключатель для создания различных типов Weight Votes и для ссылки на типы узлов класса в любой из иерархий Project Definition для сопоставления больших структур определений.",
                "updated": 1639137065780
            },
            {
                "language": "TR",
                "text": "Farklı Ağırlık Oyları ( Weight Votes ) türlerini ortaya çıkarmak ve büyük tanım yapılarını eşlemek için Proje Tanımı Hiyerarşilerinden ( Project Definition Hierarchies ) herhangi biri içindeki Sınıf düğüm türlerine başvurmak için bu anahtarı kullanın.",
                "updated": 1671559302289
            },
            {
                "language": "DE",
                "text": "Verwenden Sie diesen Schalter, um verschiedene Arten von Gewichtungsabstimmungen zu erzeugen und um Klassentypen von Knoten innerhalb einer der Projektdefinitionshierarchien zu referenzieren, um große Strukturen von Definitionen abzubilden.",
                "updated": 1707855838601
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1624729675267
        },
        {
            "style": "Text",
            "text": "You may use this switch for three different purposes:",
            "translations": [
                {
                    "language": "RU",
                    "text": "Вы можете использовать этот переключатель для трех разных целей:",
                    "updated": 1639137077505
                },
                {
                    "language": "TR",
                    "text": "Bu anahtarı üç farklı amaç için kullanabilirsiniz:",
                    "updated": 1671559331009
                },
                {
                    "language": "DE",
                    "text": "Sie können diesen Schalter für drei verschiedene Zwecke verwenden:",
                    "updated": 1707855891985
                }
            ]
        },
        {
            "style": "List",
            "text": "As an organizational device: You may create arbitrary arrangements of votes, spawning more switches and votes.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В качестве организационного устройства: вы можете создавать произвольные схемы голосов, порождая больше переключателей и голосов.",
                    "updated": 1639137104002
                },
                {
                    "language": "TR",
                    "text": "Organizasyonel bir araç olarak (As an organizational device): Daha fazla anahtar ve oy üreterek keyfi oy düzenlemeleri oluşturabilirsiniz.",
                    "updated": 1671559511434
                },
                {
                    "language": "DE",
                    "text": "Als Organisationsmittel: Sie können beliebige Anordnungen von Stimmen erstellen, die weitere Schalter und Stimmen hervorbringen.",
                    "updated": 1707855902619
                }
            ]
        },
        {
            "style": "List",
            "text": "As a switch: You may control the flow of Weight Power, pretty much like with a Token Power Switch, but within the Voting Program. If you need a reminder, read about how Token Power Flows.",
            "updated": 1630394709837,
            "translations": [
                {
                    "language": "RU",
                    "text": "В качестве переключателя: вы можете управлять потоком Weight Power, почти так же, как с помощью переключателя Token Power Switch, но в рамках программы Voting Program. Если вам нужно напоминание, прочитайте пояснения Token Power Flows.",
                    "updated": 1639137292102
                },
                {
                    "language": "TR",
                    "text": "Bir anahtar olarak (As a switch): Ağırlık Gücü ( Weight Power ) akışını, tıpkı bir Token Güç Anahtarında ( Token Power Switch ) olduğu gibi, ancak Oylama Programı ( Voting Program ) içinde kontrol edebilirsiniz. Hatırlatmaya ihtiyacınız varsa, Token Gücünün ( Token Power Flows ) nasıl aktığını okuyun.",
                    "updated": 1671560118608
                },
                {
                    "language": "DE",
                    "text": "Als Schalter: Sie können den Fluss der Gewichtskraft (Weight Power) steuern, ähnlich wie bei einem Token Power Switch, aber innerhalb des Abstimmungsprogramms (Voting Program). Wenn Sie eine Erinnerung brauchen, lesen Sie, wie Token Power fließt (Token Power Flows).",
                    "updated": 1707855965818
                }
            ]
        },
        {
            "style": "List",
            "text": "As a data-structure mapper: Use the node to reference Class types of nodes within Project Definition Hierarchies to map entire structures of definitions.",
            "translations": [
                {
                    "language": "RU",
                    "text": "В качестве средства отображения структуры данных: используйте узел для ссылки на типы узлов классов в иерархиях Project Definition Hierarchies для отображения целых структур определений.",
                    "updated": 1639137355275
                },
                {
                    "language": "TR",
                    "text": "Bir veri yapısı eşleyicisi olarak (As a data-structure mapper): Tanımların tüm yapılarını eşleştirmek için Proje Tanımı Hiyerarşileri ( Project Definition Hierarchies ) içindeki Sınıf tipi düğümlere başvurmak için bu düğümü kullanın.",
                    "updated": 1671560491019
                },
                {
                    "language": "DE",
                    "text": "Als Datenstruktur-Mapper: Verwenden Sie den Knoten, um auf Klassentypen von Knoten innerhalb von Projektdefinitionshierarchien (Project Definition Hierarchies) zu verweisen, um ganze Strukturen von Definitionen abzubilden.",
                    "updated": 1707856033280
                }
            ]
        },
        {
            "style": "Text",
            "text": "The first two use cases are self-explanatory. Let's explore the third one in more detail.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Первые два варианта использования не требуют пояснений. Рассмотрим третий подробнее.",
                    "updated": 1639137367996
                },
                {
                    "language": "TR",
                    "text": "İlk iki kullanım durumu kendi kendini açıklamaktadır. Üçüncüsünü daha ayrıntılı olarak inceleyelim.",
                    "updated": 1671560725274
                },
                {
                    "language": "DE",
                    "text": "Die ersten beiden Anwendungsfälle sind selbsterklärend. Lassen Sie uns den dritten Fall genauer untersuchen.",
                    "updated": 1707856043005
                }
            ]
        },
        {
            "style": "Callout",
            "text": "Use a Weight Votes Switch node to establish a reference with a Class type of node — Pool Class, Position Class, Feature Class, or Asset Class — within Project Definition Hierarchies. Then use the Install Missing Votes option on the menu of the Weight Votes Switch to map the entire Class section of the hierarchy! ",
            "updated": 1630498028825,
            "translations": [
                {
                    "language": "RU",
                    "text": "Используйте узел Weight Votes Switch, чтобы установить ссылку на узел типа Class — Pool Class, Position Class, Feature Class или Asset Class — в иерархиях Project Definition Hierarchies. Затем используйте опцию Install Missing Votes в меню переключателя Weight Votes Switch, чтобы отобразить весь раздел «Class» в иерархии!",
                    "updated": 1639137558513
                },
                {
                    "language": "TR",
                    "text": "Proje Tanımı Hiyerarşileri ( Project Definition Hierarchies ) içinde bir Sınıf tipi düğümle -Havuz Sınıfı ( Pool Class ), Pozisyon Sınıfı ( Position Class ), Özellik Sınıfı ( Feature Class ) veya Varlık Sınıfı ( Asset Class )- referansı oluşturmak için bir Ağırlık Oyları Anahtarı düğümü kullanın. Ardından hiyerarşinin tüm Sınıf bölümünü eşlemek için Ağırlık Oyları Anahtarı menüsündeki Eksik Oyları Yükle seçeneğini kullanın!",
                    "updated": 1671561308162
                },
                {
                    "language": "DE",
                    "text": "Verwenden Sie einen Schalter für die Stimmengewichtung, um einen Bezug zu einem Klassentyp von Knoten - Poolklasse, Positionsklasse, Featureklasse oder Assetklasse (Pool Class, Position Class, Feature Class, or Asset Class) - innerhalb von Projektdefinitionshierarchien (Project Definition Hierarchies) herzustellen. Verwenden Sie dann die Option Fehlende Stimmen installieren im Menü des Schalters für Gewichtungsstimmen, um den gesamten Klassenbereich der Hierarchie zuzuordnen!",
                    "updated": 1707856098829
                }
            ]
        },
        {
            "style": "Note",
            "text": "The process creates a Weight Votes Switch for each Class type of node, and matching Weight Votes for each Asset, Feature, Position, or Pool defined within each Class node.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Процесс создает Weight Votes Switch для каждого узла типа Class и соответствующие Weight Votes для каждого Asset, Feature, Position или Pool, определенных в каждом узле Class.",
                    "updated": 1639137705778
                },
                {
                    "language": "TR",
                    "text": "İşlem, her Sınıf düğümü türü için bir Ağırlık Oyları Anahtarı ve her Sınıf düğümü içinde tanımlanan tüm Varlık ( Asset ), Özellik ( Feature ), Pozisyon ( Position ) veya Havuz ( Pool ) için eşleşen Ağırlık Oylarını ( Weight Votes ) oluşturur.",
                    "updated": 1671561786488
                },
                {
                    "language": "DE",
                    "text": "Der Prozess erstellt einen Schalter für Gewichtungsstimmen für jeden Klassentyp von Knoten und passende Gewichtungsstimmen für jedes Asset, Feature, jede Position oder jeden Pool (Weight Votes Switch for each Class type of node, and matching Weight Votes for each Asset, Feature, Position, or Pool), die innerhalb jedes Klassenknotens definiert sind.",
                    "updated": 1707856144302
                }
            ]
        },
        {
            "style": "Success",
            "text": "If something changes on the side of the definitions, you may always go back a run the Install Missing Votes process again. The process will remap the structure with the appropriate votes and switches.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если что-то изменится в определениях, вы всегда можете вернуться к процессу Install Missing Votes еще раз. Процесс изменит отображение структуры с соответствующими голосами и переключателями.",
                    "updated": 1639137749014
                },
                {
                    "language": "TR",
                    "text": "Tanımlar tarafında bir şey değişirse, her zaman geri dönüp Eksik Oyları Yükle işlemini tekrar çalıştırabilirsiniz. İşlem, yapıyı uygun oylarla ve anahtarlarla yeniden eşleştirecektir.",
                    "updated": 1671561869807
                },
                {
                    "language": "DE",
                    "text": "Wenn sich an den Definitionen etwas ändert, können Sie jederzeit zurückgehen und den Prozess Fehlende Abstimmungen installieren erneut ausführen. Der Prozess wird die Struktur mit den entsprechenden Stimmen und Schaltern neu zuordnen.",
                    "updated": 1707856156390
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuration"
        },
        {
            "style": "Title",
            "text": "Configuration",
            "updated": 1624729681447,
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация",
                    "updated": 1639137759609
                }
            ]
        }
    ]
}