{
    "topic": "Docs Commands",
    "pageNumber": "7",
    "type": "Docs Repaginate Command",
    "definition": {
        "text": "When you add a Docs Topic Page or a Docs Tutorial Page, you may define a page number. The number defines the position of the page within the table of contents. To add a page in-between other pages you may use decimal values. Use the Repaginate command to recalculate all page numbers and leave the whole set in integers.",
        "updated": 1610976158171,
        "translations": [
            {
                "language": "DE",
                "text": "Wenn Sie eine Doku-Themenseite oder eine Doku-Übungsseite (Docs Tutorial Page) hinzufügen, können Sie eine Seitenzahl festlegen. Die Nummer bestimmt die Position der Seite im Inhaltsverzeichnis. Um eine Seite zwischen anderen Seiten einzufügen, können Sie Dezimalwerte verwenden. Verwenden Sie den Befehl Repaginieren, um alle Seitenzahlen neu zu berechnen und den gesamten Satz in ganzen Zahlen zu belassen.",
                "updated": 1681417126208
            },
            {
                "language": "RU",
                "text": "Когда вы добавляете страницу Docs Topic Page или страницу Docs Tutorial Page, вы можете указать номер страницы. Число определяет положение страницы в оглавлении. Чтобы добавить страницу между другими страницами, вы можете использовать десятичные значения. Используйте команду Repaginate, чтобы пересчитать все номера страниц и составить весь набор в целых числах.",
                "updated": 1638465473279
            },
            {
                "language": "TR",
                "text": "Bir Dokümanlar Konu Sayfası veya Dokümanlar Öğretici ( Tutorial ) Sayfası eklediğinizde, bir sayfa numarası tanımlayabilirsiniz. Bu sayı, sayfanın içindekiler tablosundaki konumunu tanımlar. Diğer sayfaların arasına sayfa eklemek için ondalık değerleri kullanabilirsiniz. Tüm sayfa numaralarını yeniden hesaplamak ve kümenin tamamını tamsayılar halinde bırakmak için Yeniden Sayfalandır komutunu kullanın.",
                "updated": 1652198534340
            },
            {
                "language": "PT",
                "text": "Quando adiciona um Título a uma Página ou uma Página de Tutorial aos Documentos, poderá definir o número de página. O número define a posição da página dentro do índice. Para adicionar uma página entre páginas, pode usar valores decimais. Assim, utilize o comando Repaginar para recalcular automaticamente todos os números das páginas, ficando posteriormente numeradas em números inteiros.",
                "updated": 1711317718932
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Warning",
            "text": "Make sure you consult with the Superalgos Documentation Group before using the Docs Repaginate Command on existing topics or tutorials. The repagination changes all files in the collection. For that reason, the command may be prone to creating conflicts with other users that may be working on those files too.",
            "updated": 1616705086396,
            "translations": [
                {
                    "language": "DE",
                    "text": "Konsultieren Sie unbedingt die Superalgos Documentation Group, bevor Sie den Befehl Docs Repaginate für bestehende Themen oder Tutorials verwenden. Die Repaginierung ändert alle Dateien in der Sammlung. Aus diesem Grund kann der Befehl zu Konflikten mit anderen Benutzern führen, die ebenfalls an diesen Dateien arbeiten.",
                    "updated": 1681417139813
                },
                {
                    "language": "RU",
                    "text": "Обязательно проконсультируйтесь с группой по документации Superalgos (Superalgos Documentation Group), прежде чем использовать команду Docs Repaginate для существующих тем или учебных пособий. При повторной компоновке изменяются все файлы в коллекции. По этой причине команда может быть подвержена конфликтам с другими пользователями, которые также могут работать с этими файлами.",
                    "updated": 1638466508210
                },
                {
                    "language": "TR",
                    "text": "Varolan konular veya öğreticiler üzerinde Dokümanlar Yeniden Sayfalandır Komutunu kullanmadan önce Superalgos Dokümantasyon Grubunu bildiğinizden  emin olun. Yeniden sayfalama, koleksiyondaki tüm dosyaları değiştirir. Bu nedenle, komut, bu dosyalar üzerinde de çalışabilecek diğer kullanıcılarla çakışmalar oluşturmaya eğilimli olabilir.",
                    "updated": 1652198725610
                },
                {
                    "language": "PT",
                    "text": "Tenha a certeza que consultou e entendeu toda a documentação contida no Grupo de Documentação do Superalgos antes de usar o Comando Repaginar Docs nos títulos ou tutoriais existentes. A repaginação afeta todos os arquivos na categoria. Por este motivo, o comando pode gerar conflitos com outros utilizadores que também podem estar a trabalhar nesses arquivos.",
                    "updated": 1711317656791
                }
            ]
        },
        {
            "style": "Title",
            "text": "Syntax",
            "translations": [
                {
                    "language": "RU",
                    "text": "Синтаксис",
                    "updated": 1638465802167
                },
                {
                    "language": "TR",
                    "text": "Sözdizimi",
                    "updated": 1652199595661
                },
                {
                    "language": "PT",
                    "text": "Syntaxe",
                    "updated": 1711316970160
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "docs.repaginate Category from Project: Topic or Tutorial name."
        },
        {
            "style": "Title",
            "text": "Properties",
            "translations": [
                {
                    "language": "RU",
                    "text": "Свойства",
                    "updated": 1638465812184
                },
                {
                    "language": "TR",
                    "text": "Özellikleri",
                    "updated": 1652198799400
                },
                {
                    "language": "PT",
                    "text": "Propriedades",
                    "updated": 1711317279116
                }
            ]
        },
        {
            "style": "List",
            "text": "Category: It must be either Topic or Tutorial.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Category: Es muss entweder ein Topic oder Tutorial sein.",
                    "updated": 1633895143925
                },
                {
                    "language": "RU",
                    "text": "Категория: это должна быть тема Topic или учебное пособие Tutorial.",
                    "updated": 1638466087699
                },
                {
                    "language": "TR",
                    "text": "Category: Konu veya Öğretici ( Tutorial ) olmalıdır.",
                    "updated": 1652198865935
                },
                {
                    "language": "PT",
                    "text": "Categoria: Deve ser ou Título ou Tutorial.",
                    "updated": 1711317619976
                }
            ]
        },
        {
            "style": "List",
            "text": "Project: Any existing already integrated project.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Project:  Jedes bestehende, bereits integrierte project.",
                    "updated": 1633895168329
                },
                {
                    "language": "RU",
                    "text": "Проект: Любой существующий уже интегрированный проект.",
                    "updated": 1638465970101
                },
                {
                    "language": "TR",
                    "text": "Project: Mevcut herhangi bir entegre proje.",
                    "updated": 1652198888042
                },
                {
                    "language": "PT",
                    "text": "Projeto (Project): Qualquer projeto existente e já integrado .",
                    "updated": 1711317462422
                }
            ]
        },
        {
            "style": "List",
            "text": "Topic or Tutorial name: The name given to the Topic or Tutorial that you want to repaginate.",
            "updated": 1620006152656,
            "translations": [
                {
                    "language": "DE",
                    "text": "Topic or Tutorial name: Der Name des Topic oder Tutorial, das Sie neu veröffentlichen möchten.",
                    "updated": 1633895204521
                },
                {
                    "language": "RU",
                    "text": "Название темы или учебного пособия: название, присвоенное теме или учебному пособию, которые вы хотите изменить.",
                    "updated": 1638466049307
                },
                {
                    "language": "TR",
                    "text": "Topic or Tutorial name: Yeniden isimlendirmek istediğiniz Konuya veya Öğreticiye ( Tutorial ) verilen ad.",
                    "updated": 1652199065556
                },
                {
                    "language": "PT",
                    "text": "Nome do Título ou Tutorial: O nome dado ao Título ou Tutorial que deseja repaginar.",
                    "updated": 1711317611786
                }
            ]
        },
        {
            "style": "Title",
            "text": "Example",
            "translations": [
                {
                    "language": "DE",
                    "text": "Beispiele",
                    "updated": 1633895096256
                },
                {
                    "language": "RU",
                    "text": "Пример:",
                    "updated": 1638466112303
                },
                {
                    "language": "TR",
                    "text": "Örnek",
                    "updated": 1652198974101
                },
                {
                    "language": "PT",
                    "text": "Exemplo",
                    "updated": 1711317329809
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "docs.repaginate Topic from Superalgos: Docs Commands"
        },
        {
            "style": "Title",
            "text": "Usage",
            "translations": [
                {
                    "language": "DE",
                    "text": "Verwendung",
                    "updated": 1681417406828
                },
                {
                    "language": "RU",
                    "text": "Использование",
                    "updated": 1638466140836
                },
                {
                    "language": "TR",
                    "text": "Kullanma",
                    "updated": 1652199227058
                },
                {
                    "language": "PT",
                    "text": "Emprego",
                    "updated": 1711318429835
                }
            ]
        },
        {
            "style": "Text",
            "text": "After you repaginate a Topic or Tutorial, the best way to proceed is to manually delete from disk all the files associated with that Topic / Tutorial. After you delete them, you execute the repaginate command and then the docs.save command.",
            "updated": 1630500489007,
            "translations": [
                {
                    "language": "DE",
                    "text": "Nachdem Sie ein Thema oder einen Lehrgang (Tutorial) repaginiert haben, löschen Sie am besten alle Dateien, die mit diesem Thema/Lehrgang (Tutorial) verbunden sind, manuell von der Festplatte. Nachdem Sie sie gelöscht haben, führen Sie den Befehl \"repaginate\" und dann den Befehl docs.save aus.",
                    "updated": 1681417513804
                },
                {
                    "language": "RU",
                    "text": "После повторной компоновки темы или учебного пособия лучший способ продолжить - вручную удалить с диска все файлы, связанные с этой темой / учебным пособием. После их удаления вы выполняете команду docs.repaginate, а затем команду docs.save.",
                    "updated": 1638466670298
                },
                {
                    "language": "TR",
                    "text": "Bir Konuyu veya Öğreticiyi ( Tutorial ) yeniden isimlendirdikten sonra devam etmenin en iyi yolu, o Konu / Öğreticiyle ( Tutorial ) ilişkili tüm dosyaları diskten manuel olarak silmektir. Bunları sildikten sonra ardından docs.save yazın.",
                    "updated": 1652199455049
                },
                {
                    "language": "PT",
                    "text": "Depois de repaginar um Título ou Tutorial, o melhor procedimento é apagar manualmente todos os arquivos associados a esse Título/Tutorial no disco. Após apagá-los, execute o comando de repaginação e só depois então o comando docs.save.",
                    "updated": 1711317891197
                }
            ]
        },
        {
            "style": "Text",
            "text": "The repagination flags all of the files of that Topic / Tutorial as changed, so you don't need to worry about the deleted files since they will be all recreated.",
            "updated": 1614942454596,
            "translations": [
                {
                    "language": "DE",
                    "text": "Die Neuverteilung kennzeichnet alle Dateien dieses Themas / Tutorial ´s als geändert, so dass Sie sich nicht um die gelöschten Dateien kümmern müssen, da sie alle neu erstellt werden.",
                    "updated": 1681417571495
                },
                {
                    "language": "RU",
                    "text": "Перекомпоновка помечает все файлы в этой теме / учебнике как измененные, поэтому вам не нужно беспокоиться об удаленных файлах, поскольку все они будут созданы заново.",
                    "updated": 1638466715220
                },
                {
                    "language": "TR",
                    "text": "Yeniden isimlendirdikten , bu Konunun / Öğreticinin ( Tutorial ) tüm dosyalarını değiştirilmiş olarak işaretler, böylece silinen dosyalar hakkında endişelenmenize gerek kalmaz, çünkü hepsi yeniden oluşturulur.",
                    "updated": 1652199377240
                },
                {
                    "language": "PT",
                    "text": "A repaginação sinaliza todos os arquivos desse Título/Tutorial como alterados, então não se precisa de preocupar com os arquivos apagados, pois todos serão recriados.",
                    "updated": 1711318040507
                }
            ]
        },
        {
            "style": "Text",
            "text": "After repagination, reload the UI to get into memory only the repaginated version.",
            "translations": [
                {
                    "language": "DE",
                    "text": "Nach der Neuverteilung laden Sie die Benutzeroberfläche (UI) neu, damit nur die neu verteilte Version gespeichert wird.",
                    "updated": 1681417552292
                },
                {
                    "language": "RU",
                    "text": "После перекомпоновки перезагрузите пользовательский интерфейс UI, чтобы в память попала только вновь созданная версия.",
                    "updated": 1638466797706
                },
                {
                    "language": "TR",
                    "text": "Yeniden etiketlemeden sonra, yalnızca yeniden etiketlenmiş sürümü belleğe almak için kullanıcı arayüzünü ( UI ) yeniden yükleyin.",
                    "updated": 1652199551990
                },
                {
                    "language": "PT",
                    "text": "Após a repaginação, recarregue a UI para carregar apenas a versão repaginada na memória.",
                    "updated": 1711318312834
                }
            ]
        }
    ]
}