{
    "type": "Data Dependency",
    "definition": {
        "text": "Data dependencies are references established with dataset definitions of other bots, determining which datasets the process establishing the reference uses as input.",
        "translations": [
            {
                "language": "RU",
                "text": "Data Dependency - это ссылки, установленные с определениями наборов данных других ботов, определяющие, какие наборы данных процесс, устанавливающий ссылку, использует в качестве входных.",
                "updated": 1638729798621
            },
            {
                "language": "TR",
                "text": "Veri bağımlılıkları, referansı oluşturan sürecin hangi veri kümelerini girdi olarak kullanacağını belirleyen, diğer botların veri kümesi tanımlarıyla oluşturulan referanslardır.",
                "updated": 1639142451353
            },
            {
                "language": "DE",
                "text": "Datenabhängigkeiten sind Referenzen, die mit Datensatzdefinitionen anderer Bots hergestellt werden und bestimmen, welche Datensätze der Prozess, der die Referenz herstellt, als Eingabe verwendet.",
                "updated": 1708265570444
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "Most bots consume data other bots have produced. Because bots need the data as input for their calculations, processes establish a data dependency with the dataset definitions of other bots. The reference provides the process with all the information needed to decode the dataset, enabling it to perform the required calculations.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Большинство ботов потребляют данные, созданные другими ботами. Поскольку боты нуждаются в данных в качестве входных данных для своих вычислений, процессы устанавливают зависимость данных с определениями наборов данных других ботов. Справочник предоставляет процессу всю информацию, необходимую для декодирования набора данных, что позволяет ему выполнять необходимые вычисления.",
                    "updated": 1638729832092
                },
                {
                    "language": "TR",
                    "text": "Çoğu bot, diğer botların ürettiği verileri tüketir. Botlar hesaplamaları için girdi olarak verilere ihtiyaç duyduklarından, süreçler diğer botların veri kümesi tanımlarıyla bir veri bağımlılığı oluşturur. Referans, sürece veri kümesinin kodunu çözmek için gereken tüm bilgileri sağlayarak gerekli hesaplamaları yapmasına olanak tanır.",
                    "updated": 1654391633488,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Die meisten Bots verbrauchen Daten, die andere Bots erzeugt haben. Da Bots die Daten als Eingabe für ihre Berechnungen benötigen, stellen Prozesse eine Datenabhängigkeit mit den Datensatzdefinitionen anderer Bots her. Die Referenz liefert dem Prozess alle Informationen, die er zur Entschlüsselung des Datensatzes benötigt, damit er die erforderlichen Berechnungen durchführen kann.",
                    "updated": 1708265570616,
                    "style": "Text"
                }
            ]
        }
    ]
}