{
    "type": "Market",
    "definition": {
        "text": "A market is the definition of a pair of assets (i.e.: BTC-USDT) listed as a market in the corresponding exchange.",
        "translations": [
            {
                "language": "ES",
                "text": "Un market es la definición de assets (i.e.: BTC-USDT) listados como mercado en el correspondiente exchange.",
                "updated": 1628045938159,
                "style": "Definition"
            },
            {
                "language": "RU",
                "text": "Рынок - это определение пары активов (например, BTC-USDT), перечисленных на соответствующей бирже.",
                "updated": 1635592307113
            },
            {
                "language": "TR",
                "text": "Market, ilgili borsada listelenen bir çift varlığın (örn. BTC-USDT) tanımıdır.",
                "updated": 1639119566603
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Important",
            "text": "Only markets that are effectively listed on the exchange may be configured and used with the system. Check with the exchange and make sure you understand what tickers they are using, which is the base asset and which the quoted asset on the listed markets.",
            "translations": [
                {
                    "language": "TR",
                    "text": "Yalnızca borsada etkin bir şekilde işlem gören varlıklar yapılandırılabilir ve sistemle birlikte kullanılabilir. Borsaya bakın  ve hangi çiftleri kullandıklarını, temel varlığın hangisi olduğunu ve listelenen çiftlerde kote edilen varlığın hangisi olduğunu anladığınızdan emin olun.",
                    "updated": 1642405446968
                }
            ]
        },
        {
            "style": "Block",
            "text": "Configuring",
            "updated": 1609772445354
        },
        {
            "style": "Title",
            "text": "Market Configuration",
            "updated": 1609772469334,
            "translations": [
                {
                    "language": "TR",
                    "text": "Market Yapılandırması",
                    "updated": 1642405469664
                }
            ]
        },
        {
            "style": "Text",
            "text": "Superalgos lets you fine tune the connection to exchanges. For example if a user want to use Bybit Perpetuals then he have the ability to set up the trading system at the exchange level to have an hedge position. This must be reflected in the way Superalgos connects to the exchange. Additional parameters can be set up and passed to Superalgos with the following properties:",
            "updated": 1650647470784
        },
        {
            "style": "Text",
            "text": "codeName It's the pair name to use for trading.",
            "updated": 1650647533016
        },
        {
            "style": "Text",
            "text": "positionParameters It's an object that can be populated with exchange specific parameters.",
            "updated": 1650647570917
        },
        {
            "style": "Text",
            "text": "Example:",
            "updated": 1650647308494
        },
        {
            "style": "Json",
            "text": "{\n    \"codeName\": \"BIT/USDT\",\n    \"positionParams\": {\n        \"position_idx\": 0\n    }\n}",
            "updated": 1650647635268
        },
        {
            "style": "Important",
            "text": "Usually these parameters are exchange specific and not interchangeable. This means that every exchange has its specific parameters to use.",
            "updated": 1650647765349
        }
    ]
}