{
    "type": "Signal Context Formula",
    "definition": {
        "text": "The Signal Context Formula node allows the signal provider to send additional data surrounding an Outgoing Formula Signal or Outgoing Event Signal.",
        "updated": 1647057722823,
        "translations": [
            {
                "language": "RU",
                "text": "Позволяет поставщику сигналов отправлять дополнительные данные, окружающие исходящий сигнал формулы (Outgoing Formula Signal).",
                "updated": 1645253495188
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content",
            "updated": 1644030134004
        },
        {
            "style": "Title",
            "text": "Attaching a Context Object",
            "translations": [
                {
                    "language": "RU",
                    "text": "Стандартный сигнал по формуле отправляет результат связанной с ним формулы. Например, результирующая Order Rate формулы Order Rate. Провайдер сигналов может также установить узел Signal Context Formula. Этот узел позволяет провайдеру отправлять дополнительную информацию, поступающую из торговой системы. Это могут быть значения, используемые для расчета текущей формулы, значения из торгового механизма или любые другие доступные переменные.",
                    "updated": 1645253526577
                }
            ],
            "updated": 1647057686980
        },
        {
            "style": "Text",
            "text": "By defining a Signal Context Formula node. The signal provider can attach a context object that holds additional information to be sent along with the signal data.",
            "updated": 1647057883359
        },
        {
            "style": "Subtitle",
            "text": "Context of Formula Signal"
        },
        {
            "style": "Text",
            "text": "A standard formula signal sends the result of its associated formula. So for example the resulting Order Rate of an order rate formula. A signal provider can also set up a Signal Context Formula node. This node allows the provider to send additional information coming out of the trading system. This can be values used to help calculate the current formula, values from the Trading Engine or any other available variables."
        },
        {
            "style": "Subtitle",
            "text": "Context of Event Signal"
        },
        {
            "style": "Text",
            "text": "Events Signals often send simple true and false values. Adding context variables using a Signal Context Formula node allows the signal provider to supply additional information concerning why an event was triggered allowing for far more powerful signals.",
            "updated": 1647057429306
        },
        {
            "style": "Block",
            "text": "Configuration",
            "updated": 1644030390795
        },
        {
            "style": "Title",
            "text": "Available Data",
            "translations": [
                {
                    "language": "RU",
                    "text": "Конфигурация Signal Context Formula",
                    "updated": 1645253540277
                }
            ],
            "updated": 1647057646695
        },
        {
            "style": "Text",
            "text": "The provider has access to any of the session parameters active within the system at the time of sending the signal. Key examples include: user defined variables, trading engine values, and all indicator values."
        },
        {
            "style": "Title",
            "text": "Signal Context Formula Configuration"
        },
        {
            "style": "Subtitle",
            "text": "Example",
            "updated": 1644030374260,
            "translations": [
                {
                    "language": "RU",
                    "text": "Пример",
                    "updated": 1645253546433
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "let context = {\n    profitLoss: tradingEngine.tradingCurrent.tradingEpisode.tradingEpisodeStatistics.profitLoss.value,\n    hitFail: tradingEngine.tradingCurrent.tradingEpisode.tradingEpisodeStatistics.hitFail.value,\n    roi: tradingEngine.tradingCurrent.tradingEpisode.tradingEpisodeStatistics.ROI.value\n}\n\ncontext // return the context object",
            "updated": 1643429104204
        }
    ]
}