{
    "type": "Trading Strategy",
    "definition": {
        "text": "A trading strategy is the description of a set of actions or events that run in stages. Events are triggered upon the validation of precise conditions describing specific market situations. Trading strategies are designed to achieve a specific goal within the broader plan of a trading system via taking and managing positions.",
        "updated": 1617184911508
    },
    "paragraphs": [
        {
            "style": "Block",
            "text": "Content"
        },
        {
            "style": "Text",
            "text": "The definition of a strategy may be analyzed in three sections:"
        },
        {
            "style": "Callout",
            "text": "A strategy is a set of actions occurring in stages"
        },
        {
            "style": "Hierarchy",
            "text": "Superalgos->Trading Strategy->2",
            "updated": 1610138980124
        },
        {
            "style": "Text",
            "text": "While stages are played in a sequence, upon execution there are overlaps. That is, a stage doesn't need to be closed for the next stage to be opened. The framework sets a clear separation of the concepts embodied in each stage to facilitate the process of defining and developing a trading system. But the truth is that, both at the conceptual level and during execution, the lines between stages are rather blurry."
        },
        {
            "style": "Callout",
            "text": "designed to achieve a specific goal within a broader plan"
        },
        {
            "style": "Text",
            "text": "Your investment plan or trading career may have any number of goals (e.g.: accumulating a certain asset, diversifying on a basket of coins, annual profit targets, etc.). If you attempt to achieve more than one goal with a single strategy, you will sooner or later run into problems. It may be doable, but the strategy would certainly be more complex than is necessary or desirable. In any case, the logical thing to do is to analyze each goal separately so that you may design (at least) one clear, straightforward strategy for each goal."
        },
        {
            "style": "Text",
            "text": "One of the edges granted by trading automation is the capacity to develop and deploy an unlimited number of strategies. At the same time, Superalgos allows the administration of complexity by breaking down and structuring concepts in small units: a trading system contains strategies, which contain stages, which contain specific definitions. "
        },
        {
            "style": "Text",
            "text": "Understanding that keeping things simple is important will help you develop a robust and extensible arsenal of bots. Simplicity is the key to sustainability."
        },
        {
            "style": "Text",
            "text": "In other words, the infrastructure provided by Superalgos enables the hyperspecialization of strategies. Do not aim to trade in all sorts of market situations with the same strategy. Instead, develop a strategy for each market situation you wish to trade."
        },
        {
            "style": "Callout",
            "text": "via taking and managing positions"
        },
        {
            "style": "Text",
            "text": "The definition of strategy points to the concept of a position. A position is a process that exchanges the base asset for the quoted asset and that—after some time, as the position develops and targets are hit—exchanges back the quoted asset for the base asset."
        },
        {
            "style": "Text",
            "text": "The framework implemented in the Superalgos Protocol is optimized to work with such a concept."
        },
        {
            "style": "Text",
            "text": "However, Superalgos is flexible enough to allow you to override this hard interpretation of the concept of a position. For example, you may design market-making strategies, a strategy to balance portfolios, or develop all sorts of ideas that don't necessarily fit in that part of the definition."
        }
    ]
}