{
    "type": "Loss Function",
    "definition": {
        "text": "Machines learn by means of a loss function. It's a method of evaluating how well specific algorithm models the given data. If predictions deviates too much from actual results, loss function would cough up a very large number.",
        "updated": 1615895725952,
        "translations": [
            {
                "language": "RU",
                "text": "Машины обучаются с помощью функции потерь. Это метод оценки того, насколько хорошо конкретный алгоритм моделирует заданные данные. Если прогнозы слишком сильно отклоняются от реальных результатов, функция потерь выдаст очень большое число.",
                "updated": 1645248498916
            },
            {
                "language": "TR",
                "text": "Makineler bir kayıp fonksiyonu aracılığıyla öğrenir. Bu, belirli bir algoritmanın verilen verileri ne kadar iyi modellediğini değerlendiren bir yöntemdir. Tahminler gerçek sonuçlardan çok fazla saparsa, kayıp fonksiyonu çok büyük bir sayı verir.",
                "updated": 1654397314158
            },
            {
                "language": "DE",
                "text": "Maschinelles Lernen mit Hilfe einer Verlustfunktion. Sie ist eine Methode zur Bewertung, wie gut ein bestimmter Algorithmus die gegebenen Daten modelliert. Wenn die Vorhersagen zu sehr von den tatsächlichen Ergebnissen abweichen, würde die Verlustfunktion eine sehr hohe Zahl ausspucken.",
                "updated": 1707240466797
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "Right click and select the pencil button to enter edit mode.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Щелкните правой кнопкой мыши и выберите кнопку с карандашом, чтобы перейти в режим редактирования.",
                    "updated": 1645248504298
                },
                {
                    "language": "TR",
                    "text": "Düzenleme moduna girmek için sağ tıklayın ve kalem düğmesini seçin.",
                    "updated": 1654397320258,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Klicken Sie mit der rechten Maustaste und wählen Sie die Schaltfläche \"Stift\", um in den Bearbeitungsmodus zu gelangen.",
                    "updated": 1707240425551
                }
            ]
        }
    ]
}