{
    "type": "Batch Input Shape",
    "definition": {
        "text": "If defined, will be used to create an input layer to insert before this layer. If both Input Shape and batchInputShape are defined, Batch Input Shape will be used. This argument is only applicable to input layers (the first layer of a model).",
        "updated": 1613243097313,
        "translations": [
            {
                "language": "RU",
                "text": "Если определено, используется для создания входного слоя, который будет вставлен перед этим слоем. Если определены и Input Shape, и batchInputShape, будет использоваться Batch Input Shape. Этот аргумент применим только к входным слоям (первый слой модели).",
                "updated": 1645195620848
            },
            {
                "language": "TR",
                "text": "Tanımlanmışsa, bu katmandan önce eklenecek bir girdi katmanı oluşturmak için kullanılır. Hem Girdi Şekli hem de batchInputShape tanımlanmışsa, Toplu Girdi Şekli kullanılır. Bu bağımsız değişken yalnızca girdi katmanları (bir modelin ilk katmanı) için geçerlidir.",
                "updated": 1654396666556
            },
            {
                "language": "DE",
                "text": "Falls definiert, wird damit eine Eingabeschicht erstellt, die vor dieser Schicht eingefügt wird. Wenn sowohl Input Shape als auch batchInputShape definiert sind, wird Batch Input Shape verwendet. Dieses Argument gilt nur für Eingabeschichten (die erste Schicht eines Modells).",
                "updated": 1706371461226
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Subtitle",
            "text": "Possible Values",
            "updated": 1613243125301,
            "translations": [
                {
                    "language": "RU",
                    "text": "Возможные значения",
                    "updated": 1645195626532
                },
                {
                    "language": "TR",
                    "text": "Olası Değerler",
                    "updated": 1654396673298,
                    "style": "Subtitle"
                },
                {
                    "language": "DE",
                    "text": "Mögliche Werte",
                    "updated": 1706371470017
                }
            ]
        },
        {
            "style": "Javascript",
            "text": "null | number"
        }
    ]
}