{
    "type": "Spatial Dropout 1D Layer",
    "definition": {
        "text": "Spatial 1D version of Dropout.",
        "updated": 1613214223035,
        "translations": [
            {
                "language": "RU",
                "text": "Пространственная одномерная версия Dropout.",
                "updated": 1645249981656
            },
            {
                "language": "TR",
                "text": "Dropout'un uzamsal 1D versiyonu.",
                "updated": 1654397618078
            },
            {
                "language": "DE",
                "text": "Räumliche 1D-Version von Dropout. ",
                "updated": 1705011707438
            }
        ]
    },
    "paragraphs": [
        {
            "style": "Text",
            "text": "This Layer type performs the same function as the Dropout layer, but it drops entire 1D feature maps instead of individual elements. For example, if an input example consists of 3 timesteps and the feature map for each timestep has a size of 4, a spatialDropout1d layer may zero out the feature maps of the 1st timesteps and 2nd timesteps completely while sparing all feature elements of the 3rd timestep.",
            "updated": 1613214250740,
            "translations": [
                {
                    "language": "RU",
                    "text": "Этот тип слоя выполняет ту же функцию, что и слой Dropout, но обнуляет не отдельные элементы, а целые одномерные карты признаков. Например, если входной пример состоит из 3 временных этапов и карта особенностей для каждого временного этапа имеет размер 4, слой spatialDropout1d может полностью обнулить карты особенностей 1-го и 2-го временных этапов, сохранив все элементы особенностей 3-го временного этапа.",
                    "updated": 1645250003117
                },
                {
                    "language": "TR",
                    "text": "Bu Katman türü Bırakma katmanı ile aynı işlevi görür, ancak tek tek öğeler yerine 1B özellik haritalarının tamamını bırakır. Örneğin, bir girdi örneği 3 zaman adımından oluşuyorsa ve her bir zaman adımının özellik haritasının boyutu 4 ise, spatialDropout1d katmanı 1. ve 2. zaman adımlarının özellik haritalarını tamamen sıfırlarken 3. zaman adımının tüm özellik öğelerini koruyabilir.",
                    "updated": 1654397623614,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Dieser Ebenentyp (Layer type) erfüllt dieselbe Funktion wie die Dropout-Ebene, jedoch werden ganze 1D-Feature-Maps anstelle einzelner Elemente gelöscht. Wenn ein Eingabebeispiel beispielsweise aus drei Zeitschritten besteht und die Feature-Map für jeden Zeitschritt eine Größe von 4 hat, kann eine spatialDropout1d-Ebene die Feature-Maps des ersten und zweiten Zeitschritts vollständig löschen, während alle Feature-Elemente des dritten Zeitschritts verschont bleiben.",
                    "updated": 1705009132673
                }
            ]
        },
        {
            "style": "Text",
            "text": "If adjacent frames (timesteps) are strongly correlated (as is normally the case in early convolution layers), regular dropout will not regularize the activation and will otherwise just result in merely an effective learning rate decrease. In this case, spatialDropout1d will help promote independence among feature maps and should be used instead.",
            "translations": [
                {
                    "language": "RU",
                    "text": "Если соседние кадры (временные интервалы) сильно коррелированы (как это обычно бывает в ранних слоях свертки), обычное выпадение не приведет к регуляризации активации и в противном случае приведет лишь к снижению эффективной скорости обучения. В этом случае spatialDropout1d будет способствовать независимости карт признаков и должен быть использован вместо него.",
                    "updated": 1645250029714
                },
                {
                    "language": "TR",
                    "text": "Bitişik kareler (zaman adımları) güçlü bir şekilde ilişkiliyse (normalde erken konvolüsyon katmanlarında olduğu gibi), düzenli bırakma aktivasyonu düzenli hale getirmeyecek ve aksi takdirde sadece etkili bir öğrenme oranı düşüşüne neden olacaktır. Bu durumda, spatialDropout1d özellik haritaları arasında bağımsızlığı desteklemeye yardımcı olacaktır ve bunun yerine kullanılmalıdır.",
                    "updated": 1654397629767,
                    "style": "Text"
                },
                {
                    "language": "DE",
                    "text": "Wenn benachbarte Frames (Zeitschritte) stark korreliert sind (wie es normalerweise bei frühen Faltungsschichten der Fall ist), wird ein reguläres Dropout die Aktivierung nicht regulieren und andernfalls lediglich zu einer Verringerung der effektiven Lernrate führen. In diesem Fall trägt spatialDropout1d dazu bei, die Unabhängigkeit zwischen den Merkmalskarten zu fördern und sollte stattdessen verwendet werden.",
                    "updated": 1705009148848
                }
            ]
        }
    ]
}